[{"url": "https://www.shreveporttimes.com/story/sports/college/2020/04/14/louisiana-tech-konkol-lswa-coach-year-lsu-mays-all-louisiana/2992073001/", "title": "Konkol, Mays lead 2020 LSWA All-Louisiana college basketball honors", "authors": ["Staff Reports", "Published P.M. Ct April"], "date": "2020-04-14", "keywords": ["college", "lswa", "team", "louisiana", "2020", "konkol", "jr", "alllouisiana", "lead", "ppg", "basketball", "g", "sr", "lsu", "baton", "points", "honors", "mays", "rpg"], "summary": "CLOSELouisiana Tech's Eric Konkol was named Coach of the Year for the 2020 LSWA All-Louisiana Men's Basketball Team.\nSkylar Mays, LSU – G, Sr., Baton Rouge, La., 16.7 ppg., 5.0 rpg., 3.2 rpg.\nThird TeamKae'Ron Baker, Louisiana College – G, Jr., Navasota, Texas, 19.8 ppg., 5.3 rpg., 3.0 apg.\nJavonte Smart, LSU – G, Soph., Baton Rouge, La., 12.5 ppg., 3.5 rpg., 4.2 apg.\nChristion Thompson, Tulane – G, Sr., Gonzales, La., 14.1 ppg., 6.3 rpg., 2.8 apg."}, {"url": "https://www.225batonrouge.com/things-to-do/january-2020-calendar-events-baton-rouge", "title": "January 2020 calendar of events in Baton Rouge", "authors": [], "date": "2019-12-31", "keywords": ["theatre", "event", "2020", "local", "museum", "events", "music", "calendar", "rouge", "art", "night", "baton", "work"], "summary": "knockknockmuseum.orgJan. 11The 2020 Special Olympics State Bowling Tournament, to be held at All Star Lanes in Baton Rouge, is a one-day, state-level competition open to bowlers of multiple skill levels from across the state.\nbatonrougegallery.orgJan. 25-26Bar Crawl Unlimited comes to Baton Rouge for two bar crawl events—the Margarita Crawl and the Mimosa Crawl.\ndmae.lsu.eduMUSIC EVENTS: THIS MONTH’S BEST BETSJAN. 4New Orleans songwriter Kristin Diable’s sound comes to Baton Rouge at Dyson House Listening Room at Zeeland Street.\nlouisianastatemuseum.orgJAN. 23The Baton Rouge Symphony Orchestra presents its Mozart Birthday Bash!\nbrso.orgJAN. 27One of pop-surrealism’s top artists, Dan Quintana, hosts a lecture on his work at Baton Rouge Gallery."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["usa", "stadium", "falcons", "2020", "defensive", "linebacker", "mandatory", "moreround", "today", "options", "2019", "draft", "nov", "round", "credit"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "won", "virtually", "upfield", "participate", "team", "touches", "packers", "wants", "invites", "nfl", "draft", "super", "tons"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Ohio State running back J.K. Dobbins:What he can do– Built low to the ground at 5-9.\nCompact frame, with big, powerful legs– Tons of experience as a one-cut runner.\nWants to get upfield with initial patience following by burst–..."}, {"url": "https://www.avma.org/javma-news/2020-05-01/obituaries", "title": "Obituaries", "authors": [], "date": "2020-05-01", "keywords": ["member", "small", "state", "animal", "died", "veterinary", "2019", "medicine", "obituaries", "university", "dr"], "summary": "Prior to retirement, he was in small animal practice for several years and worked for the U.S. Department of Agriculture.\nA small animal veterinarian, he owned Camp McDonald Animal Clinic in Mount Prospect, Illinois, for 33 years.\nHe practiced small animal medicine in Indiana and Florida for 52 years.\nA past president of the Florida VMA, he served on the Florida Board of Veterinary Medicine for several years.\nA small animal veterinarian, he owned Valley Animal Hospital in Cedar Bluff and Grundy Animal Hospital in Grundy, Virginia."}, {"url": "https://www.wafb.com/2020/04/10/latest-louisiana-news-sports-business-entertainment-am-cdt/", "title": "Latest Louisiana news, sports, business and entertainment at 9:20 p.m. CDT", "authors": ["Published April", "At Am"], "date": "2020-04-10", "keywords": ["business", "blakes", "wrote", "state", "died", "latest", "entertainment", "shreveport", "920", "virus", "exposed", "test", "times", "louisiana", "blake", "cdt"], "summary": "SHREVEPORT, La.\n(AP) — A leader in the Civil Rights movement in north Louisiana, who put his life on the line in the fight for racial equality, has died after possibly being exposed to the coronavirus.\nCanaan Baptist Church in Shreveport, died Wednesday.\nThe Times reports Blake’s daughter, Monica Blake Mickle, wrote on Facebook that her father was ill after being exposed to the virus but had been improving.\nJohn Bel Edwards offered condolences on Thursday to Blake’s family during his daily press conference regarding the impact of the virus on the state."}, {"url": "https://www.courier-journal.com/story/news/2020/03/20/coronavirus-pastor-arrested-holding-church-during-spanish-flu/2874182001/", "title": "One pastor was so outraged by church ban during Spanish flu that he went to jail", "authors": ["Jon Hale", "Published A.M. Et March"], "date": "2020-03-20", "keywords": ["jail", "pastor", "courier", "outraged", "murray", "went", "flu", "members", "journal", "church", "spanish", "reported", "taylor", "ban", "services"], "summary": "Harvey Boyce Taylor, the pastor at Murray Baptist Church in Murray, Kentucky, held services in violation of the ban on Jan. 26, 1919.\nTaylor was arrested in his pulpit at the evening service, according to the Jan. 28, 1919 edition of The Courier Journal.\nBuy Photo In 1919, the Courier Journal reported on the saga of Murray Baptist Church pastor Harvey Boyce Taylor's defying the state board of health's ban on public gatherings during the Spanish Flu outbreak.\n(Photo: Courier Journal Archives)The county judge announced afterward he would issue warrants for the arrest of Taylor and 31 others at the service.\nIn its Feb. 19 edition, The Courier Journal reported members of the Murray Baptist Church congregation had settled their fines for violating the ban, but Taylor still refused."}, {"url": "https://www.bigeasymagazine.com/2020/04/01/contemplating-the-factors-shocking-covid-19-rates-in-louisiana/", "title": "Contemplating the Factors: Shocking COVID-19 Rates in Louisiana", "authors": [], "date": "2020-04-01", "keywords": ["orleans", "system", "factors", "contemplating", "shocking", "rates", "health", "stress", "virus", "residents", "known", "immune", "covid19", "louisiana"], "summary": "It is when the immune system fails to hold up its defenses that the respiratory system goes under siege.\nWhen someone is healthy, the immune system will quickly identify a threat, prepare for an attack and eliminate the pathogen naturally.\nAccording to researchers at John Hopkins University, a huge portion of the immune system is found in the GI Tract.\nFOOD AND UNHEALTHY HABITSThe health of Louisiana residents is heavily impacted by food traditions and access to fresh produce.\nStatistics show that nearly 30% of Louisiana residents smoke cigarettes daily, and they are most likely to make less than $25,000 a year."}, {"url": "https://www.wafb.com/2020/01/12/one-critical-after-shooting-amarillo-street/", "title": "One dead after Amarillo Street shooting; suspect arrested", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-12", "keywords": ["amarillo", "block", "dead", "deunta", "shot", "dynovan", "arrested", "rouge", "killed", "shooting", "suspect", "department", "street", "brown", "johnson"], "summary": "According to the Baton Rouge Police Department, Deunta Brown, 19, shot and killed Dynovan Johnson around 3:10 p.m. in the 3600 block of Amarillo Street."}, {"url": "https://www.wafb.com/2020/01/20/man-killed-shooting-west-brookstown-drive/", "title": "Man killed in shooting on West Brookstown Drive", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-20", "keywords": ["brookstown", "man", "injuries", "thomas", "scene", "provided", "drive", "west", "died", "reginald", "killed", "shooting", "updated", "saying", "critical", "transported"], "summary": "BRPD said Reginald Thomas, 38, was transported in critical condition from the scene.\nOn Monday, police provided an updated saying Thomas died from his injuries."}, {"url": "https://www.wafb.com/2020/01/04/first-expungement-event-scheduled-jan/", "title": "First expungement event of 2020 held Jan. 4", "authors": ["Rachael Thomas", "Published At Pm"], "date": "2020-01-04", "keywords": ["district", "hall", "event", "representatives", "2020", "public", "office", "city", "expungement", "staffed", "jan", "prosecutor", "court", "held"], "summary": "The event was held at City Hall from 10 a.m. to 2 p.m.\nIt was staffed by representatives from the Office of the Public Defender, the District Attorney’s Office, the City Prosecutor, and the Clerks of Court, as well as District Court."}, {"url": "https://www.wafb.com/2020/01/12/one-injured-shooting-byron-street/", "title": "One injured in shooting on Byron Street", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-12", "keywords": ["disclosed", "called", "scene", "immediately", "byron", "crews", "shooting", "injured", "street", "details", "emergency"], "summary": "Emergency crews were called to the scene just after 9 p.m. Saturday.\nDetails about the shooting were not immediately disclosed."}, {"url": "https://www.businessreport.com/article/business-report-publisher-2020-will-be-a-long-year-for-louisiana-politics", "title": "‘Business Report’ Publisher: 2020 will be a long year for Louisiana politics", "authors": ["Daily Report Staff"], "date": "2020-01-09", "keywords": ["publisher", "business", "politics", "2020", "report", "parish", "long", "state", "mccollister", "rouge", "tigers", "baton", "east", "louisiana"], "summary": "What a great way to start the year for Baton Rouge and Louisiana.\nIn the first monthly Business Report issue of 2020, you will find many predictions and perspectives from a variety of people and professionals in our community about the next 12 months.\nAnd there’s more politics closer to home in East Baton Rouge Parish.\nOur Democratic governor just won East Baton Rouge Parish by a 2-to-1 margin over a Republican opponent who grew up in the capital city.\nAlso in his column, McCollister shares some demographics about East Baton Rouge Parish that might surprise you."}, {"url": "https://www.katc.com/news/covering-louisiana/victory-parade-planned-for-lsu-mayor-to-present-team-with-key-to-city", "title": "UPDATE: LSU victory celebration held in Baton Rouge Saturday", "authors": [], "date": "2020-01-14", "keywords": ["maravich", "assembly", "center", "lsus", "parade", "inside", "baton", "team", "rouge", "celebration", "lsu", "victory", "update", "campus", "held"], "summary": "BATON ROUGE — The entire LSU football team will be honored with a parade this Saturday in Baton Rouge.\nThe victory parade, scheduled for Saturday January 18, 2020, on LSU's campus, was announced following LSU's 42 - 25 win over Clemson on Monday.\nThe parade will travel through LSU's campus and will culminate in a celebration held inside the Pete Maravich Assembly Center.\nIn the event of severe weather, officials say the parade will be cancelled, but the celebration inside the Maravich Center will still take place.\nFans will enter the Maravich Assembly Center through the two ramps on the south side of the PMAC."}, {"url": "https://www.wafb.com/2019/12/04/la-governor-first-lady-announce-inauguration-plans/", "title": "Gov. Edwards will not hold inaugural ball the same day as National Championship game", "authors": ["Rachael Thomas", "Published April", "At Pm"], "date": "2019-12-04", "keywords": ["st", "championship", "gov", "seating", "swearinin", "mass", "game", "inaugural", "hold", "capitol", "national", "standing", "ball", "day", "public", "edwards", "watch", "morning", "room"], "summary": "The morning will begin with an invitation-only mass at St. Joseph’s Cathedral.\nAfter the mass, the governor and first lady will head to the capitol building for the swearin-in.\nLimited seating is available, but the public will have access to standing room on the Capitol Grounds to watch the ceremony."}, {"url": "https://www.wafb.com/2020/01/10/lsu-announces-no-classes-jan-national-championship-game/", "title": "LSU cancels classes on Jan. 13 and 14 for National Championship game", "authors": ["Amanda Lindsley", "Published At Pm"], "date": "2020-01-10", "keywords": ["championship", "updates", "calendar", "working", "university", "jan", "w", "academic", "13", "game", "cancellation", "national", "day", "classes", "cancels", "lsu", "14", "update", "universitys"], "summary": "The University Registrar is currently working to update the university’s academic calendar, as the cancellation will likely require scheduling make-up days.\nThe cancellation may also impact milestone dates throughout the semester, such as the last day to drop without receiving a grade of “W” and the last day to add a class.\nLSU will share all updates to the academic calendar as soon as possible so that students and faculty can plan accordingly."}, {"url": "https://www.wafb.com/2020/01/10/first-alert-forecast-warm-quiet-friday-before-severe-weather-threatens-louisiana-saturday/", "title": "FIRST ALERT FORECAST: Warm, quiet Friday before severe weather threatens Louisiana on Saturday", "authors": ["Diane Deaton", "Published April", "At Am", "At Pm"], "date": "2020-01-10", "keywords": ["warm", "forecast", "strong", "tornadoes", "alert", "winds", "primary", "followed", "high", "severe", "weather", "possibility", "threat", "quiet", "louisiana", "lower", "tomorrow", "threatens"], "summary": "Very strong winds will be the primary threat, followed by the possibility of a couple of strong tornadoes.\nThe threat will be over by Saturday afternoon with a high tomorrow in the lower 70s."}, {"url": "https://www.wafb.com/2020/01/26/one-shot-during-alleged-home-invasion-lee-drive/", "title": "One shot during alleged home invasion on Lee Drive", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-26", "keywords": ["available", "described", "called", "scene", "alleged", "shot", "drive", "lee", "immediately", "jan", "injury", "nonlifethreatening", "details", "invasion"], "summary": "Police were called to the scene around 10 a.m. Sunday, Jan. 26.\nDetails about who was shot were not immediately available.\nThe injury was described as non-life-threatening, however."}, {"url": "https://www.dailycomet.com/news/20200101/will-trump-campaign-in-la-in-2020", "title": "Will Trump campaign in La. in 2020?", "authors": ["Greg Hilburngannett Louisiana"], "date": "2020-01-01", "keywords": ["campaign", "2020", "impeachment", "la", "voters", "state", "dont", "president", "trump", "election", "republican", "louisiana"], "summary": "\"I would doubt he will come to Louisiana in 2020,\" said Pearson Cross, a political scientist at the University of Louisiana at Lafayette.\nCouvillon conducted a poll in November showing 54% of Louisiana voters opposed Trump's impeachment, while 37% supported impeachment.\nSo with Louisiana out of play in 2020, it makes practical sense that Trump would focus his efforts elsewhere.\n\"President Trump and his family love Louisiana; that’s why they come back so often,\" Harbison said.\n\"But President Trump has proved to be unpredictable, so I don't think we can rule anything out,\" Cross said."}, {"url": "https://www.wafb.com/2020/01/01/get-free-chick-fil-a-entre-jan-/", "title": "Get a free Chick-fil-A entrée Jan. 2-11", "authors": ["Rachael Thomas", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-01-01", "keywords": ["211", "offer", "tab", "chickfila", "person", "entrée", "rewards", "log", "using", "free", "limited", "jan", "app"], "summary": "The free entrée will be awarded only by using the Chick-fil-A One app.\nThe offer is limited to one entrée per person.\nThose who log into their account on the app will automatically get the offer under the Rewards tab."}, {"url": "https://www.wafb.com/2020/01/14/baton-rouge-police-investigating-homicide-after-person-found-dead-car/", "title": "Suspect in custody after person found dead in vehicle; victim now identified", "authors": ["Lester Duhé", "Published At Pm"], "date": "2020-01-14", "keywords": ["custody", "cars", "dead", "bring", "scary", "yeah", "vehicle", "person", "wouldnt", "car", "place", "shooting", "suspect", "somebody", "identified", "victim", "know"], "summary": "“These people had to know this place was here or they wouldn’t bring that car up in here.\nHad to be two cars.\nSomebody had to get the people, to bring them out of here, that did the shooting.\nSo yeah, it’s scary,” she said."}, {"url": "https://www.wafb.com/2020/01/12/betty-claiborne-who-was-arrested-trying-integrate-baton-rouge-swimming-pool-has-died/", "title": "Baton Rouge civil rights activist Betty Claiborne laid to rest", "authors": ["Danae Leake", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-01-12", "keywords": ["civil", "betty", "parish", "rest", "mayorpresident", "laid", "activist", "wasnt", "rouge", "sharon", "rev", "baton", "claiborne", "rights", "weston"], "summary": "“The freedoms, especially as African Americans, we would not be able to enjoy them if it wasn’t for people like her.\nWhen we look at the civil rights history of Baton Rouge, Louisiana, Rev.\nBetty Claiborne is embedded in the fabric of civil rights here in our city and in our parish,” said East Baton Rouge Mayor-President Sharon Weston Broome."}, {"url": "https://www.wafb.com/2020/01/06/unusual-flu-season-strikes-louisiana-second-peak-come/", "title": "Unusual flu season strikes in Louisiana; second peak to come", "authors": ["Liz Koh", "Published At Pm"], "date": "2020-01-06", "keywords": ["youre", "youve", "second", "secondary", "seen", "peak", "unusual", "flu", "strikes", "theres", "season", "come", "having", "say", "wow", "safe", "tell", "louisiana"], "summary": "“If you’re having chest pain, if you’re having any respiratory distress then absolutely go,\" said Dr. Flechas.\n\"Because you never know, we might tell you it’s just the flu, and you will need bed rest and fluids.\nOr we may say, ‘Wow you’ve got a secondary infection.\nThere’s some bronchitis, some pneumonia.'\nSo I always would rather be safe and have you seen.”"}, {"url": "https://www.225batonrouge.com/food-drink/best-225-week-mlk-fest-louisiana-marathon-events-baton-rouge-weekend", "title": "Best of 225 This Week: MLK Fest, Louisiana Marathon, LSU celebration and more events in Baton Rouge this weekend", "authors": [], "date": "2020-01-16", "keywords": ["rouge", "jan", "need", "louisiana", "week", "library", "marathon", "event", "music", "fest", "lsu", "train", "baton", "mlk", "weekend", "events", "parade", "celebration", "register"], "summary": "Mark MLK Day by volunteering around Baton Rouge all weekendThe Walls Project and the Mayor’s Office are joining forces for a full weekend of volunteer activities along a 2-mile stretch of Plank Road.\nThe MLK Fest 2020 will be held Friday, Jan. 17, to Tuesday, Jan. 21.\nDance the night away with live music at Superior Grill FridayJoin Superior Grill MidCity Baton Rouge this Friday, Jan. 17, 6:30-10 p.m., to listen to the Carbon Copy Band.\nIn affiliation with Running USA, all ages are eligible for either a full, half or quarter marathon, 5K or kids marathon.\nThe Louisiana State Capitol is at 900 N. Third St.Have a DIY night with friends at Board & Brush MondayYou’ll have a blast with Board & Brush Baton Rouge for some DIY projects with friends Monday."}, {"url": "https://www.wafb.com/2020/01/05/one-person-seriously-injured-shooting-st-rose-avenue/", "title": "24-year-old man killed in shooting on St. Rose Avenue", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-05", "keywords": ["man", "paramedics", "rose", "st", "tenner", "died", "killed", "shooting", "suffering", "reported", "wounds", "avenue", "24yearold", "transported"], "summary": "Police said Kayzon Tenner, 24, died in the shooting reported on St. Rose Avenue near North Boulevard at around 8 p.m. Saturday.\nParamedics had found Tenner suffering from multiple gunshot wounds.\nTenner was transported to the hospital and later died of his injuries."}, {"url": "https://www.wafb.com/2020/01/09/man-accused-invading-womans-home-hitting-her-with-wrench/", "title": "Man accused of invading woman’s home, hitting her with a wrench", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-01-09", "keywords": ["accused", "victims", "man", "problem", "invading", "womans", "windows", "having", "probable", "cause", "wrench", "hitting", "ongoing", "broke", "williams", "victim"], "summary": "Williams admitted to police he did go to the victim’s home and broke her windows because of an “ongoing problem” he and the victim were having, according to the probable cause affidavit."}, {"url": "https://www.businessreport.com/newsletters/restaurateur-jordan-piazza-planning-a-run-for-baton-rouge-mayor", "title": "Restaurateur Jordan Piazza planning a run for Baton Rouge mayor", "authors": ["Stephanie Riegel"], "date": "2020-01-02", "keywords": ["business", "restaurateur", "planning", "months", "run", "mayor", "rouge", "political", "watson", "bar", "baton", "broome", "jordan", "piazza", "republican"], "summary": "Among them is 31-year-old Republican businessman and restaurateur Jordan Piazza, who tells Daily Report he plans to formally announce his candidacy this spring.\nA Baton Rouge native and graduate of LSU, where he earned a bachelor’s degree in agricultural business, Piazza began his career in the corporate office of Walk-On’s Sports Bistreaux.\nIn recent months, Piazza says he has been meeting with business and community leaders and is encouraged by the feedback he has received.\nBoth Watson and Marcelle acknowledge they are considering a run, though neither is ready to officially throw their hat in the ring.\n“I’ve been asked by a number of people throughout this parish to run for mayor and it’s compelling,” Marcelle says."}, {"url": "https://www.wafb.com/2020/01/13/thousands-people-run-louisiana-marathon-jan-/", "title": "Louisana Marathon runners finish strong", "authors": ["Rachael Thomas", "Donovan Jackson", "Published At Pm"], "date": "2020-01-13", "keywords": ["strong", "local", "runners", "runner", "louisana", "finish", "represent", "shapes", "races", "marine", "lot", "sizes", "marathon", "patriotism", "veteran"], "summary": "\"We also represent colors here at a lot of local races just to bring patriotism and awareness to people that you don’t have to be a fast runner just to get out here and do this.\nIt’s for all people all shapes all sizes and all runner,” said Elena Branzaru, a U.S. Marine Corps veteran."}, {"url": "https://www.businessreport.com/article/lapolitics-new-legislative-term-brings-new-lobbying-firms", "title": "LaPolitics: New legislative term brings new lobbying firms", "authors": ["Jeremy Alford"], "date": "2020-01-31", "keywords": ["recently", "firms", "lobbying", "coulon", "lapolitics", "term", "martinez", "rouge", "legislative", "gr", "brings", "strategies", "dubos", "louisiana"], "summary": "For example, Chris Coulon, who, along with Alisha Duhon and Robert Lancon, recently left Adams & Reese to form Pivotal GR Solutions.\n“I think smaller lobbying firms are quickly becoming a highly effective alternative to larger firms in Baton Rouge,” says Coulon.\nLike Coulon, Martinez says he recognized a different need developing among those who require GR help.\nDuBos, the son of New Orleans political analyst and editor Clancy DuBos, was most recently the legislative aide to former Senate President John Alario.\nHe was most recently with the LSU president’s office and, prior to that, LaPolitics Weekly."}, {"url": "https://wgno.com/news/local/baton-rouge-traffic-stop-leads-to-human-trafficking-arrest/", "title": "Baton Rouge traffic stop leads to human trafficking arrest", "authors": ["Amy Boraks", "Wgno Web Desk"], "date": "2020-01-09", "keywords": ["victims", "human", "investigation", "traffic", "state", "west", "leads", "trafficking", "baton", "rouge", "troopers", "suspicious", "stop", "arrest", "louisiana"], "summary": "The traffic stop and subsequent investigation led to the arrest of 44-year-old Ruben Guadarrama Delgado of Shafter, CA.\nThe investigation began as Troopers became suspicious of criminal activity consistent with human trafficking after speaking with Delgado’s 22-year-old female passenger.\nDelgado was arrested and booked into the West Baton Rouge Parish Jail for human trafficking, false imprisonment, and improper lane usage.\nJanuary is recognized nationally as Human Trafficking Awareness Month and Louisiana State Police remains dedicated to rescuing and obtaining justice for the victims of crimes involving the exploitation of children and the trafficking of humans for sex or labor.\nThe Louisiana State Police online reporting system is available to the public through an anonymous reporting form that is submitted to the appropriate investigators."}, {"url": "https://www.myarklamiss.com/news/louisiana-politics/louisiana-inauguration-overshadowed-by-football-championship/", "title": "John Bel Edwards Second Inauguration from the Louisiana State Capitol", "authors": ["James Selby"], "date": "2020-01-13", "keywords": ["house", "second", "edwards", "john", "capitol", "state", "great", "work", "way", "term", "education", "continue", "inauguration", "bel", "louisiana"], "summary": "To my fellow Louisianans, thank you for the trust you have placed in me to continue leading this great state.\nMy love for this state deepens as I meet more Louisianans like you who remind me how blessed we are to call this great state home.\nPowered by our diverse cultures and our shared love for one another and for this state, we are Louisiana strong and Louisiana proud!\nGod bless you all, God bless the Great State of Louisiana and God bless the United States of America.\nJohn Bel Edwards will be sworn in for his second term as Louisiana Governor."}, {"url": "https://lsusports.net/news/2020/1/13/football-save-the-date-jan-18-championship-celebration.aspx", "title": "Save the Date: Jan. 18 Championship Celebration", "authors": [], "date": "2020-01-13", "keywords": ["stadium", "tiger", "date", "national", "championship", "outside", "18", "lsus", "parade", "save", "west", "music", "celebration", "campus", "jan"], "summary": "BATON ROUGE -- The LSU football team will participate in a celebration of its college football national championship on Saturday, January 18, on LSU's campus.\nA parade running through LSU's campus will begin at 11 a.m. at LSU's school of music.\nThe parade will go through LSU's campus and end up at the west side of Tiger Stadium via Victory Hill.\nThe National Championship Celebration will begin at 12 p.m. outside the west side of Tiger Stadium.\nNational championship gear will also be available for purchase at the LSU Sports Shop and around Tiger Stadium."}, {"url": "https://www.wafb.com/2020/01/11/louisiana-reports-over-cases-hepatitis-amid-ongoing-outbreak/", "title": "Louisiana reports over 700 cases of hepatitis A amid ongoing outbreak", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-11", "keywords": ["tracked", "transmit", "source", "cases", "symptoms", "shows", "health", "amid", "weeks", "hepatitis", "ongoing", "department", "virus", "700", "outbreak", "reports", "louisiana"], "summary": "This map shows where cases of Hepatitis A are being tracked by the Louisiana Department of Health as of Friday, Jan. 10.\nAn infected person can transmit the virus to others up to two weeks before symptoms appear, and even those who do not experience symptoms can transmit the virus to others.\n(Source: Louisiana Department of Health)"}, {"url": "https://www.wafb.com/2020/01/28/lawmakers-aim-lower-louisianas-car-insurance-rates-during-legislative-session/", "title": "Lawmakers aim to lower Louisiana’s car insurance rates during legislative session", "authors": ["Matt Houston", "Published At Pm"], "date": "2020-01-28", "keywords": ["widowed", "sen", "set", "prevent", "person", "rates", "aim", "insurance", "car", "score", "lawmakers", "legislative", "louisianas", "session", "proposals", "lower", "luneau"], "summary": "Another set of proposals comes from one of the omnibus bill’s biggest critics, Sen. Jay Luneau, D-Alexandria.\nLuneau has filed several measures that would prevent insurance companies from calculating insurance rates based on credit score, gender over the age of 25, whether a person has been widowed, or whether a person has been deployed in the military for at least six months."}, {"url": "https://www.wafb.com/2020/01/16/police-investigating-deadly-shooting-pocasset-street/", "title": "Arrest made in deadly Pocasset Street shooting", "authors": ["Rachael Thomas", "Published At Pm"], "date": "2020-01-16", "keywords": ["lewis", "local", "taken", "pocasset", "outside", "say", "shooting", "deadly", "wound", "suffering", "street", "arrest"], "summary": "Police say the shooting happened Wednesday, Jan. 15 around 3 a.m. outside a home in the 3700 block of Pocasset Street.\nPolice say Lewis, 25, was found outside his home suffering from a gunshot wound.\nHe was taken to a local hospital, where he later died."}, {"url": "https://www.wafb.com/2020/01/20/police-respond-olol-after-someone-reportedly-shot/", "title": "Man suffering from gunshot wounds ‘put out’ of vehicle near OLOL", "authors": ["Rachael Thomas", "Published At Pm"], "date": "2020-01-20", "keywords": ["man", "thomas", "olol", "victim", "vehicle", "road", "rouge", "gunshot", "suffering", "shooting", "private", "wounds", "lane", "near", "transported"], "summary": "According to the Baton Rouge Police Department, the shooting happened near the 2300 block of Thomas Road at around 2:30 p.m. on Jan. 20.\nThe victim was transported near Our Lady of Lake on Essen Lane by private vehicle before being “put out\" of the vehicle."}, {"url": "https://www.wafb.com/2020/01/06/omv-investigating-service-outages-certain-locations-around-la-monday/", "title": "OMV officials speak about service outages at locations in Louisiana", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-01-06", "keywords": ["recent", "locations", "neal", "vehicles", "outages", "officials", "wafb", "state", "offices", "regional", "omv", "service", "issue", "related", "speak", "louisiana"], "summary": "(WAFB) - Keith Neal, Assistant Deputy Commissioner for the Louisiana Office of Motor Vehicles (OMV) says an internet issue caused closures at all Louisiana offices Monday, Jan. 6 and still continues to impact some regional offices.\nNeal says the issue is not related to a recent cyber attack on the state that crippled government agencies."}, {"url": "https://www.wafb.com/2020/01/13/john-bel-edwards-be-sworn-second-term-la-governor/", "title": "John Bel Edwards sworn in for second term as Louisiana governor", "authors": ["Mykal Vincent", "Austin Kemker", "Published April", "At Pm"], "date": "2020-01-13", "keywords": ["second", "edwards", "john", "sworn", "gov", "taxpayer", "term", "today", "turned", "louisianans", "win", "teachers", "governor", "bel", "louisiana"], "summary": "Edwards on his inauguration today.\nEdwards has delivered incredible progress for Louisiana.\nWith his swearing in today, Gov.\nEdwards becomes the first Democratic governor to win reelection in Louisiana in 44 years.\nIn his second term, I look forward to seeing all he will accomplish for the people of Louisiana.”Gov."}, {"url": "https://www.businessreport.com/article/republicans-tapped-to-head-louisiana-senates-budget-tax-panels", "title": "Republicans tapped to head Louisiana Senate’s budget, tax panels", "authors": ["The Associated Press"], "date": "2020-01-17", "keywords": ["head", "budget", "local", "cortez", "committee", "committees", "senates", "senate", "tapped", "tax", "republicans", "affairs", "charge", "sen", "panels", "tried", "republican", "louisiana"], "summary": "The Louisiana Senate’s new Republican president will continue a tradition of bipartisan leadership across the majority-GOP chamber’s subject-matter committees, but Republicans will take charge of the key financial and redistricting panels.\nHe named Republicans as leaders of 12 panels and gave Democrats—including the head of the state Democratic Party—the chairmanships of five panels.\nSen. Bret Allain of Franklin will oversee the Revenue and Fiscal Affairs Committee that handles tax policy.\nAnd Slidell Sen. Sharon Hewitt will take charge of the Senate and Governmental Affairs Committee that governs redistricting.\nDemocrats will take charge of the education, labor, local affairs and retirement committees, along with one of three judiciary panels."}, {"url": "https://www.brproud.com/news/your-local-election-hq/2020-vision-whats-next-in-louisiana-politics/", "title": "2020 VISION: What’s next in Louisiana politics?", "authors": ["Harrison Golden", "The Associated Press"], "date": "2020-01-01", "keywords": ["whats", "politics", "2020", "edwards", "spend", "money", "state", "unclaimed", "second", "treasurer", "responsibility", "schroder", "vision", "republican", "louisiana"], "summary": "Unclaimed property pressureLouisiana Treasurer John Schroder is renewing his resolution from last year.\nJohn Bel Edwards argues Schroder’s failure to transfer unclaimed money undermines the Legislature’s power over state funds.\nAs the Republican treasurer stands willing to shield his 2020 promise in court, the Democratic governor faces one more recurring fight.\nThey say it’s too soon to tell how much money Louisiana will collect this fiscal year and next.\n“Our failure to do so shirks our constitutional responsibility that we have to estimate revenue.”For all the repeats 2020 brings to Louisiana politics, one item does please Edwards."}, {"url": "https://www.wafb.com/2020/01/07/man-arrested-stabbing-jade-avenue/", "title": "Man arrested in stabbing on Jade Avenue", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-01-07", "keywords": ["man", "digital", "hospital", "image", "positively", "arrested", "spoke", "stabbing", "jade", "stabbed", "witnesses", "avenue", "identify", "victim"], "summary": "Detectives spoke to several witnesses at the hospital who were able to positively identify a digital image of Delcid-Solis as the man who stabbed the victim."}, {"url": "https://www.wafb.com/2020/01/06/dragos-open-baton-rouge-location-february/", "title": "Drago’s to host grand opening Monday", "authors": ["Kiran Chawla", "Published April", "At Am", "At Pm"], "date": "2020-01-06", "keywords": ["oysters", "waiting", "dragos", "thrilled", "sight", "finally", "serve", "opportunity", "host", "grand", "rougeons", "louisiana", "opening", "thank"], "summary": "“After a very long time, the finish line is finally in sight.\nOur family is very grateful for this opportunity.\nWe can’t thank Baton Rougeons enough for waiting on us.\nWe’re thrilled to finally be able to serve to you our Louisiana delicacy of charbroiled oysters and anything else your heart desires,” said Cvitanovich."}, {"url": "https://www.houmatoday.com/news/20200130/booked-on-bayou-police-report-for-jan-29-30-2020", "title": "Booked on the Bayou: Police report for Jan. 29-30, 2020", "authors": [], "date": "2020-01-30", "keywords": ["booked", "bayou", "court", "2020", "report", "st", "theft", "ave", "drive", "houma", "counts", "thibodaux", "improper", "jan", "possession", "2930"], "summary": "JAN. 29Probation and Parole• Michael Gilmer II, 31, 124 Millennium Ave., Houma, two counts of failure to appear in court, probation violation.\n• Trey Harry, 27, 100 Stadium Drive, Houma, aggravated assault, simple criminal property damage.\n• Darryl Trosclair, 32, 823 Grinage St., Houma, possession with intent to distribute meth.\nThibodaux Police Department• Farrel Goff, 32, 1302 Midland Drive, Thibodaux, entering and remaining in places after being forbidden, battery of a dating partner.\nJAN. 30Terrebonne Parish Sheriff’s Office• Michael Matherne, 44, 505 Williams Ave., Houma, improper lighting, possession of meth."}, {"url": "https://www.theadvertiser.com/story/sports/college/lsu/2020/01/24/lsu-basketball-team-brings-glittering-6-0-sec-record-texas/4568956002/", "title": "LSU may be undefeated in the SEC, but it needs a quality non-conference win at Texas", "authors": ["Glenn Guilbeau", "Published P.M. Ct Jan."], "date": "2020-01-24", "keywords": ["wade", "sec", "quality", "texas", "12", "team", "needs", "win", "tigers", "stephen", "lsu", "tournament", "undefeated", "nonconference", "big"], "summary": "66 Texas (12-6, 2-4 Big 12 Conference) at 1 p.m. on ESPN in the SEC/Big 12 shootout.\n1 Baylor (16-1, 6-0 Big 12) at Florida (12-6, 4-2 SEC) at 7 p.m. on ESPN.\nThe SEC/Big 12 Challenge opens with two games at 11 a.m. — Iowa State (9-9, 2-4 Big 12) at No.\n14 West Virginia (15-3, 4-2 Big 12) on ESPN.\n18 Texas Tech (12-6, 3-3 Big 12) at 5 p.m. on ESPN."}, {"url": "https://www.wafb.com/2020/01/22/economist-says-lsus-national-championship-season-was-boost-baton-rouges-economy/", "title": "Economist says LSU’s national championship season was a boost to Baton Rouge’s economy", "authors": ["Matt Houston", "Published April", "At Am", "At Pm"], "date": "2020-01-22", "keywords": ["restaurants", "championship", "success", "theres", "tendency", "season", "teams", "rouge", "schoolers", "university", "boost", "sense", "national", "lsus", "scott", "baton", "rouges", "economist", "economy"], "summary": "\"There's a sense - just a happy sense - that causes people to go to restaurants more.\nTo celebrate.\nIt just opens up the pocketbooks and that has a tendency to be really good for the economy, as well,\" Loren Scott, a Baton Rouge economist, said.\nLSU says its football team's success has also led more high schoolers to apply to the university."}, {"url": "https://jjie.org/2020/01/11/controversial-baton-rouge-police-shooting-case-slated-to-go-before-grand-jury/", "title": "Controversial Baton Rouge Police Shooting Case Slated to Go Before Grand Jury - Juvenile Justice Information Exchange", "authors": ["Clarissa Sosin", "Daryl Khan"], "date": "2020-01-11", "keywords": ["justice", "case", "state", "rouge", "grand", "exchange", "brpd", "information", "controversial", "shooting", "juvenile", "slated", "jury", "baton", "hamadeh", "traffic", "officer", "frazier", "howard"], "summary": "BATON ROUGE, La.\n— Initially former Baton Rouge Police Officer Yuseff Hamadeh was considered a hero for killing a suspect during a traffic stop.\nThe Frazier case is slated to go before the grand jury at the 19th Judicial District Courthouse in downtown Baton Rouge on Thursday.\nThe evidence in the Howard case will be presented a week later, on Jan. 23, sources close to the case said.\nThe East Baton Rouge Parish District Attorney’s office did not reply to requests for comment for this story."}, {"url": "https://www.wafb.com/2020/04/13/exxonmobil-releases-cause-fire-baton-rouge-refinery-february/", "title": "ExxonMobil releases cause of fire at Baton Rouge refinery in February", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-04-13", "keywords": ["plastic", "products", "refinery", "produced", "used", "rouge", "releases", "cause", "wide", "produces", "baton", "variety", "exxonmobil", "largest"], "summary": "ExxonMobil is the largest manufacturing employer in Louisiana.\nThe Baton Rouge refinery is the fifth largest in the nation.\nThe facility produces gasoline, diesel, jet fuel, and more.\nAt the chemical plant, materials are produced that are used in a wide variety of products, such as paint, adhesives, plastic milk jugs, and other everyday items."}, {"url": "https://www.nytimes.com/2020/03/26/us/coronavirus-louisiana-new-orleans.html", "title": "New Orleans Faces a Virus Nightmare, and Mardi Gras May Be Why", "authors": ["Katy Reckdahl", "Campbell Robertson", "Richard Fausset"], "date": "2020-03-26", "keywords": ["nightmare", "orleans", "going", "think", "care", "faces", "patient", "recording", "mardi", "virus", "really", "im", "patients", "say", "gras", "know"], "summary": "And there’s always going to be somebody who says, you know that’s OK. And that especially happens during Mardi Gras.\nmichael barbaroToday: My colleague Megan Twohey speaks with a nurse on the front lines of the virus in New Orleans.\nmegan twoheyI really, really appreciate it.\nmegan twoheyAnd looking back, given everything that’s happened since then, given everything you’ve been through, how do you think about Mardi Gras now?\nBut I do think that Mardi Gras is going to be the Mardi Gras before the world changed."}, {"url": "https://www.kplctv.com/2020/04/14/latest-louisiana-news-sports-business-entertainment-am-cdt/", "title": "Latest Louisiana news, sports, business and entertainment at 9:20 p.m. CDT", "authors": ["Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-04-14", "keywords": ["testing", "business", "supplies", "states", "detainees", "latest", "weeks", "theres", "entertainment", "920", "say", "jails", "coronavirus", "louisiana", "immigration", "cdt"], "summary": "HOUSTON (AP) — The coronavirus is spreading in immigration detention, with more than 70 detainees in 13 states testing positive and hundreds of others under quarantine.\nU.S. Immigration and Customs Enforcement has started to lower its detainee population to reduce the risk of people getting sick.\nBut people held in immigration jails and their advocates say there’s still not enough protective gear, cleaning supplies or space that allows for social distancing.\nThey fear the number of coronavirus cases will sharply rise in the coming weeks as it has in jails and prisons nationwide.\nDetainees in at least four states say they have been denied masks."}, {"url": "https://www.shreveporttimes.com/story/sports/college/2020/04/14/louisiana-tech-konkol-lswa-coach-year-lsu-mays-all-louisiana/2992073001/", "title": "Konkol, Mays lead 2020 LSWA All-Louisiana college basketball honors", "authors": ["Staff Reports", "Published P.M. Ct April"], "date": "2020-04-14", "keywords": ["college", "lswa", "team", "louisiana", "2020", "konkol", "jr", "alllouisiana", "lead", "ppg", "basketball", "g", "sr", "lsu", "baton", "points", "honors", "mays", "rpg"], "summary": "CLOSELouisiana Tech's Eric Konkol was named Coach of the Year for the 2020 LSWA All-Louisiana Men's Basketball Team.\nSkylar Mays, LSU – G, Sr., Baton Rouge, La., 16.7 ppg., 5.0 rpg., 3.2 rpg.\nThird TeamKae'Ron Baker, Louisiana College – G, Jr., Navasota, Texas, 19.8 ppg., 5.3 rpg., 3.0 apg.\nJavonte Smart, LSU – G, Soph., Baton Rouge, La., 12.5 ppg., 3.5 rpg., 4.2 apg.\nChristion Thompson, Tulane – G, Sr., Gonzales, La., 14.1 ppg., 6.3 rpg., 2.8 apg."}, {"url": "https://www.crowleytoday.com/sports-college-sports/lsu%E2%80%99s-skylar-mays-headlines-2020-lswa-men%E2%80%99s-college-basketball-team", "title": "LSU’s Skylar Mays headlines 2020 LSWA Men’s College Basketball Team", "authors": [], "date": "2020-04-16", "keywords": ["sec", "college", "skylar", "lswa", "team", "louisiana", "rebounds", "2020", "scoring", "basketball", "lsus", "lsu", "points", "honors", "mens", "mays", "percentage", "led", "headlines"], "summary": "Mays averaged a career-best 16.7 points per game to lead the Tigers while grabbing 5.0 rebounds with 3.2 assists and 1.8 steals per game.\nWatford, a second-team selection, claimed Freshman of the Year honors for LSU after averaging 13.6 points, 7.2 rebounds and 1.7 assists.\nHe averaged 13.8 points and 8.1 rebounds in SEC play and scored a season-high 26 points at Vanderbilt on Feb. 5.\nMays was joined on the first team by Louisiana Tech guard DaQuan Bracey, Cedric Harris of Centenary College, Sha’Markus Kennedy of McNeese and New Orleans’ Bryson Robinson.\nThe third team consisted of LSU’s Javonte Smart, Kae’Ron Baker of Louisiana College, Chudier Bile of Northwestern State, Myles Burns of Loyola (N.O.)"}, {"url": "https://www.wafb.com/2020/03/19/all-la-omv-locations-will-close-due-covid-precautions/", "title": "All La. OMV locations will close due to COVID-19 precautions", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-03-19", "keywords": ["available", "app", "locations", "drivers", "suspend", "wallet", "digital", "searching", "la", "state", "precautions", "omv", "license", "close", "covid19"], "summary": "Additionally, LA Wallet, the state of Louisiana's official digital driver's license, is now available to residents free of charge.\nThe all digital identification and driver's license app will suspend its fee in response to the COVID-19 pandemic.\nThe app is available to download on Apple and Android devices by searching LA Wallet."}, {"url": "https://www.wafb.com/2020/03/30/supplemental-snap-benefits-response-covid-will-be-issued-many-louisiana-households/", "title": "Supplemental SNAP benefits in response to COVID-19 will be issued to many Louisiana households", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-03-30", "keywords": ["response", "federal", "waiver", "suspended", "households", "unless", "supplemental", "issued", "rule", "statewide", "requirements", "snap", "work", "temporarily", "benefits", "covid19", "louisiana"], "summary": "Also in response to the pandemic, the federal rule that limited Able-Bodied Adults Without Dependents (ABAWDs) to only three months of benefits unless they met federal work requirements has been temporarily suspended.\nThe rule would have gone into effect for 50 non-waived parishes in Louisiana on April 1, following the expiration of a previously obtained statewide waiver."}, {"url": "https://www.eunicetoday.com/news/jobless-rate-sees-steepest-over-month-drop-february-2006", "title": "Jobless rate sees steepest over-the-month drop since February 2006", "authors": [], "date": "2020-03-28", "keywords": ["lost", "jobs", "drop", "2020", "overthemonth", "individuals", "steepest", "sees", "adjusted", "2006", "2019", "rate", "seasonally", "increased", "jobless", "number", "gained"], "summary": "The state’s not seasonally adjusted unemployment rate dropped to 4.3% in February compared to 5.7% in January, according to statistics released Friday by the Bureau of Labor & Statistics.\nThis is the largest over-the-month drop in the not seasonally adjusted unemployment rate since February 2006.\nThe number of not seasonally adjusted employed individuals increased by 28,650 from 1,977,412 in January 2020 to 2,006,062 in February 2020.\nThis is the second highest not seasonally adjusted number of employed for the month of February in the series.\nLouisiana’s seasonally adjusted unemployment rate decreased from 5.3 percent in January 2020 to 5.2 percent in February 2020."}, {"url": "https://www.wafb.com/2020/03/19/state-sales-tax-deadline-extended-amid-covid-pandemic/", "title": "State sales tax deadline extended amid COVID-19 pandemic", "authors": ["Kevin Foster", "Published April", "At Am", "At Pm"], "date": "2020-03-19", "keywords": ["pandemic", "excise", "sales", "returns", "state", "normally", "deadline", "amid", "month", "wine", "period", "payments", "tax", "following", "covid19", "extended"], "summary": "The extension applies to sales, beer excise, and wine excise tax returns and payments for the February 2020 tax period which are normally due on the 20th day of the following month."}, {"url": "https://www.seatrade-maritime.com/ports-logistics/keeping-essential-maritime-businesses-working-us", "title": "Keeping essential maritime businesses working the US", "authors": [], "date": "2020-04-16", "keywords": ["federal", "businesses", "maritime", "keeping", "directives", "line", "rescues", "miles", "working", "late", "mississippi", "essential", "louisiana"], "summary": "The bottom line is that shipping and maritime activities, and the supply chains which feed them, are deemed to be “Essential Businesses”- which are allowed to stay open.\nOf course, the devil is in the details- with companies and trade associations seeking clarifications on who is essential.\nMaritime businesses clearly are.\nWhile the heavily attended parades and densely packed gatherings occurred during late February, Louisiana’s “stay at home” directives were only issued in late March, drawing on Federal governmental definitions of “Essential”.\nThe groups are providing rescues of a different sort than waterborne rescues- this time, gathering medical supplies and bringing them to front line health care workers."}, {"url": "https://www.businessreport.com/politics/louisiana-extends-filing-deadline-for-sales-tax-returns", "title": "Louisiana extends filing deadline for sales tax returns", "authors": ["Daily Report Staff"], "date": "2020-03-20", "keywords": ["excise", "sales", "returns", "filing", "taxes", "extends", "extended", "deadline", "payments", "tax", "extension", "period", "louisiana"], "summary": "Businesses have additional time to file returns due this month for sales and excise taxes collected by the Louisiana Department of Revenue.\nThe extended deadline is May 20, for applicable returns and payments that were due today.\nThe extension applies to sales tax returns as well as excise taxes on beer and wine for the February 2020 tax period.\nBy state law, sales and excise tax returns for any monthly tax period are generally due on the 20th day of the following month.\nLDR will also waive penalties and interest for applicable returns and payments received by the extended May 20 deadline."}, {"url": "https://www.washingtontimes.com/news/2020/apr/15/coronavirus-death-percentage-black-population-fall/", "title": "Coronavirus death percentage in black population falls in Louisiana", "authors": ["The Washington Times Http", "James Varney"], "date": "2020-04-15", "keywords": ["ldh", "orleans", "population", "falls", "state", "black", "health", "deaths", "coronavirus", "percentage", "virus", "figures", "white", "death", "louisiana"], "summary": "NEW ORLEANS — The percentage of African Americans among Louisiana’s coronavirus deaths dropped sharply in new data released Wednesday, flatting what has been an alarming trend of the disease disproportionately striking black communities.\nThe figure fell to 59.2% this, with the percentage of white deaths rocketing to 30.24%, according to tables the Louisiana Department of Health releases weekly.\nThe LDH offered no reason for the reported sharp decrease in the percentage of African American coronavirus victims.\nOverall, Louisiana’s population is about one-third black, but that percentage is higher in heavily populated areas like Baton Rouge where the virus continues to percolate.\nJohn Bel Edwards and LDH figures."}, {"url": "https://www.businessreport.com/industry/exxonmobil-cuts-baton-rouge-refinery-production-contract-workforce", "title": "ExxonMobil cuts Baton Rouge refinery production, contract workforce", "authors": ["Daily Report Staff"], "date": "2020-03-24", "keywords": ["refinery", "workforce", "production", "workers", "baton", "cut", "spending", "rouge", "secondlargest", "contract", "number", "exxonmobil", "cuts"], "summary": "ExxonMobil cut production on Saturday at its 502,500-barrel-per-day Baton Rouge refinery as poor demand has pushed up inventories and filled storage tanks, Reuters reports.\nThe number of contract workers at the Baton Rouge refinery was cut by 1,800 on Friday as ExxonMobil began informing service companies of planned spending cuts.\nThe Baton Rouge refinery is the second-largest in Louisiana and ExxonMobil’s second-largest in the U.S.\nThe number of contract workers at the refinery is usually about 2,000 and increases when major overhauls are underway.\nThe Baton Rouge refinery recently restored full production on March 9 after it was shut by a Feb. 12 fire."}, {"url": "https://theintercept.com/2020/04/07/louisiana-coronavirus-prisons/", "title": "Louisiana’s Coronavirus Plan for Prisons Could Create Death Camps", "authors": [], "date": "2020-04-07", "keywords": ["angola", "officials", "camps", "state", "cases", "plan", "medical", "louisianas", "coronavirus", "create", "incarcerated", "prison", "death", "prisons", "covid19", "louisiana"], "summary": "Rather than release people, they plan to isolate those who test positive for the virus in two maximum-security state facilities — a plan that critics said amounts to creating death camps.\nThe plan, which also applies to people held in pretrial detention, was met with a barrage of questions and criticism.\nOn March 28, Louisiana became the first state to record the death of an incarcerated person from Covid-19.\nThe outbreak at Oakdale, they say, should serve as a warning of what’s likely coming to Louisiana state prisons and local jails.\nJohn Bel Edwards and other state officials to seek clarifications about their plans to handle a surge of cases in the state’s prisons."}, {"url": "https://www.cnn.com/2020/04/05/politics/john-bel-edwards-ventilators-cnntv/index.html", "title": "Louisiana governor says state could run out of ventilators by end of the week if coronavirus cases continue to rise", "authors": ["Chandelis Duster", "Caroline Kelly"], "date": "2020-04-05", "keywords": ["ventilator", "confirmed", "cases", "continue", "state", "run", "johns", "week", "deaths", "rise", "end", "coronavirus", "governor", "louisiana", "number", "ventilators"], "summary": "John Bel Edwards on Sunday said his state could run out of ventilators by the end of the week if the number of confirmed coronavirus cases there continues to surge.\n\"As we achieve success in slowing the rate of spread, we also push out that date.\nLouisiana has emerged as one of several coronavirus hot spots across the United States with a surge in the number of confirmed coronavirus cases and deaths.\nThe state has more than 12,000 cases and more than 400 deaths, according to Johns Hopkins University's tally of cases .\nEdwards continued, \"So we're encouraging everyone in Louisiana to take social distancing, the stay-at-home order, very seriously because that's how we're going to save people's lives at the end of the day.\""}, {"url": "https://www.225batonrouge.com/food-drink/whats-fresh-baton-rouge-farmers-markets-february-2020", "title": "What’s fresh at Baton Rouge farmers markets this February 2020", "authors": [], "date": "2020-01-30", "keywords": ["market", "whats", "farmers", "main", "available", "2020", "winter", "markets", "fresh", "rouge", "season", "greens", "baton", "stock"], "summary": "Luckily, the Baton Rouge Farmers Market has veggies, produce and locally made foods for every occasion.\nWith warmer weather approaching, Louisiana strawberries will start making their annual appearance at the farmers market.\nThe Baton Rouge Arts Market will take place in conjunction with the farmers market this Saturday, Feb. 1.\nMore than 50 potters, photographers, painters and jewelers from the Gulf Coast region flock to Baton Rouge to sell their work.\nAnd as usual, the East Baton Rouge Master Gardeners will be onsite every first Saturday with free growing guides and tips for planting spring vegetable gardens."}, {"url": "https://fanbuzz.com/college-football/sec/lsu/kelly-orgeron/", "title": "Kelly & Ed Orgeron Divorcing After 23 Years of Marriage", "authors": ["Patrick Pinak", "Allison Johnson", "John Duffley", "Patrick", "About The Author", "The League", "Patrick Has Spent Parts Of The Last Four Years Covering University Of Florida Athletics", "Spent Two Seasons With Major League Baseball. He'S A Baseball Junkie Who Spends His Days Defending Derek Jeter", "The Miami Marlins. A Recent Gator Grad", "Patrick Currently Resides In Gainesville"], "date": "2020-04-02", "keywords": ["shes", "divorcing", "23", "orgeron", "marriage", "sons", "coach", "wife", "ed", "lsu", "kelly", "orgerons", "football"], "summary": "Ed Orgeron’s wife, Kelly Orgeron, is a different story.\nHow Kelly Orgeron Nearly DiedLSU Head Coach Ed Orgeron draws inspiration from the perseverance his wife, Kelly, has shown after nearly losing her life in a medical emergency.\npic.twitter.com/Uxp4SPWWtD — LSU Football (@LSUfootball) May 9, 2019One look at Kelly Orgeron and you’d never think of the surgeries and scars.\nEd Orgeron to his wife, Kelly, en route to sing #LSU’s alma mater with the team: “Come on Kelly lady, we got us a song to sang.\"\nEd Orgeron is at the top of his profession in the SEC with Kelly Orgeron by his side."}, {"url": "https://www.orthospinenews.com/2020/04/03/first-katrina-now-covid19-the-louisiana-state-university-perspective/", "title": "First Katrina, Now COVID19: The Louisiana State University Perspective", "authors": ["Elizabeth Hofheinz", "Two Time Winner Of The More Award Ms. Hofheinz Was The First Writer Employed Orthopedics This Week. The More Award Is Granted Annually The American Academy Of Orthopaedic Surgeons To Recognize Excellence In Journalism. Ms. Hofheinz Is Currently The Director Of Communications For Ortho Spine Partners", "Osp ."], "date": "2020-04-03", "keywords": ["katrina", "going", "hospital", "state", "patient", "dr", "health", "trauma", "md", "residents", "university", "patients", "perspective", "covid19", "louisiana"], "summary": "Robert Zura, M.D., an orthopedic trauma surgeon, is the Robert D’Ambrosia Professor and Department Head at the Louisiana State University Health Sciences Center (LSUHSC).\nIn mid-March Seattle was overwhelmed and began questioning their ability to handle nonemergent patients in addition to those with COVID19.”“At this point I have yet to directly treat any COVID19 patients.\nWill device reps move from hospital to hospital and potentially be exposed or expose others to the virus?\n“While I have not seen any COVID19 patients, my wife and I started feeling poorly around March 20.\nApparently, I was in a room with a COVID19 patient and didn’t know."}, {"url": "https://www.arkansasonline.com/news/2020/apr/16/explosion-damages-paper-mill-in-maine-g/", "title": "The nation in brief", "authors": ["Compiled Democrat-Gazette Staff Wire Reports"], "date": "2020-04-16", "keywords": ["maine", "explosion", "ardoin", "voting", "brief", "state", "jets", "force", "air", "republicans", "nation", "republican"], "summary": "The blast rocked the Androscoggin Mill in Jay, in central Maine, around noon, state police spokesman Steve McCausland said.\nThe jets will replace older F-16 aircraft and will allow the Air Force to meet other requirements for readiness and training, the Air Force said in a statement.\nThe Air Force said in a preliminary report that noise from the F-35s could make more than 1,000 homes \"incompatible for residential use.\"\nWhile Madison's City Council passed a resolution opposing the jets, the Greater Madison Chamber of Commerce is a vocal supporter.\nSecretary of State Kyle Ardoin ran into a wall of opposition from his fellow Republicans -- including objections from the state Republican Party -- for his proposal."}, {"url": "https://www.reviewjournal.com/nevada-preps/np-basketball/boys-basketball/bishop-gorman-boys-basketball-sends-2-to-division-i-schools-2007703/", "title": "Bishop Gorman boys basketball sends 2 to Division I schools", "authors": ["Las Vegas Review-Journal"], "date": "2020-04-16", "keywords": ["going", "basketball", "gorman", "boys", "sends", "wilkinson", "las", "vegas", "lamar", "bishop", "im", "school", "division", "schools", "mwani"], "summary": "Mwani Wilkinson and Braden Lamar signed national letters of intent to Division I schools after helping Bishop Gorman to its ninth straight state championship.\nBishop Gorman forward Mwani Wilkinson (23) blocks a shot by in the Durango guard Keshon Gilbert (10) in the fourth quarter of their basketball game at Bishop Gorman High School in Las Vegas Monday, Jan. 27, 2020.\nCannon/Las Vegas Review-Journal) @KMCannonPhotoBishop Gorman forward Mwani Wilkinson (23) dunks between Durango guards Anthony Hunter (21) and Sebastian Mack (12) in the fourth quarter of their basketball game at Bishop Gorman High School in Las Vegas Monday, Jan. 27, 2020.\nBishop Gorman won 80-61.\n(Ellen Schmidt/Las Vegas Review-Journal) @ellenkschmidt_Two seniors who helped Bishop Gorman win its ninth straight state basketball championship in March traded their orange and blue for purple and gold in signing Division I scholarships Wednesday."}, {"url": "https://www.click2houston.com/business/2020/02/12/fire-erupts-at-exxonmobil-refinery-in-louisiana-no-injuries-2/", "title": "Fire erupts at ExxonMobil refinery in Louisiana; no injuries", "authors": [], "date": "2020-02-12", "keywords": ["refinery", "injuries", "spokesman", "rouge", "department", "air", "monte", "baton", "reported", "erupts", "exxonmobil", "largest", "louisiana"], "summary": "BATON ROUGE, La.\n– A fire inside an ExxonMobil refinery in Louisiana turned the night sky a shade of orange and sent a large plume of smoke into the air.\nThe fire erupted at the facility in Baton Rouge around 11:30 p.m. Tuesday, Baton Rouge Fire Department spokesman Curt Monte told news outlets.\nExxonMobil is the largest manufacturing employer in Louisiana and its Baton Rouge refinery is the fifth largest in the country, WAFB-TV reported.\nThere was no off-site impact, fire department spokesman Monte said."}, {"url": "https://www.225batonrouge.com/things-to-do/march-2020-calendar-events-baton-rouge", "title": "March 2020 calendar of events in Baton Rouge", "authors": [], "date": "2020-02-21", "keywords": ["theatre", "event", "2020", "local", "tour", "center", "events", "calendar", "rouge", "art", "band", "baton"], "summary": "Vote for your favorites to help determine who gets the 2020 People’s Choice awards at this Baton Rouge Epicurean Society event.\nFind the event on FacebookARTS EVENTS: THIS MONTH’S BEST BETSUNTIL MARCH 15Watch Theatre Baton Rouge’s hilarious rendition of The Fox on the Fairway.\nPennington Foundation Great Performers in Concert Series will feature country superstar Trisha Yearwood with the Baton Rouge Symphony Orchestra featuring her music from the ’90s to now.\nthetexasclub.comMARCH 14Head over to L’Auberge Casino & Hotel Baton Rouge to hear the rock, rhythm and blues, jazz and gospel sounds of the Marshall Tucker Band.\nIf you’re an aspiring songwriter, this event is perfect for you, but even if you’re not, you can just hang out and listen to plenty of live and original music in downtown Baton Rouge."}, {"url": "https://www.wafb.com/2020/02/22/revelers-prepare-baton-rouges-spanish-town-parade/", "title": "Revelers prepare for Baton Rouge’s Spanish Town parade", "authors": ["Lester Duhé", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-02-22", "keywords": ["robert", "revelers", "prepare", "rouges", "sight", "way", "parade", "saying", "baton", "started", "wont", "thinking", "town", "spanish", "krewe"], "summary": "“We (Spanish Town Krewe) said, hindsight is 2020, which is an old saying from way back, and then we started thinking, well that won’t fit Spanish Town so what about hiney sight?\nWe said, okay we like that,” said Robert King, a Spanish Town krewe member for 38 years."}, {"url": "https://www.wafb.com/2020/02/18/exxonmobil-release-day-report-about-fire-baton-rouge-refinery/", "title": "Exxon discloses additional chemical released during fire", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-02-18", "keywords": ["chemical", "amounts", "report", "discloses", "reported", "additional", "7day", "levels", "released", "exxon", "butadiene", "benzene", "allowable"], "summary": "In that initial report, Exxon reported it believed benzene and butadiene had been released at levels exceeding allowable limits.\nThe updated “7-day report” disclosed that sulfuric acid was also released at levels above allowable amounts.\nExxon also said in the “7-day report” that the amounts of benzene and butadiene it initially reported as being involved actually turned out to be lower."}, {"url": "https://ukathletics.com/news/2020/4/13/quickley-to-forgo-remaining-eligibility-declare-for-nba-draft.aspx", "title": "Quickley to Forgo Remaining Eligibility, Declare for NBA Draft", "authors": [], "date": "2020-04-13", "keywords": ["30", "sec", "nba", "remaining", "eligibility", "games", "game", "declare", "player", "season", "3pointers", "draft", "quickley", "points", "forgo"], "summary": "But after praying about it and discussing it with my family, I've decided to forgo my remaining eligibility by declaring for the 2020 NBA Draft and signing with an agent.\n\"His reward: SEC Player of the Year, as voted on by the coaches.\nHe is a wonderful, centered young man who has fought his way to the point of being a first-round draft pick.\n\"Quickley is the third Kentucky underclassman to declare for the NBA Draft.\nHe scored in double figures in 26 of the 30 games he played in and topped the 20-point plateau in eight."}, {"url": "https://www.wafb.com/2020/01/31/ibm-hosting-job-fair-baton-rouge-saturday-feb/", "title": "IBM hosting job fair in Baton Rouge Saturday, Feb. 1", "authors": ["Rachael Thomas", "Published April", "At Am", "At Pm"], "date": "2020-01-31", "keywords": ["worldclass", "workforce", "support", "fair", "feb", "ibm", "job", "rouge", "louisianas", "team", "baton", "hosting", "work", "skilled", "vital"], "summary": "“IBM’s presence in Louisiana’s capital demonstrates the confidence it has in the Louisiana workforce, and we are proud to work with Louisiana’s higher education community to provide companies like IBM with a world-class workforce.\nAs IBM continues to play a vital role in the growth of Louisiana’s IT industry, we are confident that Baton Rouge will continue to support the IBM team with skilled professionals for the leading IT opportunities of the future,” said LED FastStart Executive Director Paul Helton."}, {"url": "https://www.katc.com/news/covering-louisiana/volunteer-louisiana-announces-2020-champions-of-service", "title": "Volunteer Louisiana announces 2020 Champions of Service", "authors": [], "date": "2020-02-21", "keywords": ["2020", "volunteers", "la", "announces", "baton", "champion", "rouge", "community", "volunteer", "students", "champions", "service", "louisiana"], "summary": "Lieutenant Governor Bill Nungesser and Volunteer Louisiana have announced nine 2020 Champions of Service.\nVolunteer Louisiana recognizes six regional champions as well as statewide AmeriCorps, Senior Corps, and corporate champions.\nBill Farmer and the Silver Hammers – Capital Area Champion: Bill Farmer of Baton Rouge, LA, is a dedicated volunteer with Rebuilding Together Baton Rouge.\nGovernor Billy Nungesser and the Volunteer Louisiana Foundation, will honor these winners at the Champions of Service Awards Luncheon on April 22 during National Volunteer Week.\nVolunteer Louisiana, located in the Office of Lt."}, {"url": "https://www.wafb.com/2020/02/04/emergency-crews-respond-reported-shooting-louisiana-culinary-institute/", "title": "Deputies say ‘jealous boyfriend’ and accomplice responsible for fatal shooting near Louisiana Culinary Institute", "authors": ["Rachael Thomas", "Nick Gremillion", "Matt Houston", "Published At Pm"], "date": "2020-02-04", "keywords": ["man", "seconddegree", "jealous", "rouge", "say", "louisiana", "institute", "deputies", "weapon", "second", "shooting", "murder", "fatal", "responsible", "principal", "illegal", "jarquin", "near", "culinary", "handy"], "summary": "Adams has also been charged with illegal use of a weapon.\nA second man, Jarquin Handy, 22, of Baton Rouge, was also arrested on charges of principal to second-degree murder and principal to illegal use of a weapon."}, {"url": "https://www.wafb.com/2020/02/24/rep-cedric-richmond-hosting-cenus-job-fairs-baton-rouge-new-orleans/", "title": "Rep. Cedric Richmond hosting census job fairs in Baton Rouge, New Orleans", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-02-24", "keywords": ["workforce", "rouge", "census", "spent", "fairs", "opportunity", "week", "shape", "schools", "cedric", "unique", "job", "constituents", "baton", "uncounted", "orleans", "richmond", "rep", "hosting"], "summary": "“I’m calling on all of my constituents to help shape our community’s future ahead of this year’s Census count,” Rep. Richmond said.\n“By actively participating in the process, everyone has a unique opportunity to influence how millions of federal dollars will be spent on schools, emergency management, public housing, community centers, and more.\nFortunately, that opportunity extends beyond just being counted.\nThat is why I have partnered with the Census to host two 2020 Census job fairs this week to connect constituents with recruiters looking to add to the workforce needed to ensure no person is left uncounted.”"}, {"url": "https://www.wafb.com/2020/02/15/mardi-gras-parades-rolling-saturday-br-baker-denham/", "title": "Mardi Gras parades held Saturday in BR, Baker", "authors": ["Mykal Vincent", "Lester Duhé", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-02-15", "keywords": ["baker", "little", "surprising", "br", "taking", "smith", "parades", "mardi", "relatives", "weve", "visiting", "work", "gras", "held"], "summary": "“Visiting relatives and taking a little break from work.\nFirst Mardi Gras, we’ve been in Louisiana before, but never Mardi Gras.\nBeen a little surprising.\nIt’s been amazing, lots of fun,” said Jerry Smith and his family."}, {"url": "https://www.wafb.com/2020/02/04/lsu-host-regional-quidditch-championship-feb/", "title": "LSU to host regional Quidditch championship Feb. 8 & 9", "authors": ["Nick Gremillion", "Published April", "At Am", "At Pm"], "date": "2020-02-04", "keywords": ["1030", "championship", "12", "feb", "regional", "team", "host", "130", "quidditch", "lsu", "515", "1130", "830", "play"], "summary": "The LSU Quidditch team will play on Saturday at 9 a.m., 10:30 a.m., 12 p.m., 1:30 p.m., and 5:15 p.m. and on Sunday at 8:30 a.m., 10 a.m., 11:30 a.m., and 1 p.m."}, {"url": "https://www.wafb.com/2020/01/06/dragos-open-baton-rouge-location-february/", "title": "Drago’s to host grand opening Monday", "authors": ["Kiran Chawla", "Published April", "At Am", "At Pm"], "date": "2020-01-06", "keywords": ["oysters", "waiting", "dragos", "thrilled", "sight", "finally", "serve", "opportunity", "host", "grand", "rougeons", "louisiana", "opening", "thank"], "summary": "“After a very long time, the finish line is finally in sight.\nOur family is very grateful for this opportunity.\nWe can’t thank Baton Rougeons enough for waiting on us.\nWe’re thrilled to finally be able to serve to you our Louisiana delicacy of charbroiled oysters and anything else your heart desires,” said Cvitanovich."}, {"url": "https://www.wafb.com/2020/03/01/hundreds-pour-into-downtown-baton-rouge-race-cure/", "title": "Hundreds pour into downtown Baton Rouge for 2020 Race for the Cure", "authors": ["Kevin Foster", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-03-01", "keywords": ["downtown", "hundreds", "2020", "supporters", "susan", "komen", "rouge", "cure", "world", "g", "cancer", "threemile", "baton", "race", "survivors", "breast", "pour"], "summary": "Hundreds of survivors and supporters of family members battling breast cancer ran through downtown during the Susan G. Komen Race for the Cure.\nProceeds from the three-mile race will go to the Susan G. Komen Grants Program which funds breast cancer research as well as educational and scientific programs around the world."}, {"url": "https://www.wafb.com/2020/02/15/community-meeting-called-over-exxonmobil-fire-lawmaker-decide-introducing-new-legislation-about-safety-concerns/", "title": "Community meeting following Exxon fire turns heated as residents express concerns", "authors": ["Austin Kemker", "Kevin Foster", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-02-15", "keywords": ["heated", "tactics", "express", "residents", "exxon", "need", "understand", "concerns", "okay", "community", "night", "following", "order", "public", "ready", "turns", "set", "meeting", "sure"], "summary": "“I’m in a battle, okay?\nYou need to understand that and I have to make sure that firefighter goes home to his family at night, so it’s going to be a minute for us to set up, get our tactics in order, and get ready to go and get set up before I can contact public affairs, the environmental or whoever,” an Exxon employ said to the crowd.\n“Those guys want to get the information to you.”"}, {"url": "https://www.wafb.com/2020/02/23/baton-rouge-police-respond-shooting-alexander-ave/", "title": "One arrested in alleged home invasion, shooting on Alexander Avenue", "authors": ["Published At Pm"], "date": "2020-02-23", "keywords": ["victims", "house", "ran", "gunfire", "alleged", "way", "victim", "neighboring", "arrested", "help", "smith", "rouge", "shooting", "avenue", "alexander", "invasion"], "summary": "According to the Baton Rouge Police Department, Derrick Smith forced his way into the victim’s home on Alexander Avenue on Sunday, Feb. 23 and exchanged gunfire with the victim.\nSmith allegedly ran to a neighboring house to ask for help."}, {"url": "https://www.wafb.com/2020/02/25/baton-rouge-general-welcomes-mardi-gras-baby-hosts-parade-patients/", "title": "Baton Rouge General welcomes Mardi Gras baby, hosts parade for patients", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-02-25", "keywords": ["hosts", "general", "welcomed", "weighing", "welcomes", "hospital", "armani", "parade", "spokesperson", "baton", "pounds", "rouge", "world", "mardi", "patients", "baby", "gras"], "summary": "Katie Johnston, a hospital spokesperson, says baby girl Armani Kai Mardi Gras mambo-ed into the world at 12:04 a.m. Baby Armani was the first 2020 Mardi Gras Day baby born at the hospital, weighing five pounds and 13 ounces.\nShe was welcomed by parents Christina and Paul."}, {"url": "https://www.clickorlando.com/news/politics/2020/04/14/the-latest-app-could-be-used-by-eu-to-relax-restrictions/", "title": "CORONAVIRUS UPDATES: Some shops allowed to reopen in Italy", "authors": ["The Associated Press", "Associated Press"], "date": "2020-04-14", "keywords": ["cases", "sinn", "updates", "health", "deaths", "allowed", "president", "italy", "coronavirus", "patients", "number", "reopen", "shops", "infections", "covid19"], "summary": "—Trump meets with former coronavirus patients.\nAmong the former COVID-19 patients meeting with Trump at the White House is Michigan state lawmaker Karen Whitsett.\nThe Navy also says the number of coronavirus cases among the Roosevelt crew is now 589, with 3,922 negative test results.\n___LOS ANGELES — The number of COVID-19 cases among crewmembers of the Navy hospital ship Mercy has risen to seven.\nHe’s worried that puts the state at risk for a new spike in coronavirus infections after appearing to make strides in stemming the outbreak."}, {"url": "https://www.wafb.com/2020/02/08/recent-arrests-linked-possible-large-violent-drug-ring-baton-rouge/", "title": "Recent arrests linked to possible large, violent drug ring in Baton Rouge", "authors": ["Elizabeth Vowell", "Published At Pm"], "date": "2020-02-08", "keywords": ["drug", "keelen", "rouge", "ring", "witness", "linked", "rappers", "violent", "recent", "possible", "believe", "collins", "winbourne", "baton", "warrants", "death", "arrests", "large", "phillips", "ordered"], "summary": "According to the arrest warrants, police believe in April 2017 Collins, Phillips, and several others ambushed and killed Lorenzo Dixon, a local rapper known on Winbourne Avenue.\nPolice claim a witness heard Collins and another man, Patrick Carter, take credit for the shooting.\nThe warrant also names Jornell Keelen as someone who was involved or had knowledge of the murder.\nInvestigators believe the unidentified ringleader of the organization ordered the rapper’s death, promising the suspects money, drugs, or even a higher position in the group.\nPolice say the witness claims one of the men was also ordered to kill Keelen after the rapper’s death, but failed to do so."}, {"url": "https://www.desmogblog.com/2020/02/24/real-time-air-pollution-exxon-refinery-fire-denka-louisiana", "title": "Momentum Builds to Monitor Cancer Alley Air Pollution in Real Time After Exxon Refinery Fire in Louisiana", "authors": ["Bryan Walsh", "Time Magazine"], "date": "2020-02-24", "keywords": ["refinery", "st", "rouge", "cancer", "exxon", "louisiana", "john", "momentum", "alley", "air", "epa", "plant", "real", "monitor", "pollution", "community", "baton", "builds", "monitoring", "meeting"], "summary": "A large fire at ExxonMobil's Baton Rouge oil refinery late on February 11 lit up the sky for miles and continued until dawn.\nSenator Cleo Fields leading a community meeting in Baton Rouge on February 19, 2020.\nFlares at ExxonMobil’s Baton Rouge facility seen from the Star of Bethlehem Baptist Church’s parking lot.\n“It is not my intention to come here and undercut you in any way,” Gray told St. John the Baptist residents.\nLt. General Russel Honoré speaking at a February 11, 2020 Baton Rouge community meeting."}, {"url": "https://www.wafb.com/2020/02/21/volunteers-clean-up-route-spanish-town-parade/", "title": "Crews clean up Spanish Town parade route", "authors": ["Wafb Staff", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-02-21", "keywords": ["trees", "route", "took", "parade", "road", "crews", "invasive", "town", "clean", "spanish", "moss"], "summary": "The crews also asked to move their cars from the route along Spanish Town Road.\nCrews even took time to clean up the invasive ball moss off of trees in the Spanish Town area."}, {"url": "https://www.wafb.com/2020/02/14/lsu-baseball-announces-doubleheader-saturday/", "title": "LSU baseball announces doubleheader on Saturday", "authors": ["Amanda Lindsley", "Published March", "At Pm"], "date": "2020-02-14", "keywords": ["stadium", "respective", "tickets", "games", "game", "lsu", "seating", "doubleheader", "ticket", "honored", "priority", "holder", "announces", "baseball"], "summary": "The stadium will NOT be cleared in between games on Saturday, so both Game 2 and Game 3 tickets will be honored throughout the day.\nSeating priority will go to the respective game’s ticket holder."}, {"url": "https://www.wafb.com/2020/02/18/baton-rouge-blues-legend-henry-gray-dies/", "title": "Henry Gray, legendary blues musician, dies at 95", "authors": ["Donovan Jackson", "Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-02-18", "keywords": ["henry", "musician", "prayer", "post", "gray", "dies", "95", "great", "reads", "smile", "legendary", "blues", "transitioned", "word", "soon", "sadness", "thank"], "summary": "“It is with great sadness that I formally announce that my Great Grandfather Henry Gray has transitioned.\nMy family and I appreciate every prayer, every donation, every smile, and every word of encouragement that you have given throughout his more than 70 year career.\nI will post the funeral arrangements as soon as we make them.\nThank you all,” the post reads."}, {"url": "https://www.brproud.com/news/baton-rouge-epicurean-society-and-louisiana-hospitality-foundation-present-crawfete-2020/", "title": "Baton Rouge Epicurean Society and Louisiana Hospitality Foundation present CrawFête 2020", "authors": ["Chad Sabadie", "Karli Carpenter", "Associated Press", "Nexstar Media Wire"], "date": "2020-02-26", "keywords": ["society", "event", "2020", "crawfête", "creole", "tickets", "seafood", "restaurant", "foundation", "geaux", "baton", "epicurean", "rouge", "crawfish", "present", "bar", "hospitality", "louisiana"], "summary": "The gourmet crawfish tasting event kicks off Sunday, March 8th, 2-5 pm at Perkins Rowe.\nAs guests taste boiled crawfish and crawfish dishes inspired by local restaurants and chefs, they will also have the opportunity to vote on their favorite boiled crawfish and listen to live music by Last Call Band.\nRestaurants participating this year are Walk-On’s, Juban’s, Bergeron’s City Market, C&M Crawfish, Mestizo’s, Cecilia Creole Bistro, Drago’s Seafood Restaurant, Geaux Creole, Francis Southern Table & Bar, City Pork Brasserie & Bar, , Houmas House, Ruffino’s, LSU Dining, Fred’s Bar, Solera Bar and Kitchen, Just Wingin It, Dickie Brennan’s Co., Bin 77 Bistro & Sidebar, Adrian’s Restaurant, L’Auberge Bon Temp Buffet, Hot Tails, Four Oaks Quality Crawfish, Crawfish on the Geaux, Game Changer Smoker, Cuisine Louisiane, Triple H Chefs, Rouj Creole, Tallulah’s Crafted Food and Wine Bar, Zea’s Rotisserie and Bar, Louisiana Lagniappe, Tony’s Seafood, Playa’s Bowls LA & Ivar’s Sports Bar & Grill.\nRegular Tickets are $50 and VIP tickets are $100 and can be purchased online at www.crawfetebr.com.\nProceeds from the event will benefit the Baton Rouge Epicurean Society and the Louisiana Hospitality Foundation’s charitable efforts in the Baton Rouge community."}, {"url": "https://www.wafb.com/2020/02/05/first-alert-forecast-severe-weather-moves-wednesday-afternoon/", "title": "FIRST ALERT FORECAST: Tornado Watch issued for Baton Rouge area", "authors": ["Steve Caparotta", "Published April", "At Am", "At Pm"], "date": "2020-02-05", "keywords": ["forecast", "flooding", "tornado", "wafb", "alert", "viewing", "tonight", "totals", "watch", "locally", "issued", "rouge", "weather", "area", "baton", "uptick", "upward", "rain"], "summary": "The combination of a slow-moving front and our guidance showing those moderate to heavy rains lingering overnight has led to a bit of an uptick in forecast rain totals.\nLook for anywhere from 1″ to 3″ of rain on average through lunchtime Thursday, with locally higher amounts possible.\nWith the upward nudge in the rain forecasts, NOAA’s Weather Prediction Center has now expanded the Slight Risk (2/4) of flooding (excessive rainfall) to include all of the WAFB viewing area.\nThe primary concern locally is the potential for some nuisance street flooding tonight into early Thursday."}, {"url": "https://www.wafb.com/2020/02/09/woman-allegedly-kidnapped-baton-rouge-escapes-rapist-by-faking-medical-emergency/", "title": "Woman allegedly kidnapped in Baton Rouge escapes rapist by faking medical emergency", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-02-09", "keywords": ["going", "rapist", "escapes", "wafb", "taken", "set", "allegedly", "baton", "woman", "rouge", "medical", "faking", "troy", "kidnapped", "prevent", "raped", "emergency"], "summary": "BATON ROUGE, La.\n(WAFB) - Troy Knighten, 56, was taken into custody by Baton Rouge police officers who claim he abducted a woman, brought her to a home where measures were set up to prevent her escape, advised her “he was going to have her and she was going to have him,” and raped her."}, {"url": "https://lsusports.net/news/2020/2/3/classroom-community-february-2020-ccacsa-student-athletes-of-the-month.aspx", "title": "February 2020 CCACSA Student-Athletes of the Month", "authors": [], "date": "2020-02-03", "keywords": ["academic", "2020", "student", "success", "ccacsa", "studentathletes", "month", "commitment", "affairs", "service", "major", "work"], "summary": "– The LSU Cox Communications Academic Center for Student-Athletes (CCACSA) recognizes several athletes for their scholastic and community achievements each month.\nStudent-athletes are chosen based on their commitment to academic success and for their devotion to volunteerism and service to the community.\nHere are the February 2020 CCASA's staff Student-Athletes of the month:• Mercy Abire, Sr., Women's Track & Field, Lagos, Nigeria (Major: Interdisciplinary Studies)Nominator – Academic Advisor John Parham: \"Mercy has shown the motivation and desire to improve and excel in the classroom.\"\nThe Cox Communications Academic Center for Student-Athletes is a 54,000 square-foot facility comprised of teams for academic affairs, student affairs and information technology, who annually serve more than 500 student-athletes.\nThe purpose of the CCACSA is to provide an all-inclusive, student-centered support structure for all student-athletes from matriculation, through graduation, and life beyond."}, {"url": "https://www.businessreport.com/article/catch-me-if-you-can-subject-frank-abagnale-comes-to-baton-rouge", "title": "‘Catch Me If You Can’ subject Frank Abagnale comes to Baton Rouge", "authors": ["Julia Arenstam"], "date": "2020-02-11", "keywords": ["cybersecurity", "going", "abagnale", "frank", "state", "speech", "normal", "hes", "rouge", "life", "subject", "fbi", "baton", "catch", "comes", "louisiana"], "summary": "Frank Abagnale, the famed fraudster turned cybersecurity expert for the FBI, was the keynote speaker at today’s annual Louisiana Association of Business and Industry luncheon.\nAbagnale became one of the FBI’s most-wanted criminals before the age of 21, and later became the subject of a Stephen Spielberg movie, Catch Me If You Can.\nSince serving years in French, Swedish and U.S. jails for his crimes, Abagnale has become a decorated FBI agent and instructor for going on 44 years.\nHe’s continued to work for the FBI for more than 35 years since his required service expired.\n“But I also want the new normal in Louisiana to be the highest level of cybersecurity prevention anywhere in the nation.”"}, {"url": "https://www.wafb.com/2020/02/18/investigators-reports-elder-abuse-rise-louisiana/", "title": "THE INVESTIGATORS: Reports of elder abuse on the rise in Louisiana", "authors": ["Scottie Hunter", "Published At Pm"], "date": "2020-02-18", "keywords": ["number", "elder", "fact", "investigators", "neglect", "cases", "unknown", "yes", "place", "rise", "abuse", "reported", "reports", "taking", "increase", "louisiana"], "summary": "“Yes,” she answered.\n“Each year, we see an increase in cases reported of abuse or neglect and we are not confident in the fact that all of the cases are being reported.\nThere are an unknown number of cases that are taking place that have not been reported.”"}, {"url": "https://wgno.com/news/local/feb-28-deadline-for-louisiana-superintendent-applications/", "title": "Feb. 28 deadline for Louisiana superintendent applications", "authors": ["Associated Press", "Amy Boraks", "Wgno Web Desk"], "date": "2020-02-18", "keywords": ["board", "secondary", "elementary", "28", "superintendent", "deadline", "feb", "education", "vote", "applicants", "wants", "louisianas", "white", "applications", "louisiana"], "summary": "(AP) — Louisiana’s top public school board has set a Feb. 28 deadline for anyone who wants to apply to be the state’s next superintendent of education.\nThe Board of Elementary and Secondary Education published an information packet online for interested applicants and hired a firm to help with the search.\nLongtime Superintendent of Education John White is stepping down from the job March 11.\nThe search committee hopes to recommend one to three applicants to the full board for consideration to be superintendent.\nIt will take a two-thirds vote of the 11-member board to appoint a superintendent."}, {"url": "https://www.wafb.com/2020/02/06/krewe-oshun-br-prepares-inaugural-mardi-gras-parade/", "title": "History made in north Baton Rouge with inaugural Krewe of Oshun parade", "authors": ["Published At Pm"], "date": "2020-02-06", "keywords": ["history", "oshun", "long", "terrence", "north", "parade", "inaugural", "wonderful", "wasnt", "turned", "rouge", "kids", "nice", "baton", "krewe", "probably", "especially", "weve"], "summary": "\"First one we've had in a long, long time.\nI probably wasn't even born when they had the first one, but it turned out nice.\nIt was wonderful, especially for these kids, it was something they could see,\" said Terrence Dunn."}, {"url": "https://www.wafb.com/2020/02/27/baton-rouge-doctors-warn-people-remain-calm-during-coronavirus-scare/", "title": "Baton Rouge doctors warn people to remain calm during coronavirus scare", "authors": ["Lester Duhé", "Published At Pm"], "date": "2020-02-27", "keywords": ["youre", "safe", "doctors", "protecting", "oneal", "notices", "traveling", "washing", "warn", "look", "rouge", "coronavirus", "travel", "calm", "sure", "baton", "remain", "scare"], "summary": "“Make sure that if you’re traveling, that you look at your travel notices.\nYou call your airline, make sure that you can still fly to your destination, and then, if you’re traveling and it’s deemed safe to travel, make sure that you’re washing your hands, protecting your cough, avoiding the flu,” said Oneal."}, {"url": "https://www.wafb.com/2020/02/19/million-tax-dollars-were-misused-or-missed-out-louisiana-legislative-auditor-says/", "title": "$642 million in tax dollars were misused or missed out on in 2019, Louisiana legislative auditor says", "authors": ["Matt Houston", "Published At Pm"], "date": "2020-02-19", "keywords": ["reconcile", "records", "state", "dollars", "million", "legislative", "642", "louisiana", "missed", "revenue", "reads", "report", "funds", "2019", "tax", "noncompliance", "related", "overall", "misused", "auditor"], "summary": "“Auditors continue to find non-compliance with state laws related to budgets; failure to reconcile bank accounts; errors in accounting records; deficits in general funds and other funds; and misappropriation of money and assets,\" the report reads.\n\"The overall effect is the loss of much-needed revenue at the local level.”"}, {"url": "https://www.ksla.com/2020/02/16/woman-accused-punching-baton-rouge-officer-eye/", "title": "Woman accused of punching Baton Rouge officer in the eye", "authors": ["Kevin Foster", "Published At Pm"], "date": "2020-02-16", "keywords": ["accused", "semien", "head", "handcuffed", "strike", "officer", "punching", "shoulder", "woman", "rouge", "department", "eye", "facility", "baton", "struck"], "summary": "Semien, after being brought to a Baton Rouge Police Department facility, struck the officer in the shoulder and attempted to strike the officer in the head while handcuffed, according to the officer."}, {"url": "https://www.katc.com/news/coronavirus/gov-edwards-leads-live-statewide-broadcast-on-louisianas-response-to-covid-19", "title": "Gov. Edwards leads live statewide broadcast on Louisiana's response to COVID-19", "authors": [], "date": "2020-03-20", "keywords": ["response", "edwards", "broadcast", "information", "gov", "leads", "radio", "statewide", "help", "stations", "resources", "louisianas", "live", "public", "television", "work", "covid19"], "summary": "John Bel Edwards will be joined by health experts and members of his administration for a live statewide discussion on Louisiana's response to COVID-19.\nIt will air from 7-8 PM on television and radio stations across the state and on multiple digital platforms.\nThe program will be produced and broadcast from the studio of Louisiana Public Broadcasting in Baton Rouge.\nI'm grateful to LPB and the television and radio stations statewide who are using their platforms to help educate our citizens and make our state as safe as possible.\nHere are the details:COVID-19 Louisiana's ResponseAirs Monday, March 23 on network and public television and radio stations statewide."}, {"url": "https://www.latimes.com/world-nation/story/2020-03-29/louisiana-church-defies-covid-19-order-holds-sunday-services", "title": "Louisiana church defies COVID-19 order, holds Sunday services", "authors": ["Houston Bureau Chief", "Molly Hennessy-Fiske Has Been A Staff Writer Since In Washington", "Los Angeles", "Texas", "Overseas. A Graduate Of Harvard College", "She Spent A Year As Middle East Bureau Chief Before Returning As Houston Bureau Chief."], "date": "2020-03-29", "keywords": ["services", "holds", "going", "service", "including", "churches", "central", "virus", "life", "church", "order", "spell", "defies", "covid19", "louisiana"], "summary": "A volunteer at Life Tabernacle Church outside Baton Rouge, La., checks a woman’s temperature before she can enter Sunday’s service.\n(Woody Jenkins / Central City News)On Sunday, 1,265 attended morning services at the church, said the Rev.\n“I’d rather die than kill the church,” Spell repeated, framing the pandemic as a test of faith.\nTony Spell of Life Tabernacle Church said during his sermon Sunday that the Louisiana governor should deem churches as essential services, like some retailers and clinics.\nSpell and church members said they do not believe COVID-19 is fake or that they can heal themselves, as some have reported."}, {"url": "https://www.wafb.com/2020/03/19/all-la-omv-locations-will-close-due-covid-precautions/", "title": "All La. OMV locations will close due to COVID-19 precautions", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-03-19", "keywords": ["available", "app", "locations", "drivers", "suspend", "wallet", "digital", "searching", "la", "state", "precautions", "omv", "license", "close", "covid19"], "summary": "Additionally, LA Wallet, the state of Louisiana's official digital driver's license, is now available to residents free of charge.\nThe all digital identification and driver's license app will suspend its fee in response to the COVID-19 pandemic.\nThe app is available to download on Apple and Android devices by searching LA Wallet."}, {"url": "https://www.ksla.com/2020/03/26/baton-rouge-area-pastor-defies-governor-welcomes-large-gathering-into-church-service/", "title": "Baton Rouge area pastor defies governor, welcomes large gathering into church service", "authors": ["Lester Duhé", "Published At Pm"], "date": "2020-03-26", "keywords": ["going", "fear", "rouge", "anointed", "church", "service", "pastor", "welcomes", "tonight", "governor", "believe", "virtue", "baton", "healed", "worshiping", "large", "healing", "gathering", "defies", "handkerchiefs"], "summary": "“We want to encourage other religious leaders in churches like us, do not let the fear of persecution of any government official, any dictator law, prevent you from worshiping God, which our First Amendment states you are not allowed to do in any form,” said Spell.\n“Our church is a hospital where the sick can come and get healing.\nCancers are healed here, people are healed of HIV in these services, and we believe that.\nTonight, we’re also going to pass out anointed handkerchiefs to people who may have a fear, who may have a sickness, and we believe that when those anointed handkerchiefs go, that healing virtue is going to go on them as well.\""}, {"url": "https://www.kltv.com/2020/03/22/governor-edwards-issues-stay-at-home-order-effective-march/", "title": "Louisiana’s statewide stay at home order in effect now", "authors": ["Charitee Blackmon", "Published At Pm"], "date": "2020-03-22", "keywords": ["practice", "effect", "edwards", "distancing", "gov", "leave", "social", "statewide", "louisianas", "necessary", "measures", "order", "stay", "essential"], "summary": "“In Louisiana we have taken aggressive measures to mitigate the spread of COVID-19 and flatten the curve; however, this is not enough.\nAs our number of cases continue to grow, I am directing all Louisianans to stay at home unless it is absolutely necessary for you to leave.\nIf you have to go out, make sure you practice social distancing measures and keep 6 feet between you and the people around you.\nPeople are encouraged to go outside and to stay active during this time, as long as they practice social distancing when they are around their neighbors,” Gov.\n“This order is not something I take lightly, but it is necessary to protect the health, safety and well-being of our people, our communities and our way of life.” -Gov."}, {"url": "https://www.myarklamiss.com/lifestyle/health/coronavirus/statewide-burn-ban-issued-for-louisiana/", "title": "Statewide burn ban issued for Louisiana", "authors": ["Jonathan Freeman", "Associated Press"], "date": "2020-03-24", "keywords": ["burning", "burn", "agriculture", "marshal", "state", "statewide", "issued", "department", "rs", "result", "order", "forestry", "shall", "ban", "louisiana"], "summary": "BATON ROUGE, La.\n(Press Release) — State Fire Marshal H. “Butch” Browning, in collaboration with Agriculture and Forestry Commissioner Mike Strain, have issued a statewide cease and desist order for all private burning, pursuant to authority under R.S.\nPrivate burning shall only be allowed by permission of the local fire department or local government.\nThis order is effective as of 8 a.m., March 25, 2020 and shall remain in effect until rescinded.\nViolation of this Fire Marshal order could result in criminal and/or civil penalties."}, {"url": "https://www.wafb.com/2020/03/18/gov-edwards-calls-dept-education-waive-attendance-testing-requirements-amid-covid-pandemic/", "title": "US Dept. of Education approves waiver for attendance, testing requirements amid COVID-19 pandemic", "authors": ["Rachael Thomas", "Published At Pm"], "date": "2020-03-18", "keywords": ["approves", "leaders", "dept", "waiver", "wrote", "students", "testing", "possible", "provide", "education", "attendance", "requirements", "covid19", "pandemic", "local", "continue", "amid", "help", "worrying"], "summary": "“Our actions today provide turnkey flexibilities for state and local leaders to focus on the immediate needs of their students and educators without worrying about federal repercussions,” wrote U.S. Secretary of Education Betsy DeVos in a news release preceding approval of Louisiana’s request.\n“I’ve spoken with many local education leaders in the past days, and I’m inspired by their efforts to help their students continue to learn and grow.\nWe’re going to continue to provide every flexibility possible to help make that as simple as possible.”"}, {"url": "https://710keel.com/louisiana-expert-prescribes-herd-immunity-to-fight-covid-19/", "title": "Louisiana Expert Prescribes “Herd Immunity” To Fight COVID-19", "authors": ["Greg Atoms"], "date": "2020-03-30", "keywords": ["state", "told", "immunity", "slow", "expert", "theres", "spread", "coronavirus", "herd", "virus", "residents", "prescribes", "covid19", "fight", "louisiana"], "summary": "The fight against COVID-19, or coronavirus, continues across the state of Louisiana.\nGovernor John Bel Edwards has put multiple layers of public protection, including closing schools, casinos, gyms, and movie theaters.\nWhile the state is doing everything it can to slow the spread, many pharmaceutical companies are working to find treatments and vaccines.\nOur Lady of the Lake-Baton Rouge Infectious Disease Specialist Catherine O’Neal told Louisiana Radio Network that \"herd immunity\" will be key to ending COVID-19.\nMost Louisiana residents, and US residents, will eventually get the virus."}, {"url": "https://www.businessreport.com/newsletters/virus-roundup-16", "title": "Virus roundup …", "authors": ["Daily Report Staff"], "date": "2020-03-31", "keywords": ["pandemic", "business", "local", "james", "zoom", "rouge", "yorks", "coronavirus", "virus", "roundup", "younger", "weston"], "summary": "• The NCAA will officially allow schools to provide spring-sport student athletes an additional season of competition and an extension of their period of eligibility.\n• Zoom, the videoconferencing app whose traffic has surged during the coronavirus pandemic, is under scrutiny by the office of New York’s attorney general, Letitia James, for its data privacy and security practice.\nRead more stories on how the coronavirus is impacting the Baton Rouge business community.\nSee a roundup of resources available to those impacted by the pandemic.\nClick here to see a 225 magazine list of local restaurants offering pickup or delivery."}, {"url": "https://www.wafb.com/2020/03/19/gov-edwards-all-louisiana-parishes-eligible-covid-business-aid/", "title": "Gov. Edwards: All Louisiana parishes eligible for COVID-19 business aid", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-03-19", "keywords": ["business", "workforce", "edwards", "small", "sba", "parishes", "gov", "aid", "providing", "walks", "unique", "working", "louisianas", "eligible", "work", "covid19", "louisiana"], "summary": "“COVID-19 is a unique crisis affecting all walks of life, and that means Louisiana’s small business community will continue to be heavily impacted by disruptions to their operations,” Gov.\nEdwards said.\n“We are pleased to work with SBA and the federal government in providing this critical working capital to our small business owners who are suffering from the necessary measures installed due to the Coronavirus.\nOur hope is that these SBA disaster loans will be an important part of sustaining their businesses and providing support to their employees who make up over half of Louisiana’s private-sector workforce.”"}, {"url": "https://www.businessreport.com/economy/baton-rouge-to-rely-on-reserve-federal-funds-to-cover-lost-tax-revenues", "title": "Baton Rouge to rely on reserve, federal funds to cover lost tax revenues", "authors": ["Julia Arenstam"], "date": "2020-03-23", "keywords": ["rely", "fund", "city", "rouge", "million", "sales", "federal", "general", "revenue", "reserve", "budget", "collections", "funds", "tax", "baton", "lost", "business", "cover", "revenues"], "summary": "As businesses continue to be restricted, Baton Rouge will face revenue loss on several fronts, namely from sales tax collections, which account for over 60% of general fund revenue.\nOf that, $191.9 million is directed toward the general fund, comprising about 60% of general fund revenue.\nThe city was already “conservative” in its sales tax estimates for the year and didn’t project much growth.\nThe MovEBR program, funded through a 0.5% sales tax, is also expected to survive the virus, city officials say.\nWhile the bond is paid back through sales tax collections, it’s over the entire 30-year life of the program."}, {"url": "https://www.businessreport.com/newsletters/ochsner-to-begin-in-house-testing-as-health-care-system-faces-overload", "title": "Ochsner to begin in-house testing as health care system faces overload", "authors": ["Julia Arenstam"], "date": "2020-03-20", "keywords": ["testing", "ochsner", "system", "confirmed", "begin", "faces", "cases", "health", "baton", "week", "rouge", "inhouse", "patients", "care", "overload", "dauterive"], "summary": "Ochsner Health System is moving its COVID-19 testing in-house at its New Orleans-area medical center.\nLouisiana has 479 confirmed cases of COVID-19.\nIt informs everything we do with patients and suspected patients,” Ochsner Chief Medical Officer Dr. Robert Hart said on a press call today.\nThe state could be on a trajectory similar to Italy, which now has over 41,000 confirmed cases and 3,400 deaths.\nConfirmed COVID-19 patients in Baton Rouge have been hospitalized at Ochsner, Our Lady of the Lake and Baton Rouge General."}, {"url": "https://www.katc.com/news/coronavirus/all-lottery-locations-close-until-april-13", "title": "All lottery locations close until April 13", "authors": [], "date": "2020-03-23", "keywords": ["locations", "13", "tickets", "payment", "continue", "winning", "ticket", "retailers", "prize", "lottery", "players", "close", "resume"], "summary": "Beginning today at 5 p.m. until April 13, the Lottery will close its Baton Rouge headquarters, regional prize payment offices and distribution center to both employees and the public in order to comply with the Governor's stay-at-home mandate.\nFor all other prize levels, players can visit www.louisianalottery.com/claim for information on ways they may claim in the interim.\nWhile winning tickets can be claimed by mail, the Lottery reminds players that by law, an original ticket is required for prize payment, and therefore there is no recourse for tickets lost in transit.\nAlso, Lottery ticket sales will continue at any retailer that is willing and able to do so.\nThe Lottery will continue to monitor state and federal officials for new information on how to proceed and will be communicating our plans to resume reopening as the situation changes."}, {"url": "https://patch.com/us/across-america/blind-faith-meets-coronavirus-science-potentially-deadly-crash", "title": "Blind Faith Meets Coronavirus Science In Potentially Deadly Clash", "authors": [], "date": "2020-03-26", "keywords": ["faith", "public", "blind", "potentially", "health", "churches", "week", "meets", "coronavirus", "deadly", "church", "clash", "science", "spell", "worshippers", "worship", "services"], "summary": "Church services in the age of the new coronavirus, though, can also kill people.\nCitizens: Prosecute The PastorCountries already past the peak of coronavirus cases know the danger of public worship services that are allowed to continue unfettered.\nBurke lives in Italy, which has the world's second-highest coronavirus infection rate behind China and the highest coronavirus death toll so far.\nThe Church of Jesus Christ of Latter-day Saints suspended worship services around the world to slow the spread of the coronavirus.\nMeanwhile, though, some pastors are still dismissing science and health experts, and embracing faith and each other."}, {"url": "https://www.theguardian.com/world/2020/mar/29/church-goers-around-the-world-ignore-social-distance-advice", "title": "Churchgoers all over world come to terms with physical distancing advice", "authors": ["Andrew Roth", "Shaun Walker", "Dom Phillips"], "date": "2020-03-29", "keywords": ["physical", "prayer", "called", "distancing", "st", "advice", "churches", "open", "terms", "come", "world", "orthodox", "online", "church", "churchgoers", "worshippers", "services"], "summary": "Millions of people across the world tuned into online church services on Sunday as their usual places of worship were closed, but in some places clerics insisted on their doors remaining open.\nIn virus-hit Louisiana, hundreds of worshippers attended services on Sunday, flouting a ban on large gatherings.\nHowever, he has since urged faithful to use media broadcasts of services to prayer, especially over the Easter period.\nAnd while some churches are still open for prayer, mass and services have mostly moved online.\nRio’s Attitude Baptist church – frequented by Brazil’s first lady, Michelle Bolsonaro – is only holding online services."}, {"url": "https://www.klfy.com/louisiana/no-emergency-snap-benefits-available-at-this-time-those-in-need-asked-to-apply-online/", "title": "No emergency SNAP benefits available at this time, those in need asked to apply online", "authors": [], "date": "2020-03-24", "keywords": ["available", "apply", "text", "recipient", "asked", "need", "spaces", "option", "onlineyou", "online", "rouge", "snap", "wwwdcfslagovgetsnap", "benefits", "emergency"], "summary": "BATON ROUGE, La.\nAt this time, there is no option for emergency/disaster SNAP benefits; however, if you are not already a SNAP recipient and have a food need, you are encouraged to apply for benefits online.\nYou can apply online at www.dcfs.la.gov/getSNAP, by mail/fax or text GETSNAP (no spaces) to 898211.\nYou may also email LAHelpU.DCFS@la.gov or call 1-888-LA-HELP-U (1-888-524-3578) Monday through Friday, 7:30 a.m. to 6 p.m."}, {"url": "https://www.spokesman.com/stories/2020/mar/25/washington-state-redshirt-senior-defensive-back-br/", "title": "Washington State redshirt senior defensive back Bryce Beekman dies at 22", "authors": [], "date": "2020-03-25", "keywords": ["defensive", "safety", "spring", "dies", "state", "redshirt", "22", "washington", "team", "pullman", "senior", "bryce", "beekmans", "beekman", "wsu"], "summary": "PULLMAN – Bryce Beekman, a redshirt senior defensive back on Washington State’s football team, died Tuesday in Pullman, Pullman Police Commander Jake Opgenorth confirmed to The Spokesman-Review.\nReece Beekman, a high school senior at Scotlandville Magnet High – the school Bryce also attended – won Outstanding Player honors in the Division I title game.\n“Heartfelt thoughts and prayers go out to the Beekman Family and the Washington State University community,” Leach tweeted.\n“RIP boy,” former WSU safety Jalen Thompson wrote.\nThere’s been multiple times where he wouldn’t leave me alone until I smiled.”Teammates, coaches, friends react to death of Washington State safety Bryce Beekman Countless current and former teammates, coaches, friends and others shared their condolences on social media after it was learned rising redshirt senior safety Bryce Beekman died Tuesday night at the age of 22."}, {"url": "https://www.fox8live.com/2020/03/09/louisiana-lawmakers-return-baton-rouge-new-legislative-session/", "title": "Louisiana lawmakers return to Baton Rouge for new legislative session", "authors": ["Katherine Mozzone", "Published At Pm", "Published At Am"], "date": "2020-03-09", "keywords": ["sherman", "loss", "trying", "way", "bill", "pass", "rouge", "lawmakers", "legislative", "session", "win", "baton", "legislation", "return", "louisiana"], "summary": "“The goal in the legislative session is not always to pass legislation, sometimes it’s to bring attention to an issue.\nThe way you do that is by filing a bill then trying to get a hearing for that bill.\nThat can be a win even if it’s a loss for the bill,” Sherman said."}, {"url": "https://www.wafb.com/2019/12/10/trisha-yearwood-perform-with-baton-rouge-symphony-march/", "title": "Trisha Yearwood to perform with Baton Rouge Symphony this weekend", "authors": ["Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-12-10", "keywords": ["weekend", "2020", "river", "symphony", "raising", "w", "performer", "pennington", "rouge", "baton", "trisha", "timothy", "perform", "yearwood"], "summary": "Yearwood will appear as the 2020 Irene W. and C. B. Pennington Foundation Great Performer in Concert with the Baton Rouge Symphony under the direction of Timothy Muffitt on Saturday, March 7, 2020 at 8 p.m. at the Raising Cane’s River Center Arena."}, {"url": "https://www.businessreport.com/article/five-bills-introduced-aimed-at-shaping-louisiana-redistricting", "title": "Five bills introduced aimed at shaping Louisiana redistricting", "authors": ["Julia Arenstam"], "date": "2020-03-10", "keywords": ["bills", "aimed", "house", "state", "shaping", "introduced", "bill", "voter", "process", "package", "public", "redistricting", "louisiana"], "summary": "The 2020 census surveys haven’t quite made it to Louisiana yet, but five bills introduced in the state Legislature aim to shape Louisiana’s redistricting policies.\nThe “2020 Election Integrity Package,” put up by various state representatives, is backed by nonprofits Fair Districts Louisiana and the Power Coalition for Equity and Justice.\nIvey is the only Republican sponsoring a bill in the package and is the sole author of a bill that would create a public redistricting website.\n“I am excited to bring HB 565 that will provide a portal where the people of Louisiana can engage and stay informed throughout the redistricting process.\nThe actual redistricting process won’t begin until 2021, but because of Democratic Gov."}, {"url": "https://www.businessreport.com/events/register-now-for-the-baton-rouge-2020-best-places-to-work", "title": "Register now for the Baton Rouge 2020 Best Places to Work", "authors": ["Special Promotions"], "date": "2020-02-10", "keywords": ["business", "2020", "companies", "report", "reports", "baton", "places", "rouge", "best", "employees", "work", "company", "register"], "summary": "Find out by registering for Business Report’s 2019 Best Places to Work.\nIndependent firm Best Companies Group determines the selection and ranking for Business Report’s Best Places to Work.\nBusiness Report will recognize the 2020 Best Places to Work in a special issue in September.\nBest Places to Work in Baton Rouge is presented by Business Report, the Greater Baton Rouge Society for Human Resource Management and Best Companies Group.\nSee a timeline for the Best Places to Work program, register your company for inclusion and get complete details about other 2020 Business Report events."}, {"url": "https://www.wafb.com/2020/03/13/authorities-investigating-three-overnight-arson-fires-baton-rouge/", "title": "Authorities investigating three overnight arsons in Baton Rouge", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-03-13", "keywords": ["authorities", "minutes", "arsons", "took", "florida", "worth", "spokesperson", "overnight", "rouge", "notified", "investigating", "monte", "baton", "school", "firefighters", "incident"], "summary": "Firefighters were notified of the first fire at the Ace Driving School at 9:24 p.m. at 1160 Florida Blvd.\nCurt Monte, a fire department spokesperson said it took crews 14 minutes to get the fire under control.\nMonte said the fire caused $125,000 in damages to the building, which was worth $700,000 before the incident."}, {"url": "https://www.wafb.com/2020/03/02/funeral-services-announced-baton-rouge-blues-legend-henry-gray/", "title": "Funeral services announced for Baton Rouge blues legend Henry Gray", "authors": ["Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-03-02", "keywords": ["rouge", "blues", "flies", "services", "louisianans", "nostrils", "henry", "gray", "announced", "try", "funeral", "legend", "baton", "leave", "targets", "longlasting", "known", "lesions", "skin"], "summary": "Louisianans are dodging the bite of black flies known to try to crawl into their target’s ears, nostrils, or eyes, and leave long-lasting lesions on the skin."}, {"url": "https://www.wafb.com/2020/03/09/baton-rouge-duo-wont-let-sxsw-cancelation-stop-their-tour/", "title": "Baton Rouge duo won’t let SXSW cancelation stop their tour", "authors": ["Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2020-03-09", "keywords": ["hundreds", "thousands", "event", "tour", "sxsw", "expected", "baton", "week", "facebook", "wont", "rouge", "let", "fest", "dropped", "stop", "cancelation", "duo", "sponsors"], "summary": "On Friday, March 6, one week before the 10-day event that was expected to draw hundreds of thousands of people, the City of Austin canceled SXSW due to concerns over coronavirus.\nSeveral sponsors like Facebook and Apple dropped out of the fest days before the announcement was made."}, {"url": "https://www.businessreport.com/business/restaurants-take-a-hit-over-st-patricks-day-weekend", "title": "Baton Rouge restaurants take a hit over St. Patrick’s Day weekend", "authors": ["Stephanie Riegel"], "date": "2020-03-16", "keywords": ["restaurants", "weekend", "business", "owns", "local", "st", "patricks", "worse", "hit", "day", "road", "perkins", "rouge", "overpass", "baton", "watts"], "summary": "Though the annual Wearin’ of the Green parade, scheduled for Saturday, was indefinitely postponed, several bars in the Perkins Road Overpass area attracted large, raucous crowds of revelers from Friday afternoon through late Saturday.\nLocal restaurants, however, didn’t benefit from the boom.\nRestaurateur Brad Watts, who owns K Street Grill under the Perkins Road Overpass and Cecilia and the River Room downtown, estimates weekend business for area restaurants was down 30% to 60%.\nWatts, a board member of the Louisiana Restaurant Association’s Baton Rouge chapter, checked in with a sample of local restaurants Saturday night, in addition to his own.\nFriday night and Saturday, the four remaining restaurants in his group saw business fall off an estimated 30% to 40%."}, {"url": "https://www.katc.com/news/covering-louisiana/baton-rouge-blues-festival-releases-2020-lineup", "title": "Baton Rouge Blues Festival releases 2020 lineup", "authors": [], "date": "2020-03-04", "keywords": ["available", "2020", "commemorative", "festival", "rouge", "blues", "releases", "zonatareese", "baton", "zitonikki", "lineup", "wellfind"], "summary": "The Baton Rouge Blues Festival has released its lineup for the 2020 festival, which will be held on Saturday, April 18, and Sunday, April 19 in and round Repentance Park and Galvez Plaza.\nOn both days, the hours are 12 p.m. to 10 p.m.\nThe free festival will feature internationally known and local performers alike, including:Kingfish IngramSonny LandrethKenny NealEric GalesAmythyst KiahAlabama SlimDELGRESThe Peterson BrothersSandra HallMike ZitoNikki HillLittle Freddie KingOscar \"Harpo\" DavisWarren StormDege LeggApril JacksonMichael Juan NunezChicago AlDarcy MaloneElvin KillerbeeJosh GarrettBlue Monday All-Stars \"Lil Buck Tribute\" showDeandre TateArthur Gremillion & FriendsHenry Turner, JuniorZion HarmonizersAndrew HillRobbie BarringerPam GrishamJanue AycockLance PorterLeah OrthRalph GoodsonAlex CookSebastien PlanteChris ZonataReese SullivanLilli Lewis ProjectThe Baton Rouge Blues Foundation will release a commemorative pin that will be available for a $10 donation.\nThe 2020 commemorative poster, designed by Baton Rouge-based artist Krist Norsworthy, will be available for purchase at the festival as well.\nFind more information at the festival's website here or at the Facebook page here."}, {"url": "https://www.businessreport.com/article/the-2020-baton-rouge-business-awards-and-hall-of-fame", "title": "The 2020 Baton Rouge Business Awards and Hall of Fame", "authors": ["Daily Report Staff"], "date": "2020-03-04", "keywords": ["hall", "business", "2020", "report", "honorees", "scott", "awards", "rouge", "community", "region", "junior", "baton", "fame"], "summary": "The 2020 Baton Rouge Business Awards and Hall of Fame class includes the ultimate leaders Charlie D’Agostino and Peggy Scott, whose decades of service in the Baton Rouge community leave lasting impacts.\nJoining D’Agostino and Scott in this year’s class is John D’Angelo, of Investar Bank, who is the 2020 Businessperson of the Year.\nAlong with telling their stories and spotlighting their accomplishments in the new Business Report cover package, this year’s honorees will be celebrated at an event on March 24, presented in conjunction Junior Achievement.\nThe Business Awards were launched in 1984 to pay tribute to remarkable individuals and companies in the Capital Region and celebrate their many accomplishments.\nIn 1993, Business Report partnered with Junior Achievement to present the awards and added a Hall of Fame category to recognize those with a lifetime of achievement."}, {"url": "https://www.theadvertiser.com/story/sports/college/lsu/2020/03/08/2020-sec-tournament-how-watch-lsu-basketball/4986398002/", "title": "2020 SEC Tournament: LSU basketball quarterfinal game canceled due to coronavirus concern", "authors": ["Chastity Laskey", "Published P.M. Ct March"], "date": "2020-03-08", "keywords": ["canceled", "mens", "usa", "quarterfinal", "sec", "2020", "game", "concern", "basketball", "today", "watch", "stephen", "tigers", "coronavirus", "lsu", "tournament"], "summary": "CLOSEThe LSU Tigers men's basketball team was scheduled to play again in the quarterfinals of the 2020 Southeastern Conference Tournament on Friday, March 13 in Nashville, Tennessee.\nThe game was scheduled to start at 8 p.m. CT.On Thursday morning, the SEC canceled the remainder of the 2020 SEC Men's Basketball Tournament.\nThe Tigers lost 80-63 to the Michigan State men's basketball team and did not advance to the Elite Eight.\nGet updates on the LSU Tigers with The Daily Advertiser's app.\nMore LSU BasketballWill Wade is the LSU men's basketball head coach."}, {"url": "https://www.dailymail.co.uk/news/article-8126379/Defiant-Ohio-bar-owners-ignore-governors-order-close-insist-theyll-stay-open-make-living.html", "title": "Defiant Ohio bar owners ignore governors' order to close and insist they'll stay open to make living", "authors": ["Leah Simpson", "Leah Simpson For Dailymail.Com"], "date": "2020-03-18", "keywords": ["restaurants", "state", "shut", "open", "governors", "takeout", "insist", "owners", "closed", "schools", "living", "order", "public", "ohio", "theyll", "ignore", "bars", "ordered", "stay"], "summary": "Tim Walz ordered bars and restaurants across Minnesota to temporarily close to customers who dine in.\nAll restaurant dining areas and gyms in the state shut March 20 with immediate effect.\nThe guidelines also call for not eating or drinking in bars, restaurants and food courts, but to use drive-thru or pickup options.\nKim Reynolds ordered restaurants, bars, fitness centers, theaters and casinos to close for two weeks.\nThe governor signed a state of emergency order last week, requesting public schools to close and ordering non-essential state employees to work from home."}, {"url": "https://www.businessreport.com/article/baton-rouge-louisiana-land-on-governors-cup-top-10-lists", "title": "Baton Rouge and Louisiana land on Governor’s Cup top 10 lists", "authors": ["Caitie Burkes"], "date": "2020-03-02", "keywords": ["cup", "lists", "project", "rouge", "governors", "ranked", "million", "expansion", "2019", "baton", "land", "wins", "louisiana"], "summary": "Baton Rouge and Louisiana have both been honored for strong economic development project performances in 2019, according to the most recent Governor’s Cup rankings published annually by Site Selection magazine.\nThe Governor’s Cup measures the quantity of significant business development projects for the calendar year.\nDespite not making the list in 2018, Baton Rouge ranked second in 2019 among mid-sized metros of 200,000 to 1 million people, topped only by Dayton, Ohio.\nAdditionally, both Baton Rouge (No.\nJohn Bel Edwards says the state’s 2019 project wins will create 12,300 new jobs in Louisiana."}, {"url": "https://www.katc.com/news/covering-louisiana/louisiana-sec-of-state-to-address-impacts-of-covid-19-on-upcoming-election", "title": "Louisiana Sec. of State announces postponement of Spring 2020 elections", "authors": [], "date": "2020-03-13", "keywords": ["secretary", "voting", "sec", "2020", "spring", "state", "primary", "postponement", "health", "presidential", "serious", "elections", "election", "postponing", "announces", "louisiana"], "summary": "Secretary of State Kyle Ardoin held a press conference on Friday, March 13 to discuss the impacts of COVID-19 on upcoming Louisiana elections.\nThe April 4 Presidential Preference Primary and Municipal Primary election will be held on June 20.\nJohn Bel Edwards signed an executive order postponing Louisiana's upcoming elections including the presidential primary in response to COVID-19, commonly called the coronavirus.\nThe request would postpone the April 4, 2020 Presidential Primary Election to June 20, 2020 and the May 9, 2020 General Election to July 25, 2020.\nLouisiana is the first state to postpone their elections because of the coronavirus."}, {"url": "https://www.avma.org/javma-news/2020-05-01/obituaries", "title": "Obituaries", "authors": [], "date": "2020-05-01", "keywords": ["member", "small", "state", "animal", "died", "veterinary", "2019", "medicine", "obituaries", "university", "dr"], "summary": "Prior to retirement, he was in small animal practice for several years and worked for the U.S. Department of Agriculture.\nA small animal veterinarian, he owned Camp McDonald Animal Clinic in Mount Prospect, Illinois, for 33 years.\nHe practiced small animal medicine in Indiana and Florida for 52 years.\nA past president of the Florida VMA, he served on the Florida Board of Veterinary Medicine for several years.\nA small animal veterinarian, he owned Valley Animal Hospital in Cedar Bluff and Grundy Animal Hospital in Grundy, Virginia."}, {"url": "https://www.houmatoday.com/news/20200322/coronavirus-is-already-dealing-louisiana-economic-blow", "title": "Coronavirus is already dealing Louisiana an economic blow", "authors": ["Kristen Mosbrucker", "The Advocate", "Baton Rouge"], "date": "2020-03-22", "keywords": ["dealing", "jobs", "oil", "state", "businesses", "economic", "unemployment", "week", "coronavirus", "lafayette", "blow", "louisiana"], "summary": "\"This is one of the worst (economic forecasts) I’ve seen for Louisiana, where cases of coronavirus are spiking,\" Scott said.\nIn East Baton Rouge Parish, about 8,000 businesses employing 143,700 workers were impacted by the flooding, according to the Louisiana Economic Development department.\nIn Louisiana, the Louisiana Workforce Commission, though having website issues, has sped up its claims process and temporarily waived job search requirements.\nEnergy companies and related businesses comprised 29.4% of the more diversified Lafayette-area gross domestic product as of October 2019, according to the Lafayette Economic Development Authority’s analysis of federal data.\n\"All these changes will work their way through the Louisiana economy,\" Richardson said of the rock bottom oil price and impact from the coronavirus."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["usa", "stadium", "falcons", "2020", "defensive", "linebacker", "mandatory", "moreround", "today", "options", "2019", "draft", "nov", "round", "credit"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "won", "virtually", "upfield", "participate", "team", "touches", "packers", "wants", "invites", "nfl", "draft", "super", "tons"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Ohio State running back J.K. Dobbins:What he can do– Built low to the ground at 5-9.\nCompact frame, with big, powerful legs– Tons of experience as a one-cut runner.\nWants to get upfield with initial patience following by burst–..."}, {"url": "https://www.dallasnews.com/sports/texas-longhorns/2020/04/14/texas-mock-draft-roundup-see-where-devin-duvernay-brandon-jones-and-others-are-projected-to-go-in-the-nfl-draft/", "title": "Texas mock draft roundup: See where four Longhorns are projected to go in the NFL draft", "authors": ["Alex Briseno", "Joseph Hoyt", "Catherine Marfin", "John Hancock", "Reese Oxner", "Jim Rossman"], "date": "2020-04-14", "keywords": ["johnson", "tackles", "projected", "jones", "texas", "overall", "longhorns", "longhorn", "mock", "2019", "fifth", "draft", "nfl", "roundup", "senior", "round"], "summary": "3-ranked recruiting classes in 2018 and 2019, but time will tell if Texas has fixed its struggles revolving around developing NFL talent.\nThe first Longhorn wasn’t taken until the Houston Texans selected Charles Omenihu in the fifth round with the 161st overall pick.\nOther mock drafts have Jones going anywhere between the third and fifth round, so it is tough to pinpoint exactly where he will be taken.\nWhile Duvernay’s college career took a while to take off, his senior year alone has him going anywhere between the third and fifth round.\nThe Athletic (Dane Brugler): Round 7, 217th overall by San FranciscoFind more Texas stories from The Dallas Morning News here."}, {"url": "https://www.225batonrouge.com/things-to-do/october-2019-calendar-events", "title": "October 2019 Calendar of Events", "authors": [], "date": "2019-09-27", "keywords": ["market", "theatre", "hosts", "event", "events", "music", "calendar", "2019", "rouge", "band", "art", "zoo", "baton"], "summary": "stgeorgefair.comOct. 19• The Baton Rouge Mini Maker Faire returns, highlighting creative projects from tech, arts and crafts makers.\n1031consortium.comOct. 19, 20 + 26-27The Baton Rouge Zoo hosts its yearly Boo at the Zoo event for “merry, not scary” Halloween fun.\nbrzoo.orgOct. 24Laura Siu Planning & Events hosts Table•Story, a culinary event series highlighting dishes from countries around the world.\ncytbatonrouge.orgOct. 20Contemporary ballet company BalletX travels from Philadelphia for two performances at Manship Theatre presented by Baton Rouge Ballet.\nbatonrougeballet.orgOct. 24The Baton Rouge Symphony Orchestra cycles through five fall-themed pieces with “Bachtoberfest” at the Capitol Park Museum."}, {"url": "https://www.225batonrouge.com/things-to-do/december-2019-calendar-events", "title": "December 2019 Calendar of Events", "authors": [], "date": "2019-11-26", "keywords": ["stick", "event", "party", "events", "red", "calendar", "2019", "art", "band", "rouge", "lsu", "brings", "sound"], "summary": "Click here for our roundup of more than 20 local holiday events, shows, cocktail parties and endless shopping.\nservingsushi.comRed Stick droppingHead to Red Stick Revelry for live music and a laser light show.\nThe event begins during the day with Red Stick Rising at North Boulevard Town Square.\nAs midnight strikes, the light show will be accompanied by the ceremonial dropping of the Red Stick and a fireworks display.\nthetexasclub.comDec. 14Little Freddie King is a New Orlean blues guitarist bringing his country-inflected sound to the Red Stick at Dyson House."}, {"url": "https://www.insurancejournal.com/news/southcentral/2019/12/24/552874.htm", "title": "Louisiana Adds More Jobs Year-Over-Year; Baton Rouge, Hammond MSAs Set Records", "authors": [], "date": "2019-12-24", "keywords": ["records", "rouge", "increased", "employment", "seasonally", "gained", "louisiana", "sector", "2018", "yearoveryear", "adds", "nonfarm", "jobs", "2019", "baton", "msas", "set", "adjusted", "hammond"], "summary": "Seasonally adjusted nonfarm employment increased by 9,000 jobs from 1,984,400 in November 2018 to 1,993,400 jobs in November 2019.\nSeasonally adjusted nonfarm employment has added jobs over the year the past four months.\nSeasonally adjusted nonfarm employment is at its highest level since November 2015.\nFrom October 2019, seasonally adjusted nonfarm employment increased by 4,100 jobs.\nSeasonally adjusted private sector employment increased by 10,900 jobs from 1,656,900 in November 2018 to 1,667,800 jobs in November 2019."}, {"url": "https://www.wafb.com/2019/12/25/crime-baton-rouge-area/", "title": "Crime in the Baton Rouge area in 2019", "authors": ["Rachael Thomas"], "date": "2019-12-25", "keywords": ["wreck", "forward", "crime", "officer", "mother", "decided", "rouge", "2019", "wont", "area", "action", "baton", "death"], "summary": "Both the mother of a 1-year-old girl and a Baton Rouge police officer will not face charges after the woman’s baby was killed in a wreck back in 2017.\nThe officer, Christopher Manuel, and the child’s mother, Brittany Stephens, were both initially arrested and charged with negligent homicide after it was determined the officer was speeding at the time of the wreck and the mother had not properly restrained her child inside the vehicle.\nIn November of 2019, prosecutors decided to take no action in the case, meaning the office won’t move forward against either party.\nThe East Baton Rouge district attorney said it became a real conundrum of who was truly responsible for the girl’s death.\nSince they could not definitively prove which action really caused the baby’s death, they decided to not move forward again either the officer or the mother."}, {"url": "https://www.225batonrouge.com/our-city/225s-guide-louisianas-2019-elections", "title": "225’s guide to Louisiana’s 2019 elections", "authors": [], "date": "2019-09-30", "keywords": ["voting", "governor", "information", "including", "guide", "candidates", "vote", "open", "elections", "2019", "election", "louisianas", "polling", "225s", "polls"], "summary": "Below, you can find information on election dates and where to find up-to-date information on your polling place and your ballot.\nThere are also several district and parish-level offices up for a vote, including East Baton Rouge Parish sheriff, clerk of court, assessor and coroner.\nFind detailed information, including your voter status and polling location, at sos.la.gov.\nNOV. 15: Absentee voting deadlineNOV. 16: General election (including runoff elections).\nPolls are open 6 a.m.-8 p.m.Everything you need before votingGo here to find your polling location and other voting information."}, {"url": "https://fanbuzz.com/high-school/bryan-allen-jr-recruiting/", "title": "LSU Lands Commitment From Nation’s No. 2 Safety", "authors": ["Patrick Pinak", "Brett Regan", "John Duffley", "Patrick", "About The Author", "The League", "Patrick Has Spent Parts Of The Last Four Years Covering University Of Florida Athletics", "Spent Two Seasons With Major League Baseball. He'S A Baseball Junkie Who Spends His Days Defending Derek Jeter", "The Miami Marlins. A Recent Gator Grad", "Patrick Currently Resides In Gainesville"], "date": "2020-04-09", "keywords": ["allen", "university", "safety", "defensive", "nations", "state", "texas", "aledo", "commitment", "jr", "bryan", "lands", "lsu"], "summary": "S Bryan Allen Jr.\nCommits to LSUBREAKING: The #2 Safety in the Nation, Bryan Allen Jr. has Just Committed to #LSU !\nLSU #GeauxTigers pic.twitter.com/BqZ4Idbiy1 — Bryan Allen jr (@BJThaKid04) April 9, 2020RELATED: Nation’s No.\n1 QB Announces Final 5 SchoolsFour-star safety Bryan Allen Jr. committed to LSU in April 2020, adding more firepower to LSU’s future recruiting classes.\nBryan Allen Jr."}, {"url": "https://www.wafb.com/2019/10/24/greater-baton-rouge-state-fair-starts-thursday-runs-through-nov/", "title": "Greater Baton Rouge State Fair to reopen Friday", "authors": ["Rachael Thomas", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-10-24", "keywords": ["yates", "rusty", "fair", "state", "travis", "studio", "greater", "day", "week", "rouge", "schedule", "band", "white", "baton", "reopen", "russell"], "summary": "There will be performances every day of the week.\nOn opening day, attendees can hear from Travis Matte & the Kingpins.\nOther performers include Old Dawgs, Studio 4 Band, Ivory White, Russell McLain, the Rusty Yates Band, Burnhouse, and MJ & the Redeemers.\nClick here for a full music schedule."}, {"url": "https://www.225batonrouge.com/food-drink/best-225-week-louisiana-book-festival-farmers-market-anniversary-baton-rouge-weekend", "title": "Best of 225 This Week: Louisiana Book Festival; farmers market anniversary and more in Baton Rouge this weekend", "authors": [], "date": "2019-10-31", "keywords": ["market", "weekend", "farmers", "theatre", "park", "class", "festival", "book", "baton", "week", "rouge", "cake", "live", "craft", "nov", "best", "louisiana"], "summary": "Classes are $25 and run 6-9 p.m. Party Time Baton Rouge is at 3350 Bluebonnet Blvd.\nThis Saturday, Nov. 2, is the Louisiana Book Festival 2019, 9 a.m.-4 p.m. in downtown Baton Rouge.\nOn Sunday, additional events will be held noon-6 p.m., with Baton Rouge Concert Band and Carbon Copy Band performing.\nSee a murderous musical at Theatre Baton Rouge this weekendA Gentleman’s Guide to Love and Murder will begin its run at the Theatre Baton Rouge starting Friday, Nov. 1.\nTheatre Baton Rouge is at 7155 Florida Blvd."}, {"url": "https://www.wafb.com/2019/10/07/baton-rouge-veterans-parade-mayor-releases-festival-details/", "title": "Baton Rouge Veteran’s Parade 2019: Mayor releases festival details", "authors": ["Published At Pm"], "date": "2019-10-07", "keywords": ["sponsored", "service", "festival", "veterans", "uss", "parade", "selflessness", "mayor", "starting", "run", "rouge", "releases", "2019", "sacrifices", "road", "baton", "details"], "summary": "The parade, sponsored by the Mayor-President’s Advisory Council on Veteran’s Affairs, will run down River Road starting in front of the Pentagon Barracks and ending at the USS Kidd.\nThe parade will honor the service, sacrifices and selflessness of our veterans."}, {"url": "https://www.wafb.com/2019/09/16/october-proclaimed-indigenous-peoples-day-louisiana/", "title": "October 14 proclaimed to be Indigenous Peoples’ Day in Louisiana", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-09-16", "keywords": ["history", "rich", "unnoticed", "state", "proclaimed", "day", "proclamation", "recognize", "indigenous", "lot", "peoples", "14", "recognition", "helps", "recognized", "louisiana"], "summary": "“It helps recognize us.\nWe come from a very rich culture in our country and state, but we sometimes go unnoticed.\nWe go unnoticed a lot.\nThis proclamation brings a conversation, awareness, and recognition.\n“We’re not just in the history books.”"}, {"url": "https://www.businessreport.com/article/louisianas-jobless-rate-fifth-highest-in-nation", "title": "Louisiana’s jobless rate fifth highest in nation", "authors": ["Julia Arenstam"], "date": "2020-01-24", "keywords": ["roughly", "dc", "labor", "rose", "states", "unemployment", "washington", "highest", "rate", "louisianas", "fifth", "jobless", "reported", "nation"], "summary": "Louisiana’s seasonally adjusted unemployment rate for December 2019 rose to 4.9%, ranking it fifth highest among all states and Washington, D.C., according to the latest numbers from the Bureau of Labor Statistics.\nAlaska had the highest unemployment at 6.1%, followed by Mississippi (5.7), Washington, D.C., (5.3%), and West Virginia (5%).\nThe national unemployment rate was 3.5%.\nThe lowest unemployment rate was reported in South Carolina, Utah and Vermont, all at 2.3%.\nLouisiana’s December rate rose from 4.7% the month before, and 4.5% in October 2019—but was consistent with the 4.9% rate reported in December 2018."}, {"url": "https://www.wafb.com/2019/12/30/top-business-headlines-red-stick/", "title": "Top 2019 business headlines in the Red Stick", "authors": ["Danae Leake", "Published At Pm"], "date": "2019-12-30", "keywords": ["hargrave", "stick", "business", "showing", "video", "trickortreaters", "red", "candy", "2019", "halloween", "sign", "walkons", "thats", "headlines", "left"], "summary": "A franchise holder of a Walk-On’s in Covington had been fired after posting a racially-charged rant on Facebook about some Halloween trick-or-treaters.\nHargrave posted a video from his doorbell camera showing what appears to be several African American children helping themselves to handfuls of Halloween candy Hargrave left on his front porch.\nThat’s despite the fact Hargrave says he left a sign near the candy instructing each child to take just one piece of candy."}, {"url": "https://www.wafb.com/2019/10/13/election-results-east-baton-rouge-parish-races/", "title": "2019 ELECTION RESULTS: East Baton Rouge Parish races", "authors": ["Published April", "At Pm"], "date": "2019-10-13", "keywords": ["task", "running", "kennedy", "parish", "serve", "tapped", "president", "sens", "rouge", "election", "races", "results", "2019", "trump", "baton", "lawmakers", "east", "md"], "summary": "President Donald Trump has tapped Sens.\nBill Cassidy, MD, and John Kennedy to serve on his task force of lawmakers focused on getting the country’s economy back up and running."}, {"url": "https://www.wafb.com/2019/12/31/year-in-review-news-sports-crime-business-baton-rouge-area/", "title": "Year-in-review: News, sports, crime, business in the Baton Rouge area", "authors": ["Published At Pm"], "date": "2019-12-31", "keywords": ["business", "bring", "crime", "wafb", "la", "viewing", "rouge", "yearinreview", "2019", "area", "baton", "close", "share"], "summary": "BATON ROUGE, La.\n(WAFB) - As we bring 2019 to a close, WAFB would like to share the top stories in our viewing area of the last year."}, {"url": "https://www.225batonrouge.com/things-to-do/august-2019-calendar-events", "title": "August 2019 Calendar of Events", "authors": [], "date": "2019-07-26", "keywords": ["orleans", "festival", "events", "presents", "annual", "music", "calendar", "rouge", "2019", "band", "lsu", "baton", "louisiana"], "summary": "Find it on Facebook• Join the LSU recreation center for Bike the Capitol, an all-day bike ride around Baton Rouge.\nThe annual Baton Rouge Best Dressed Ball returns to the Raising Cane’s River Center, honoring the city’s most stylish leaders.\nknockknockmuseum.org/knockstockAug. 23Ready your tastebuds for the Baton Rouge Epicurean Society’s annual Fête Rouge Food and Wine Fête at L’Auberge Casino & Hotel.\nbatonrougegallery.orgAug. 16-25Theatre Baton Rouge presents Andrew Lippa’s The Wild Party, the roaring ’20s musical based on the Joseph Moncure March poem of the same name.\nlasm.orgAug. 30Baton Rouge Gallery’s Movies & Music on the Lawn series continues with Kids Night, featuring the 1915 film Alice in Wonderland set to music performed by Baton Rouge Music Studios students."}, {"url": "https://www.wafb.com/2019/10/10/jambalaya-jam-kicks-off-busy-baton-rouge-weekend/", "title": "Buckle up for a busy weekend in Baton Rouge", "authors": ["Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-10-10", "keywords": ["weekend", "buckle", "leave", "baton", "try", "rouge", "targets", "nostrils", "louisianans", "longlasting", "flies", "busy", "known", "lesions", "skin"], "summary": "Louisianans are dodging the bite of black flies known to try to crawl into their target’s ears, nostrils, or eyes, and leave long-lasting lesions on the skin."}, {"url": "https://www.225batonrouge.com/our-city/louisiana-native-lauren-daigle-returns-baton-rouge-world-tour", "title": "Louisiana native Lauren Daigle returns to Baton Rouge for her world tour", "authors": [], "date": "2019-09-30", "keywords": ["daigle", "albums", "returns", "tour", "river", "center", "record", "rouge", "world", "baton", "lauren", "album", "taking", "native", "louisiana"], "summary": "During that time of isolation, Daigle learned how to sing, taking voice lessons as a remedy to chronic fatigue and depression.\nDaigle moved to Baton Rouge and attended LSU before leaving to follow her musical aspirations in Nashville.\nDaigle will head off to Europe again in November for dates in Spain, France and the United Kingdom.\nBut not before stopping in Baton Rouge at the Raising Cane’s River Center this month for what is sure to be a packed homecoming performance.\nSee the showLauren Daigle returns to Baton Rouge Oct. 11, 7 p.m., for the Look Up Child tour at Raising Cane’s River Center."}, {"url": "https://www.wafb.com/2019/10/13/election-results-which-amendments-passed-failed-louisianas-primary-election/", "title": "2019 ELECTION RESULTS: Which amendments passed, failed in Louisiana’s primary election", "authors": ["Published April", "At Pm"], "date": "2019-10-13", "keywords": ["laboratory", "school", "southern", "money", "educational", "primary", "fund", "passed", "amendments", "election", "failed", "louisianas", "results", "2019", "university", "public", "television", "louisiana"], "summary": "Louisiana voters approved funding for Louisiana Educational Television Authority, Thrive Academy, University Laboratory School, and Southern University Laboratory School.\nLouisiana Educational Television Authority is a public television entity that produces educational and culturally relevant programming through Louisiana Public Broadcasting.\nSouthern Lab and University Lab are both operated by Baton Rouge-based public universities.\nThe funding referenced in this amendment comes from the Education Excellence Fund and larger Millennial Fund which also provides money to the Taylor Opportunity Program (TOPS).\nThe fund was set up years ago using money collected from settlements related to lawsuits with tobacco companies."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisiana-2019-elections-results-recap/289-8796aa35-3989-43e8-975a-6dc2c3dd1c2f", "title": "Louisiana 2019 Elections Results recap", "authors": ["Author", "Melinda Deslatte", "Associated Press", "Published", "Pm Cdt October", "Updated"], "date": "2019-10-13", "keywords": ["orleans", "reelected", "edwards", "state", "term", "recap", "elections", "2019", "election", "tax", "results", "race", "face", "louisiana"], "summary": "Runoff elections are held among the top two vote-getters in each competition if no candidate reaches more than 50% of the vote.\nEdwards says Louisiana is rebounding from an economic recession and a decade of budget crises after a bipartisan tax deal ended the state's financial instability.\nRELATED: Jim Donelon re-elected as Louisiana insurance commissionerFew other opponents to the GOP incumbents had done significant fundraising.\nRELATED: Kyle Ardoin to face Gwen Collins-Greenup in Secretary of State run-offLouisiana Constitutional AmendmentsVoters decided four proposals to change the Louisiana Constitution.\nRELATED: Edwards will face Rispone in Louisiana's governor race runoffRELATED: Louisiana Election Results 2019► Get breaking news from your neighborhood delivered directly to you by downloading the new FREE WWL-TV News app now in the IOS App Store or Google Play."}, {"url": "https://www.nytimes.com/2019/10/13/us/baton-rouge-st-george.html", "title": "Suburbanites in Louisiana Vote to Create a New City of Their Own", "authors": ["Rick Rojas"], "date": "2019-10-13", "keywords": ["suburbanites", "parish", "incorporation", "vote", "city", "rouge", "control", "create", "residents", "baton", "wanted", "yearslong", "schools", "louisiana"], "summary": "BATON ROUGE, La.\nThe outcome was a rebuke to parish leaders, and illustrated just how strongly many residents wanted to separate themselves from Baton Rouge, the state capital, which is governed jointly with the parish.\nThe yearslong effort began as an attempt to create a new school district, and evolved over time into a drive for a whole new city.\nSupporters said they wanted to improve schools, have more local control over infrastructure and have their tax dollars spent closer to home, rather than see the money spread across East Baton Rouge Parish.\nThey said all areas of the parish would benefit as a result."}, {"url": "https://www.wafb.com/2019/10/01/baton-rouge-school-announces-closure-due-flu-will-remain-closed-through-oct/", "title": "Baton Rouge school back in session following flu scare", "authors": ["Spencer Soicher", "Published At Pm"], "date": "2019-10-01", "keywords": ["flu", "henderson", "situation", "levels", "spread", "particular", "rouge", "lunchroom", "session", "following", "baton", "school", "wanted", "k", "scare", "play"], "summary": "“It was definitely not something that we wanted to do, but we felt like it was the best for our particular situation at this time,” Henderson said.\n“We are also a very close school.\nK through 12 eat in the same lunchroom, use some of the same classrooms, play in the same gym, so it’s easy to spread across the grade levels.”"}, {"url": "https://www.businessreport.com/newsletters/sales-tax-collections-continue-2019-growth", "title": "Sales tax collections continue 2019 growth", "authors": ["Julia Arenstam"], "date": "2020-01-02", "keywords": ["sales", "report", "growth", "continue", "parish", "vehicle", "collections", "month", "city", "compared", "2019", "tax", "previous", "increase"], "summary": "Baton Rouge’s October 2019 sales tax collections rose nearly 4% from the same time last year, raking in over $16.9 million, according to the latest report from the city-parish.\nMost of the October combined sales and motor tax growth came from outside the city limits, with a 5.6% monthly increase compared to the city’s 2.7% increase.\nThe 2% city and parish sales tax rose 4.4% in October compared to the previous year and is on pace to report a 2% year-over-year growth.\nTotal parish and city vehicle tax collections dipped slightly in October, down 0.74% from the previous year, but still bringing in $1.34 million compared to last year’s $1.35 million.\nOctober’s vote to incorporate the proposed city of St. George—if it makes its way through the legal system—will take away some of this sales tax revenue from the general fund."}, {"url": "https://www.wafb.com/2019/10/13/election-results-west-baton-rouge-parish-sheriffs-race-heads-runoff/", "title": "2019 ELECTION RESULTS: West Baton Rouge Parish Sheriff’s race heads for runoff", "authors": ["Published April", "At Pm"], "date": "2019-10-13", "keywords": ["runoff", "strong", "parish", "trust", "voters", "west", "baton", "zito", "rouge", "election", "win", "results", "shooting", "sheriffs", "race", "cazes", "handling", "heads"], "summary": "In previous campaigns, Cazes easily captured a majority needed to win the race, but with strong criticisms from his competitors and members of the public over the West Baton Rouge Sheriff’s Office’s handling of the deputy-involved shooting death of Josef Richardson, it remained to be seen whether he’d maintained enough trust among voters to secure a lead.\nZito critiqued Cazes over his handling of the incident."}, {"url": "https://www.wafb.com/2019/10/11/election-day-what-you-need-know-before-heading-polls/", "title": "ELECTION DAY 2019: What you need to know before heading to the polls", "authors": ["Mykal Vincent", "Published April", "At Pm"], "date": "2019-10-11", "keywords": ["proposed", "parish", "st", "officials", "way", "day", "vote", "election", "heading", "2019", "rouge", "parishs", "polls", "school", "municipality", "need", "know"], "summary": "City-parish officials and people living within East Baton Rouge Parish will be keeping a close eye on the vote to incorporate the proposed city of St. George.\nThe battle over what could become the parish’s fifth and largest municipality began in 2015 as a way to improve school districts in the area."}, {"url": "https://www.225batonrouge.com/things-to-do/january-2020-calendar-events-baton-rouge", "title": "January 2020 calendar of events in Baton Rouge", "authors": [], "date": "2019-12-31", "keywords": ["theatre", "event", "2020", "local", "museum", "events", "music", "calendar", "rouge", "art", "night", "baton", "work"], "summary": "knockknockmuseum.orgJan. 11The 2020 Special Olympics State Bowling Tournament, to be held at All Star Lanes in Baton Rouge, is a one-day, state-level competition open to bowlers of multiple skill levels from across the state.\nbatonrougegallery.orgJan. 25-26Bar Crawl Unlimited comes to Baton Rouge for two bar crawl events—the Margarita Crawl and the Mimosa Crawl.\ndmae.lsu.eduMUSIC EVENTS: THIS MONTH’S BEST BETSJAN. 4New Orleans songwriter Kristin Diable’s sound comes to Baton Rouge at Dyson House Listening Room at Zeeland Street.\nlouisianastatemuseum.orgJAN. 23The Baton Rouge Symphony Orchestra presents its Mozart Birthday Bash!\nbrso.orgJAN. 27One of pop-surrealism’s top artists, Dan Quintana, hosts a lecture on his work at Baton Rouge Gallery."}, {"url": "https://www.nytimes.com/2019/11/16/us/louisiana-governor-edwards-rispone.html", "title": "In Louisiana, a Narrow Win for John Bel Edwards and a Hard Loss for Trump", "authors": ["Rick Rojas", "Jeremy Alford"], "date": "2019-11-16", "keywords": ["edwards", "loss", "john", "state", "democratic", "won", "rispone", "try", "president", "win", "trump", "hard", "republicans", "bel", "mr", "narrow", "louisiana"], "summary": "John Bel Edwards of Louisiana, the only Democratic governor in the Deep South, narrowly won re-election Saturday, overcoming the intervention of President Trump, who visited the state multiple times in an effort to help Mr. Edwards’s Republican challenger and demonstrate his own clout.\nIn Louisiana, Mr. Trump had wagered significant political capital to try to lift Eddie Rispone, a businessman who ran against Mr. Edwards in large part by embracing the president and his agenda.\nMr. Trump campaigned for Mr. Rispone twice in the final two weeks of the race, warning Louisiana voters that a loss would reflect poorly on his presidency — the same appeal he made in Kentucky earlier this month to try to help Gov.\nOf the three governor’s races this year, all in deep red states, Republicans won only one, in Mississippi.\nRepublicans also lost control of both chambers of the state legislature in Virginia, where many Democratic candidates were sharply critical of Mr. Trump."}, {"url": "https://www.wafb.com/2019/10/21/oct-runoff-debate-set-louisiana-governors-race/", "title": "Oct. 30 runoff debate set in Louisiana governor’s race", "authors": [], "date": "2019-10-21", "keywords": ["runoff", "headtohead", "event", "30", "public", "set", "statewide", "governors", "rouge", "oct", "planned", "nov", "race", "sparring", "debate", "louisiana"], "summary": "The two contenders have agreed to an event planned by Louisiana Public Broadcasting and the Council for A Better Louisiana that will air statewide.\nThe Baton Rouge debate may be the only head-to-head sparring the candidates do ahead of the Nov. 16 runoff."}, {"url": "https://www.wafb.com/2019/10/04/stats-show-louisiana-ranks-high-deadly-domestic-violence-cases-each-year/", "title": "Stats show Louisiana ranks high for deadly domestic violence cases each year", "authors": ["Lester Duhé", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-10-04", "keywords": ["services", "support", "referrals", "cases", "way", "provide", "violence", "high", "try", "trained", "managers", "ranks", "life", "deadly", "domestic", "price", "stats", "louisiana"], "summary": "“We have case managers and advocates there who are trained to provide them with support and referrals.\nWe do everything we can to try and get them back together and on their way and into their life, and we also provide legal services for free,” said Price."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisianas-constitutional-amendments-2019-explained/289-8d27f2f2-0531-4b7a-bf8c-0ddcadadb4d4", "title": "What do Louisiana's four proposed constitutional amendments mean?", "authors": ["Author", "Kevin Dupuy", "Published", "Pm Cdt September", "Updated", "Pm Cdt October"], "date": "2019-09-26", "keywords": ["proposed", "orleans", "board", "constitutional", "means", "vote", "schools", "amendments", "louisianas", "tax", "public", "property", "mean", "louisiana"], "summary": "NEW ORLEANS — When Louisiana voters go to the polls for October's gubernatorial primary election, they will decide on four constitutional amendments.\nWhat do those four constitutional amendments on Louisiana's 2019 ballot mean?\nA NO vote means: These three schools and public TV will not be added to a list of Education Excellence Fund recipients.\nA NO vote means: Only allow courts would be allowed to rule on constitutional questions in tax disputes.\nThe city is looking to create property tax exemptions for people who provide affordable housing."}, {"url": "https://www.businessreport.com/business/forty-under-40-2019-baton-rouge", "title": "2019 Forty Under 40", "authors": [], "date": "2019-11-20", "keywords": ["leadership", "business", "board", "st", "achievements", "foundation", "baton", "2019", "rouge", "member", "40", "louisiana"], "summary": "Supports STAR through “Hunks and Heels,” as well as the Greater Baton Rouge Food Bank and Baton Rouge Youth Coalition.\nAlso actively involved in St. Aloysius Catholic Church, and is class of 2019 graduate of Leadership Baton Rouge.\nThat experience defined my career path from that point forward.”Back to top of pageStuart Helo | 36Sector Lead, Development Advisory Services, CSRS Inc.Professional achievements:• 2019 Leadership Baton Rouge Alumni Fellow, Baton Rouge Area Chamber.\nCommunity:Volunteers with Baton Rouge Audubon Society, Louisiana Bird Observatory, Baton Rouge Christmas Bird Count, and guest lectures for the Louisiana Master Naturalist of Greater Baton Rouge.\nAdvice for futureForty Under 40 honorees:“Continue to embrace Baton Rouge and make our community better."}, {"url": "https://www.businessreport.com/newsletters/baton-rouge-unemployment-labor-force-both-rise", "title": "Baton Rouge unemployment, labor force both rise", "authors": ["Julia Arenstam"], "date": "2020-01-03", "keywords": ["workforce", "force", "unemployment", "data", "baton", "tied", "rouge", "2019", "rise", "rate", "highest", "labor", "reported"], "summary": "Baton Rouge unemployment rates and the number of people in the workforce continued to rise simultaneously in October and November 2019 compared to the previous year.\nDespite the unemployment rise, the city’s labor force also continued to grow over that two-month period, reaching more than 423,000 in November 2019.\nAt the same time in 2018, the Baton Rouge workforce totaled just under 420,000.\nLouisiana tied for the 47th/48th highest unemployment rate in the country with West Virginia.\nThe Baton Rouge area’s unemployment tied for the second-lowest with New Orleans and Metairie."}, {"url": "https://www.nytimes.com/2019/10/10/us/baton-rouge-st-george.html", "title": "Voters Near Baton Rouge Want Better Schools. First, They Need a New City.", "authors": ["Rick Rojas"], "date": "2019-10-10", "keywords": ["parish", "st", "george", "voters", "need", "baton", "city", "rouge", "community", "came", "residents", "better", "school", "river", "schools", "near"], "summary": "The campaign morphed into the notion of St. George as organizers said that lawmakers had told them a new school district could be viable if it were part of a freshly incorporated city.\nThen, roughly a month later, the city was devastated by floods, a disaster that, many residents said, banded the community together after so much tumult.\n“It was an incredible family that came together in the parish,” Ms. Cormier said, “and I don’t know how we lost it.\nPlans for the city call for a lean operation: The parish’s Sheriff’s Department would police it and it would continue to rely on other parish services.\n“It’s a very modern, some could say even progressive, way to look at city management,” Mr. Rainey said."}, {"url": "https://www.wafb.com/2019/10/09/see-candidates-face-off-finale-debate-tonight-pm-wafb/", "title": "Candidates for La. governor face off in final debate", "authors": ["Rachael Thomas", "Published April", "At Pm"], "date": "2019-10-09", "keywords": ["sure", "la", "medicaid", "deserve", "way", "candidates", "waste", "ineligible", "final", "wont", "abuse", "governor", "work", "face", "debate", "need"], "summary": "In terms of healthcare, candidates were asked what they would do to make sure those who receive Medicaid actually deserve it.\nAbraham said those people need to have jobs and that the waste, fraud, and abuse must be stopped.\nEdwards responded, saying Medicaid expansion was the easiest big decision he has made as governor.\nRispone said the state needs to freeze eligibility to get rid of waste and abuse.\nHe says Medicaid can’t keep expanding because then the people who really need it won’t have it."}, {"url": "https://www.politico.com/news/2019/10/01/edwards-louisiana-governor-republicans-014084", "title": "GOP squabbles as Louisiana governor nears reelection", "authors": [], "date": "2019-10-01", "keywords": ["nears", "squabbles", "abraham", "edwards", "national", "issues", "rispone", "democrats", "week", "trump", "reelection", "gop", "republicans", "governor", "republican", "louisiana"], "summary": "Jim Hodges, a Democrat, said for candidates running in deep red states like Louisiana or Mississippi, avoiding “close alliance with the national party or national issues” is an effective strategy to localize their races.\nIn a televised debate last week in Lafayette, each GOP candidate worked to peg the other as a political insider.\nBut Trump allies, including Republican National Committee chairwoman Ronna McDaniel, Donald Trump Jr., and Trump reelection campaign manager Brad Parscale, have all slammed Edwards on Twitter.\nDespite Louisiana’s Democratic tradition, no Democratic governor has won a second consecutive term since Edwin Edwards (no relation) won reelection in the mid 1970s.\n“If the election were held today, there would not be [a runoff],” John Bel Edwards said in the interview last week."}, {"url": "https://www.225batonrouge.com/food-drink/halloween-almost-make-baton-rouge-events", "title": "Halloween is almost here. Make the most of it with these Baton Rouge events", "authors": [], "date": "2019-10-22", "keywords": ["event", "spooky", "party", "events", "rouge", "night", "plenty", "baton", "oct", "costume", "halloween"], "summary": "For fans of everything ghoulish and ghostly, it’s a little disappointing that Halloween will be on a work night this year, but don’t worry.\nFriday, Oct. 25New Orleans party band Bag of Donuts will rock out at the L’Auberge Casino & Hotel Baton Rouge starting at 9 p.m.\nSunday, Oct. 27Join Bike Baton Rouge and 10/31 Consortium as they tour seven historic cemeteries in downtown, Mid City and Old South Baton Rouge, covering less than 15 miles.\nWednesday, Oct. 30Starting at 7 p.m., you can dress up for a nighttime bike ride all around downtown Baton Rouge.\nThursday, Oct. 31At 9 p.m., head to the Halloween Dance Party at The Radio Bar."}, {"url": "https://www.wafb.com/2019/12/13/coroner-called-out-double-shooting-north-blvd/", "title": "Two people found shot to death near North Boulevard", "authors": ["Samantha Morgan", "Published At Pm"], "date": "2019-12-13", "keywords": ["established", "boulevard", "shot", "north", "motive", "homicide", "added", "suspect", "double", "identified", "death", "near"], "summary": "They added they have not yet established a motive or identified a suspect in the double homicide."}, {"url": "https://www.nytimes.com/2019/10/13/us/john-bel-edwards-rispone-runoff-election.html", "title": "Gov. Edwards of Louisiana Forced Into Runoff With Republican", "authors": ["Rick Rojas"], "date": "2019-10-13", "keywords": ["runoff", "edwards", "sought", "rispone", "state", "gov", "senator", "trump", "night", "tax", "governor", "louisiana", "mr", "republican", "forced"], "summary": "Mr. Abrah am received just shy of 24 percent of the vote, trailing Mr. Rispone by three percentage points.\nHe conceded on Saturday night and endorsed Mr. Rispone .\nMr. Rispone emphasized the dearth of his political experience throughout the campaign as he sought to portray Mr. Edwards and Mr. Abraham as career politicians.\nBut Mr. Edwards also benefited after his 2015 opponent, Senator David Vitter, was hobbled by a prostitution scandal.\nRepublicans have called Mr. Edwards an “accidental governor,” and he is one of very few to hold the top office in the Deep South."}, {"url": "https://www.bleedinggreennation.com/2020/4/16/21223348/nfl-mock-draft-2020-philadelphia-eagles-justin-jefferson-first-round-pick-lsu-wide-receiver-sbnation", "title": "NFL Mock Draft 2020: Making the case for Justin Jefferson as the Eagles’ pick", "authors": ["Brandon Lee Gowton", "Apr"], "date": "2020-04-16", "keywords": ["2020", "case", "think", "slot", "good", "jefferson", "mock", "making", "eagles", "draft", "nfl", "receiver", "21", "wide", "pick", "justin"], "summary": "Jokes aside, this Jefferson article is specifically prompted by my pick in the annual SB Nation NFL writers mock draft.\nThere are rarely sure things in the draft, but Jefferson feels like an especially reasonable bet.\nI think Jefferson is the fourth-best wide receiver in the draft, and the 14th-best player overall.\nAnd that’s important for an Eagles team that desperately needs to upgrade their wide receiver situation.\nPhilly used three wide receiver sets at the seventh highest frequency back during the Eagles’ Super Bowl season in 2017."}, {"url": "https://www.wafb.com/2019/09/24/louisiana-retired-teachers-association-announces-fall-meeting/", "title": "Louisiana Retired Teachers Association announces fall meeting", "authors": ["Published At Pm"], "date": "2019-09-24", "keywords": ["director", "system", "speakers", "water", "state", "announces", "wold", "vicknair", "fall", "teachers", "meeting", "retired", "association", "russell", "louisiana"], "summary": "Guest speakers include Ashley Franklin and Joey David from the Louisiana State Museums; Leea Russell, the director of education for the Greater Baton Rouge Arts Council; Amy Wold, the director of communications for the Water Institute of the Gulf; and Dana Vicknair, the director of the Teachers’ Retirement System of Louisiana."}, {"url": "https://www.wafb.com/2019/10/13/election-results-louisiana-house-representative-races/", "title": "2019 ELECTION RESULTS: Louisiana House of Representative races", "authors": ["Published April", "At Pm"], "date": "2019-10-13", "keywords": ["house", "reached", "space", "limit", "thirtyone", "term", "members", "representative", "races", "election", "2019", "results", "session", "legislative", "leaving", "previous", "louisiana"], "summary": "Thirty-one previous members of the House reached their 12-year term limit in 2019, leaving space for new faces to fill the Capitol building during the next legislative session."}, {"url": "https://www.225batonrouge.com/things-to-do/louisiana-book-festival-returns-next-month-bringing-opportunities-meet-states-talented-coming-storytellers", "title": "The Louisiana Book Festival returns next month, bringing opportunities to meet some of the state’s most talented up-and-coming storytellers", "authors": [], "date": "2019-10-01", "keywords": ["theyre", "storytellers", "family", "returns", "meet", "magazine", "upandcoming", "authors", "state", "states", "festival", "opportunities", "book", "month", "library", "talented", "hamilton", "louisiana"], "summary": "The Louisiana Book Festival rolls back into town Nov. 2, and now in its 16th year, it’s a library of literary options.\n“We call it the Louisiana Book Festival for a reason,” says State Librarian Rebecca Hamilton, who helps organize the festival.\nThe authors that we invite are all Louisiana authors, or they’re authors from other places that have written about Louisiana.\nJumonville is donating the proceeds from her book sales to the Louisiana Library and Book Festival Foundation, Hamilton adds.\n2019 Louisiana Book FestivalNov. 2, 9 a.m.-4 p.mDowntown Baton Rouge (State Library of Louisiana, State Capitol, Capitol Park Museum and nearby locations)Free admissionlouisianabookfestival.orgThis article was originally published in the October 2019 issue of 225 Magazine."}, {"url": "https://www.wafb.com/2019/10/20/troopers-investigate-two-separate-fatality-crashes-baton-rouge-area/", "title": "Troopers investigate two separate deadly crashes in Baton Rouge area", "authors": ["Published At Pm"], "date": "2019-10-20", "keywords": ["crashes", "separate", "investigate", "scene", "unknown", "vehicle", "sample", "troopers", "rouge", "carline", "unrestrained", "deadly", "area", "baton", "toxicology", "pronounced", "obtained", "impairment"], "summary": "Carline was unrestrained at the time of the crash and ejected from the vehicle.\nHe was pronounced deceased on the scene.\nImpairment is unknown at this time, but a toxicology sample was obtained from Carline for analysis."}, {"url": "https://www.225batonrouge.com/food-drink/hot-new-restaurants", "title": "Baton Rouge’s biggest restaurant openings of the past year", "authors": [], "date": "2019-11-29", "keywords": ["225", "restaurants", "looks", "local", "restaurant", "openings", "rouges", "scene", "great", "worthy", "past", "rouge", "food", "baton", "spots", "biggest"], "summary": "After years of watching our local dining scene evolve, we felt it deserved its own year-end retrospective, immortalized forever in print.\nHow we narrowed the restaurantsWe placed the most emphasis on first-time, full-service openings that launched between October 2018 and October 2019.\nThe Baton Rouge bar scene is also booming more than everGet more food news!\nWe’re admittedly a little biased, but there’s really no better source for local food news than our e-newsletter, 225 Dine.\nSubscribe for exclusive first looks inside new restaurants, chef interviews, restaurant reviews, event previews and more at 225batonrouge.com/food."}, {"url": "https://www.thenewsstar.com/story/news/2019/11/04/president-donald-trump-plans-shreveport-rally-louisiana-governors-race/4152838002/", "title": "President Trump set to visit Shreveport-Bossier for Louisiana governor's race rally", "authors": ["Greg Hilburn", "Published A.M. Ct Nov."], "date": "2019-11-04", "keywords": ["shreveportbossier", "donald", "monroe", "visit", "set", "rally", "president", "trump", "governors", "election", "white", "race", "louisiana"], "summary": "The Daily AdvertiserPresident Donald Trump has tentatively planned a rally in Shreveport-Bossier City on Nov. 14 to support Republican Eddie Rispone in the Louisiana governor's race, sources with direct knowledge of the plans told USA Today Network.\nTrump's Shreveport-Bossier rally will be held in the CenturyLink Center in Bossier City.\nRepublican U.S. Sen. Bill Cassidy said he also emphasized northwestern Louisiana's importance in the campaign to President Trump.\n“The people of Louisiana love Donald Trump, and Donald Trump loves Louisiana,\" Cassidy said.\nWith all these trips to our state, he must be a (LSU) Tiger fan.”More: President Trump tweets ahead of Louisiana rally for governor's raceSources said they expect Trump to announce the Shreveport-Bossier City rally while on stage in Monroe."}, {"url": "https://www.wafb.com/2019/10/25/vice-president-mike-pence-set-visit-baton-rouge/", "title": "Vice President Mike Pence visits Baton Rouge to stump for Eddie Rispone", "authors": ["Published April", "At Pm"], "date": "2019-10-25", "keywords": ["stump", "pence", "visit", "vice", "rispone", "rally", "mike", "baton", "president", "washington", "rouge", "trump", "publicly", "slamming", "eddie", "race", "spent", "visits"], "summary": "At least publicly, Pence focused his message and campaigning on the race for governor and not on drama in Washington, D.C. President Donald Trump spent the majority of his last visit to Louisiana slamming Democrats and the impeachment inquiry at a rally in Lake Charles."}, {"url": "https://www.fox8live.com/2019/10/10/study-louisana-ranks-st-murder-rate-mississippi-nd/", "title": "Study: Louisana ranks 1st for murder rate, Mississippi 2nd", "authors": ["Chris Finch", "Published At Pm", "Published At Am"], "date": "2019-10-10", "keywords": ["looked", "lowrey", "source", "ones", "lowest", "study", "louisana", "states", "2nd", "rates", "1st", "ranks", "rate", "highest", "mississippi", "murder", "safewise"], "summary": "SafeWise looked at five years of FBI data to determine which states have the highest murder rates and which ones have the lowest murder rates (Source: Lowrey, Erin)"}, {"url": "https://www.fox8live.com/2019/12/24/teen-dead-year-old-injured-christmas-eve-home-invasion-shooting/", "title": "High school senior killed in home invasion shooting on Christmas Eve", "authors": ["Mykal Vincent", "Published At Pm", "Published At Am"], "date": "2019-12-24", "keywords": ["unlocked", "targeted", "subdivision", "eve", "suspects", "turret", "spokesperson", "high", "signs", "killed", "shooting", "senior", "door", "sheriffs", "school", "christmas", "invasion"], "summary": "According to the East Baton Rouge Parish Sheriff’s Office, the shooting happened just before 5 a.m. on Turret Drive off Millerville Road in the Avalon subdivision.\nA spokesperson for EBRSO says suspects entered the home through the front door in a targeted attack.\nOfficials say there were no signs of forced entry; the front door was possible unlocked."}, {"url": "https://www.wafb.com/2019/10/30/i-just-took-dna-test-turns-out-lizzo-is-baton-rouge/", "title": "I just took a DNA test, turns out Lizzo is 100% in Baton Rouge", "authors": ["Amanda Lindsley", "Published At Pm"], "date": "2019-10-30", "keywords": ["dna", "stick", "speculating", "southern", "took", "lizzo", "video", "unknown", "secretive", "rouge", "test", "baton", "sent", "visiting", "universitys", "100", "turns"], "summary": "At this time, it’s unknown why Lizzo is visiting the Red Stick.\nSome are speculating Lizzo could be recording a music video on Southern University’s campus after the school sent out a very secretive tweet."}, {"url": "https://lionsports.net/news/2020/4/16/womens-basketball-slu-adds-five-for-2020-21.aspx", "title": "Southeastern Louisiana University Athletics", "authors": [], "date": "2020-04-16", "keywords": ["school", "southeastern", "seasons", "game", "state", "college", "high", "team", "junior", "university", "jones", "athletics", "points", "louisiana"], "summary": "Guzzardo and her staff knew that finding experienced players to help fill that void was vital to continuing SLU's positive momentum.\n\"With four players coming from the junior college ranks and an SEC transfer, we expect this group to make an immediate impact in the upcoming season.\n\"Southeastern will open the 2020-21 season in early November.Kacey Bradford – 6-2 – F – Jackson, Miss.\n– Neosha CC/Carencro HSCierria Cunningham – 5-7 – G – Tuscaloosa, Ala. – Shelton State CC/Hillcrest HSNatalie Kelly – 6-3 – F – Albany, La.\n\"We've been recruiting Bryana since she was in high school, so we're glad to finally add her to our program."}, {"url": "https://www.avma.org/javma-news/2020-05-01/obituaries", "title": "Obituaries", "authors": [], "date": "2020-05-01", "keywords": ["member", "small", "state", "animal", "died", "veterinary", "2019", "medicine", "obituaries", "university", "dr"], "summary": "Prior to retirement, he was in small animal practice for several years and worked for the U.S. Department of Agriculture.\nA small animal veterinarian, he owned Camp McDonald Animal Clinic in Mount Prospect, Illinois, for 33 years.\nHe practiced small animal medicine in Indiana and Florida for 52 years.\nA past president of the Florida VMA, he served on the Florida Board of Veterinary Medicine for several years.\nA small animal veterinarian, he owned Valley Animal Hospital in Cedar Bluff and Grundy Animal Hospital in Grundy, Virginia."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["usa", "stadium", "falcons", "2020", "defensive", "linebacker", "mandatory", "moreround", "today", "options", "2019", "draft", "nov", "round", "credit"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "won", "virtually", "upfield", "participate", "team", "touches", "packers", "wants", "invites", "nfl", "draft", "super", "tons"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Ohio State running back J.K. Dobbins:What he can do– Built low to the ground at 5-9.\nCompact frame, with big, powerful legs– Tons of experience as a one-cut runner.\nWants to get upfield with initial patience following by burst–..."}, {"url": "https://www.225batonrouge.com/things-to-do/november-2019-calendar-events", "title": "November 2019 Calendar of Events", "authors": [], "date": "2019-11-01", "keywords": ["theatre", "local", "festival", "events", "holiday", "music", "calendar", "rouge", "2019", "night", "live", "lsu", "baton"], "summary": "Nov. 1-3• The Greater Baton Rouge State Fair began in 1965 when two existing Baton Rouge Jaycee Projects—a trade show and a carnival—were combined.\nThe annual, free gathering of readers, writers and their books has activities for all ages, including live music, cooking demos, book talks, signings and more.\nthemarketbr.comNov. 11-23The second Sweet Baton Rouge Holiday Local Pop Up Shop at Perkins Rowe will showcase Louisiana makers.\nNov. 2The open-air Baton Rouge Arts Market returns alongside the Red Stick Farmers Market downtown.\nAs the former SGA president at Southern University, Banner is now a rapper, actor and activist, returning to Baton Rouge for SU’s homecoming weekend."}, {"url": "https://www.insurancejournal.com/news/southcentral/2019/12/24/552874.htm", "title": "Louisiana Adds More Jobs Year-Over-Year; Baton Rouge, Hammond MSAs Set Records", "authors": [], "date": "2019-12-24", "keywords": ["records", "rouge", "increased", "employment", "seasonally", "gained", "louisiana", "sector", "2018", "yearoveryear", "adds", "nonfarm", "jobs", "2019", "baton", "msas", "set", "adjusted", "hammond"], "summary": "Seasonally adjusted nonfarm employment increased by 9,000 jobs from 1,984,400 in November 2018 to 1,993,400 jobs in November 2019.\nSeasonally adjusted nonfarm employment has added jobs over the year the past four months.\nSeasonally adjusted nonfarm employment is at its highest level since November 2015.\nFrom October 2019, seasonally adjusted nonfarm employment increased by 4,100 jobs.\nSeasonally adjusted private sector employment increased by 10,900 jobs from 1,656,900 in November 2018 to 1,667,800 jobs in November 2019."}, {"url": "https://fox6now.com/2019/11/17/democrat-john-bel-edwards-wins-governor-reelection-in-conservative-louisiana/", "title": "Democrat John Bel Edwards wins governor reelection in conservative Louisiana", "authors": ["Ap Wire Service"], "date": "2019-11-17", "keywords": ["edwards", "john", "rispone", "conservative", "pres", "democrat", "trump", "reelection", "louisianas", "republicans", "governor", "wins", "race", "bel", "republican", "louisiana"], "summary": "× Democrat John Bel Edwards wins governor reelection in conservative LouisianaBATON ROUGE, La.\nJohn Bel Edwards to a second term, shocking Republicans who had hoped to reclaim the seat on the strength of President Donald Trump’s popularity.\nTrump fought to return the seat to the GOP, but his intense interest in the race not only motivated conservative Republicans, but also powered a surge in anti-Pres.\nTrump made three trips to Louisiana to rally against Edwards, and fashioned the runoff election between Edwards and Rispone into a test of his own popularity and political prowess.\nAs he conceded the race, Rispone called on supporters to give a round of applause for Pres."}, {"url": "https://www.businessreport.com/newsletters/baton-rouge-unemployment-labor-force-both-rise", "title": "Baton Rouge unemployment, labor force both rise", "authors": ["Julia Arenstam"], "date": "2020-01-03", "keywords": ["workforce", "force", "unemployment", "data", "baton", "tied", "rouge", "2019", "rise", "rate", "highest", "labor", "reported"], "summary": "Baton Rouge unemployment rates and the number of people in the workforce continued to rise simultaneously in October and November 2019 compared to the previous year.\nDespite the unemployment rise, the city’s labor force also continued to grow over that two-month period, reaching more than 423,000 in November 2019.\nAt the same time in 2018, the Baton Rouge workforce totaled just under 420,000.\nLouisiana tied for the 47th/48th highest unemployment rate in the country with West Virginia.\nThe Baton Rouge area’s unemployment tied for the second-lowest with New Orleans and Metairie."}, {"url": "https://www.katc.com/news/covering-louisiana/brpd-searching-for-man-missing-since-november-2019", "title": "BRPD searching for man missing since November 2019", "authors": [], "date": "2020-02-20", "keywords": ["225", "man", "brpd", "missing", "searching", "seen", "cable", "2019", "rouge", "suffers", "baton", "search", "taking", "whereabouts"], "summary": "A search is ongoing for a man missing from the Baton Rouge area who was last seen in late November 2019.\nThe Baton Rouge Police Department say that Deonta Cable was last seen around the 4700 block of Airline Hwy.\nIt is believed that Cable suffers from mental illness and is not taking medications.\nHe is described as being 5'9\" and 160 pounds with black hair and brown eyes.\nAnyone who has seen Cable or has information on the whereabouts is asked to contact the BRPD Missing Persons Division at (225) 389-8617 or Baton Rouge Police at (225) 389-2000."}, {"url": "https://www.thenewsstar.com/story/news/2019/12/30/here-louisiana-top-10-political-stories-2019-john-bel-edwards-donald-trump-lsu-new-orleans-saints/2773830001/", "title": "What were the Top 10 political stories in Louisiana in 2019?", "authors": ["Greg Hilburn", "Published A.M. Ct Dec."], "date": "2019-12-30", "keywords": ["edwards", "john", "state", "gov", "president", "political", "2019", "trump", "lsu", "bel", "republican", "louisiana"], "summary": "CLOSE Crowd cheers for Louisiana Gov.\nSo it's not surprising what political headline rose to the top in 2019, but can you name the rest of the Top 10 political stories of the year?\nJohn Bel Edwards secured a narrow second term victory to remain the only Democratic governor in the Deep South.\nLouisiana Gov.\n\"I love Louisiana,\" Trump said at every stop."}, {"url": "https://www.wafb.com/2019/10/07/baton-rouge-veterans-parade-mayor-releases-festival-details/", "title": "Baton Rouge Veteran’s Parade 2019: Mayor releases festival details", "authors": ["Published At Pm"], "date": "2019-10-07", "keywords": ["sponsored", "service", "festival", "veterans", "uss", "parade", "selflessness", "mayor", "starting", "run", "rouge", "releases", "2019", "sacrifices", "road", "baton", "details"], "summary": "The parade, sponsored by the Mayor-President’s Advisory Council on Veteran’s Affairs, will run down River Road starting in front of the Pentagon Barracks and ending at the USS Kidd.\nThe parade will honor the service, sacrifices and selflessness of our veterans."}, {"url": "https://www.wafb.com/2019/10/25/registration-early-voting-dates-novembers-runoff-elections/", "title": "Early voting for runoff election is Nov. 2 through 9", "authors": ["Mykal Vincent", "Published April", "At Pm"], "date": "2019-10-25", "keywords": ["runoff", "voting", "vehicles", "digital", "id", "wallet", "special", "voters", "early", "training", "election", "license", "nov", "picture", "louisiana"], "summary": "In addition to a Louisiana driver’s license, a Louisiana Special ID or a generally recognized ID with picture and signature, voters may now use a digital license via LA Wallet, the new smartphone app by the Louisiana Office of Motor Vehicles.\nPoll commissioners have received training regarding the digital license as an acceptable form of picture ID."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisiana-2019-elections-results-recap/289-8796aa35-3989-43e8-975a-6dc2c3dd1c2f", "title": "Louisiana 2019 Elections Results recap", "authors": ["Author", "Melinda Deslatte", "Associated Press", "Published", "Pm Cdt October", "Updated"], "date": "2019-10-13", "keywords": ["orleans", "reelected", "edwards", "state", "term", "recap", "elections", "2019", "election", "tax", "results", "race", "face", "louisiana"], "summary": "Runoff elections are held among the top two vote-getters in each competition if no candidate reaches more than 50% of the vote.\nEdwards says Louisiana is rebounding from an economic recession and a decade of budget crises after a bipartisan tax deal ended the state's financial instability.\nRELATED: Jim Donelon re-elected as Louisiana insurance commissionerFew other opponents to the GOP incumbents had done significant fundraising.\nRELATED: Kyle Ardoin to face Gwen Collins-Greenup in Secretary of State run-offLouisiana Constitutional AmendmentsVoters decided four proposals to change the Louisiana Constitution.\nRELATED: Edwards will face Rispone in Louisiana's governor race runoffRELATED: Louisiana Election Results 2019► Get breaking news from your neighborhood delivered directly to you by downloading the new FREE WWL-TV News app now in the IOS App Store or Google Play."}, {"url": "https://www.225batonrouge.com/things-to-do/december-2019-calendar-events", "title": "December 2019 Calendar of Events", "authors": [], "date": "2019-11-26", "keywords": ["stick", "event", "party", "events", "red", "calendar", "2019", "art", "band", "rouge", "lsu", "brings", "sound"], "summary": "Click here for our roundup of more than 20 local holiday events, shows, cocktail parties and endless shopping.\nservingsushi.comRed Stick droppingHead to Red Stick Revelry for live music and a laser light show.\nThe event begins during the day with Red Stick Rising at North Boulevard Town Square.\nAs midnight strikes, the light show will be accompanied by the ceremonial dropping of the Red Stick and a fireworks display.\nthetexasclub.comDec. 14Little Freddie King is a New Orlean blues guitarist bringing his country-inflected sound to the Red Stick at Dyson House."}, {"url": "https://www.wafb.com/2019/11/17/election-results-generalrunoff-election/", "title": "2019 ELECTION RESULTS: Louisiana Gubernatorial General/Runoff Election", "authors": ["Published April", "At Pm"], "date": "2019-11-17", "keywords": ["gubernatorial", "mobile", "voters", "portal", "generalrunoff", "urged", "sos", "election", "2019", "polling", "results", "voter", "smartphone", "louisianas", "location", "louisiana"], "summary": "Voters hoping to find their polling location or learn more about the choices that will appear on their ballot are urged to use Louisiana’s free smartphone app, GeauxVote Mobile, or the SOS Voter Portal."}, {"url": "https://www.businessreport.com/business/forty-under-40-2019-baton-rouge", "title": "2019 Forty Under 40", "authors": [], "date": "2019-11-20", "keywords": ["leadership", "business", "board", "st", "achievements", "foundation", "baton", "2019", "rouge", "member", "40", "louisiana"], "summary": "Supports STAR through “Hunks and Heels,” as well as the Greater Baton Rouge Food Bank and Baton Rouge Youth Coalition.\nAlso actively involved in St. Aloysius Catholic Church, and is class of 2019 graduate of Leadership Baton Rouge.\nThat experience defined my career path from that point forward.”Back to top of pageStuart Helo | 36Sector Lead, Development Advisory Services, CSRS Inc.Professional achievements:• 2019 Leadership Baton Rouge Alumni Fellow, Baton Rouge Area Chamber.\nCommunity:Volunteers with Baton Rouge Audubon Society, Louisiana Bird Observatory, Baton Rouge Christmas Bird Count, and guest lectures for the Louisiana Master Naturalist of Greater Baton Rouge.\nAdvice for futureForty Under 40 honorees:“Continue to embrace Baton Rouge and make our community better."}, {"url": "https://www.businessreport.com/newsletters/baton-rouge-area-school-districts-make-top-10-in-louisiana", "title": "Baton Rouge area school districts make top 10 in Louisiana", "authors": ["Daily Report Staff"], "date": "2019-11-06", "keywords": ["public", "improvement", "rankings", "state", "rouge", "area", "baton", "school", "scores", "louisiana", "schools", "districts"], "summary": "Four of the top 10 school districts in Louisiana—Zachary, Ascension, Central and West Feliciana—are in the Baton Rouge area, according to 2019 school performance data released today by the Department of Education.\nAll four districts in the latest rankings earned A scores.\nEast Baton Rouge Parish received a C, as it did in 2018, though its numerical score was up 8% to 69 from 65.\nIn the individual school rankings, Baton Rouge Magnet High School was listed as the highest-performing public school in Baton Rouge and ranked sixth statewide.\nDespite improvements at many schools, however, 44% of all public schools in Louisiana will be required to develop plans for improvement to submit to the state for approval and funding."}, {"url": "https://www.wafb.com/2019/12/25/crime-baton-rouge-area/", "title": "Crime in the Baton Rouge area in 2019", "authors": ["Rachael Thomas"], "date": "2019-12-25", "keywords": ["wreck", "forward", "crime", "officer", "mother", "decided", "rouge", "2019", "wont", "area", "action", "baton", "death"], "summary": "Both the mother of a 1-year-old girl and a Baton Rouge police officer will not face charges after the woman’s baby was killed in a wreck back in 2017.\nThe officer, Christopher Manuel, and the child’s mother, Brittany Stephens, were both initially arrested and charged with negligent homicide after it was determined the officer was speeding at the time of the wreck and the mother had not properly restrained her child inside the vehicle.\nIn November of 2019, prosecutors decided to take no action in the case, meaning the office won’t move forward against either party.\nThe East Baton Rouge district attorney said it became a real conundrum of who was truly responsible for the girl’s death.\nSince they could not definitively prove which action really caused the baby’s death, they decided to not move forward again either the officer or the mother."}, {"url": "https://www.225batonrouge.com/our-city/225s-guide-louisianas-2019-elections", "title": "225’s guide to Louisiana’s 2019 elections", "authors": [], "date": "2019-09-30", "keywords": ["voting", "governor", "information", "including", "guide", "candidates", "vote", "open", "elections", "2019", "election", "louisianas", "polling", "225s", "polls"], "summary": "Below, you can find information on election dates and where to find up-to-date information on your polling place and your ballot.\nThere are also several district and parish-level offices up for a vote, including East Baton Rouge Parish sheriff, clerk of court, assessor and coroner.\nFind detailed information, including your voter status and polling location, at sos.la.gov.\nNOV. 15: Absentee voting deadlineNOV. 16: General election (including runoff elections).\nPolls are open 6 a.m.-8 p.m.Everything you need before votingGo here to find your polling location and other voting information."}, {"url": "https://www.wafb.com/2019/11/13/wednesdays-low-temps-break-year-record/", "title": "Wednesday’s low temps break 112-year record", "authors": ["Diane Deaton", "Published April", "At Am", "At Pm"], "date": "2019-11-13", "keywords": ["temps", "portion", "low", "temperatures", "today", "wednesdays", "windy", "break", "record", "112year", "wont", "hard", "remains", "warning", "remain", "normal"], "summary": "A Hard Freeze Warning remains in effect until 8 a.m., through a portion of the early commute, but temperatures will remain much cooler than normal again today.\nAt least it won’t be as windy as it was Tuesday."}, {"url": "https://www.businessreport.com/newsletters/meet-the-2019-forty-under-40", "title": "Meet the 2019 Forty under 40", "authors": ["Business Report Staff"], "date": "2019-11-20", "keywords": ["business", "meet", "report", "class", "region", "2019", "nonprofit", "working", "volunteer", "40", "organizations", "work"], "summary": "Whether they’re working late into the evening to complete a big assignment, getting up early to ready their kids for school or scrambling to a nonprofit board meeting, Business Report’s 2019 Forty Under 40 class is anything but idle.\nCulling down the list of nominees for this year’s Forty Under 40 class was no small task.\nBusiness Report received 550 nominations for 292 unique candidates.\nBusiness Report will recognize and celebrate all of this year’s honorees at an already sold-out special event on Dec. 4 at L’Auberge Casino Hotel.\nRead the full cover package on this year’s Forty Under 40 here, and see their individual profiles here:"}, {"url": "https://www.ksla.com/2019/10/13/gov-edwards-face-eddie-rispone-november-runoff/", "title": "Gov. Edwards to face Eddie Rispone in November runoff", "authors": ["Published April", "At Pm"], "date": "2019-10-13", "keywords": ["runoff", "tv", "edwards", "rose", "richest", "rispone", "state", "gov", "result", "steadily", "spent", "eddie", "race", "rispones", "face"], "summary": "Rispone, who is one of the richest men in the state, steadily rose in the polls throughout the race — the likely result of a blanketing of the airwaves with frequent TV ads.\nAccording to election filings, Rispone’s campaign spent more than $10 million on the race, most of which was reportedly his own money."}, {"url": "https://thelensnola.org/2019/11/13/as-activists-are-arrested-in-baton-rouge-in-depth-coverage-shows-louisianas-death-alley-to-the-world/", "title": "As activists are arrested in Baton Rouge, in-depth coverage shows Louisiana’s ‘Death Alley’ to the world", "authors": [], "date": "2019-11-13", "keywords": ["indepth", "shows", "officers", "rouge", "louisianas", "louisiana", "pastor", "alley", "greg", "plants", "world", "baton", "death", "coverage", "petrochemical", "book", "arrested", "floor", "cada"], "summary": "Those of us who have been protesting the petrochemical plants along the Mississippi River as part of the Coalition Against Death Alley (CADA) can claim a long-sought success.\nPastor Greg told the police officers to give her two more minutes to finish her talk and said then we would leave.\nTwo of the officers pushed Pastor Greg to the floor and made him lie on his stomach while they cuffed his hands behind his back.\nTwo days after the arrest, some of us CADA leaders met with Pastor Greg to discuss what we might have done differently.\nMeanwhile, we are preparing our case against the Baton Rouge police for arresting Pastor Greg unnecessarily."}, {"url": "https://www.wafb.com/2019/11/18/multiple-state-websites-email-systems-down/", "title": "OMV locations to remain closed until Monday", "authors": ["Matt Houston", "Published At Pm"], "date": "2019-11-18", "keywords": ["usual", "locations", "state", "closed", "affected", "theres", "berry", "worked", "systems", "wic", "omv", "snap", "sign", "remain"], "summary": "Jacques Berry with the Division of Administration says benefits such as WIC, SNAP, etc.\nhave not been affected, but that the enrollment process has been affected, so people are not currently able to sign up for the programs.\nPayroll for state worked has also not been affected, he said.\nPaychecks have been processed and will be dispersed as usual.\nBerry also says there’s still no estimate on when all state computer systems will be fully functional."}, {"url": "https://www.nytimes.com/2019/11/08/us/louisiana-runoff-election-trump.html", "title": "In Louisiana Governor’s Election, a True Test of Trump’s Sway", "authors": ["Richard Fausset", "Campbell Robertson"], "date": "2019-11-08", "keywords": ["trumps", "general", "rispone", "true", "votes", "talk", "week", "governors", "test", "election", "trump", "race", "rispones", "mr", "republican", "sway", "louisiana"], "summary": "Mr. Rispone is a Baton Rouge native with his own bootstrapping Louisiana story to tell: In 1989 he and his brother founded ISC Constructors, a specialty contracting company that now boasts annual revenues of $350 million, according to the campaign.\nThis heavy emphasis on tax cuts is at the center of one of the few actual policy debates in the race.\nMr. Rispone’s critics have said his embrace of Mr. Trump is a fill-in for his lack of policy details beyond the general talk of cuts.\nThis week, the radio host Newell Normand, a former Jefferson Parish sheriff, blasted Mr. Rispone on his influential New Orleans radio talk show.\n“All the while Eddie Rispone has already sold us out — we’re actually now, in nationalizing this governor’s race, a pawn in Washington politics."}, {"url": "https://www.nytimes.com/2019/11/18/us/John-bel-edwards-louisiana-democrat.html", "title": "After Defeating His Opponent and Trump, Louisiana Governor Charts His Own Path", "authors": ["Rick Rojas", "Jeremy Alford"], "date": "2019-11-18", "keywords": ["support", "path", "charts", "edwards", "voters", "success", "defeating", "trump", "opponent", "political", "south", "governor", "mr", "republican", "louisiana"], "summary": "As his re-election bid geared up, once again the G.O.P.\nThe Republican Governors Association classified Louisiana as a “top pickup.”But when Mr. Edwards, the only sitting Democratic governor in the Deep South, did it again on Saturday, this time overcoming not just his opponent but repeated appearances by President Trump, it was clear he was no fluke.\nMr. Edwards combined a pro-gun, anti-abortion conservative social agenda with progressive stances on issues like Medicaid expansion and education, and a record of success in fixing a budget mess left behind by his Republican predecessor.\nBut his success in attracting both black voters and centrist whites is widely viewed as a crucial lesson for Democratic candidates in the South and well beyond.\nMr. Edwards also drew support from voters who had backed the other Republican candidate in the primary."}, {"url": "https://www.wafb.com/2019/11/26/man-killed-shooting-blvd-de-province/", "title": "Arrest made in deadly shooting on Boulevard de Province in November", "authors": ["Samantha Morgan", "Rachael Thomas", "Published At Pm"], "date": "2019-11-26", "keywords": ["highway", "second", "province", "n", "boulevard", "road", "old", "shooting", "deadly", "harrells", "window", "incident", "arrest"], "summary": "The incident happened in the 1800 block of Boulevard de Province, which connects Old Hammond Highway and N Harrell’s Ferry Road.\nThis was the second shooting to happen in that area within a 24-hour window."}, {"url": "https://www.wafb.com/2019/10/30/kanye-west-appear-brunchella-sunday-service-baton-rouge-friday/", "title": "Thousands flock to Bethany Church to hear Kanye West chronicle journey with religion at ‘Sunday Service’", "authors": ["Rachael Thomas", "Lester Duhé", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-10-30", "keywords": ["going", "flock", "rouge", "church", "service", "im", "yeezy", "religion", "wow", "west", "unless", "randomly", "journey", "hear", "heard", "usually", "thousands", "kanye", "chronicle", "shocked"], "summary": "“I’m excited to see Yeezy.\nUsually, big artists like this don’t randomly just come to Baton Rouge, unless it’s for like a homecoming concert,” said Jordan Donald.\n“He’s going to be at Bethany and I was like wow.\nI heard about him going to Atlanta, and then I heard about him going to Joel Osteen’s Church, so I was like wow, I’m still shocked,” said Josias Lucas."}, {"url": "https://www.wafb.com/2019/11/03/how-get-your-free-flu-shot-louisiana/", "title": "Free flu shot clinics across Louisiana scheduled during November", "authors": ["Danae Leake", "Published At Pm"], "date": "2019-11-03", "keywords": ["vaccination", "little", "wafb", "clinics", "scheduled", "shot", "flu", "la", "shots", "rouge", "louisianas", "free", "oneday", "louisiana"], "summary": "BATON ROUGE, La.\n(WAFB) - Have you had your flu shot yet?\nLouisiana’s health department is continuing to hold one-day flu vaccination clinics in November where people can get flu shots at little to no cost."}, {"url": "https://www.wwltv.com/article/news/health/survey-louisiana-among-the-worst-areas-in-us-for-flu-activity/289-a5ffca0c-9115-4d6a-aa9e-9de72571db4e", "title": "Survey: Louisiana among the worst areas in US for flu activity", "authors": ["Author", "Wwl Staff", "Published", "Am Cst November", "Updated"], "date": "2019-11-21", "keywords": ["orleans", "survey", "walgreens", "la", "texas", "flu", "activity", "rouge", "mississippi", "worst", "areas", "louisiana"], "summary": "NEW ORLEANS — Louisiana, Mississippi and Texas lead the nation in flu activity, according to a Walgreen's survey that ended last week.\nLafayette topped the list, but New Orleans, Baton Rouge and Biloxi all ranked in the top six areas in the United States with the highest incidence of flu, the Walgreens Flu Index reports.\nThe survey uses national retail prescription data for antiviral medicine used to treat the flu at Walgreens stores.\nTop 10 Designated Market Areas (DMAs) with Flu Activity (11/16/2019)Lafayette, La.\nNew Orleans, La."}, {"url": "https://www.ksla.com/2019/11/11/poll-louisiana-governors-race-tight-runoff-nears/", "title": "POLL: Louisiana governor’s race tight as runoff nears", "authors": ["Ksla Staff", "Published April", "At Pm"], "date": "2019-11-11", "keywords": ["runoff", "party", "edwards", "rispone", "voters", "cross", "vote", "undecided", "lines", "governors", "say", "trump", "nears", "louisiana", "race", "poll", "tight"], "summary": "81% of Trump voters from 2016 say they will cast their vote for Rispone while 15% say they will cross party lines to vote for Edwards.\n4% of those voters say they are undecided."}, {"url": "https://www.wafb.com/2019/11/20/three-arrested-following-home-invasion-shooting/", "title": "Three arrested following home invasion, shooting", "authors": ["Mykal Vincent", "Published At Pm"], "date": "2019-11-20", "keywords": ["physical", "man", "homeowners", "told", "way", "arrested", "stepsons", "shooting", "following", "door", "suspect", "knocked", "neighbors", "invasion"], "summary": "The homeowner told detectives a man knocked on his door and forced his way into the home with a gun.\nGunshots were heard by neighbors.\nThe homeowner’s step-sons engaged in a physical altercation with the armed suspect at the door."}, {"url": "https://www.shreveporttimes.com/story/news/local/louisiana/2019/12/01/analysis-louisiana-cyberattack-disrupts-but-could-have-been-worse/4348758002/", "title": "Analysis: Louisiana cyberattack disrupts, but not worst-case", "authors": ["Melinda Deslatte", "Associated Press", "Published P.M. Ct Dec."], "date": "2019-12-01", "keywords": ["services", "analysis", "edwards", "worstcase", "cyberattack", "state", "technology", "computer", "underwood", "disrupts", "office", "louisianas", "ransomware", "louisiana"], "summary": "Still, the ransomware hit serves as an indication of the new normal, where Louisiana technology officials are always trying to combat the latest attempted attack.\nSen. Sharon Hewitt praised the quick response from Louisiana’s technology services office to the Nov. 18 cyberattack, but also worried about vulnerabilities to another strike.\nThe Office of Technology Services immediately shut down external access to network servers when the breach was discovered.\nThe state established a cybersecurity emergency response team that includes leaders from the technology services office, the homeland security department, the Louisiana State Police, the Louisiana National Guard and university experts.\nIn south Louisiana, the governor announced in August that Louisiana is spending $2 million to help establish a cybersecurity center in Baton Rouge."}, {"url": "https://www.wafb.com/2020/02/19/brpd-asking-help-locating-man-missing-since-november/", "title": "BRPD asking for help in locating man missing since November 2019", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-02-19", "keywords": ["highway", "man", "brpd", "deonta", "missing", "don", "seen", "help", "2019", "cable", "late", "jr", "heard", "locating", "asking", "sgt", "near"], "summary": "Don Coppola Jr. says Deonta Cable has not been heard from since late November of 2019.\nCable was last seen near the 4700 block of Airline Highway."}, {"url": "https://www.wafb.com/2019/11/09/one-killed-shooting-curtis-street/", "title": "Man arrested in fatal shooting on Curtis Street", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-11-09", "keywords": ["fatal", "man", "spike", "released", "curtis", "uniform", "wall", "arrested", "violence", "training", "shooting", "units", "street", "reassigned", "recent"], "summary": "A recent spike in gun violence has BRPD against a wall.\nChief Murphy Paul says 60 detectives will be reassigned to the street crimes and narcotics units.\nAnother 26 new officers will be released from the field training program and will be permanently assigned to uniform patrol."}, {"url": "https://www.wafb.com/2019/11/06/new-louisiana-school-grades-scores-released-wednesday/", "title": "New Louisiana school grades and scores released Wednesday", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-11-06", "keywords": ["districts", "st", "wafb", "overall", "west", "viewing", "grades", "rouge", "released", "school", "scores", "saw", "louisiana"], "summary": "In the WAFB viewing area, Iberville, West Baton Rouge, and West Feliciana school districts saw improvements in overall scores.\nPointe Coupee and St. Helena school districts saw a decrease in overall performance scores."}, {"url": "https://www.katc.com/news/covering-louisiana/ldwf-estimate-la-fishing-industry-sustained-258m-in-losses-during-historic-flooding", "title": "LDWF estimate: La. fishing industry sustained $258M in losses during historic flooding", "authors": [], "date": "2019-11-15", "keywords": ["million", "258m", "louisiana", "flooding", "la", "economic", "sustained", "impact", "fishing", "fisheries", "noaa", "disaster", "flood", "historic", "estimate", "estimated", "industry", "losses", "ldwf"], "summary": "BATON ROUGE - The Louisiana fishing industry suffered an estimated $258 million in losses due to the historic 2019 flooding event, according to a fisheries disaster economic impact analysis conducted by the Louisiana Department of Wildlife and Fisheries, Governor John Bel Edwards announced today.\nEdwards' request [gov.louisiana.gov] for a formal declaration of a fisheries disaster in Louisiana.\nFollowing the approval, LDWF began working with NOAA to evaluate the economic impact to Louisiana fisheries and finalized the economic impact evaluation today.\nThe estimated economic impact value far exceeds the amount of disaster assistance funding currently available at NOAA.\nLDWF did not attempt to capture impacts other than for the processor sector as part of our surveys as we understood that those would be collected by NOAA Fisheries."}, {"url": "https://www.wafb.com/2019/11/17/cazes-elected-fifth-term-west-baton-rouge-parish-sheriff/", "title": "Cazes elected to fifth term as West Baton Rouge Parish Sheriff", "authors": ["Published April", "At Pm"], "date": "2019-11-17", "keywords": ["theyre", "going", "term", "rouge", "came", "serving", "elected", "west", "sheriff", "today", "fifth", "young", "baton", "thats", "cazes", "streets", "parish", "turn", "work"], "summary": "“I saw a lot of guys come in and get out that came in at a young age and they deserve a chance, but they got out after serving time and they didn’t have nothing.\nToday, we have a program in place that we can send them to school, we give them an education, they go to work release, and then we turn around and give them a job.\nThen they get out with money,\" said Cazes.\n“They’re not going out on the streets and going back to the same area they came from with nothing.\nAnd, that’s a blessing to me.”"}, {"url": "https://www.wafb.com/2019/11/11/first-alert-forecast-freeze-warning-issued-baton-rouge-area/", "title": "FIRST ALERT FORECAST: Hard Freeze Warning issued for Baton Rouge area", "authors": ["Diane Deaton", "Published April", "At Am", "At Pm"], "date": "2019-11-11", "keywords": ["wind", "forecast", "alert", "winds", "way", "warning", "temperatures", "north", "issued", "afternoon", "rouge", "hard", "area", "stays", "baton", "freeze", "rain", "skies"], "summary": "Most of the rain should be out of the area by the morning commute, but clouds will linger through midday before giving way to clearing skies from Tuesday afternoon into Tuesday evening.\nIt stays cold through the day too, with temperatures only getting into the low 40s for Baton Rouge Tuesday afternoon.\nGiven the north winds, afternoon wind chills will be in the 30s."}, {"url": "https://www.wafb.com/2019/11/22/lawmakers-updated-service-status-after-state-network-cyber-attack/", "title": "Governor declares state of emergency after cyber-attack", "authors": ["Matt Houston", "Published At Pm"], "date": "2019-11-22", "keywords": ["patience", "penalized", "cyberattack", "state", "outage", "unnecessarily", "restore", "declares", "worked", "team", "governor", "public", "related", "emergency", "services"], "summary": "“We appreciate the patience of the public as our team of experts has worked around the clock to restore online services related to this cybersecurity issue,” Gov.\nEdwards said.\n“We know that some people may have missed filing deadlines or incurred fees because of the outage, which the emergency declaration allows us to correct so that the members of the public are not penalized unnecessarily.”"}, {"url": "https://www.wafb.com/2019/11/19/smell-smoke-firefighters-working-find-source-smoke-baton-rouge-area/", "title": "Sugar cane burning in WBR Parish; wind brings smell to BR", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-11-19", "keywords": ["wind", "smell", "burning", "parish", "officials", "br", "wbr", "west", "received", "smoke", "rouge", "say", "cane", "fields", "sugar", "brings"], "summary": "West Baton Rouge Parish fire officials say that sugar cane fields were being burned in the area.\nThe agency also said it had not received calls about the smoke."}, {"url": "https://fortune.com/2019/11/18/redistricting-2020-kentucky-louisiana-virginia-democratic-victories-could-give-party-edge-redrawing-congressional-districts/", "title": "Southern Democrats' State Victories Could Give Party an Edge in Redrawing Political Turf", "authors": [], "date": "2019-11-18", "keywords": ["party", "southern", "redrawing", "state", "victories", "turf", "democrats", "open", "political", "wants", "trump", "edge", "reopen", "economy"], "summary": "Trump wants to reopen the U.S. economy by May 1.\nBut what can he open?"}, {"url": "https://www.businessreport.com/opinions/louisiana-election-endorsements-eddie-rispone-baton-rouge", "title": "Publisher: Your vote is your voice on Nov. 16", "authors": ["Rolfe Mccollister"], "date": "2019-11-05", "keywords": ["publisher", "unions", "district", "runoff", "jobs", "state", "believe", "16", "vote", "education", "judge", "nov", "voice", "louisiana"], "summary": "There are many important runoff elections and early voting is open now until Saturday, Nov. 9.\nRemember, this is the runoff and with early voting beginning Nov. 2 and a Nov. 16 election day, most folks have already selected their candidate or are leaning toward a particular choice.\nOur secretary of state, state treasurer, secretary of agriculture and insurance commissioner support Rispone.\nBut I believe Louisiana is going to have limited revenue growth until we create more jobs and attract new businesses.\nHe agreed to destroy all advertisements “where you appear in a judicial robe and/or use the phrase `2019 Elect our Judge Johnson.’” Johnson’s brother, Don, is a sitting district judge."}, {"url": "https://www.wafb.com/2019/11/03/voting-polls-packed-early-voting/", "title": "Polls packed for first day of early voting", "authors": ["Donovan Jackson", "Published April", "At Pm"], "date": "2019-11-03", "keywords": ["choose", "voting", "packed", "believe", "asked", "early", "citizens", "day", "serve", "right", "vote", "american", "polls", "thats", "finkelstein"], "summary": "“They asked me to serve and I believe that’s my right to serve and that my right to vote.\nThey are American citizens and they have the right to choose as well,” said Finkelstein."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisiana-elections-2019-your-voters-guide/289-d538b36a-1350-47ef-a134-d498eaba3e8e", "title": "Voter Guide for Louisiana's 2019 Election: Everything you need to know", "authors": ["Author", "Kevin Dupuy", "Melinda Deslatte", "Associated Press", "Published", "Pm Cdt September", "Updated", "Pm Cdt October"], "date": "2019-09-30", "keywords": ["orleans", "state", "states", "guide", "term", "office", "election", "2019", "louisianas", "tax", "voter", "louisiana", "race", "ballot", "court", "need", "know"], "summary": "NEW ORLEANS — Louisiana Gov.\nYou can register online through the Louisiana Secretary of State's website or in person at the Registrar of Voter's Office or Louisiana Office of Motor Vehicles.\nArdoin worked as a top deputy in the secretary of state's office before winning the job in last year's special election.\n4: Allow New Orleans to create property tax exemptions in exchange for affordable rentsRELATED: What do Louisiana's four proposed constitutional amendments mean?\nThe secretary of state's office said 665 elected positions are on the ballot, along with 58 local propositions."}, {"url": "https://www.wafb.com/2019/11/19/find-your-team-family-feud-auditions-coming-louisiana/", "title": "Find your team, Family Feud auditions coming to Louisiana", "authors": ["Amanda Kitch", "Published At Pm"], "date": "2019-11-19", "keywords": ["selected", "family", "stand", "audition", "send", "auditions", "video", "coming", "teammates", "feud", "website", "submit", "team", "submission", "louisiana"], "summary": "To apply, submit your name, email and audition city in the online form.\nThen, send a video of you and your selected family teammates.\nThe goal is to make your family stand out during the video submission.\nLearn more about your video submission and audition in the FAQ section of the website."}, {"url": "https://www.wafb.com/2019/10/24/greater-baton-rouge-state-fair-starts-thursday-runs-through-nov/", "title": "Greater Baton Rouge State Fair to reopen Friday", "authors": ["Rachael Thomas", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-10-24", "keywords": ["yates", "rusty", "fair", "state", "travis", "studio", "greater", "day", "week", "rouge", "schedule", "band", "white", "baton", "reopen", "russell"], "summary": "There will be performances every day of the week.\nOn opening day, attendees can hear from Travis Matte & the Kingpins.\nOther performers include Old Dawgs, Studio 4 Band, Ivory White, Russell McLain, the Rusty Yates Band, Burnhouse, and MJ & the Redeemers.\nClick here for a full music schedule."}, {"url": "https://www.225batonrouge.com/things-to-do/december-2019-calendar-events", "title": "December 2019 Calendar of Events", "authors": [], "date": "2019-11-26", "keywords": ["stick", "event", "party", "events", "red", "calendar", "2019", "art", "band", "rouge", "lsu", "brings", "sound"], "summary": "Click here for our roundup of more than 20 local holiday events, shows, cocktail parties and endless shopping.\nservingsushi.comRed Stick droppingHead to Red Stick Revelry for live music and a laser light show.\nThe event begins during the day with Red Stick Rising at North Boulevard Town Square.\nAs midnight strikes, the light show will be accompanied by the ceremonial dropping of the Red Stick and a fireworks display.\nthetexasclub.comDec. 14Little Freddie King is a New Orlean blues guitarist bringing his country-inflected sound to the Red Stick at Dyson House."}, {"url": "https://www.avma.org/javma-news/2020-05-01/obituaries", "title": "Obituaries", "authors": [], "date": "2020-05-01", "keywords": ["member", "small", "state", "animal", "died", "veterinary", "2019", "medicine", "obituaries", "university", "dr"], "summary": "Prior to retirement, he was in small animal practice for several years and worked for the U.S. Department of Agriculture.\nA small animal veterinarian, he owned Camp McDonald Animal Clinic in Mount Prospect, Illinois, for 33 years.\nHe practiced small animal medicine in Indiana and Florida for 52 years.\nA past president of the Florida VMA, he served on the Florida Board of Veterinary Medicine for several years.\nA small animal veterinarian, he owned Valley Animal Hospital in Cedar Bluff and Grundy Animal Hospital in Grundy, Virginia."}, {"url": "https://www.richlandtoday.com/news/january-jobless-rate-parish", "title": "January jobless rate up in parish", "authors": [], "date": "2020-03-24", "keywords": ["jobs", "parish", "unemployment", "data", "adjusted", "2019", "rate", "seasonally", "employment", "jobless", "gained", "louisiana"], "summary": "The Richland Parish unemployment rate increased 1.5 percent in January according to figures released by the Louisiana Works Commission.\nThe jobless rate for the parish rose from 6.9 percent in December 2019 to 8.4 percent in January 2020.\nWest Carroll Parish had the states highest jobless rate at 15.4 percent.\nLouisiana’s overall unemployment rate rose from 4.9 in December 2019 to 5.7 in January.\nLouisiana’s preliminary seasonally adjusted unemployment rate for January 2020 is 5.3 percent."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["usa", "stadium", "falcons", "2020", "defensive", "linebacker", "mandatory", "moreround", "today", "options", "2019", "draft", "nov", "round", "credit"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "won", "virtually", "upfield", "participate", "team", "touches", "packers", "wants", "invites", "nfl", "draft", "super", "tons"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Ohio State running back J.K. Dobbins:What he can do– Built low to the ground at 5-9.\nCompact frame, with big, powerful legs– Tons of experience as a one-cut runner.\nWants to get upfield with initial patience following by burst–..."}, {"url": "https://www.wafb.com/2019/12/25/crime-baton-rouge-area/", "title": "Crime in the Baton Rouge area in 2019", "authors": ["Rachael Thomas"], "date": "2019-12-25", "keywords": ["wreck", "forward", "crime", "officer", "mother", "decided", "rouge", "2019", "wont", "area", "action", "baton", "death"], "summary": "Both the mother of a 1-year-old girl and a Baton Rouge police officer will not face charges after the woman’s baby was killed in a wreck back in 2017.\nThe officer, Christopher Manuel, and the child’s mother, Brittany Stephens, were both initially arrested and charged with negligent homicide after it was determined the officer was speeding at the time of the wreck and the mother had not properly restrained her child inside the vehicle.\nIn November of 2019, prosecutors decided to take no action in the case, meaning the office won’t move forward against either party.\nThe East Baton Rouge district attorney said it became a real conundrum of who was truly responsible for the girl’s death.\nSince they could not definitively prove which action really caused the baby’s death, they decided to not move forward again either the officer or the mother."}, {"url": "https://fanbuzz.com/high-school/bryan-allen-jr-recruiting/", "title": "LSU Lands Commitment From Nation’s No. 2 Safety", "authors": ["Patrick Pinak", "Brett Regan", "John Duffley", "Patrick", "About The Author", "The League", "Patrick Has Spent Parts Of The Last Four Years Covering University Of Florida Athletics", "Spent Two Seasons With Major League Baseball. He'S A Baseball Junkie Who Spends His Days Defending Derek Jeter", "The Miami Marlins. A Recent Gator Grad", "Patrick Currently Resides In Gainesville"], "date": "2020-04-09", "keywords": ["allen", "university", "safety", "defensive", "nations", "state", "texas", "aledo", "commitment", "jr", "bryan", "lands", "lsu"], "summary": "S Bryan Allen Jr.\nCommits to LSUBREAKING: The #2 Safety in the Nation, Bryan Allen Jr. has Just Committed to #LSU !\nLSU #GeauxTigers pic.twitter.com/BqZ4Idbiy1 — Bryan Allen jr (@BJThaKid04) April 9, 2020RELATED: Nation’s No.\n1 QB Announces Final 5 SchoolsFour-star safety Bryan Allen Jr. committed to LSU in April 2020, adding more firepower to LSU’s future recruiting classes.\nBryan Allen Jr."}, {"url": "https://www.wafb.com/2019/12/31/year-in-review-news-sports-crime-business-baton-rouge-area/", "title": "Year-in-review: News, sports, crime, business in the Baton Rouge area", "authors": ["Published At Pm"], "date": "2019-12-31", "keywords": ["business", "bring", "crime", "wafb", "la", "viewing", "rouge", "yearinreview", "2019", "area", "baton", "close", "share"], "summary": "BATON ROUGE, La.\n(WAFB) - As we bring 2019 to a close, WAFB would like to share the top stories in our viewing area of the last year."}, {"url": "https://www.dallasnews.com/sports/texas-longhorns/2020/04/14/texas-mock-draft-roundup-see-where-devin-duvernay-brandon-jones-and-others-are-projected-to-go-in-the-nfl-draft/", "title": "Texas mock draft roundup: See where four Longhorns are projected to go in the NFL draft", "authors": ["Alex Briseno", "Joseph Hoyt", "Catherine Marfin", "John Hancock", "Reese Oxner", "Jim Rossman"], "date": "2020-04-14", "keywords": ["johnson", "tackles", "projected", "jones", "texas", "overall", "longhorns", "longhorn", "mock", "2019", "fifth", "draft", "nfl", "roundup", "senior", "round"], "summary": "3-ranked recruiting classes in 2018 and 2019, but time will tell if Texas has fixed its struggles revolving around developing NFL talent.\nThe first Longhorn wasn’t taken until the Houston Texans selected Charles Omenihu in the fifth round with the 161st overall pick.\nOther mock drafts have Jones going anywhere between the third and fifth round, so it is tough to pinpoint exactly where he will be taken.\nWhile Duvernay’s college career took a while to take off, his senior year alone has him going anywhere between the third and fifth round.\nThe Athletic (Dane Brugler): Round 7, 217th overall by San FranciscoFind more Texas stories from The Dallas Morning News here."}, {"url": "https://www.wafb.com/2019/12/30/top-business-headlines-red-stick/", "title": "Top 2019 business headlines in the Red Stick", "authors": ["Danae Leake", "Published At Pm"], "date": "2019-12-30", "keywords": ["hargrave", "stick", "business", "showing", "video", "trickortreaters", "red", "candy", "2019", "halloween", "sign", "walkons", "thats", "headlines", "left"], "summary": "A franchise holder of a Walk-On’s in Covington had been fired after posting a racially-charged rant on Facebook about some Halloween trick-or-treaters.\nHargrave posted a video from his doorbell camera showing what appears to be several African American children helping themselves to handfuls of Halloween candy Hargrave left on his front porch.\nThat’s despite the fact Hargrave says he left a sign near the candy instructing each child to take just one piece of candy."}, {"url": "https://www.insurancejournal.com/news/southcentral/2019/12/24/552874.htm", "title": "Louisiana Adds More Jobs Year-Over-Year; Baton Rouge, Hammond MSAs Set Records", "authors": [], "date": "2019-12-24", "keywords": ["records", "rouge", "increased", "employment", "seasonally", "gained", "louisiana", "sector", "2018", "yearoveryear", "adds", "nonfarm", "jobs", "2019", "baton", "msas", "set", "adjusted", "hammond"], "summary": "Seasonally adjusted nonfarm employment increased by 9,000 jobs from 1,984,400 in November 2018 to 1,993,400 jobs in November 2019.\nSeasonally adjusted nonfarm employment has added jobs over the year the past four months.\nSeasonally adjusted nonfarm employment is at its highest level since November 2015.\nFrom October 2019, seasonally adjusted nonfarm employment increased by 4,100 jobs.\nSeasonally adjusted private sector employment increased by 10,900 jobs from 1,656,900 in November 2018 to 1,667,800 jobs in November 2019."}, {"url": "https://www.wafb.com/2019/12/03/what-do-this-holiday-season-baton-rouge/", "title": "What to do this holiday season in Baton Rouge", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-12-03", "keywords": ["law", "holiday", "firm", "season", "rouge", "vulnerable", "murphy", "giving", "baton", "masks", "face", "covid19"], "summary": "Murphy Law Firm in Baton Rouge is now giving away face masks to those must vulnerable to COVID-19."}, {"url": "https://www.businessreport.com/article/louisianas-jobless-rate-fifth-highest-in-nation", "title": "Louisiana’s jobless rate fifth highest in nation", "authors": ["Julia Arenstam"], "date": "2020-01-24", "keywords": ["roughly", "dc", "labor", "rose", "states", "unemployment", "washington", "highest", "rate", "louisianas", "fifth", "jobless", "reported", "nation"], "summary": "Louisiana’s seasonally adjusted unemployment rate for December 2019 rose to 4.9%, ranking it fifth highest among all states and Washington, D.C., according to the latest numbers from the Bureau of Labor Statistics.\nAlaska had the highest unemployment at 6.1%, followed by Mississippi (5.7), Washington, D.C., (5.3%), and West Virginia (5%).\nThe national unemployment rate was 3.5%.\nThe lowest unemployment rate was reported in South Carolina, Utah and Vermont, all at 2.3%.\nLouisiana’s December rate rose from 4.7% the month before, and 4.5% in October 2019—but was consistent with the 4.9% rate reported in December 2018."}, {"url": "https://www.225batonrouge.com/things-to-do/january-2020-calendar-events-baton-rouge", "title": "January 2020 calendar of events in Baton Rouge", "authors": [], "date": "2019-12-31", "keywords": ["theatre", "event", "2020", "local", "museum", "events", "music", "calendar", "rouge", "art", "night", "baton", "work"], "summary": "knockknockmuseum.orgJan. 11The 2020 Special Olympics State Bowling Tournament, to be held at All Star Lanes in Baton Rouge, is a one-day, state-level competition open to bowlers of multiple skill levels from across the state.\nbatonrougegallery.orgJan. 25-26Bar Crawl Unlimited comes to Baton Rouge for two bar crawl events—the Margarita Crawl and the Mimosa Crawl.\ndmae.lsu.eduMUSIC EVENTS: THIS MONTH’S BEST BETSJAN. 4New Orleans songwriter Kristin Diable’s sound comes to Baton Rouge at Dyson House Listening Room at Zeeland Street.\nlouisianastatemuseum.orgJAN. 23The Baton Rouge Symphony Orchestra presents its Mozart Birthday Bash!\nbrso.orgJAN. 27One of pop-surrealism’s top artists, Dan Quintana, hosts a lecture on his work at Baton Rouge Gallery."}, {"url": "https://www.wafb.com/2019/12/30/one-injured-shooting-near-yosemite-drive/", "title": "One injured in shooting near Byrd Drive", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-12-30", "keywords": ["condition", "provided", "scene", "officials", "drive", "person", "immediately", "emergency", "shooting", "byrd", "stable", "injured", "near", "transported"], "summary": "One person was transported from the scene.\nTheir condition was not immediately provided, however, emergency officials said they are stable."}, {"url": "https://www.bayoubrief.com/2019/12/29/these-are-the-people-and-events-that-shaped-louisiana-in-2019/", "title": "These Are the People and Events that Shaped Louisiana in 2019.", "authors": ["Lamar Is The Publisher", "Founder Of The Bayou Brief", "A Native Of Alexandria", "Louisiana", "A Graduate Of Alexandria Senior High School", "Rice University In Houston", "Smu S Dedman School Of Law In Dallas", "An Award-Winning Muckraker. He Was The Last Person Andrew Breitbart Ever Insulted", "Apologized To", "He S Responsible For Breaking A Series Of National News Stories About Racism"], "date": "2019-12-29", "keywords": ["orleans", "campaign", "edwards", "law", "state", "rispone", "events", "shaped", "insurance", "city", "2019", "trump", "louisiana"], "summary": "In Part One of this two-part series, we take inventory of the good, the bad, and the ugly of Louisiana politics in 2019.\nThat was underscored most prominently during the last month and a half of this year’s campaign season, when the president held three separate rallies in Louisiana to campaign against Edwards.\nHe’s the author of an entire casebook on Louisiana Constitutional Law, and, among other things, a law review article titled “The Dimension of Time in the Louisiana Products Liability Act.”During his eighteen-year stint as Louisiana state Treasurer, he ran for the United States Senate three times.\nFor several days, his campaign Facebook page directed people to the web domain “GoGayGovernor.com.”Most Authentic LaToya CantrellFrom left to right: Louisiana First Lady Donna Edwards, Louisiana Gov.\nThat means if Jeff Landry is ultimately successful, his efforts could be devastating for hundreds of thousands of people in Louisiana."}, {"url": "https://www.wafb.com/2019/12/12/body-found-parking-lot-medical-facility-bluebonnet/", "title": "Body found in parking lot of medical facility on Bluebonnet; no signs of trauma or foul play", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-12-12", "keywords": ["bluebonnet", "parish", "scene", "parking", "office", "trauma", "medical", "tests", "lot", "coroners", "facility", "foul", "toxicology", "say", "rouge", "body", "signs", "play"], "summary": "The East Baton Rouge Parish Coroner’s Office was called to the scene.\nOfficials from the coroner’s office say there were no obvious signs of trauma.\nToxicology tests have been ordered.\nThe man was 29-years-old."}, {"url": "https://www.wafb.com/2019/12/18/gov-edwards-says-hell-sign-state-emergency-following-severe-storms-louisiana/", "title": "Gov. Edwards says he’ll sign a state of emergency following severe storms in Louisiana", "authors": ["Published At Pm"], "date": "2019-12-18", "keywords": ["student", "state", "raise", "gov", "severe", "louisiana", "hell", "storms", "net", "sign", "emergency", "education", "following", "increase", "edwards", "higher", "teacher", "progress", "pay"], "summary": "“Education cures a lot of ills,” he said.\n“While we made good progress this year, it was the first teacher pay raise in 10 years.\nIt was the first net increase in state general funding increase for higher education in ten years and we still have one of the lowest expenditures per student in higher education in the nation.”"}, {"url": "https://www.wafb.com/2019/12/07/south-baton-rouge-christmas-parade-set-saturday-dec/", "title": "South Baton Rouge Christmas Parade set for Saturday, Dec. 7", "authors": ["Rachael Thomas", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-12-07", "keywords": ["set", "dec", "parade", "leave", "try", "rouge", "targets", "south", "nostrils", "louisianans", "longlasting", "baton", "flies", "known", "lesions", "christmas", "skin"], "summary": "Louisianans are dodging the bite of black flies known to try to crawl into their target’s ears, nostrils, or eyes, and leave long-lasting lesions on the skin."}, {"url": "https://patch.com/louisiana/baton-rouge/tornado-emergency-alexandria-louisiana-destructive-winds", "title": "Tornado Damages Homes Throughout The South: Storm Kills 3", "authors": [], "date": "2019-12-16", "keywords": ["near", "homes", "alexandria", "southern", "tornado", "storm", "kills", "damages", "damage", "issued", "central", "south", "destructive", "emergency", "louisiana"], "summary": "ALEXANDRIA, LA — A tornado ripped through the South on Monday afternoon, killing three people and causing major damage in central Louisiana, particularly in the Alexandria area.\nA tornado emergency was declared in Alexandria, Louisiana.\nLOUISIANA: Large and destructive tornado near Alexandria International Airport, moving northeast at 25 mph.\nTORNADO EMERGENCY for Alexandria.\nA tornado emergency means there is a severe threat to human life and catastrophic damage is imminent or ongoing."}, {"url": "https://www.225batonrouge.com/food-drink/baton-rouges-biggest-food-stories-2019", "title": "Baton Rouge’s biggest food stories of 2019", "authors": [], "date": "2019-12-31", "keywords": ["writer", "local", "restaurant", "rouges", "cynthea", "2019", "rouge", "food", "staff", "baton", "best", "biggest"], "summary": "Remember the days when Baton Rouge only had two breweries?\nBut staff writer Cynthea Corfah bravely volunteered to take on the assignment, and she adeptly compiled a roundup that was uber useful and still fun to read.\nChris Motto was arguably Baton Rouge’s biggest food celebrity of the year.\nAs exciting of a year as it was for new openings, we also bid sad farewells to some Baton Rouge classics.\nManaging editor Benjamin Leger explored plenty of them in his compilation of what Baton Rouge might look like in the next decade."}, {"url": "https://www.wafb.com/2019/12/13/coroner-called-out-double-shooting-north-blvd/", "title": "Two people found shot to death near North Boulevard", "authors": ["Samantha Morgan", "Published At Pm"], "date": "2019-12-13", "keywords": ["established", "boulevard", "shot", "north", "motive", "homicide", "added", "suspect", "double", "identified", "death", "near"], "summary": "They added they have not yet established a motive or identified a suspect in the double homicide."}, {"url": "https://www.wafb.com/2019/11/19/gus-young-christmas-parade-scheduled-dec/", "title": "Gus Young Christmas Parade scheduled for Dec. 14", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-11-19", "keywords": ["gus", "representatives", "local", "officials", "wafb", "la", "scheduled", "dec", "parade", "season", "rouge", "14", "young", "christmas", "ready"], "summary": "BATON ROUGE, La.\n(WAFB) - Local officials are getting ready for the holiday season after representatives announced the date of the annual Gus Young Christmas Parade."}, {"url": "https://www.businessreport.com/business/forty-under-40-2019-baton-rouge", "title": "2019 Forty Under 40", "authors": [], "date": "2019-11-20", "keywords": ["leadership", "business", "board", "st", "achievements", "foundation", "baton", "2019", "rouge", "member", "40", "louisiana"], "summary": "Supports STAR through “Hunks and Heels,” as well as the Greater Baton Rouge Food Bank and Baton Rouge Youth Coalition.\nAlso actively involved in St. Aloysius Catholic Church, and is class of 2019 graduate of Leadership Baton Rouge.\nThat experience defined my career path from that point forward.”Back to top of pageStuart Helo | 36Sector Lead, Development Advisory Services, CSRS Inc.Professional achievements:• 2019 Leadership Baton Rouge Alumni Fellow, Baton Rouge Area Chamber.\nCommunity:Volunteers with Baton Rouge Audubon Society, Louisiana Bird Observatory, Baton Rouge Christmas Bird Count, and guest lectures for the Louisiana Master Naturalist of Greater Baton Rouge.\nAdvice for futureForty Under 40 honorees:“Continue to embrace Baton Rouge and make our community better."}, {"url": "https://www.wafb.com/2019/12/15/monday-declared-lsu-football-day-louisiana/", "title": "Monday declared ‘LSU Football Day’ in Louisiana", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-12-15", "keywords": ["secretary", "award", "named", "winning", "state", "day", "coach", "tigers", "wide", "lsu", "winner", "declared", "football", "louisiana"], "summary": "A copy of the proclamation signed by Louisiana Secretary of State Kyle Ardoin lists the Tigers winning the SEC Championship game, Coach Ed Orgeron being named “Coach of the Year,” Joe Burrow being named the second Heisman winner in LSU’s history, wide receiver Ja’marr Chase receiving the Fred Biletnikoff Award, and safety Grant Delpit being presented with the Jim Thorpe Award as reasons he dedicated the day for celebrating the team’s success.\n(Source: Office of Louisiana Secretary of State)"}, {"url": "https://www.wafb.com/2019/12/24/one-adult-one-minor-injured-christmas-eve-shooting/", "title": "High school senior killed in home invasion shooting on Christmas Eve", "authors": ["Mykal Vincent", "Published At Pm"], "date": "2019-12-24", "keywords": ["unlocked", "targeted", "subdivision", "eve", "suspects", "turret", "spokesperson", "high", "signs", "killed", "shooting", "senior", "door", "sheriffs", "school", "christmas", "invasion"], "summary": "According to the East Baton Rouge Parish Sheriff’s Office, the shooting happened just before 5 a.m. on Turret Drive off Millerville Road in the Avalon subdivision.\nA spokesperson for EBRSO says suspects entered the home through the front door in a targeted attack.\nOfficials say there were no signs of forced entry; the front door was possible unlocked."}, {"url": "https://www.wafb.com/2019/12/03/teen-boy-dies-ottawa-drive-shooting-arrested-suspects-still-large/", "title": "3 arrested after teen boy shot, killed walking home from school", "authors": ["Kevin Foster", "Rachael Thomas", "Published At Pm"], "date": "2019-12-03", "keywords": ["booked", "weapon", "teen", "walking", "seconddegree", "principale", "parish", "suspects", "shot", "jeffrey", "arrested", "killed", "juvenile", "prison", "school", "boy", "murder"], "summary": "The two juvenile suspects have been booked into juvenile detention.\nJeffrey faces a charge of principale to second-degree murder among other charges.\nDavaughn was booked into the parish prison on one count of second-degree murder and illegal use of a weapon."}, {"url": "https://www.businessreport.com/newsletters/year-in-review-baton-rouge-restaurant-closures-in-2019", "title": "Year in review: Baton Rouge restaurant closures in 2019", "authors": ["Caitie Burkes"], "date": "2019-12-23", "keywords": ["closures", "restaurant", "replaced", "boulevard", "drive", "perkins", "road", "lee", "rouge", "2019", "review", "grill", "baton", "street", "sherwood"], "summary": "The Baton Rouge area saw at least a couple dozen restaurant closures throughout 2019, according to Daily Report archives.\nWhen it comes to searching for any sort of pattern behind the closings, there doesn’t appear to be one.\nWhile most are permanent, some—like Krispy Kreme and Ralph & Kacoo’s–are said to be temporary.\nAnd while some locations seem particularly troubled, such as the Lee Drive retail center near LSU that saw three permanent closures in the past year, “closing” signs were generally spread throughout Baton Rouge.\nSome shuttered concepts have already been replaced, and some haven’t."}, {"url": "https://www.wafb.com/2019/12/03/st-george-fire-department-parade-santa-claus-through-your-neighborhood-firetruck/", "title": "Annual Christmas parade with St. George Fire Department set for two weekends in December", "authors": ["Rachael Thomas", "Published April", "At Pm", "At Am"], "date": "2019-12-03", "keywords": ["vincent", "george", "st", "set", "weekends", "donations", "vehicle", "parade", "annual", "unwrapped", "food", "underprivileged", "department", "paul", "christmas", "collect"], "summary": "Once again, the St. George Fire Department is partnering with St. Vincent de Paul to collect food for those in need.\nA vehicle with the organization will follow behind the firetruck to collect food, as well as new, unwrapped toys for underprivileged kids.\nDonations of new toiletries and grooming supplies will also be accepted.\nDonations can also be made at each St. George fire station.\nIf you prefer to make a financial donation, checks should be made payable to St. Vincent de Paul."}, {"url": "https://www.wafb.com/2019/11/30/first-alert-forecast-lower-risk-severe-weather-late-tonight/", "title": "FIRST ALERT FORECAST: Colder temperatures return for the new week", "authors": ["Jeff Morrow", "Published April", "At Am", "At Pm"], "date": "2019-11-30", "keywords": ["weekend", "forecast", "spc", "wafb", "alert", "storms", "colder", "temperatures", "risk", "viewing", "storm", "week", "slight", "weather", "return", "upped"], "summary": "Rain continues to be a main weather story for the weekend and the NWS Storm Prediction Center (SPC) has upped the ante by posting a Slight Risk to an Enhanced Risk for severe storms Sunday across the WAFB viewing area."}, {"url": "https://www.wafb.com/2019/12/23/state-police-preparing-record-number-travelers-la-roads/", "title": "More Americans traveling for the holidays than ever", "authors": ["Matt Houston", "Published March", "At Pm", "At Am", "Published February"], "date": "2019-12-23", "keywords": ["holidays", "state", "traveling", "road", "watch", "officers", "americans", "troopers", "season", "indicated", "lsp", "speed", "louisiana"], "summary": "Louisiana State Police troopers are on high alert this holiday season, though there will not be more officers on the road.\nDrivers should expect more DWI checkpoints, and LSP also indicated it will watch carefully for people who decide to speed as well."}, {"url": "https://www.wafb.com/2019/12/23/baton-rouge-ring-with-annual-red-stick-revelry/", "title": "Baton Rouge rang in 2020 with annual Red Stick Revelry", "authors": ["Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-12-23", "keywords": ["stick", "2020", "revelry", "annual", "red", "try", "leave", "rouge", "targets", "nostrils", "louisianans", "longlasting", "flies", "baton", "rang", "known", "lesions", "skin"], "summary": "Louisianans are dodging the bite of black flies known to try to crawl into their target’s ears, nostrils, or eyes, and leave long-lasting lesions on the skin."}, {"url": "https://www.wafb.com/2019/12/04/la-governor-first-lady-announce-inauguration-plans/", "title": "Gov. Edwards will not hold inaugural ball the same day as National Championship game", "authors": ["Rachael Thomas", "Published April", "At Pm"], "date": "2019-12-04", "keywords": ["st", "championship", "gov", "seating", "swearinin", "mass", "game", "inaugural", "hold", "capitol", "national", "standing", "ball", "day", "public", "edwards", "watch", "morning", "room"], "summary": "The morning will begin with an invitation-only mass at St. Joseph’s Cathedral.\nAfter the mass, the governor and first lady will head to the capitol building for the swearin-in.\nLimited seating is available, but the public will have access to standing room on the Capitol Grounds to watch the ceremony."}, {"url": "https://www.businessreport.com/newsletters/hancock-whitney-sells-baton-rouge-locations-to-bancorpsouth-south-louisiana-bank", "title": "Hancock Whitney sells Baton Rouge locations to BancorpSouth, South Louisiana Bank", "authors": ["Caitie Burkes"], "date": "2019-12-02", "keywords": ["sells", "locations", "filed", "branch", "bank", "rouge", "south", "banks", "hancock", "whitney", "baton", "million", "bancorpsouth", "louisiana"], "summary": "The locations of two shuttered Hancock Whitney-owned banks have been scooped up by BancorpSouth Bank and South Louisiana Bank in separate sales that closed last week, according to records filed with the East Baton Rouge Parish Clerk of Court’s office.\nIn a deal filed Tuesday, Mississippi-based BancorpSouth Bank purchased the former MidSouth Bank branch on the corner of Siegen Lane and Industriplex Boulevard for almost $2.3 million, or $884 per square foot.\nMeanwhile, Hancock Whitney also sold its former branch located near the intersection of Highland Road and Lee Drive to the Houma-based South Louisiana Bank for $500,000, or $208 per square foot, signifying the bank’s entrance into the Baton Rouge market.\nWith $412 million in deposits across its seven branches in Lafayette, Lafourche and Terrebonne parishes, South Louisiana Bank currently holds 0.39% of the statewide market share.\nThe deals come as Baton Rouge banks continue to ride a nationally triggered consolidation wave that’s been marked by a flurry of mergers and acquisitions in the local market over the past several decades."}, {"url": "https://www.wafb.com/2020/01/07/man-arrested-stabbing-jade-avenue/", "title": "Man arrested in stabbing on Jade Avenue", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2020-01-07", "keywords": ["man", "digital", "hospital", "image", "positively", "arrested", "spoke", "stabbing", "jade", "stabbed", "witnesses", "avenue", "identify", "victim"], "summary": "Detectives spoke to several witnesses at the hospital who were able to positively identify a digital image of Delcid-Solis as the man who stabbed the victim."}, {"url": "https://www.businessreport.com/newsletters/visit-baton-rouge-approves-nearly-5-45m-budget-for-2020", "title": "Visit Baton Rouge approves nearly $5.45M budget for 2020", "authors": ["Caitie Burkes"], "date": "2019-12-12", "keywords": ["budget", "nearly", "2020", "545m", "visit", "local", "arrigo", "approves", "rouge", "2019", "million", "tax", "soccer", "baton"], "summary": "The Visit Baton Rouge board of directors on Thursday unanimously passed a $5.45 million budget for 2020, a 1% increase over the original 2019 budget.\nThe agency plans to spend approximately $5.77 million in 2020, up 6% from the $5.41 million spent this year.\nPlans call for spending some $3.1 million on promotions, nearly $2 million on personnel and $703,000 on administrative costs.\nVisit Baton Rouge is funded through a share of the local hotel occupancy tax, from which it has collected some $4.3 million throughout the first nine months of 2019—a 14% increase from the same time last year.\nHowever, he doesn’t expect 2020 to bring Baton Rouge as much in revenues."}, {"url": "https://www.wafb.com/2019/12/29/brecs-baton-rouge-zoo-welcomes-baby-giraffe/", "title": "BREC’S Baton Rouge Zoo welcomes baby giraffe", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-12-29", "keywords": ["lead", "care", "welcomes", "good", "weeks", "mother", "expert", "rouge", "supervision", "zoo", "outcomes", "baton", "giraffe", "baby", "hopefully", "brecs"], "summary": "“Our keeper, curator & veterinary staff are incredibly skilled and are monitoring the mother and calf closely.\nThis expert care and supervision will hopefully lead to good outcomes,” said Zoo Director Phil Frost, noting the mortality rate for giraffes ages 6 months and under is nearly 50%.\n“This expert care and supervision will hopefully lead to good outcomes.\nWith a first-time mother, the progress over the coming few days & weeks will be crucial.”"}, {"url": "https://www.wafb.com/2019/12/10/trisha-yearwood-perform-with-baton-rouge-symphony-march/", "title": "Trisha Yearwood to perform with Baton Rouge Symphony this weekend", "authors": ["Mykal Vincent", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-12-10", "keywords": ["weekend", "2020", "river", "symphony", "raising", "w", "performer", "pennington", "rouge", "baton", "trisha", "timothy", "perform", "yearwood"], "summary": "Yearwood will appear as the 2020 Irene W. and C. B. Pennington Foundation Great Performer in Concert with the Baton Rouge Symphony under the direction of Timothy Muffitt on Saturday, March 7, 2020 at 8 p.m. at the Raising Cane’s River Center Arena."}, {"url": "https://www.businessreport.com/article/louisiana-shed-7000-construction-jobs-in-2019", "title": "Louisiana shed 7,000 construction jobs in 2019", "authors": ["Caitie Burkes"], "date": "2020-01-24", "keywords": ["lost", "jobs", "months", "shed", "7000", "states", "washington", "terms", "2019", "past", "employment", "construction", "louisiana"], "summary": "Louisiana has lost 7,000 construction jobs over the past 12 months, according to seasonally adjusted data released today by the Associated General Contractors of America, reflecting a 4.8% decline in construction employment throughout 2019.\nAdditionally, the 7,000 jobs lost was second highest in the country, after Ohio, which lost 9,000.\nOverall, Louisiana was among 16 states to lose construction jobs in 2019.\nThe latest figures come as construction employment has increased in 34 states and Washington, D.C., over the past 12 months, while 29 states added construction jobs in December.\nMeanwhile, Maine saw the highest percentage increase of construction jobs, with an 11.5% uptick."}, {"url": "https://www.wafb.com/2019/12/23/no-trash-services-scheduled-christmas-day-baton-rouge/", "title": "Trash services back on schedule after holiday", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2019-12-23", "keywords": ["27", "doesnt", "holiday", "dec", "workers", "leave", "picked", "rounds", "schedule", "say", "trash", "lot", "sanitation", "services"], "summary": "Sanitation workers have a lot of rounds to make, so if yours doesn’t get picked up by Thursday, they say to leave it out for Friday, Dec. 27."}, {"url": "https://www.wafb.com/2019/12/25/look-most-talked-about-stories/", "title": "The most talked about stories of 2019", "authors": ["Mykal Vincent", "Published At Pm"], "date": "2019-12-25", "keywords": ["secret", "viewers", "statistics", "theres", "smiles", "2019", "shared", "talked", "science", "wrap", "yearend"], "summary": "There you have it, folks.\nA year-end wrap up of the stories you loved, liked, commented, and shared the most in 2019.\nThere’s no secret or science here, just statistics.\nThese stories brought the most smiles, the most joy, and maybe a little heartache (lookin’ at you, NFL referees), to our viewers, our fans, our followers, our friends, and our families in 2019."}, {"url": "https://www.wafb.com/2019/12/07/bicyclist-reportedly-struck-killed-siegen-lane-near-airline-highway/", "title": "Bicyclist struck, killed on Siegen Lane near Airline Highway", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-12-07", "keywords": ["highway", "source", "parish", "struck", "respond", "vehicle", "office", "rouge", "killed", "airline", "wave", "siegen", "lane", "bicyclist", "near"], "summary": "The East Baton Rouge Parish Coroner’s Office has been called to respond to a fatal collision involving a vehicle and bicyclist near the intersection of Airline Highway and Siegen Lane Saturday, Dec. 7.\n(Source: WAVE 3 News)"}, {"url": "https://www.wafb.com/2019/12/12/port-allens-christmas-court-street-kicks-off-friday/", "title": "Port Allen’s Christmas on Court Street kicks off Friday", "authors": ["Wafb Staff", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-12-12", "keywords": ["port", "kicks", "leave", "try", "louisianans", "targets", "nostrils", "flies", "longlasting", "allens", "street", "known", "lesions", "christmas", "court", "skin"], "summary": "Louisianans are dodging the bite of black flies known to try to crawl into their target’s ears, nostrils, or eyes, and leave long-lasting lesions on the skin."}, {"url": "https://www.wafb.com/2019/12/25/notable-deaths/", "title": "Notable deaths of 2019", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2019-12-25", "keywords": ["faith", "family", "words", "knew", "deaths", "woman", "2019", "lives", "wish", "love", "governor", "notable", "louisiana"], "summary": "“She was a woman of grace, faith and hope.\nShe has left an eternal mark on all who knew her because she was generous and unconditional in her love, warm in her embrace and genuinely interested in the welfare of others.\nWhile she knew that her name would forever be linked with Hurricanes Katrina and Rita, it was her dying wish that she be remembered for her faith in God, commitment to family and love of Louisiana.\nAs Louisiana’s first female governor, her prestigious career cannot be separated from her faith and family — all are intertwined.\nPlease pray for God’s peace to carry us through the coming days and months of sorrow as we mourn her absence from our lives,” Louisiana Governor John Bel Edwards said of Blanco’s passing on Aug. 18."}, {"url": "https://www.225batonrouge.com/things-to-do/november-2019-calendar-events", "title": "November 2019 Calendar of Events", "authors": [], "date": "2019-11-01", "keywords": ["theatre", "local", "festival", "events", "holiday", "music", "calendar", "rouge", "2019", "night", "live", "lsu", "baton"], "summary": "Nov. 1-3• The Greater Baton Rouge State Fair began in 1965 when two existing Baton Rouge Jaycee Projects—a trade show and a carnival—were combined.\nThe annual, free gathering of readers, writers and their books has activities for all ages, including live music, cooking demos, book talks, signings and more.\nthemarketbr.comNov. 11-23The second Sweet Baton Rouge Holiday Local Pop Up Shop at Perkins Rowe will showcase Louisiana makers.\nNov. 2The open-air Baton Rouge Arts Market returns alongside the Red Stick Farmers Market downtown.\nAs the former SGA president at Southern University, Banner is now a rapper, actor and activist, returning to Baton Rouge for SU’s homecoming weekend."}, {"url": "https://www.225batonrouge.com/food-drink/best-225-week-festival-lights-zoos-holiday-decorations-baton-rouge-weekend", "title": "Best of 225 This Week: Festival of Lights, the zoo’s holiday decorations and more in Baton Rouge this weekend", "authors": [], "date": "2019-12-05", "keywords": ["weekend", "theatre", "event", "lights", "decorations", "zoos", "festival", "holiday", "dec", "baton", "week", "rouge", "glass", "zoo", "best", "louisiana"], "summary": "Enjoy yourself at the Trees of Light Gala this ThursdayThis Thursday, Dec. 5, the Trees of Light Gala at the Hilton Baton Rouge Capitol Center will have food, drinks and the band Tip Tops, 6:30-10:30 p.m.\nHosted by The Hospice of Baton Rouge, the fundraiser will raise money for end-of-life care, palliative care and other resources for the greater Baton Rouge area and surrounding parishes.\nThe Hilton Baton Rouge Capitol Center is at 201 Lafayette St.See dozens of holiday decorations at the Baton Rouge Zoo this FridayThis Friday, Dec. 6, the Zoo Lights event at BREC’s Baton Rouge Zoo will have more than 50 lit-up holiday decorations.\nWalk the trail at the zoo and see all the festive displays 5:30-9 p.m.Tickets are $5 for adults.\nBREC’s Baton Rouge Zoo is at 3601 Thomas Road."}, {"url": "https://www.wafb.com/2019/12/27/brpd-investigating-body-found-off-convention-street/", "title": "BRPD: Cases of 3 homeless people shot, killed likely connected", "authors": ["Rachael Thomas", "Lester Duhé", "Published At Pm"], "date": "2019-12-27", "keywords": ["brpd", "urgent", "cases", "search", "shot", "provide", "providing", "connected", "killed", "nature", "community", "likely", "doing", "shelter", "ensuring", "somebody", "homeless"], "summary": "“The beds that we can provide to the community are always of urgent nature and certainly now even more so, and so we’re doing the best we can with what we have available in ensuring if somebody comes to us in search of shelter, we’re providing that to them,” said Acaldo."}, {"url": "https://www.wafb.com/2019/12/07/paramedics-responding-patient-shot-howell-park/", "title": "Arrest made after man killed in apparent robbery at Howell Park", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-12-07", "keywords": ["park", "apparent", "man", "secretary", "ground", "shawn", "wilson", "halt", "road", "howell", "killed", "outbreak", "robbery", "speeding", "work", "arrest", "thing"], "summary": "While just about everything has ground to a halt amid the coronavirus outbreak, some road work is actually speeding ahead.\nDOTD Secretary, Dr. Shawn Wilson says it is a good thing for their crews."}, {"url": "https://www.wafb.com/2019/12/29/one-killed-second-person-shot-head-st-gabriel/", "title": "Two killed in St. Gabriel; Baton Rouge man charged", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-12-29", "keywords": ["near", "man", "ag", "highway", "gabriel", "st", "scene", "officials", "vehicle", "road", "discovered", "emergency", "rouge", "killed", "lsu", "baton", "charged"], "summary": "Emergency officials were called to a scene over on LSU Ag Road off of Highway 30 at around 9:40 pm.\nAuthorities discovered a vehicle at the scene near an LSU AgCenter building in the 5900 block of LSU Ag Road, emergency officials said."}, {"url": "https://www.wafb.com/2019/12/26/seven-news-investigations/", "title": "9News investigations in 2019", "authors": ["Kevin Foster", "Published At Pm"], "date": "2019-12-26", "keywords": ["investigations", "united", "state", "voters", "states", "serving", "received", "2019", "reelection", "clear", "9news", "secure", "louisiana"], "summary": "“I have always been committed to fair, accurate and secure elections.\nIt is crystal clear that no law was broken by me campaigning for reelection at an event where I received the endorsement of the President of the United States.\nWhat is also clear is that an overwhelming majority of Louisiana voters believe in the job we are doing, and I am excited about four more years of serving the great state of Louisiana.”"}, {"url": "https://www.wafb.com/2019/12/13/one-person-reportedly-shot-new-rafe-mayer-road-off-scenic-highway/", "title": "Victims fight back, fatally shoot alleged home intruder, armed robber off of Scenic Highway", "authors": ["Rachael Thomas", "Published At Pm"], "date": "2019-12-13", "keywords": ["victims", "highway", "shoot", "herman", "rouge", "say", "money", "office", "hills", "armed", "sheriffs", "officials", "alleged", "intruder", "scenic", "robber", "fight", "parish", "inside", "fatally"], "summary": "According to the East Baton Rouge Parish Sheriff’s Office, Herman Hills, 44, allegedly entered a home and demanded money while armed with a handgun.\nOfficials say the people inside the home attempted to take the gun away from Hills and an altercation ensued."}, {"url": "https://www.leesvilledailyleader.com/news/20191205/ascension-parish-news-briefs", "title": "Ascension Parish News Briefs", "authors": [], "date": "2019-12-05", "keywords": ["ascension", "parish", "game", "parade", "library", "2019", "rouge", "route", "program", "christmas", "briefs"], "summary": "Library ClosingsThe Ascension Parish Library will be closed Friday, December 6, 2019 for a parish wide staff meeting.\nTake a breather at our Pop-Up Café at the Ascension Parish Library in Galvez.\nPlease call the Ascension Parish Library in Galvez at 622-3339 for more information.\nThe holiday season is finally here, and that means it is time for one of our favorite traditions: Cookie Swap at Ascension Parish Library in Donaldsonville.\nTo register or for more information on this program, please contact the Ascension Parish Library in Galvez at 622-3339."}, {"url": "https://www.wafb.com/2019/12/21/man-stabbed-death-inside-baton-rouge-nightclub/", "title": "Man stabbed to death inside Baton Rouge nightclub", "authors": ["Wafb Staff", "Published At Pm"], "date": "2019-12-21", "keywords": ["man", "physical", "inside", "nightclub", "club", "payne", "stabbed", "rouge", "say", "night", "fondrell", "involved", "baton", "death", "altercation"], "summary": "Police say Fondrell Payne, 31, was inside the night club and involved in a physical altercation.\nDuring the altercation, Payne was stabbed in the chest."}, {"url": "https://www.wafb.com/2019/12/08/this-date-history-snow-day/", "title": "This Date in History: 2017 Snow Day", "authors": ["Zack Fradella", "Published At Pm"], "date": "2019-12-08", "keywords": ["history", "date", "snow", "shore", "positioned", "2017", "parishes", "day", "north", "starting", "multiple", "rouge", "river", "near"], "summary": "On December 8, 2017 multiple inches of snow fell along the I-10 corridor starting near Lake Charles and continuing across the Baton Rouge area.\nThe band of snow then positioned itself from the River parishes extending to much of the North Shore."}, {"url": "https://www.wafb.com/2019/12/02/south-baton-rouge-christmas-parade-scheduled-released/", "title": "Organizers to collect donations to buy toys during South Baton Rouge Christmas Parade", "authors": ["Wafb Staff", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-12-02", "keywords": ["types", "helping", "donations", "holiday", "view", "rouge", "organizers", "christmas", "seeking", "using", "series", "buy", "hands", "south", "baton", "collect", "send", "parade", "subject", "toys"], "summary": "If your organization is seeking donations for the holiday season and would like to be a part of our “Holiday Helping Hands” series, please send an email to holidayhelpinghands@wafb.com with the subject line ‘Holiday Helping Hands.’ View the types of stories we cover by using the link here."}, {"url": "https://vegasinc.lasvegassun.com/business/gaming/2019/dec/25/louisiana-oks-1st-riverboat-casino-request-to-move/", "title": "Louisiana OK’s 1st riverboat casino request to move to land", "authors": ["Associated Press"], "date": "2019-12-25", "keywords": ["casino", "riverboat", "oks", "gambling", "nearly", "request", "1st", "riverboats", "million", "lake", "land", "resorts", "louisiana"], "summary": "Louisiana OK’s 1st riverboat casino request to move to landBATON ROUGE, La.\n— Louisiana approved its first application to move a riverboat casino to land.\nEldorado Resorts plans a new $112.7 million casino between the parking lot and hotel for the Isle of Capri riverboat in Westlake, The Advocate of Baton Rouge reported.\nThe new casino approved last week will be nearly triple the size of the riverboat.\nEconomists estimated the previous week that this fiscal year's riverboat casino revenues would be down $8.6 million to $12.8 million from last year's."}, {"url": "https://www.businessreport.com/newsletters/havertys-to-open-friday-near-mall-of-louisiana", "title": "Havertys to open Friday near Mall of Louisiana", "authors": ["Holly Duchmann"], "date": "2019-12-19", "keywords": ["highway", "sale", "bluebonnet", "space", "set", "open", "mall", "square", "airline", "parc", "havertys", "price", "near", "louisiana"], "summary": "After moving out of its longtime space on Airline Highway near Cortana Mall, Havertys Furniture is set to open the doors of its new home near the Mall of Louisiana on Friday.\nRenovations on the space, formerly occupied by Home Furniture Plus bedding, began in July and cost $1.23 million.\nHavertys sold its 42,000-square-foot Airline Highway property to Vivid Ink in a $2.25 million deal that closed late February and moved out of the space in the fall.\nThe opening is the latest tenant shake-up in Bluebonnet Parc, which has seen a fair amount of activity this year.\nCincinnati-based Viking Partners, which bought Bluebonnet Parc for $21 million in late 2013, listed the center for sale online though it didn’t set a listing price, saying “the market will determine the sale price.”"}, {"url": "https://www.bleedinggreennation.com/2020/4/16/21223348/nfl-mock-draft-2020-philadelphia-eagles-justin-jefferson-first-round-pick-lsu-wide-receiver-sbnation", "title": "NFL Mock Draft 2020: Making the case for Justin Jefferson as the Eagles’ pick", "authors": ["Brandon Lee Gowton", "Apr"], "date": "2020-04-16", "keywords": ["2020", "case", "think", "slot", "good", "jefferson", "mock", "making", "eagles", "draft", "nfl", "receiver", "21", "wide", "pick", "justin"], "summary": "Jokes aside, this Jefferson article is specifically prompted by my pick in the annual SB Nation NFL writers mock draft.\nThere are rarely sure things in the draft, but Jefferson feels like an especially reasonable bet.\nI think Jefferson is the fourth-best wide receiver in the draft, and the 14th-best player overall.\nAnd that’s important for an Eagles team that desperately needs to upgrade their wide receiver situation.\nPhilly used three wide receiver sets at the seventh highest frequency back during the Eagles’ Super Bowl season in 2017."}, {"url": "https://www.wafb.com/2019/12/16/tornado-watch-issued-southeast-louisiana-southwest-mississippi-until-pm/", "title": "National Weather Service upgrades tornado that tore through Amite County to EF-3", "authors": ["Wafb Staff", "Published April", "At Am", "At Pm"], "date": "2019-12-16", "keywords": ["county", "amite", "tornado", "ef3", "discussing", "power", "restored", "service", "weeks", "weather", "destroyed", "national", "days", "tore", "falling", "mccurley", "upgrades", "trees", "infrastructure"], "summary": "“The power company’s infrastructure was destroyed with the trees falling, and it could be anywhere from two to three days to a couple of weeks,” said McCurley discussing when the power could be restored in the area."}, {"url": "https://www.225batonrouge.com/food-drink/hot-new-restaurants", "title": "Baton Rouge’s biggest restaurant openings of the past year", "authors": [], "date": "2019-11-29", "keywords": ["225", "restaurants", "looks", "local", "restaurant", "openings", "rouges", "scene", "great", "worthy", "past", "rouge", "food", "baton", "spots", "biggest"], "summary": "After years of watching our local dining scene evolve, we felt it deserved its own year-end retrospective, immortalized forever in print.\nHow we narrowed the restaurantsWe placed the most emphasis on first-time, full-service openings that launched between October 2018 and October 2019.\nThe Baton Rouge bar scene is also booming more than everGet more food news!\nWe’re admittedly a little biased, but there’s really no better source for local food news than our e-newsletter, 225 Dine.\nSubscribe for exclusive first looks inside new restaurants, chef interviews, restaurant reviews, event previews and more at 225batonrouge.com/food."}, {"url": "https://www.wafb.com/2019/12/20/santas-road-show-free-toy-giveaway-scheduled-saturday-dec/", "title": "Santa’s Road Show free toy giveaway scheduled for Saturday, Dec. 21", "authors": ["Rachael Thomas", "Published April", "At Pm", "At Am"], "date": "2019-12-20", "keywords": ["registration", "park", "gus", "located", "santas", "scheduled", "dec", "road", "starting", "giveaway", "21", "free", "young", "program", "toy", "held"], "summary": "The free toy giveaway will be held at the Gus Young BREC Park, located at 4200 Gus Young Ave.\nRegistration is from 10:30 to 11:30 a.m., with the program starting at 12 p.m."}, {"url": "https://www.wafb.com/2019/12/30/first-alert-forecast-beautifil-weather-new-years-eve/", "title": "FIRST ALERT FORECAST: Beautiful, but chilly weather for New Year’s Eve; next rainmaker arrives Thurs.", "authors": ["Jay Grymes", "Published April", "At Am", "At Pm"], "date": "2019-12-30", "keywords": ["forecast", "slowly", "showers", "rouge", "arrives", "alert", "weather", "cloudy", "upper", "eve", "chilly", "clouds", "afternoon", "skies", "thurs", "beautiful", "temperatures", "rainmaker", "rise"], "summary": "Clouds will slowly increase through Wednesday (New Year’s Day).\nBaton Rouge daybreak temperatures will be in the upper 30s to around 40° under partly cloudy skies, with skies becoming mostly cloudy for the afternoon.\nEven with the clouds, afternoon temperatures will climb to around 60° or so.\nA few showers will develop after dark Wednesday evening, with rain chances on the rise into Thursday morning."}, {"url": "https://www.wafb.com/2019/11/22/holiday-lights-baton-rouge-general-returns-with-new-event-more-lights-than-ever/", "title": "Holiday Lights at Baton Rouge General returns with new event, more lights than ever", "authors": ["Rachael Thomas", "Published Am At Am", "Published April", "At Pm", "At Am"], "date": "2019-11-22", "keywords": ["spot", "youre", "safe", "general", "returns", "event", "lights", "way", "holiday", "rouge", "season", "spreading", "baton", "tenreiro", "strolling", "weve"], "summary": "“Everything you enjoyed about last year’s display is back, plus we’ve added new elements to make it bigger and brighter.\nWhether you’re driving by or strolling through, Holiday Lights is our way of spreading a little holiday cheer to the community.\nAnd the free family night events give families a safe, convenient spot to celebrate the season,” said Edgardo Tenreiro, CEO of BRG."}, {"url": "https://www.wafb.com/2019/12/02/baton-rouge-teen-killed-crash-i-/", "title": "Baton Rouge teen killed in crash on I-55", "authors": ["Nick Gremillion", "Published At Pm"], "date": "2019-12-02", "keywords": ["crash", "properly", "teen", "juarez", "investigators", "state", "restrained", "impaired", "rouge", "killed", "say", "baton", "i55", "driver", "know"], "summary": "State police say Juarez was not properly restrained and died in the crash.\nInvestigators do not know if either driver was impaired at the time of the crash."}, {"url": "https://www.maxpreps.com/news/P5DoCriFRUubwPTiE8j0Lw/2019-louisiana-high-school-football-playoff-brackets-and-scores--st-james-dominates-class-3a-state-title-game.htm", "title": "2019 Louisiana high school football playoff brackets and scores: St. James dominates Class 3A state title game", "authors": ["Dean Backes"], "date": "2019-12-15", "keywords": ["weekend", "title", "st", "james", "state", "game", "class", "high", "season", "win", "christian", "victory", "school", "scores", "division", "playoff", "louisiana"], "summary": "The Louisiana high school football season came to a close this weekend with six state championship games.\nIn Class 3A, St. James (15-0) rolled past Jennings (9-6) 51-14 for its first state title since 1979.\nThe Eagles won their fifth state title of the 2000s and first since 2014.\nThe first of three games on Saturday saw Oak Grove (11-3) put together a dominant 55-12 victory over White Castle (9-4) in the Non-Select Class 1A title game.\nThe Class 5A title game saw Acadiana (15-0) win a defensive battle 8-3 over Destrehan (11-4) in the final game of the year in the Bayou State."}, {"url": "https://www.fox8live.com/2020/01/21/suspects-wanted-counterfeit-currency-cases-east-baton-rouge-parish/", "title": "8 suspects wanted in counterfeit currency cases in East Baton Rouge Parish", "authors": ["Wafb Staff", "Published At Pm", "Published At Am"], "date": "2020-01-21", "keywords": ["numbers", "parish", "cases", "case", "suspects", "state", "cavid19", "5000", "jefferson", "deaths", "rouge", "released", "baton", "reported", "wanted", "east", "counterfeit", "currency"], "summary": "More than 5,000 case of CAVID-19 and 261 deaths in Jefferson Parish were reported on Thursday as new numbers were released by the state."}, {"url": "https://www.wafb.com/2019/12/16/one-dead-one-critical-following-wreck-i-/", "title": "One dead, one critical following wreck on I-110", "authors": ["Mykal Vincent", "Published At Pm"], "date": "2019-12-16", "keywords": ["wreck", "belt", "local", "dead", "seat", "scene", "taken", "moderate", "passenger", "walker", "say", "wearing", "i110", "following", "critical"], "summary": "The passenger, Kewin Walker Jr., 29, died on scene.\nPolice say he was not wearing his seat belt.\nThe 43-year-old driver was taken to a local hospital with moderate injuries.\nPolice say he was wearing his seat belt."}, {"url": "https://www.katc.com/news/covering-louisiana/brecs-baton-rouge-zoo-welcomes-baby-reticulated-giraffe", "title": "BREC's Baton Rouge Zoo welcomes baby reticulated giraffe", "authors": [], "date": "2019-12-30", "keywords": ["wild", "calf", "welcomes", "zoos", "rouge", "zoo", "according", "baton", "born", "giraffe", "baby", "reticulated", "brecs"], "summary": "BREC's Baton Rouge Zoo has welcomed a new baby reticulated giraffe to their herd.\nOn Thursday, December 26, the zoo says a male calf was born to 6-year-old Rosie and 13-year-old Rowan.\nThe new baby is Rosie's first and is the 20th giraffe born at the Baton Rouge Zoo, according to a Facebook post.\nThe last successful giraffe birth took place at the zoo in 2001.\nReticulated giraffes, according to the zoo, are considered endangered in the wild due to human poaching and encroachment."}, {"url": "https://www.wafb.com/2019/12/24/look-back-years-since-exxon-explosion-baton-rouge/", "title": "A LOOK BACK: 30 years since Exxon explosion in Baton Rouge", "authors": ["Graham Ulkins", "Published At Pm"], "date": "2019-12-24", "keywords": ["theyre", "explosion", "things", "30", "spokesman", "way", "train", "teams", "look", "rouge", "training", "say", "baton", "unfortunate", "exxon", "prepared"], "summary": "“This was an unfortunate incident, but the things that come out of it was the way we do our training now.\nExxonMobil is a partner.\nWe’re a municipal, they’re industrial, but we train together, and through our partnerships, we have one of the best teams, and we’re prepared better than I would say most people are in the country,” said BRFD spokesman, Curt Monte."}]