[{"url": "https://www.yourcentralvalley.com/online-only/behind-the-story-the-downtown-fresno-shootings/", "title": "Behind the Story: The Downtown Fresno shootings", "authors": ["Troy Pope", "Dennis Valera", "Yourcentralvalley.Com Staff", "Justin Walker"], "date": "2020-03-17", "keywords": ["downtown", "killed", "muhammad", "shooting", "shot", "fresno", "dyer", "motel", "killing", "williams", "shootings"], "summary": "FRESNO, California (KGPE) – Next month will mark the third anniversary of the Downtown Fresno shooting spree during which three men lost their lives at the hands of a man who told us he killed them because he was angry at white men.\nThe April 18, 2017 killingsThree men, who authorities say were targeted for their race and gender, were gunned down in a shooting spree in Downtown Fresno.\nCaught in the middleGregory Woods, who was a reporter for CBS47 in 2017, was already at Fresno Police Headquarters in Downtown Fresno at the time of the shootings.\nJerry Dyer, Former Fresno Police ChiefA former classmate of Muhammad’s worked at CBS47 at the time of the shootings.\nCarl Williams’ sister, Ashley, told us by phone the family was at the funeral home making arrangements when they heard about the shootings near Downtown Fresno."}, {"url": "https://www.politico.com/newsletters/california-playbook/2020/03/18/bombshell-schools-may-not-reopen-till-fall-newsom-says-duncan-hunter-gets-11-year-sentence-ca-close-to-securing-two-large-hospitals-facebooks-100-million-for-small-biz-pelosi-vs-trump-mcclintock-votes-against-coronavirus-bill-488617", "title": "BOMBSHELL: Schools may not reopen till fall, NEWSOM says — DUNCAN HUNTER gets 11-month sentence — CA close to securing two large hospitals — FACEBOOK’s $100M for small biz — PELOSI vs. TRUMP — McCLINT", "authors": ["Follow Us On Twitter"], "date": "2020-03-18", "keywords": ["securing", "newsom", "vs", "state", "president", "sentence", "till", "reopen", "coronavirus", "la", "hospitals", "schools", "pelosi", "politicos", "small", "california", "trump"], "summary": "BOMBSHELL: Schools may not reopen till fall, NEWSOM says — DUNCAN HUNTER gets 11-month sentence — CA close to securing two large hospitals — FACEBOOK’s $100M for small biz — PELOSI vs. TRUMP — McCLINTOCK votes against coronavirus billTHE BUZZ — PARENTS’ NIGHTMARE: SCHOOL YEAR LIKELY IS DONE: The bombshell dropped Tuesday — so brace yourselves, parents.\nCalifornia schools are unlikely to reopen before the summer recess — and there’s a possibility classes may not return until fall, Gov.\nHE BURIED THE LEAD — Newsom let the stunning possibility that the 2019-20 school year is over drop during a lengthy press conference Tuesday.\nTWEET OF THE DAY: KQED’s Katie Orr @1KatieOrr: ‘This is probably really inside-the-Capitol, but, man, I miss Cal Channel.\nPOLITICO California has a variety of solutions available for partners looking to reach and activate the most influential people in the Golden State."}, {"url": "https://gvwire.com/2020/03/31/covid-19-fight-fresno-printing-company-steps-up-to-produce-face-shields/", "title": "Fresno Printing Company Steps up to Produce Face Shields", "authors": ["Jim Jakobs", "Ap News", "Randy Reed", "Nancy Price", "Dan Walters", "Calmatters Commentary"], "date": "2020-03-31", "keywords": ["printing", "needing", "used", "fresno", "face", "company", "produce", "share", "protective", "generally", "shields", "medical", "steps"], "summary": "SHARE THIS ARTICLE:Dumont Printing, a commercial printer in Fresno, is now printing something different.\n“He shared his idea of making face shields and how it had given his empty print shop purpose, while helping the healthcare industry, and keeping his staff employed.\nIt was a true partnership between the south and west.”If you know any medical facility needing face shields, please have them contact us.\n“If you know any medical facility needing face shields, please have them contact us.\nFace Shields Aren’t Generally Used AloneAccording to the National Institutes of Health, face shields are generally used in conjunction with some other form of protection."}, {"url": "https://alankandel.scienceblog.com/2020/04/15/sjv-transport-improvement-road-direct-progress-made-on-multiple-fronts/", "title": "SJV-transport-improvement-road direct; progress made on multiple fronts", "authors": ["Peter Hurrell", "Bill Wald", "Alan Kandel"], "date": "2020-04-15", "keywords": ["district", "fronts", "direct", "multiple", "transportation", "san", "highspeed", "release", "progress", "air", "rail", "sjvtransportimprovementroad", "valley", "pollution", "joaquin"], "summary": "In California’s expansive and agriculturally conducive San Joaquin Valley, encompassing eight counties in all, one-in-five children is an asthmatic.\nWhat made the Valley what it isEarly on, being the fertile-soil-rich land of plenty is what made the San Joaquin Valley so appealing to so many.\nIncidentally, in addressing air pollution created as a result of port activity, the San Joaquin Valley Air Pollution Control District (Air District) on Jun.\nThe Air District on issued a statement on May 24, 2017 concerning the deployment of electric vehicle charging stations.\nThey are known as Electric Vehicle Autonomous Renewable Chargers (EV ARC),” the Air District reported."}, {"url": "https://abc30.com/business/downtown-fresno-expecting-to-see-many-new-businesses-in-2020/5881227/", "title": "Downtown Fresno expecting to see many new businesses in 2020", "authors": ["Vanessa Vasconcelos"], "date": "2020-01-27", "keywords": ["windowsfresno", "businesses", "downtown", "fresno", "2020", "number", "windowsdowntown", "went", "partnership", "expecting", "cerracchio", "ceo"], "summary": "FRESNO, Calif. (KFSN) -- It's a new dawn for downtown Fresno, celebrating the opening of 20 new businesses for 2019.The downtown Fresno partnership predicts that number will be higher in 2020.Partnership CEO Jimmy Cerracchio says they hired security to monitor the Van Ness and Fulton corridor to give businesses peace of mind.\n\"They keep an eye into buildings being broken into, and people trying to tamper with doors or windows.\n\"Downtown unit keeps us in the loop on everything,\" Cerracchio said.\n\"Caerrachio's outlook for 2020 is optimistic, projecting 20-25 new businesses by the end of the year.\nIt's a number he says will likely increase as more people move downtown.The downtown Fresno Partnership CEO went on to say downtown apartments are at 95 percent capacity.So the demand is there, but it's just getting the units built."}, {"url": "https://finance.yahoo.com/news/sinclair-names-matthew-morse-general-190000744.html", "title": "Sinclair Names Matthew Morse General Manager in Fresno, California", "authors": [], "date": "2020-01-02", "keywords": ["mr", "broadcast", "manager", "matthew", "fresno", "sales", "morse", "california", "sinclair", "general", "names", "company", "stations", "owns"], "summary": "FRESNO, Calif., Jan. 2, 2020 /PRNewswire/ -- Sinclair Broadcast Group, Inc. (Nasdaq: SBGI), (\"the Company,\" \"Sinclair\") is pleased to announce that Matthew Morse has been named General Manager of KMPH (Fox) and KFRE (CW) in Fresno, CA.\n\"I am honored and humbled to continue my career with such a progressive company as Sinclair,\" Mr. Morse commented.\nMr. Morse has been at KMPH/KFRE since 2013, most recently serving as General Sales Manager.\nMr. Morse holds a Bachelor of Arts in Law and Society from University of California, Santa Barbara.\nCision MoreView original content to download multimedia:http://www.prnewswire.com/news-releases/sinclair-names-matthew-morse-general-manager-in-fresno-california-300980562.htmlSOURCE Sinclair Broadcast Group, Inc."}, {"url": "https://abc30.com/fresno-police-news-homicide-investigation-2020/5867929/", "title": "Victim of Fresno's first homicide of 2020 had just enlisted for U.S. Army", "authors": [], "date": "2020-01-23", "keywords": ["army", "learning", "murder", "shot", "thomas", "fresno", "2020", "shooters", "fresnos", "enlisted", "homicide", "say", "evidence", "victim", "sons", "son"], "summary": "FRESNO, Calif. (KFSN) -- Tiana Thomas is torn over learning that her son's alleged killers are 14 and 16-years-old.\n\"My heart goes out to these two because they are kids,\" Thomas said.\n\"It was January 8 that police say the teens shot and killed Thomas' 18-year-old son, Dezon Cheatham.Police found his body inside of a car in Central Fresno.\n\"I could be out taking care of business, not knowing if I'm staring my sons killer in the face.\n\"Police say at the moment they do not plan on releasing the names of the suspects because they are minors.They face charges of murder, attempted murder and other felony charges."}, {"url": "https://www.yourcentralvalley.com/news/crime/police-3-injured-in-downtown-fresno-shooting/", "title": "Search for suspects after triple shooting in southwest Fresno", "authors": ["Aj Kato", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-01-21", "keywords": ["shooting", "handgun", "southwest", "fresno", "area", "saw", "saidpolice", "vehicle", "store", "triple", "suspects", "search", "victims", "woman", "officers"], "summary": "FRESNO, California (KGPE) – Police were still searching for the suspects after a triple shooting in Downtown Fresno.\nShots rang out shortly after 7 p.m. Monday, close to a homeless encampment in the area of Santa Clara and G Streets.\n“They saw a vehicle fleeing the area and as soon as the suspects saw the officers they threw what appeared to be a handgun outside the vehicle,” said Lt. Anthony Dewall.\nA man was shot in the shin, a woman was struck in the hip, and another woman was grazed by a bullet.\nPolice did not have any suspect descriptions and were looking for a dark vehicle, possibly a Honda."}, {"url": "https://www.theguardian.com/us-news/2020/jan/02/fresno-mass-shooting-police-arrest-six-suspects-in-deadly-november-attack", "title": "Fresno mass shooting: police arrest six suspects in deadly November attack", "authors": ["Sam Levin"], "date": "2020-01-02", "keywords": ["attack", "xiong", "community", "shooting", "mass", "fresno", "deadly", "hmong", "gang", "local", "suspects", "victims", "men", "members", "arrest"], "summary": "Authorities say that gang members targeted an event where they believed rival gang members were gatheredPolice in Fresno, California, have arrested seven suspects in a mass shooting that left four dead in November, alleging gunmen targeted a backyard where they believed rival gang members were gathered.\nFacebook Twitter Pinterest Six suspects were arrested in connection with a mass shooting in Fresno in November that left four dead.\nThe department has said there was no evidence suggesting the four fatal victims were gang members.\n“It is bittersweet,” said Bobby Bliatout, a local Hmong community leader.\n“A gang member’s life is not less important than a non-gang member’s life."}, {"url": "https://www.yourcentralvalley.com/news/local-news/dmv-window-hit-by-single-bullet-in-central-fresno/", "title": "DMV window hit by single bullet in Central Fresno", "authors": ["Alliz Clavijo", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-01-09", "keywords": ["hit", "suspectthere", "single", "fresno", "central", "dmv", "southeast", "store", "app", "window", "weather", "california", "bullet"], "summary": "FRESNO, California (KSEE/KGPE) — The California Highway Patrol responded to a DMV after it was hit by a bullet on Wednesday morning.\nAuthorities say the DMV located on Olive Avenue was hit by a single caliber bullet.\nOne window along the south-east side near the parking lot was impacted, according to police.\nFresno CHP says they are conducting an investigation and are still looking for the suspect.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/highway-shooting-california-californis-2020-99/5831881/", "title": "Madera man arrested in California's first highway shooting of 2020", "authors": ["Jason Oliveira"], "date": "2020-01-10", "keywords": ["highway", "southbound", "shooting", "2020", "arrested", "99", "violence", "say", "salas", "californias", "victim", "man", "madera", "pulled"], "summary": "\"Luckily, there was no one else on the freeway at the time,\" said Mike Salas of the California Highway Patrol.According to detectives, the highway violence began at around 2 a.m. when Garcia and the victim were seen shouting at each other at a Madera gas station near Highway 99.\n\"During that chase, from the suspect chasing the victim, shots were fired.\n\"When the driver was pulled out from his vehicle, shell casings did fall from his lap, so it made it a little bit easier to follow up on that investigation that he actually did it,\" said Salas.This is California's first highway shooting of the year.\nThe CHP investigated 18 in 2019.\n\"It's not an everyday occurrence that this happens on the freeway, but unfortunately it's becoming a little more common,\" Salas said."}, {"url": "https://www.yourcentralvalley.com/news/top-stories/fresno-state-university-responds-to-the-shooting-death-of-student/", "title": "Fresno State responds to the shooting death of student", "authors": ["Kirsten Mitchell", "Dom Mcandrew", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-01-05", "keywords": ["scene", "responds", "student", "shooting", "state", "shot", "fresno", "chief", "subjects", "death", "victims", "involved", "delano"], "summary": "(KSEE/KGPE) – A Fresno State freshman was shot and killed in Delano Thursday night.\nFresno State tweeted their support for the friends and family of the young woman killed.\nOn behalf of the entire Fresno State community, we send our deepest condolences to the family and friends of Nayeli Carrillo, who passed away on Jan. 2 and was a student majoring in Pre-Social Work.\npic.twitter.com/JuDbKGNybX — Fresno State (@Fresno_State) January 4, 2020Delano Police Chief Robert Nevarez says 19-year-old Nayeli Carrillo Gonzales was sitting on a bleacher at Cesar Chavez Park with a male friend around 10 p.m.\nAnyone with information is asked to call the Delano Police Department at 721-3377 or call the Anonymous Tip line at 721-3369."}, {"url": "https://www.mwcconnection.com/2020/4/15/21217951/peak-perspective-mountain-west-over-unders", "title": "Peak Perspective: Mountain West Over/Unders", "authors": ["Apr"], "date": "2020-04-15", "keywords": ["nevada", "perspective", "mountain", "wyoming", "west", "state", "schedule", "unlv", "win", "games", "wins", "overunders", "season", "winsanalysis", "peak"], "summary": "They also have Nevada, Colorado State, Wyoming, Fresno State, and Air Force, those games are a toss-up at best.\nLuckily, the road schedule is pretty light this season with games at Ball State, Louisiana, UNLV, Nevada, New Mexico & Colorado State.\nTheir home slate is much more difficult — where they will host San Diego State, Fresno State, Utah State and Wyoming.\nLooking at conference play, Nevada, UNLV, SJSU, and CSU should be easy victories.\nIn the final four games, UNLV plays on the road at Boise State (a loss) and they have another three-game stretch to end the year to win games."}, {"url": "https://www.yourcentralvalley.com/news/crime/police-arrest-juveniles-in-fresnos-first-homicide-of-2020/", "title": "Police arrest juveniles in Fresno’s first homicide of 2020", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-01-21", "keywords": ["related", "community", "juveniles", "2020", "bowlan", "center", "fresnos", "store", "homicide", "say", "app", "heartbreaking", "cheatham", "arrest"], "summary": "FRESNO, California (KSEE/KGPE) Two juveniles age 16 and 14 years old were arrested for Fresno’s first homicide, according to Police.\nThe juveniles are related to one another and are residents of Fresno.\nPolice say they were both booked into the Juvenile Justice Center for murder, assault with a deadly weapon, and other related felony charges.\nFresno Police say they received 911 calls around 11 p.m. Jan. 8 that someone was bleeding from the head.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/local-news/ambulance-flipped-over-in-northeast-fresno-police-says/", "title": "Ambulance flipped over in Northeast Fresno, Police says", "authors": ["Yourcentralvalley.Com Staff", "Dennis Valera", "Nathaly Juarez"], "date": "2020-01-17", "keywords": ["transported", "herndon", "flipped", "maple", "fresno", "patient", "vehicle", "store", "ambulance", "say", "paramedics", "northeast", "minor"], "summary": "FRESNO, California (KGPE) – Authorities say an ambulance flipped over on Herndon and Maple Avenues.\nLt. Dooley with the Fresno Police Department says an ambulance from the American Ambulance was driving westbound on Herndon Ave. while a vehicle driving eastbound collided into each other.\nLt. Dooley says the ambulance had three paramedics and a patient inside.\nAuthorities say the paramedics were transporting the patient to Kaiser Permanente.\nThe three paramedics were transported to Community Regional Medical Hospital for minor injuries and the patient was transferred to Kaiser, police say."}, {"url": "https://www.yourcentralvalley.com/news/authorities-identify-man-in-wednesday-night-southeast-fresno-shooting/", "title": "Authorities identify man in Wednesday night Southeast Fresno shooting", "authors": ["Nathaly Juarez", "Jocelyn Moran", "Dom Mcandrew", "Joe Mcdonald", "Associated Press"], "date": "2020-01-09", "keywords": ["shooting", "shot", "fresno", "victim", "southeast", "identify", "night", "vehicle", "lt", "identified", "dooley", "store", "authorities", "man"], "summary": "FRESNO, California (KSEE/KGPE) – Authorities have identified the man who was shot in Wednesday night’s shooting in Southeast Fresno.\nThe homicide investigation began after a man was found shot to death in a vehicle in Southeast Fresno Wednesday night.\nLt. Dooley said the man was shot in the face and unable to talk.\nHe was transported to Community Regional Medical Center in critical condition, but is stable, Lt. Dooley said.\nPolice are not releasing a motive for the shooting at this time as they are following up on leads."}, {"url": "https://www.latimes.com/california/story/2020-01-31/earthquake-clovis", "title": "Earthquake: 3.3 quake strikes near Clovis, Calif.", "authors": ["Quakebot Is A Software Application Developed The Times To Report The Latest Earthquakes As Fast As Possible. It Is Currently Run"], "date": "2020-01-31", "keywords": ["magnitude", "earthquakes", "near", "strikes", "according", "30", "miles", "calif", "earthquake", "occurred", "youre", "33", "quake", "clovis", "feel"], "summary": "A magnitude 3.3 earthquake was reported Friday evening at 6:13 p.m. Pacific time 68 miles from Clovis, Calif., according to the U.S. Geological Survey.\nThe earthquake occurred 71 miles from Reedley, Calif., 72 miles from Fresno, and 74 miles from Dinuba.\nIn the last 10 days, there have been no earthquakes of magnitude 3.0 or greater centered nearby.\nAdvertisementThe earthquake occurred at a depth of 8.5 miles.\nEven if you didn’t feel this small earthquake, you never know when the Big One is going to strike."}, {"url": "https://abc30.com/fresno-pot-ordinance-weed-recreational-marijuana/5893137/", "title": "Recreational pot sale is finally coming to Fresno", "authors": ["Jason Oliveira"], "date": "2020-01-31", "keywords": ["recreational", "council", "fresno", "business", "city", "owners", "pot", "allow", "finally", "sale", "test", "leaders", "coming", "marijuana", "industry"], "summary": "FRESNO, Calif. (KFSN) -- After years of debate, the recreational sale of marijuana is coming to Fresno.The city is moving forward with plans to allow adults to legally purchase marijuana within city limits.City leaders on Thursday voted to allow business owners to open pot dispensaries later this year.In theory, as many as 21 weed shops could begin selling to adults by the fall.The initial number of dispensaries most likely won't be that high, but Fresno City leaders hope to begin accepting business applications in the coming weeksThe City Council gave its final approval Thursday that would allow regulated pot businesses to set up shop across the city.But before business applications can be accepted, the City must first conduct an environmental study to look at the impact the industry might have on the area.\n\"We're going to study the traffic impact, the neighborhood impact, air quality of this industry from a city-wide perspective.\nEvery business will have to address and mitigate those concerns at the time they apply for their application,\" said Fresno City Council president Miguel Arias.The ordinance will allow 14 retail cannabis shops in the city - that's two per Council District, with the option of adding seven more business licenses if the market demands it\"If the quality and quantity justify 21 licenses on day 1, the staff would have the authority to recommend that to the council,\" said Arias.The final approval passed with a 5-2 vote.Councilmember Mike Karbassi's concern over public safety was his primary reason for not supporting the ordinance\"Our police department has no means other than a field sobriety test.\nThere's no breathalyzer test or swab test to determine whether or not someone has THC two hours ago or two days ago so that's a big concern for me,\" said councilmember Mike Karbassi.City leaders said business owners, most from outside the Central Valley, have already secured a number of properties across the city with the hope of submitting an application and being awarded a license\"We're not going to make a decision until those applicants are scored with the rules that we set and they pass a background check that we expect from owners and operators,\" said Arias.Fresno follows Los Angeles and Bay Area cities that began regulating the industry a couple of years ago.City leaders expect the legal sale of marijuana to bring up to $10 million annually to Fresno."}, {"url": "https://www.yourcentralvalley.com/news/local-news/dead-body-found-in-canal-has-been-identified/", "title": "Dead body found in canal has been identified", "authors": ["Alliz Clavijo", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-01-04", "keywords": ["photos", "canal", "body", "water", "khamphanh", "southeast", "store", "dead", "say", "able", "identified", "man", "xayachit"], "summary": "FRESNO, California (KSEE/KGPE) — Authorities identified the body of the man who was found in a canal on Nov. 16 in southeast Fresno.\nThe man was identified as 41-year-old, Khamphanh Xayachit, of Fresno.\nOfficials say he appeared to have been in the water for several days, making it harder for authorities to identify him.\nRELATED: Body found in canal in southeast FresnoTechnicians were able to focus on a metal plate that had been surgically inserted into the victim’s arm.\nThe fingerprint database showed Khamphanh Xayachit, who had prints on file."}, {"url": "https://calmatters.org/housing/homeless/2020/01/homeless-point-in-time-count-california-inaccurate-politicized-fresno/", "title": "California just finished counting its homeless — a tally sure to be inaccurate, and politically weaponized", "authors": ["Manuela Tobias", "Matt Levin"], "date": "2020-01-30", "keywords": ["politically", "finished", "counts", "fresno", "homeless", "tally", "inaccurate", "weaponized", "night", "numbers", "sure", "homelessness", "california", "housing", "count", "counting", "volunteers"], "summary": "With yellow vests and flashlights, over 200 volunteers fanned out across Fresno to count homeless people on Tuesday night.\nThese “one night count” numbers will translate to state and federal dollars aimed at alleviating the problem.\nTechnically, statewide homeless counts should only be compared every other year, as communities are required to conduct one night counts only in odd years.\nThat’s nearly 100,000 more than California’s official homeless count of people of all ages last year, and doesn’t include those homeless children’s parents, or children under age 5.\nThey haven’t impounded my truck,” said one such man counted in his vehicle by Fresno volunteers, as a woman slept in the passenger seat."}, {"url": "https://www.latimes.com/california/story/2020-01-11/what-causes-dangerous-tule-fog-in-californias-central-valley-and-why-is-it-becoming-less-common", "title": "What causes dangerous tule fog in California’s Central Valley, and why is it becoming less common?", "authors": ["Graphics", "Data Journalist", "Paul Duginski Is A Graphics", "Data Visualization Journalist. He Joined The Los Angeles Times In A Native Of Minnesota", "He Has A Bachelor S Degree In English Moorhead State University."], "date": "2020-01-11", "keywords": ["fog", "causes", "tulare", "heat", "drivers", "central", "tule", "dangerous", "vehicles", "winter", "californias", "common", "valley", "water"], "summary": "AdvertisementA satellite photo shows California’s Central Valley socked in with thick, white tule fog.\nTule fog is thought to arise from wetlands full of tules, Schoenoplectus acutus, a reed or rush common to marshes in California.\nTo achieve high yields, fruit trees need the sustained periods with temperatures below about 44 degrees Fahrenheit during prolonged periods of tule fog.\nThey hypothesize that the decrease in winter fog is occurring along with and contributing to a reduction in winter chill.\nBut if population growth and urbanization continue in the Central Valley, the reduction in air pollution may not last, LaDochy warns."}, {"url": "https://www.wwlp.com/news/crash-leaves-raw-chicken-scattered-along-highway-in-california/", "title": "Crash leaves raw chicken scattered along highway in California", "authors": ["Nancy Asiamah", "Chris Lisinski", "State House News Service"], "date": "2020-01-14", "keywords": ["highway", "scattered", "spill", "rig", "fresno", "chicken", "frozen", "crash", "big", "99", "county", "leaves", "california", "raw"], "summary": "FRESNO COUNTY, California (KSEE/KGPE) – A mess of frozen chicken was scattered along the side of Highway 99 in Fresno County after CHP says a crash involving two big rigs caused it to spill out along the road.\nAccording to the California Highway Patrol, the crash took place on northbound Highway 99 near Mountain View Avenue shortly after 9 p.m. Monday.\nOfficers say a big rig hauling frozen chicken was parked on Highway 99 when it was side-swiped by another big rig, causing the chicken to spill out.\nNo injuries were reported."}, {"url": "https://www.yourcentralvalley.com/news/crime/man-hospitalized-after-stabbing-at-fresno-hotel/", "title": "Man hospitalized after stabbing at Fresno Hotel", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-01-23", "keywords": ["way", "hospitalized", "fresno", "stabbed", "store", "app", "stabbing", "weather", "unknownno", "urged", "victim", "man", "hotel"], "summary": "FRESNO, California (KSEE/KGPE) A man was stabbed at a hotel in central Fresno.\nPolice say they responded to the Hotel Fresno at Blackstone and Garland Avenues around 5 a.m. We are told the victim was stabbed in a room and made is way to the hotel lobby.\nThe victim was transported to the hospital, and his condition is unknown.\nIf you have any information you are urged to contact the Fresno Police Department at (559) 621-7000.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/crime/domestic-violence-suspect-arrested-after-hours-long-standoff/", "title": "Domestic violence suspect arrested after hours-long standoff", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-01-08", "keywords": ["suspect", "fresno", "apartment", "arrested", "store", "standoff", "app", "able", "woman", "domestic", "hourslong", "inside", "violence"], "summary": "FRESNO, California (KSEE/KGPE) A standoff in central Fresno ends Wednesday morning after suspect surrenders.\nFresno Police said a domestic violence suspect was held up in an apartment near Ashlan and Valentine avenues.\nPolice say this all started around 1 a.m. after reports of a domestic violence disturbance, the caller said a man forced his way inside an apartment armed with a gun.\nWhen officers arrived they found a door kicked open with a suspect barricaded inside with a woman and four children.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/crime/19-year-old-shot-and-killed-in-central-fresno-identified/", "title": "19-year-old shot and killed in central Fresno identified", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-03-04", "keywords": ["pittman", "shot", "fresno", "central", "lot", "according", "victim", "store", "app", "19yearold", "clinton", "identified", "killed", "parking"], "summary": "FRESNO, California (KSEE/KGPE) — A 19-year-old man who was shot in central Fresno Saturday afternoon died Monday, according to Fresno police.\nPolice identified the victim as Sean Pittman 19, of Fresno.\nPolice said Pittman and another male were involved in a verbal altercation in the parking lot where Pittman was located.\nThe suspect ultimately shot the victim and fled the scene in a light-colored sedan, according to police.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.kusi.com/flynn-wetzell-lead-no-7-san-diego-state-past-fresno-state/", "title": "Flynn, Wetzell lead No. 7 San Diego State past Fresno State -", "authors": ["Posted", "Updated"], "date": "2020-01-15", "keywords": ["half", "conference", "defense", "state", "san", "fresno", "flynn", "game", "past", "aztecs", "diego", "lead", "road", "wetzell"], "summary": "FRESNO, Calif. (AP) — San Diego State won’t make any scoring highlight reels with games like its one against Fresno State, yet the Aztecs might make it deep into the NCAA Tournament.\nSan Diego State (18-0, 7-0 Mountain West Conference) remains one of two unbeaten teams in Division 1, along with Auburn.\n“I was leaving the hotel (earlier) and saw Clemson beat Duke on the road,” Aztecs coach Brian Dutcher said.\nIf you missed tonight's 64-55 victory over Fresno State, here are the highlights and some more info from the game.\nThe victory gave San Diego State the series sweep and extended its conference lead to two games over New Mexico and UNLV."}, {"url": "https://www.yourcentralvalley.com/news/crime/suspects-sought-in-2-fresno-store-robberies/", "title": "Suspects sought in 2 Fresno store robberies", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-02-19", "keywords": ["department", "sought", "fresno", "robbery", "jan", "located", "store", "app", "occurred", "suspects", "victim", "robberies"], "summary": "FRESNO, California (KSEE/KGPE) — Authorities are asking for help identifying suspects in two robberies that happened last month, the Fresno Police Department said Monday.\nThe first is a strong-arm robbery that occurred on Jan. 16 at Wigs and Braids, located at Fresno and C streets.\nThe victim attempted to stop the suspects and a struggle ensued where the suspects got away with the merchandise and the victim’s cellphone, the Police Department said.\nAnyone with information regarding the identity of the two cases should contact the Fresno Police Department Robbery Unit at (559) 621-7000 or Valley Crime Stoppers at (559) 498-7867.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/crime/hospital-worker-living-near-clovis-school-arrested-for-possessing-child-pornography/", "title": "Hospital worker living near Clovis school arrested for possessing child pornography", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-01-23", "keywords": ["living", "hospital", "elementary", "possessing", "pornography", "near", "forney", "child", "porn", "school", "arrested", "store", "sheriffs", "office", "clovis", "worker"], "summary": "CLOVIS, Calif. (KSEE/KGPE) — A hospital worker was arrested after deputies searched his Clovis home near an elementary school and found devices with child pornography inside on Thursday morning, according to the Fresno County Sheriff’s Office.\nThe home is located about a block near Clovis Unified School District’s Gettysburg Elementary School.\nThe Sheriff’s Office said they collected electronic devices that contained child porn during their search.\nThe suspect, identified as Mark Forney, 68, was arrested on a charge of the possession of child porn, Botti said.\nThe Sheriff’s Office said Forney worked in the maintenance department at Community Regional Medical Center."}, {"url": "https://www.yourcentralvalley.com/news/crime/fresno-county-deputies-investigate-homicide-of-coalinga-man-in-huron/", "title": "Fresno County deputies investigate homicide of Coalinga man in Huron", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-01-11", "keywords": ["shooting", "fresno", "area", "huron", "identified", "store", "homicide", "county", "deputies", "sheriffs", "investigate", "victim", "man", "coalinga"], "summary": "HURON, Calif. (KSEE/KGPE) — Deputies are investigating the homicide of a Coalinga man who was killed in a late Friday night shooting in the west Fresno County town of Huron, according to the Fresno County Sheriff’s Office.\nOfficers and emergency crews responded and found a shooting victim on the ground who had died.\nOfficials identified the victim as Joel Aguiniga, 19, of Coalinga, who was known to stay in that area of Huron, Botti said.\nHuron Police requested the Sheriff Office’s homicide unit to take the lead in the investigation.\nDeputies have not identified a suspect at the time and do not have a motive for the shooting."}, {"url": "https://abc30.com/fresno-police-dui-new-years-eve-saturation-patrol/5806276/", "title": "Fresno Police make 12 DUI arrests on New Year's Eve", "authors": ["Gilbert Magallon"], "date": "2020-01-02", "keywords": ["12", "pretty", "fresno", "beer", "number", "think", "say", "dui", "eve", "seen", "probably", "arrests"], "summary": "FRESNO, Calif. (KFSN) -- Fresno Police had a busy New Year's Eve as they stepped up patrols to make sure everyone drove into 2020 safely.On New Year's Eve night, they made a little more than 150 stops with only about a dozen DUI arrests.Police had 12 DUI arrests which they say is pretty typical for a regular weekend, but it's a lot lower for a holiday.They say a few things could have played a factor like cold weather and ride-sharing.\n\"I think the object is to have a low number,\" says Fresno Police Sgt.\nGary Beer.Through saturation patrols, neighborhood traffic units and extra officers they were able to deter intoxicated people from getting behind the wheel.Only a dozen DUI arrests were made.Despite the low number, Beer says it's pretty close to other years.\n\"I don't think I have ever seen more than 16.\n\"$8 - $12 is a lot cheaper than somebody dying,\" he says.The twelve people who were arrested could face a fine of up to $1000, license suspension and even jail time."}, {"url": "https://abc30.com/meteor-southern-california-sighting/5890484/", "title": "Apparent meteor seen on video flashes across SoCal night sky", "authors": [], "date": "2020-01-30", "keywords": ["meteor", "sky", "caught", "southern", "video", "social", "night", "flashes", "seen", "socal", "apparent", "residents", "california", "flashed", "bright"], "summary": "My boyfriend caught this video of the meteor shower in california and wanted me to post it!!\n☄️ #meteor #SanDiego pic.twitter.com/muBQ8p10rz — kimmy (@renfriiiii) January 30, 2020LOS ANGELES -- Residents in Southern California were treated to a bright sight Wednesday night, prompting many to take to social media.An apparent meteor flashed over the region and was caught on camera.On social media, residents took video of the large bright light resembling a meteor as it flashed across the night sky.Video from a person in San Diego showed streaking lights as it broke into several smaller pieces and dropped out of sight.Several Southern California residents called into the ABC7 newsroom saying they saw the apparent meteor."}, {"url": "https://californiahealthline.org/morning-briefing/tuesday-april-14-2020/", "title": "Tuesday, April 14, 2020", "authors": [], "date": "2020-04-14", "keywords": ["nursing", "gov", "newsom", "francisco", "state", "2020", "coronavirus", "health", "county", "california", "workers", "14"], "summary": "(Shalby, Wigglesworth, Newberry and Queally, 4/13)CalMatters: Medical Workers Are Signing Up For Newsom's California Health Corps — Despite RisksOn numbers alone, Gov.\n(Bollag, 4/13)Los Angeles Times: Coronavirus: Healthcare Workers Have To Reuse MasksThe nurse keeps her mask in a Tupperware container.\n(Dolan and Mejia, 4/14)CalMatters: California Nursing Homes: Forced To Take COVID-19 Patients?\nKate Brown and Washington state Gov.\n(Rodriguez-Delgado, 4/13)Sacramento Bee: California Pastors Sue Gavin Newsom Over Coronavirus OrderA group of Inland Empire pastors is suing California Gov."}, {"url": "https://www.latimes.com/california/story/2020-04-15/gavin-newsom-california-coronavirus-help-unemployment-independent-contractors-immigrants", "title": "California to provide more help for unemployed undocumented immigrants, others amid coronavirus", "authors": ["Taryn Luna Covers Gov. Gavin Newsom", "California Politics In Sacramento For The Los Angeles Times.", "Patrick Mcgreevy Is A Reporter Covering California State Government", "Politics In The Sacramento Bureau. He Previously Worked In The Los Angeles City Hall Bureau For The Times. He Is A Native Of San Diego", "A Graduate Of San Jose State University.", "John Myers Joined The Los Angeles Times As Sacramento Bureau Chief In", "Has Spent More Than Two Decades Covering California Politics", "State Government"], "date": "2020-04-15", "keywords": ["amid", "provide", "department", "newsom", "help", "state", "independent", "employment", "benefits", "unemployment", "week", "contractors", "coronavirus", "development", "california", "undocumented", "immigrants", "unemployed"], "summary": "“We are in the process, right now, of dealing with an unprecedented number of people making phone calls to our Employment Development Department,” Newsom said.\nSu said the state Employment Development Department needed two weeks to get the new portal up and running.\nIn January 2010, near the end of the Great Recession, California received 92,738 new claims, said Michael Bernick, a former director of the state’s Employment Development Department who tracks employment data.\nNewsom’s announcement on assistance for independent contractors could potentially provide relief to tens of thousands of workers who otherwise would be ineligible for help.\nAdvertisementThose efforts have slowed as the state Employment Development Department has sought to shift resources into processing requests for jobless assistance."}, {"url": "https://nmstatesports.com/news/2020/4/14/football-aggies-ink-five-more-signees-for-2020.aspx", "title": "Aggies Ink Five More Signees for 2020", "authors": [], "date": "2020-04-14", "keywords": ["wide", "ink", "hs", "community", "nm", "state", "holmes", "2020", "defensive", "signees", "offensive", "calif", "played", "aggies"], "summary": "NEW SIGNEESPREVIOUS SIGNEES++ NM State ++– Five more student-athletes, including two transfers from FBS schools, have made their commitments to play football at NM State.Defensive backs Olan Cazad Jr. and D.J.\nMcCullough, defensive tackle Darvis Holmes, offensive lineman Gabriel Preciado and tight end Anthony Roberson signed with the Aggies on Wednesday, strengthening the program's 2020 signing class.\n\"Holmes and Roberson each come to NM State from FBS programs.\nThe Imperial Beach, Calif., native spent the 2019 campaign at Southwestern CC in Chula Vista, Calif.Wednesday's additions raise NM State's group of signees to 22.\n| Coffeyville Community College6-0 | 180 | Wide ReceiverTwentynine Palms, Calif. | Saddleback College6-1 | 170 | SafetyPompano Beach, Fla. | Independence Community College6-0 | 200 | Wide ReceiverTruckee, Calif. | Truckee HS | Saddleback College6-1 | 190 | CornerbackLiberty, Mo."}, {"url": "https://alankandel.scienceblog.com/2020/04/07/despite-marked-progress-made-fresno-kern-madera-counties-remain-hot-spots-for-dirty-wintry-air/", "title": "Despite marked progress made, Fresno, Kern, Madera counties remain ‘hot spots’ for dirty wintry air", "authors": ["Peter Hurrell", "Bill Wald", "Alan Kandel"], "date": "2020-04-07", "keywords": ["district", "2020", "wintry", "kern", "remain", "fresno", "burning", "standard", "marked", "counties", "25", "air", "valley", "hot", "pollution", "madera", "progress", "spots", "dirty"], "summary": "post-Feb. 29, 2020 is allowed, it is however, as the San Joaquin Valley Air Pollution Control District (Air District) has stated, discouraged.\nAs long as high concentrations of fine particulates in wintry Valley air persist, that fact is worrisome indeed, the counties of Fresno, Kern and Madera being impacted the most.\n“In 2019, the District adopted amendments to Rule 4901 to lower the ‘No Burning Unless Registered’ and ‘No Burning for All’ thresholds in the three counties with the biggest air pollution challenges: Madera, Fresno and Kern.\nThe lower threshold led to more frequent health-protective wood burning curtailments in these ‘Hot Spot‘ counties during the 2019-2020 winter season,” the Air District in a Mar.\nNotesDr. Michael Peterson, “Fresno needs a new path to better health,” commentary, The Fresno Bee, May 8, 2014 editionThis post was last revised on Apr."}, {"url": "https://laist.com/2020/03/18/senior_shopping_hours_grocery_stores_elderly_old_people_coronavirus_risk.php", "title": "Some Grocery Stores Are Letting Seniors Shop For Food An Hour Before Everyone Else", "authors": [], "date": "2020-03-18", "keywords": ["shoppers", "shop", "hour", "seniors", "store", "food", "grocery", "outlet", "letting", "shopping", "senior", "hours", "stores"], "summary": "They're calling it \"senior shopping hour.\"\nGrocery Outlet in Altadena was among the first stores to announce via social media that they'd set aside hours exclusively for seniors.\n(Grocery Outlet Altadena's Facebook page)In later social posts, Guajardo clarified the protocols for the daily senior shopping hour.\nBut she doesn't want these senior shopping hours to lull older people into a false sense of security about COVID-19.\nThe 99-Cent Only stores announced that they will reserve 7 to 8 a.m. on Tuesday and Thursday for senior shopping hours at all stores."}, {"url": "https://www.kmjnow.com/2020/02/13/president-donald-trumps-california-campaign-trip-includes-bakersfield/", "title": "President Donald Trump’s California Campaign Trip Includes Bakersfield", "authors": [], "date": "2020-02-13", "keywords": ["feb", "water", "president", "trip", "2020", "nunes", "includes", "donald", "olympic", "visit", "trumps", "campaign", "california", "bakersfield", "valley", "scheduled", "trump"], "summary": "FRESNO, CA (KMJ) – President Donald Trump is scheduled to visit California, making a stop in the Valley.\nOn Thursday, Feb. 13, 2020 the White House confirmed the trip, the President’s first out west since making his the State of the Union.\nPresident Trump will be in Los Angeles on Tuesday, Feb. 18 2020 where he will meet with the Olympic Committee on preparations for the 2028 Summer Olympic Games.\nOn Wednesday, Feb 19, 2020 President Trump will be in House Minority Leader Kevin McCarthy’s hometown of Bakersfield.\nTrump Valley visit takes place one day after David Bernhardt, the Interior Secretary, will be participating in a water forum with Representative Devin Nunes in Tulare."}, {"url": "https://abc30.com/blue-support-the-police-officers-woodward-park/5799955/", "title": "Support Blue Run set for February 2020 at Woodward Park", "authors": [], "date": "2019-12-31", "keywords": ["sign", "troubling", "fresno", "2020", "situations", "support", "run", "tickets", "set", "blue", "twomile", "woodward", "park", "work"], "summary": "FRESNO, Calif. (KFSN) -- Local police are inviting all to the \"Support Blue Run\" that occurs at Woodward Park on February 29, 2020.This is an opportunity to show support for those who work hard to keep Fresno and the rest of the community safe.You can sign up for either a two-mile run/walk, a 5-K run or a 10-K run.\nAll proceeds from this event will go to chaplain programs that support children in troubling situations.\nTickets for the run are $40 and can be purchased until Dec. 31, the last day of 2019."}, {"url": "http://agnetwest.com/2020-growing-together-black-farmer-conference-with-urban-farmers-to-be-held-february-29/", "title": "2020 “Growing Together” Black Farmer Conference with Urban Farmers to be Held February 29", "authors": [], "date": "2020-02-28", "keywords": ["conference", "west", "ranchers", "fresno", "growing", "2020", "resources", "usda", "resource", "farmer", "farmers", "nrcs", "black", "held", "urban", "29"], "summary": "FRESNO, Calif., Feb. 26, 2020 – The second annual Growing Together Black Farmers with Urban Farmers Conference will be held on Saturday, Feb. 29, 2020, in Fresno, California.\nHosted by the West Fresno Family Resource Center and the U.S Department of Agriculture (USDA), the conference is open to all farmers and ranchers, yet is uniquely tailored towards black farmers and urban Farmers.\n“The “Growing Together” Black Farmer Conference with Urban Farmers is an open forum for farmers and ranchers to share, learn and grow together,” says State Conservationist Carlos Suarez, of NRCS California.\nThe conference will also allow time for networking with other farmers and ranchers and with more than a dozen resource booths.\nThe West Fresno Family Resource Center was established in 2001, West Fresno Health Care Coalition (DBA: West Fresno Family Resource Center), a 501(c)(3) non-profit organization, serves residents of one of the poorest metropolitan communities in California’s Central Valley, southwest Fresno and beyond."}, {"url": "https://www.nytimes.com/2020/02/06/us/politics/michael-bloomberg-california.html", "title": "The Battle for California’s 20 Million Voters Came Early This Year", "authors": ["Jennifer Medina"], "date": "2020-02-06", "keywords": ["bloomberg", "mr", "battle", "far", "state", "sanders", "voters", "early", "million", "television", "20", "californias", "california", "campaign", "came"], "summary": "Only the other billionaire in the race, Tom Steyer, has come anywhere close, spending nearly $15 million since last summer.\nMr. Sanders’s campaign has spent roughly $3 million on television in California so far, and has said it plans to spend over $2.5 million more, spread between California and Texas, another delegate-rich Super Tuesday state.\nThe Sanders and Bloomberg campaigns are testing the theory that California is not a place that can be organized with foot soldiers.\nSo far, Mr. Bloomberg has 220 staff members throughout the state, a number his campaign expects to grow to 800 by the end of the month.\n“Riverside is our Des Moines,” said Anna Bahr, a California spokeswoman for the Sanders campaign, describing efforts in the Inland Empire city."}, {"url": "https://www.yourcentralvalley.com/news/crime/suspects-sought-in-2-fresno-store-robberies/", "title": "Suspects sought in 2 Fresno store robberies", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-02-19", "keywords": ["department", "sought", "fresno", "robbery", "jan", "located", "store", "app", "occurred", "suspects", "victim", "robberies"], "summary": "FRESNO, California (KSEE/KGPE) — Authorities are asking for help identifying suspects in two robberies that happened last month, the Fresno Police Department said Monday.\nThe first is a strong-arm robbery that occurred on Jan. 16 at Wigs and Braids, located at Fresno and C streets.\nThe victim attempted to stop the suspects and a struggle ensued where the suspects got away with the merchandise and the victim’s cellphone, the Police Department said.\nAnyone with information regarding the identity of the two cases should contact the Fresno Police Department Robbery Unit at (559) 621-7000 or Valley Crime Stoppers at (559) 498-7867.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/crime/police-search-for-suspect-in-southeast-fresno/", "title": "Police search for suspect in southeast Fresno", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-02-21", "keywords": ["suspect", "fresno", "upno", "southeast", "store", "app", "weather", "unknown", "search", "wanted", "updatesfor", "willow"], "summary": "FRESNO, California (KGPE) Fresno police have been in southeast Fresno for several hours searching for a suspect.\nFresno police arrived in the area of Olive and Willow Avenues around 4 a.m.Police can be heard on a loudspeaker asking a suspect to come out with their hands up.\nNo other details were immediately available.\nIt’s unknown what the suspect is wanted for.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://timesofsandiego.com/politics/2020/02/02/californias-official-2020-homeless-number-will-be-big-and-politically-charged/", "title": "California’s Official 2020 Homeless Number Will Be Big—And Politically Charged", "authors": [], "date": "2020-02-02", "keywords": ["politically", "counts", "times", "fresno", "homeless", "number", "2020", "bigand", "charged", "numbers", "homelessness", "californias", "california", "official", "housing", "count", "volunteers"], "summary": "These “one night count” numbers will translate to state and federal dollars aimed at alleviating the problem.\nTechnically, statewide homeless counts should only be compared every other year, as communities are required to conduct one night counts only in odd years.\nThat’s nearly 100,000 more than California’s official homeless count of people of all ages last year, and doesn’t include those homeless children’s parents, or children under age 5.\nThey haven’t impounded my truck,” said one such man counted in his vehicle by Fresno volunteers, as a woman slept in the passenger seat.\nCalifornia’s Official 2020 Homeless Number Will Be Big—And Politically Charged was last modified: by>> Subscribe to Times of San Diego’s free daily email newsletter!"}, {"url": "https://www.yourcentralvalley.com/news/local-news/heavy-loss-after-fire-burns-market-in-fresno-county/", "title": "Heavy loss after fire burns market in Fresno County", "authors": ["John Parmer", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-02-04", "keywords": ["tells", "burns", "loss", "thats", "fresno", "trip", "market", "heavy", "store", "county", "app", "weather", "working", "switched", "tell"], "summary": "FRESNO, California (KSEE/KGPE) Fresno County fire crews battled a grocery store fire with a home attached at Jennie’s Market near Britten and Cherry Avenues.\nThey say there was a breaker trip around 2 a.m. so they switched to another power source.\nAll three people were able to get out safely and the fire is now contained.\nThe Battalion Chief tells us there were no working smoke detectors in the building.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://gvwire.com/2020/03/02/rain-snow-kindle-hopes-of-march-miracle-in-parched-california/", "title": "Rain, Snow Kindle Hopes of ‘March Miracle’ in Parched California", "authors": ["Ap News", "Randy Reed", "Jim Jakobs", "Nancy Price"], "date": "2020-03-02", "keywords": ["month", "mountain", "parched", "miracle", "rain", "received", "sierra", "nws", "snow", "hopes", "mountains", "inches", "california", "national", "dry", "kindle"], "summary": "Snow fell across the Sierra and in the mountains of Southern California on Sunday.\nMammoth Mountain in the eastern Sierra reported that Sunday’s storm delivered 9 inches to 11 inches of snow.\nThe Bear Mountain resort east of Los Angeles said it received 6 inches to 8 inches of new snow.\nIn Northern California, downtown Sacramento and downtown San Francisco had nary a drop of rain in February.\nFresno received more than 7 inches of rain that month."}, {"url": "https://www.theguardian.com/environment/2020/feb/28/california-water-wells-dry-sgma", "title": "'Lost communities': thousands of wells in rural California may run dry", "authors": ["Susie Cagle"], "date": "2020-02-28", "keywords": ["wells", "lost", "community", "thousands", "water", "groundwater", "tombstone", "run", "agencies", "tooleville", "rural", "communities", "going", "california", "residents", "dry"], "summary": "Photograph: Talia Herman/The GuardianAccording to the clean water advocacy not-for-profit Community Water Center, nearly 12,000 Californians ran out of water during the 2011-2017 drought.\nIn essence, the law that was supposed to protect well users could codify their wells going dry.\nTooleville has two community wells, but only one is in operation.\nBut it hasn’t run out completely yet.”Facebook Twitter Pinterest Maria Olivera in her back yard in Tooleville, which has two community wells but only one in operation.\nFor rural residents who don’t live within a mile or so of a community water system, consolidation is not an option at all."}, {"url": "https://www.capradio.org/articles/2020/02/01/california-just-finished-counting-its-homeless-a-tally-sure-to-be-inaccurate-and-politically-weaponized/", "title": "California Just Finished Counting Its Homeless — A Tally Sure To Be Inaccurate, And Politically Weaponized", "authors": [], "date": "2020-02-01", "keywords": ["politically", "finished", "counts", "fresno", "homeless", "tally", "inaccurate", "weaponized", "night", "numbers", "sure", "homelessness", "california", "housing", "count", "counting", "volunteers"], "summary": "These “one night count” numbers will translate to state and federal dollars aimed at alleviating the problem.\nTechnically, statewide homeless counts should only be compared every other year, as communities are required to conduct one night counts only in odd years.\n“Although a lot of us don’t like it, HUD doesn’t have another way right now,” said Doreen Eley, assistant housing manager at Fresno Housing Authority.\nThat’s nearly 100,000 more than California’s official homeless count of people of all ages last year, and doesn’t include those homeless children’s parents, or children under age 5.\nThey haven’t impounded my truck,” said one such man counted in his vehicle by Fresno volunteers, as a woman slept in the passenger seat."}, {"url": "https://www.nytimes.com/2020/02/04/us/coronavirus-california-san-benito-county.html", "title": "Coronavirus in California: What to Know", "authors": ["Jill Cowan"], "date": "2020-02-04", "keywords": ["francisco", "know", "san", "state", "number", "according", "coronavirus", "california", "outbreak", "disease", "quarantine", "los"], "summary": "[Have you or someone you know faced prejudice in the United States as a result of coronavirus fears?\nSo here are some answers about the coronavirus:There are now six cases in California, the most of any U.S. state.\nA husband and wife in San Benito County learned they had the illness on Sunday and were taken by ambulance to a hospital in San Francisco on Monday, according to The San Francisco Chronicle.\nThey were the first cases involving the household person-to-person transmission of coronavirus in California.\nScreenings at the San Francisco and Los Angeles airports were put into place on Jan. 17."}, {"url": "https://www.kmjnow.com/2020/02/21/10-fresno-county-vote-centers-opening/", "title": "10 Fresno County Vote Centers Opening", "authors": [], "date": "2020-02-21", "keywords": ["election", "vote", "fresno", "voters", "opening", "day", "center", "county", "centers", "open", "library", "drop"], "summary": "Vote Centers are located throughout Fresno County, allowing voters more days and more ways to vote!\nThese first 10 Vote Centers will be open every day from 9:00 AM until 5:00 PM, leading up to Election Day.\nFollowing this opening wave of Vote Centers, the remaining 43 Vote Centers will open on Saturday, February 29, four days prior to the March 3 Election.\nIn addition to the Vote Centers, 43 secure drop boxes have been placed throughout Fresno County since February 3, 2020.\nVote Centers opening this Saturday, February 22, at 9:00AM, are listed alphabetically by City below."}, {"url": "https://www.yourcentralvalley.com/news/local-news/magnitude-4-4-earthquake-rattles-eastern-california/", "title": "Magnitude 4.4 earthquake rattles eastern California", "authors": ["Paul Schlesinger", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-02-01", "keywords": ["magnitude", "rattles", "near", "place", "store", "44", "app", "earthquake", "usgs", "shaking", "california", "reported", "reports", "eastern", "quake", "toms"], "summary": "TOMS PLACE, Calif. (KSEE/KGPE) — A magnitude 4.4 earthquake rattled parts of central and eastern California Saturday morning, according to the U.S. Geological Survey.\nThe quake struck around 10:30 a.m. about 8 miles west-northwest of Toms Place in Mono County, near Mammoth Lakes, the USGS said.\n📢#earthquake reported near Toms Place in Mono County.\nToms Place lies near the thermally active Long Valley Caldera and Mammoth Mountain volcanic system, according to the USGS.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/5978049/", "title": "Unusual warm temperatures in February means record-setting dryness for the Valley", "authors": ["Vanessa Vasconcelos"], "date": "2020-03-02", "keywords": ["month", "means", "blossoms", "temperatures", "fresno", "recordsetting", "dont", "farmers", "jacobsen", "valley", "unusual", "dryness", "water", "storm", "warm"], "summary": "\"It's a month from today, April 1, which is really the bellwether of how the season is going to go,\" Jacobsen said.\n\"Jacobsen says every storm makes a difference.\n\"Kings River here locally were somewhere between 45-50 percent of the average of where we should be, so that's very minimal,\" Jacobsen said.Some farmers are already irrigating.\n\"You take things like last year when we had one of the wettest Mays on record,\" Jacobsen said.\n\"While that culturally speaking is not the best for Valley ag right now, any kind of precipitation is welcome.\""}, {"url": "https://www.yourcentralvalley.com/news/earthquake-shakes-near-castaic-friday-morning/", "title": "Earthquake shakes near Castaic Friday morning", "authors": ["John Parmer", "Jocelyn Moran", "Dom Mcandrew", "Joe Mcdonald", "Associated Press"], "date": "2020-02-21", "keywords": ["castaic", "morning", "near", "21", "damage", "shakes", "store", "injuries", "app", "earthquake", "35", "weather", "reports"], "summary": "FRESNO, California (KSEE/KGPE) A 3.5 earthquake shook near Castaic around 6 a.m. Friday morning, according to the U.S. Geological Survey.\nEARTHQUAKE: A 3.5 earthquake occurred at 5:42 AM on Friday, February 21, 2020 1 mile, NW of Castaic.\nNo reports of injuries or damage at this time.\n— SCV Sheriff (@SCVSHERIFF) February 21, 2020For more information on the quake visit hereNo reports of injuries or damage at this time.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/local-news/1-killed-in-solo-vehicle-crash-in-northwest-fresno/", "title": "1 killed in solo vehicle crash in northwest Fresno", "authors": ["Paul Schlesinger", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-02-08", "keywords": ["estrada", "northwest", "fresno", "wall", "vehicle", "crash", "store", "app", "wreck", "weather", "woman", "solo", "killed", "valentine"], "summary": "FRESNO, Calif. (KSEE/KGPE) — One person was killed in a solo vehicle crash in northwest Fresno early Saturday morning, according to the Fresno Police Department.\nAuthorities identified the woman as 32-year-old, Elisa Estrada of Fresno.\nThe wreck occurred at 1:40 a.m. in the area of Valentine and Norwich avenues, Lt. Carl McKnight said.\nEstrada had crashed her vehicle into a wall and died from her injuries.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/local-news/blake-shelton-brings-friends-and-heroes-2020-tour-to-save-mart-center-in-february/", "title": "Blake Shelton brings ‘Friends and Heroes 2020’ tour to Save Mart Center in February", "authors": ["Paul Schlesinger", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2019-10-16", "keywords": ["brings", "heroes", "music", "2015", "tour", "friends", "2020", "country", "center", "bring", "shelton", "store", "app", "wintergetty", "blake", "california", "save", "mart"], "summary": "Musician Blake Shelton performs onstage during day three of 2015 Stagecoach, California’s Country Music Festival, at The Empire Polo Club on April 26, 2015 in Indio, California.\n(Photo by Kevin Winter/Getty Images for Stagecoach)FRESNO, California (KSEE/KGPE) — Country music superstar Blake Shelton will bring his “Friends and Heroes 2020” tour to the Save Mart Center on February 21.\nHis Fresno appearance will bring special guest Lauren Alaina as well as appearances by The Bellamy Brothers, John Anderson and Trace Adkins.\nTickets go on sale October 25 at 10 a.m.For local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.nytimes.com/interactive/2020/03/03/climate/dry-california.html", "title": "California Had Its Driest February on Record. Here’s How Bad It Was.", "authors": ["Kendra Pierre-Louis", "Nadja Popovich"], "date": "2020-03-03", "keywords": ["heres", "state", "totals", "san", "driest", "average", "bad", "california", "precipitation", "dry", "wettest", "record", "los"], "summary": "Eureka Sacramento San Francisco Precipitation totals for Feb. 2020 Wettest Driest Average Fresno Santa Barbara Los Angeles San Diego Sacramento Precipitation totals for Feb. 2020 Wettest Driest Average San Francisco Los Angeles San Diego Precipitation totals for Feb. 2020 Wettest Driest Average Sacramento San Francisco Los Angeles San Diego Precipitation totals for Feb. 2020 Wettest Driest Average Sacramento San Francisco Los Angeles San Diego Precipitation totals from Feb. 1 to March 1, 2020, are shown relative to average precipitation totals for the same period between 1979 and 2015.\n“It was the driest February on record,” said Daniel Swain, a climate scientist with the Institute of the Environment and Sustainability at the University of California, Los Angeles.\nEureka Sacramento San Francisco Precipitation totals since Oct. 2019 Wettest Driest Average Fresno Santa Barbara Los Angeles San Diego Sacramento Precipitation totals since Oct. 2019 Wettest Driest Average San Francisco Los Angeles San Diego Precipitation totals since Oct. 2019 Wettest Driest Average Sacramento San Francisco Los Angeles San Diego Precipitation totals since Oct. 2019 Wettest Driest Average Sacramento San Francisco Los Angeles San Diego Precipitation totals from Oct. 1, 2019 to Mar.\n1, 2020, are shown relative to average precipitation totals for the same period between 1979 and 2015.\n“Portions of California have experienced both their driest years on record and their wettest years on record in the past 10 years,” Dr. Swain said."}, {"url": "https://www.latimes.com/california/story/2020-03-09/california-bullet-train-officials-say-they-were-told-to-suppress-bad-news-and-shut-up", "title": "California bullet train officials say they were told to suppress bad news and ‘shut up’", "authors": ["Ralph Vartabedian", "A Former National Correspondent At The Los Angeles Times", "Joined The Newspaper In"], "date": "2020-03-09", "keywords": ["officials", "wsp", "styles", "authority", "state", "management", "project", "construction", "say", "bullet", "bad", "rail", "california", "suppress", "shut", "train", "work", "told"], "summary": "Brian Kelly, chief executive of the California High-Speed Rail Authority, said in a statement that the agency “takes seriously any claim of wrongdoing by an employee or contractor.\nWSP management, he said, told him that he didn’t need to see the documents.\nTurning around the multibillion-dollar project has proved difficult for years, given California’s complex governance structure, flawed contracts and past decisions, officials close to the project say.\nAfter The Times obtained a copy of the confidential report and published its findings, the rail authority denied the legitimacy of the analysis.\nToday, the rail authority is short by 497 of the 2,042 parcels it needs, according to its most recent progress report."}, {"url": "https://www.theguardian.com/environment/2020/feb/27/california-groundwater-sgma-law-farmers", "title": "'Without water we can't grow anything': can small farms survive California's landmark water law?", "authors": ["Susie Cagle"], "date": "2020-02-27", "keywords": ["farm", "landmark", "sgma", "groundwater", "central", "cant", "farms", "drought", "farmers", "survive", "small", "californias", "california", "valley", "water", "law", "grow"], "summary": "Photograph: Talia Herman/The GuardianThe Central Valley is America’s fruit bowl, and the heart of California’s $50bn agriculture industry.\nFacebook Twitter Pinterest A sign says ‘Pray for rain’ in California’s Central Valley.\nWithout the benefit of surface water, farmers applied for record numbers of new well permits.\nThe toll on small farmsIt is unlikely that the Central Valley will see the pain of Sgma shared equally.\nHow many almond trees can really be planted here in the Central Valley?” said Katsurayama."}, {"url": "https://www.yourcentralvalley.com/news/heavy-fire-reported-at-a-southeast-fresno-home/", "title": "FFD: Two dogs die in Fresno house fire", "authors": ["Dom Mcandrew", "Jocelyn Moran", "Joe Mcdonald", "Associated Press"], "date": "2020-02-06", "keywords": ["total", "fresno", "wellinvolved", "store", "app", "dogs", "ffd", "house", "woman", "weather", "die", "washington", "work"], "summary": "FRESNO, California (KGPE) – Two dogs died in a Fresno house fire Wednesday evening, according to Fresno Fire Department.\nCrews responded to the home on the 2900 block of E. Washington Avenue shortly before 11 p.m. Fresno Fire says they arrived to find a well-involved structure fire and work immediately began to stop flames spreading to nearby homes.\nAuthorities say two dogs lost their lives in the blaze and a woman inside suffered smoke inhalation.\nThe home will likely be a total loss.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/leap-day-year-2020-what-is/5973562/", "title": "Saturday is Leap Day! Here's what you should know about Feb. 29", "authors": [], "date": "2020-02-28", "keywords": ["heres", "feb", "added", "know", "day", "according", "party", "leap", "extra", "world", "29", "quarter"], "summary": "Saturday is Feb. 29, a.k.a.\nleap day, a date that appears on our calendars only once every four years.\nLeap day is added because it takes the Earth 365 days, five hours, 48 minutes and 45 seconds to orbit the sun -- almost an extra quarter of a day per year.\nIf you count the quarter of a day up for each year, you get an extra day added every fourth year.With the extra day comes extra intrigue.\nEvery year since, the town has invited leapers from all over the world to celebrate with a Feb. 29 parade"}, {"url": "https://www.latimes.com/politics/story/2020-02-25/california-primary-central-valley-republicans-trump", "title": "Devin Nunes’ district remains the GOP’s ruby heart as blue California votes", "authors": ["James Rainey Has Covered Multiple Presidential Elections", "The Media", "The Environment", "Mostly At The Los Angeles Times", "Which He First Joined In He Was Part Of Times Teams That Won Three Pulitzer Prizes."], "date": "2020-02-25", "keywords": ["district", "nunes", "blue", "los", "ruby", "heart", "sacramento", "gops", "occasionally", "newsletter", "devin", "receive", "votes", "times", "remains", "california", "upyou", "newsletterthe", "politics", "promotional"], "summary": "Newsletter Get our Essential Politics newsletterThe latest news, analysis and insights from our bureau chiefs in Sacramento and D.C.Sign Me UpYou may occasionally receive promotional content from the Los Angeles Times."}, {"url": "https://www.yourcentralvalley.com/news/local-news/surveillance-video-shows-crash-involving-police-officer-in-fresno-2/", "title": "Surveillance video shows crash involving police officer in Fresno", "authors": ["Shawna Khalafi", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-02-01", "keywords": ["shows", "peach", "officer", "olive", "lights", "fresno", "surveillance", "video", "crash", "sirens", "store", "traffic", "involving", "red"], "summary": "FRESNO, Calif. (KGPE) – A crash in Fresno involving a police car was captured on surveillance video on Thursday morning.\nSurveillance video from a nearby gas station shows a police SUV driving north on Peach Ave, crossing Olive Ave then colliding with a car and a minivan.\nFresno Police Department Captain Anthony Martinez says the officer was responding to a call at the time, but not as a ‘Code 3,’ meaning the officer didn’t have lights and sirens on.\nAttorney David Mugridge says because the officer didn’t have lights and sirens on, they could be more likely to be found at fault.\nIn the surveillance video, the traffic light appears to change to red before the officer drives through the intersection."}, {"url": "https://www.yourcentralvalley.com/news/crime/29-year-old-man-shot-in-southeast-fresno/", "title": "29-year-old man shot in southeast Fresno", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-02-06", "keywords": ["nevada", "shot", "wound", "fresno", "29yearold", "southeast", "store", "app", "say", "weather", "victim", "man"], "summary": "FRESNO, California (KSEE/KGPE) A 29-year-old man was shot late Wednesday night near Nevada and 6th in southeast Fresno.\nPolice got a call around midnight of shots fired in the 3600 block of E Nevada Avenue.\nWhen officers arrived, they found the man shot in the stomach.\nPolice say a dark-colored car, possibly a Honda, drove by and shot twice at the victim.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://ktla.com/news/local-news/man-dies-after-being-shot-during-argument-over-super-bowl-in-fresno/", "title": "Man Dies After Being Shot During Argument Over Super Bowl in Fresno", "authors": ["Associated Press", "Los Angeles Times"], "date": "2020-02-02", "keywords": ["argument", "suspect", "shot", "gunman", "fresno", "super", "weapon", "later", "bowl", "described", "dies", "victim", "man"], "summary": "A man died after being shot during an argument with another man over the Super Bowl in Fresno, police said Sunday.\nThe gunman walked up to a home having a barbecue around 11:50 a.m. Saturday and started arguing with a man in his 20s over the game, the Fresno Police Department said.\nThe argument escalated and the suspect shot the victim in the abdomen with what police described as a makeshift weapon, KTLA sister station KRON4 in Fresno reports.\nThe suspect, described as a homeless man in his 30s, was later arrested with the help of witnesses.\nAuthorities did not identify the victim or the gunman and no further details were available."}, {"url": "https://www.yourcentralvalley.com/news/crime/drive-by-shooting-at-southwest-market/", "title": "Drive-by shooting at southwest Market", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-02-24", "keywords": ["information", "shooting", "southwest", "fresno", "market", "store", "app", "vehicles", "weather", "driveby", "walnut", "jensen"], "summary": "FRESNO, California (KSEE/KGPE) – Fresno police are investigating a drive-by shooting in southwest Fresno.\nPolice said the shooting happened at the Jensen Walnut Market around 10:30 a.m. Monday morning near Walnut and Jensen Avenues.\nAccording to police, several vehicles were hit in the parking lot of the Market by gunfire no injuries were reported.\nIf you have any information contact the Fresno Police Department at (559) 621-7000.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/local-news/pedestrian-struck-by-car-in-southwest-fresno/", "title": "Pedestrian struck by car in southwest Fresno", "authors": ["John Parmer", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-02-26", "keywords": ["transported", "struck", "vs", "thorne", "southwest", "fresno", "pedestrian", "vehicle", "store", "app", "weather", "car", "woman", "california", "unknownno"], "summary": "FRESNO, California (KSEE/KGPE) – Police are on scene in the area of Thorne and California avenues in southwest Fresno.\nFresno police said they responded to call of a vehicle vs a pedestrian when officers arrived they found a woman in the road.\nThe woman was transported to the hospital, and her condition is unknown.\nNo other details were immediately available.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://californiahealthline.org/morning-briefing/tuesday-march-31-2020/", "title": "Tuesday, March 31, 2020", "authors": [], "date": "2020-03-31", "keywords": ["officials", "francisco", "state", "area", "2020", "san", "number", "coronavirus", "health", "31", "california", "bay"], "summary": "Meanwhile, in San Francisco, San Francisco officials are begging state and federal officials for more help in averting a looming disaster at the city’s 780-bed nursing home, where a coronavirus outbreak is growing.\nOn Monday, city officials admitted San Francisco is not equipped to handle a surge of cases at Laguna Honda hospital on its own.\nRead more from Emily DeRuy and Maggie Angst of the Bay Area News Group and Melody Gutierrez of the Los Angeles Times .\nScientists at UCSF and the San Francisco Vitalant Research Institute are among several across the country developing tests.\nUndergraduates living in on-campus housing were advised not to leave the Bay Area for any reason over spring break."}, {"url": "https://www.nytimes.com/2020/03/16/us/california-covid-19.html", "title": "To Battle Virus, 7 California Counties Order Everyone to Stay Home", "authors": ["Tim Arango", "Thomas Fuller", "John Eligon", "Conor Dougherty"], "date": "2020-03-16", "keywords": ["essential", "virus", "battle", "stay", "state", "wont", "order", "counties", "san", "way", "wellbeing", "california", "email", "wildfires"], "summary": "“This is not the moment for half-measures, and history won’t forgive us for waiting an hour more,” Mr. Liccardo said.\nResidents are being ordered to stay home except for essential reasons, which include buying food; people can also leave for outdoor activities including “walking, hiking or running” and caring for a pet.\nThe order, she said in a Twitter post, would be effective at midnight.\n[Want to get our daily newsletter California Today by email?\nAt the ports, terminals were shuttered, as fewer ships, loaded with consumer goods and parts for American factories, set sail from China."}, {"url": "https://nmstatesports.com/news/2020/4/14/football-aggies-ink-five-more-signees-for-2020.aspx", "title": "Aggies Ink Five More Signees for 2020", "authors": [], "date": "2020-04-14", "keywords": ["wide", "ink", "hs", "community", "nm", "state", "holmes", "2020", "defensive", "signees", "offensive", "calif", "played", "aggies"], "summary": "NEW SIGNEESPREVIOUS SIGNEES++ NM State ++– Five more student-athletes, including two transfers from FBS schools, have made their commitments to play football at NM State.Defensive backs Olan Cazad Jr. and D.J.\nMcCullough, defensive tackle Darvis Holmes, offensive lineman Gabriel Preciado and tight end Anthony Roberson signed with the Aggies on Wednesday, strengthening the program's 2020 signing class.\n\"Holmes and Roberson each come to NM State from FBS programs.\nThe Imperial Beach, Calif., native spent the 2019 campaign at Southwestern CC in Chula Vista, Calif.Wednesday's additions raise NM State's group of signees to 22.\n| Coffeyville Community College6-0 | 180 | Wide ReceiverTwentynine Palms, Calif. | Saddleback College6-1 | 170 | SafetyPompano Beach, Fla. | Independence Community College6-0 | 200 | Wide ReceiverTruckee, Calif. | Truckee HS | Saddleback College6-1 | 190 | CornerbackLiberty, Mo."}, {"url": "https://abc30.com/6024865/", "title": "Fresno issues emergency 'shelter in place' order amid COVID-19 concerns", "authors": ["Corin Hoggard"], "date": "2020-03-18", "keywords": ["amid", "issues", "order", "city", "place", "fresno", "care", "social", "food", "shelter", "covid19", "services", "essential", "brand", "businesses", "homes", "emergency", "health", "concerns"], "summary": "\"We've been advised to take action now and not wait for those (official) numbers,\" said council president Miguel Arias.\n\"The Fresno city council voted on the order Wednesday afternoon.People will be allowed to leave their homes for these purposes:City leaders emphasized that there's no problem with water services.\nNobody will lose water, even for non-payment.\nThe same is true for power.\n\"There is an end in sight,\" Brand said."}, {"url": "https://www.latimes.com/california/story/2020-03-19/coronavirus-california-public-records-requests-suspended", "title": "Some California cities suspend public records requests because of coronavirus", "authors": ["Staff Writer", "Ben Poston Is An Investigative Reporter Specializing In Data At The Los Angeles Times."], "date": "2020-03-19", "keywords": ["saidthe", "public", "records", "responses", "state", "emergency", "city", "coronavirus", "snyder", "requests", "california", "staffing", "suspend", "cities"], "summary": "Some local governments in California are halting their responses to public records requests as they deal with staffing restrictions caused by the coronavirus outbreak.\nThe city of Fresno suspended “immediate responses” to public records requests on Tuesday after the city declared a state of emergency, according to an email from the city attorney’s office.\nThe city will need an additional 45 days to respond to records requests after the order is lifted, the email said.\nReporters across the country are seeing more and more of this: government agencies indefinitely delaying public records requests because of #coronavirus #COVID19 #FOIAI've seen:DallasFresnoHawaiiAnd now Fremont, CAJournos: where else have you received a similar response?\n“While I’m totally sympathetic to staffing and other issues cities may now be facing, and understand that slower responses to public records requests may be required, the fact remains that the California Public Records Act is still the law of the land,” Snyder said."}, {"url": "https://www.latimes.com/california/newsletter/2020-03-20/california-stay-home-newsom-coronavirus-newsletter-essential-california", "title": "Essential California: Newsom to 40 million Californians: Stay home", "authors": ["Staff Writer", "Julia Wick Is The Author Of The"], "date": "2020-03-20", "keywords": ["businesses", "essential", "newsom", "angeles", "stay", "state", "order", "million", "city", "californians", "coronavirus", "40", "county", "california", "los"], "summary": "Good morning, and welcome to the Essential California newsletter .\nNewsletter The stories shaping California Get up to speed with our Essential California newsletter, sent six days a week.\nGavin Newsom orders all Californians to stay at home” in the Los Angeles Times]Newsom’s announcement came shortly after Los Angeles city and county officials announced dramatic new orders that severely restrict public movements.\nLaw enforcement and offices that provide government programs and services will remain open, along with essential state and local government functions.\nLos Angeles TimesL.A.'s stricter restrictions will almost certainly mean the end of business for good for many restaurants and bars."}, {"url": "https://www.latimes.com/california/story/2020-03-18/coronavirus-has-8-million-californians-under-shelter-in-place-orders", "title": "California hits 17 deaths as L.A. County confirms 46 new coronavirus cases", "authors": ["Rong-Gong Lin Ii Is A Metro Reporter", "Specializing In Covering Statewide Earthquake Safety Issues. The Bay Area Native Is A Graduate Of Uc Berkeley", "Started At The Los Angeles Times In", "Colleen Shalis A Reporter For The Los Angeles Times. She Previously Worked At Pbs Newshour In Washington", "D.C. She S A Graduate Of George Washington University", "A Native Of Southern California.", "Howard Blume Covers Education For The Los Angeles Times. He S Won The Top Investigative Reporting Prize The L.A. Press Club", "Print Journalist Of The Year The L.A. Society Of Professional Journalists Chapter. He Co-Hosts", "Deadline L.A.", "On Kpfk"], "date": "2020-03-18", "keywords": ["public", "cases", "angeles", "confirms", "state", "san", "order", "la", "coronavirus", "health", "deaths", "county", "46", "17", "shelterinplace", "california", "hits"], "summary": "AdvertisementLos Angeles expects more casesLos Angeles County on Wednesday confirmed 46 new cases of the novel coronavirus, including eight in Long Beach and two in Pasadena.\nAll new patients have been isolated, and their close contacts are being quarantined, said Barbara Ferrer, director of the L.A. County Public Health Department.\nTesting capacity increasesWith confirmed coronavirus cases spreading rapidly and reaching all 50 states, almost 9 million Californians are living under shelter-in-place orders.\nOn Tuesday, the U.S. Public Health Service reported that more than 58,778 individuals had been tested throughout the country — almost 32,000 at public health labs and roughly 27,000 at clinical labs.\nWithout calling it an official shelter-in-place order, Sacramento County officials recommended that residents stay at home as much as possible."}, {"url": "https://laist.com/2020/03/18/senior_shopping_hours_grocery_stores_elderly_old_people_coronavirus_risk.php", "title": "Some Grocery Stores Are Letting Seniors Shop For Food An Hour Before Everyone Else", "authors": [], "date": "2020-03-18", "keywords": ["shoppers", "shop", "hour", "seniors", "store", "food", "grocery", "outlet", "letting", "shopping", "senior", "hours", "stores"], "summary": "They're calling it \"senior shopping hour.\"\nGrocery Outlet in Altadena was among the first stores to announce via social media that they'd set aside hours exclusively for seniors.\n(Grocery Outlet Altadena's Facebook page)In later social posts, Guajardo clarified the protocols for the daily senior shopping hour.\nBut she doesn't want these senior shopping hours to lull older people into a false sense of security about COVID-19.\nThe 99-Cent Only stores announced that they will reserve 7 to 8 a.m. on Tuesday and Thursday for senior shopping hours at all stores."}, {"url": "https://www.nytimes.com/2020/03/19/health/coronavirus-masks-shortage.html", "title": "‘At War With No Ammo’: Doctors Say Shortage of Protective Gear Is Dire", "authors": ["Andrew Jacobs", "Matt Richtel", "Mike Baker"], "date": "2020-03-19", "keywords": ["dire", "ammo", "situation", "presidents", "gear", "number", "shortage", "say", "equipment", "protective", "washington", "production", "mile", "doctors", "workers", "war", "states"], "summary": "In the United States, the number of reported cases grew to more than 11,000 on Thursday, as Senate Republicans released a plan that would provide checks of up to $1,200 for many taxpayers and Gov.\n“We hope we are not going to need it,” he said.\nThe president’s optimistic statements contrasted starkly with the situation on the ground, particularly in Washington and New York, the states with the largest number of coronavirus cases.\n“We’re on mile one of a marathon,” she said, adding, “what does mile 25 look like?”Health care workers’ fears are not abstract.\nTwo emergency room doctors in New Jersey and Washington have been hospitalized in critical condition, dozens of other health care workers across the country have already fallen ill and hundreds have been forced into quarantine."}, {"url": "https://www.theguardian.com/world/2020/mar/24/coronavirus-us-asian-americans-racism", "title": "'Coughing while Asian': living in fear as racism feeds off coronavirus panic", "authors": ["Lauren Aratani"], "date": "2020-03-24", "keywords": ["living", "american", "panic", "chinese", "group", "china", "coronavirus", "fear", "woman", "asian", "racist", "coughing", "racism", "feeds", "told"], "summary": "“My fear is coughing in public, coughing while Asian, and the reaction other people will have.”The last few weeks has seen a rise in racist incidents and comments directed toward Asian Americans tied to fears of coronavirus.\nTrump’s new name for coronavirus comes after weeks of racist attacks against Asian American seen across the country.\nAn Asian woman in New York City wearing a face mask was assaulted and called “diseased” in early February by a stranger in a subway station.\nIn Los Angeles, a man directed a racist rant about coronavirus to a fellow passenger, who is Asian.\nAsian American history scholars point out there is a long history of anti-Asian discrimination in America that gives precedent to racist attacks against Asian Americans because of coronavirus."}, {"url": "https://abc30.com/valley-events-canceled-fresno-tulare-county-coronavirus-madera/6006892/", "title": "Coronavirus update: List of Central California events canceled, postponed amid COVID-19 concerns", "authors": [], "date": "2020-03-12", "keywords": ["update", "postponed", "coronavirus", "event", "list", "held", "mart", "fresno", "rescheduled", "covid19", "annual", "canceled", "central", "california", "events", "2020march", "center", "concerns", "save", "scheduled"], "summary": "March 31, 2020March 27, 2020March 25, 2020March 22, 2020March 21, 2020March 19, 2020March 17, 2020March 16, 2020March 14, 2020March 13, 2020CHSU Ignite the Future Scholarship Gala previously scheduled for Friday, March 20, 2020.\nThe new date has not yet been released.Gabriel Iglesias' \"Beyond Fluffy World Tour\" has been rescheduled for November 27 at the Save Mart Center.The market, to be held in May, has been canceled.\nIt will be held instead on November 7 and 8.The Valley Animal Center has turned the annual Pennies 4 Pets fundraiser into a virtual one.\nDates for a new tournament have not been released.Country singer and songwriter Brantley Gilbert's concert, which was to be held on March 27 at the Save Mart Center, has been.\nThe Royalty Contest will be held on a private date.The 2020 fair set for May 14-17 has been canceled."}, {"url": "https://www.yourcentralvalley.com/election/your-local-election/whats-on-the-ballot-in-fresno-county-for-the-march-3-primary/", "title": "What’s on the ballot in Fresno County for the March 3 primary", "authors": ["Alexan Balekian"], "date": "2020-03-03", "keywords": ["measure", "district", "money", "fresno", "primary", "city", "school", "county", "tax", "say", "needs", "favor", "ballot", "unified", "whats"], "summary": "Clovis Unified School District General Obligation BondIf this measure is approved, the Clovis Unified School District governing board can issue and sell bonds up to $408 million.\nWashington Unified School District General Obligation BondIf this measure is approved, the Washington Unified School District can issue and sell bonds up to $46 million.\nParlier Unified School District General Obligation BondIf this measure is passed, the Parlier Unified School District governing board can issue and sell bonds up to $11 million.\nFresno Unified School District General Obligation Bond (Measure M)The measure authorizes the Fresno Unified School District governing bond to issue and sell bonds up to $325 million.\nThose in favor say Measure M will provide locally controlled funding for schools to prepare students for college and jobs."}, {"url": "https://www.ksby.com/news/california-news/first-case-of-coronavirus-reported-in-fresno-county", "title": "First case of coronavirus reported in Fresno County", "authors": [], "date": "2020-03-08", "keywords": ["officials", "public", "travelers", "fresno", "covid19", "coronavirus", "health", "fcdph", "county", "infected", "case", "reported"], "summary": "The Fresno County Department of Public Health (FCDPH) confirmed Saturday the first case of coronavirus in Fresno County.\nIn a press release, health officials said two travelers were tested for COVID-19 after returning from a Grand Princess cruise on March 6th.\n#BREAKING: Fresno County health officials confirm the first case of #Coronavirus in #Fresno County.\npic.twitter.com/tROkyzVOFk — Kirsten Mitchell (@Kirsten_TV) March 8, 2020One of those tests came back as a presumptive positive case, according to officials.\nHealth officials in Fresno County said there is no immediate threat to the general public and is not recommending the cancellation of events, closures of schools or buildings at this time."}, {"url": "https://www.yourcentralvalley.com/news/fresno-state-march-match-up-benefiting-student-cupboard-kicks-off/", "title": "Fresno State March Match-Up benefiting Student Cupboard kicks off", "authors": ["Fabiola Ramirez", "Jocelyn Moran", "Dom Mcandrew", "Joe Mcdonald", "Associated Press"], "date": "2020-03-02", "keywords": ["performed", "online", "cupboard", "student", "stuffed", "state", "totochoir", "fresno", "perform", "social", "video", "school", "benefiting", "matchup", "pets", "clovis", "kicks"], "summary": "CLOVIS, California (KSEE) - Despite social distancing, the choir of Clovis East High School still managed to come together and perform 'Africa' by Toto.\nChoir members, some holding stuffed animals and pets, collectively performed the 1982 hit via online video chat."}, {"url": "https://www.yourcentralvalley.com/ksee24-news/fresno-state-college-rodeo-happening-this-weekend/", "title": "Fresno State College Rodeo happening this weekend", "authors": ["Fabiola Ramirez", "Wealthy Gener"], "date": "2020-03-04", "keywords": ["works", "really", "wasnt", "rodeo", "state", "fresno", "touch", "college", "coronavirus", "night", "bad", "thought", "throat", "weekend", "happening"], "summary": "FRESNO, California (KSEE) - Cardiovascular tech, Jon Furlow who works at a Fresno hospital, tested positive for the coronavirus and shares his personal battle.\n“My body was really hot to the touch, chills during the night, a really bad sore throat, that’s how it started, but I wasn’t thinking I was gonna have the coronavirus or anything like that.\nI just thought I was feeling bad that night.”"}, {"url": "https://www.ourvalleyvoice.com/2020/03/05/political-fix-5-march-2020/", "title": "Political Fix (5 March, 2020)", "authors": [], "date": "2020-03-05", "keywords": ["measure", "jail", "election", "state", "vote", "voters", "2020", "property", "system", "california", "fix", "bail", "political"], "summary": "But Secretary of State Alex Padilla warned voters a week ago, “Our election process does not end on election night.\nIs the Cash Bail System immoral?\nThe cash bail system also raises the number of false convictions.\nA day after former Governor Brown signed the law, the bail industry collected enough signatures to qualify a measure for the November 2020 ballot.\nNew Jersey, Colorado, New Mexico and Alaska have gotten rid of their bail systems, and there is already data in New Jersey on the public safety effects of abolishing the bail system."}, {"url": "https://abc30.com/big-fresno-fair-concert-line-up-dates-bff-concerts-ticket-prices/5987793/", "title": "Big Fresno Fair 2020: First lineup of concert performers announced", "authors": [], "date": "2020-03-05", "keywords": ["lineup", "performers", "isley", "fresno", "concert", "2020", "songs", "2020prices", "big", "fair", "set", "hart", "ray", "announced", "valli"], "summary": "Becky G.The Big Fresno Fair The Big Fresno FairFrankie Valli and the Four SeasonsThe Big Fresno Fair The Big Fresno FairEzra Ray HartThe Big Fresno Fair The Big Fresno FairThe Isley BrothersThe Big Fresno Fair The Big Fresno FairFRESNO, Calif. (KFSN) -- The Big Fresno Fair announced its first set of artists set to perform for the 2020 county fair.The line-up of artists includes Becky G, Frankie Valli and the Four Seasons, newly-formed group Ezra Ray Hart and The Isley Brothers.Members of the Big Fair Fan Club will be able to purchase tickets during an exclusive online pre-sale starting Thursday, March 19 at 9:00 a.m.Tickets go on sale to the public on Friday, March 27 at 9 a.m.Saturday, October 10, 2020Prices: $30, $40, $50Becky G. is a 22-year-old artist who has hit songs including \"Dollar,\" \"Mala Santa,\" and \"Mayores.\"\nShe's also earned No.\n1 on the Billboard Latin Airplay Charts.Monday, October 12, 2020Prices: $35, $45, $55Frankie Valli has sold more than 175 million records worldwide and is known for unforgettable songs, including \"Sherry,\" \"Can't Take My Eyes Off You,\" and \"Big Girls Don't Cry.\n\"Thursday, October 15, 2020Prices: $18, $22, $32Ezra Ray Hart is a newly-formed group featuring lead singers Kevin Griffin of Better Than Ezra, Mark McGrath of Sugar Ray and Emerson Hart of Tonic.Friday, October 16, 2020Prices: $22, $32, $42The Isley Brothers are a Grammy-award winning duo that formed in the 1950s and is known for songs like \"Twist and Shout,\" which became their first Top 40 hit on both the pop and R&B charts and the award-winning tune \"It's Your Thing.\""}, {"url": "https://www.nbc4i.com/community/health/coronavirus/costco-announces-special-hours-for-members-60-and-over-tmw/", "title": "Costco announces special hours for members 60 and older", "authors": ["Eric Halperin", "Mark Taylor"], "date": "2020-03-21", "keywords": ["stores", "customers", "announces", "costco", "vulnerable", "special", "long", "open", "older", "shopping", "members", "hours", "60"], "summary": "Customers wait in a long queue to enter a Costco members wholesale outlet in Farnborough, west of London, on March 19, 2020.\n(Photo by Adrian DENNIS / AFP) (Photo by ADRIAN DENNIS/AFP via Getty Images)(Nexstar Media Wire) – Costco has joined other big box stores in creating special shopping hours for senior customers.\nThe special hours will begin March 24.\nWhile the pharmacy will also be open during those hours, the food court will operate on the normal schedule.\nCostco joins other major retailers like Target, Dollar General and Walmart in creating shopping hours reserved for the most vulnerable."}, {"url": "https://www.latimes.com/california/story/2020-03-09/california-bullet-train-officials-say-they-were-told-to-suppress-bad-news-and-shut-up", "title": "California bullet train officials say they were told to suppress bad news and ‘shut up’", "authors": ["Ralph Vartabedian", "A Former National Correspondent At The Los Angeles Times", "Joined The Newspaper In"], "date": "2020-03-09", "keywords": ["officials", "wsp", "styles", "authority", "state", "management", "project", "construction", "say", "bullet", "bad", "rail", "california", "suppress", "shut", "train", "work", "told"], "summary": "Brian Kelly, chief executive of the California High-Speed Rail Authority, said in a statement that the agency “takes seriously any claim of wrongdoing by an employee or contractor.\nWSP management, he said, told him that he didn’t need to see the documents.\nTurning around the multibillion-dollar project has proved difficult for years, given California’s complex governance structure, flawed contracts and past decisions, officials close to the project say.\nAfter The Times obtained a copy of the confidential report and published its findings, the rail authority denied the legitimacy of the analysis.\nToday, the rail authority is short by 497 of the 2,042 parcels it needs, according to its most recent progress report."}, {"url": "https://www.yourcentralvalley.com/med-watch-today/medwatch-today-future-generations-march-14-15-2020/", "title": "MedWatch Today: Future Generations, March 14-15, 2020", "authors": ["Wealthy Gener"], "date": "2020-03-12", "keywords": ["1415", "medwatch", "today", "2020", "future", "mobile", "local", "store", "app", "say", "generations", "weather", "weeks", "national", "play", "lovable"], "summary": "FRESNO, California (KSEE/KGPE) – Say hello to these lovable little babies just born into our Community family.\nHere’s this week’s Future Generations.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/crime/19-year-old-shot-and-killed-in-central-fresno-identified/", "title": "19-year-old shot and killed in central Fresno identified", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-03-04", "keywords": ["pittman", "shot", "fresno", "central", "lot", "according", "victim", "store", "app", "19yearold", "clinton", "identified", "killed", "parking"], "summary": "FRESNO, California (KSEE/KGPE) — A 19-year-old man who was shot in central Fresno Saturday afternoon died Monday, according to Fresno police.\nPolice identified the victim as Sean Pittman 19, of Fresno.\nPolice said Pittman and another male were involved in a verbal altercation in the parking lot where Pittman was located.\nThe suspect ultimately shot the victim and fled the scene in a light-colored sedan, according to police.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/fresno-county-crash-fatal-american-avenue-ave/5987873/", "title": "Children of Fresno couple killed in car accident remember parents", "authors": ["Sontaya Rose"], "date": "2020-03-05", "keywords": ["wonderful", "love", "wards", "ward", "son", "remember", "fresno", "mom", "went", "think", "accident", "children", "car", "killed", "couple", "family", "parents"], "summary": "FRESNO, Calif. (KFSN) -- Messages of love from their grandchildren now sit at the corner where a Fresno couple was tragically killed during a car crash last week.For Karen and Doug Ward's five children, their parent's life was built on family, love, kindness and service to others.\n\"The couple was married 48 years ago and until the day they died, they still held hands and never liked to be apart.\n\"They had a wonderful, wonderful life.\n\"The Ward family has always been close, so much so three siblings and their parents all lived next door to each other.\n\"Family members say Karen Ward died almost instantly, but the doctors helped Doug to live a little longer."}, {"url": "https://abc30.com/coronavirus-in-central-california-cases-corona-virus-the-valley/6019705/", "title": "Coronavirus: How Central California hospitals, government agencies, businesses are fighting COVID-19", "authors": [], "date": "2020-03-17", "keywords": ["starting", "businesses", "public", "closed", "fighting", "fresno", "agencies", "central", "city", "center", "coronavirus", "hospitals", "1000", "county", "california", "covid19", "temporarily", "announced"], "summary": "In the emergency department, only one parent or guardian is allowed in per child.Valley Animal Center closed its doors on March 19 and will be closed until further notice.\nThe hospital has created a 'drive-through' screening area where people's temperature will be taken and they will be asked about respiratory symptoms.\nThey remain operational and accessible by phone or email and say all essential services are still available.The Fresno County Sheriff Margaret Mims hasall in-person and video conference visitations at the three Fresno County Jail facilities in downtown Fresno effective immediately.\nThis will start one hour before the store opens.Sierra Vista Mall will close until further notice to prevent the spread of COVID-19.\nSquaw Valley Alpine Meadows, Mammoth Mountain, June Mountain, and Big Bear Mountain Resort are in California."}, {"url": "https://abc30.com/coronavirus-in-central-california-cases-corona-virus-the-valley/6007545/", "title": "Coronavirus: Tracking Central California COVID-19 cases", "authors": [], "date": "2020-03-12", "keywords": ["millions", "checks", "stimulus", "today", "central", "coronavirus", "tracking", "check", "california", "covid19", "receive", "cases"], "summary": "Millions to receive stimulus checks today | How to check"}, {"url": "https://www.yourcentralvalley.com/news/local-news/woman-hit-and-killed-by-car-in-downtown-fresno-police-say/", "title": "Woman hit and killed by car in downtown Fresno, police say", "authors": ["John Parmer", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-11", "keywords": ["transported", "hit", "downtown", "fresno", "store", "app", "say", "weather", "woman", "car", "r", "victim", "killed"], "summary": "FRESNO, California (KSEE/KGPE) – A woman was struck and killed by a car in downtown Fresno Wednesday morning, according to the Fresno Police Department.\nThe crash happened around 7:00 a.m. at the intersection of Mariposa and R streets in downtown Fresno.\nPolice said a car was going south on R Street when the person was struck.\nThe victim was transported to an area hospital where they later died.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/crime/police-137-pounds-of-meth-guns-cash-seized-in-fresno-bust/", "title": "Police: 137 pounds of meth, guns, cash seized in Fresno bust", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-03-13", "keywords": ["department", "fresno", "dealer", "investigation", "guns", "meth", "137", "recovered", "narcotics", "bust", "store", "monthslong", "cash", "pounds", "seized"], "summary": "The result of a monthslong investigation into a Fresno meth dealer yielded $750,000 in narcotics, guns, ammo, and more than $9,000 in cashFRESNO, Calif. (KSEE/KGPE) – Authorities busted a meth dealer after a monthslong investigation and recovered a large amount of drugs, guns, and cash, the Fresno Police Department said Friday.\nThe Police Department said the Major Narcotics Unit recovered approximately 137 pounds of methamphetamine (packaged for sales), three assault rifles, one handgun and more than 1,000 rounds of ammo.\nThe narcotics are worth $750,000 on the street, police said.\nMore than $9,000 in cash was also recovered in the bust.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/hate-crime-vandalism-race-racist/5998945/", "title": "Fresno man's car vandalized with racial slurs as Coronavirus outbreak continues", "authors": ["Gilbert Magallon"], "date": "2020-03-10", "keywords": ["happened", "hate", "fresno", "crime", "chandys", "racial", "mans", "vandalized", "coronavirus", "slurs", "chandy", "deserves", "car", "outbreak", "racist", "continues"], "summary": "FRESNO, Calif. (KFSN) -- The faint signs of a hate crime linger on an SUV belonging to Anna Chandy's dad.Her father tried removing what reads \"F-word, Asions and Coronyvirus.\"\n\"Why are they being racist to us,\" Chandy said.\nMy heart just sunk,\" Chandy said.Chandy thinks it's the misinformation behind the coronavirus that's the root of the ignorance.\n\"No one deserves any kind of racism, any hate crime.\n\"Fresno police have launched a hate crime investigation about the person responsible for tagging Chandy's father's car."}, {"url": "https://www.yourcentralvalley.com/jobs/chukchansi-park-holds-annual-job-fair-this-weekend/", "title": "Chukchansi Park holds annual job fair this weekend", "authors": ["Nathaly Juarez"], "date": "2020-03-06", "keywords": ["holds", "shortly", "fresno", "job", "chukchansi", "grizzlies", "fair", "store", "hutchings", "season", "weekend", "park", "annual"], "summary": "This Sept. 18, 2015 photo shows fans arrive at Chukchansi Park in Fresno, Calif., for a minor-league baseball game between the Fresno Grizzlies and the Round Rock Express.\n(Eric Paul Zamora/The Fresno Bee via AP)FRESNO, Calif. (KSEE/KGPE) – The Fresno Grizzlies will hold their annual job fair at Chukchansi Park in downtown Fresno on Saturday.\nThe job fair will be from 9 a.m. to noon.\nAnyone age 18 or older is welcome to apply for multiple positions at the job fair on March 7th.\nThe Fresno Grizzlies applications can be completed online at www.fresnogrizzlies.com under the Chukchansi Park tab."}, {"url": "https://www.yourcentralvalley.com/news/local-news/fresno-county-firefighters-battle-house-fire-north-of-copper-river-ranch/", "title": "Fresno County firefighters battle house fire north of Copper River Ranch", "authors": ["Paul Schlesinger", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-07", "keywords": ["battle", "safely", "smoke", "fresno", "n", "north", "county", "store", "ranch", "injuries", "river", "house", "residents", "reported", "copper", "crews", "firefighters"], "summary": "FRESNO, Calif. (KSEE/KGPE) — Fire crews battled a house fire Saturday morning just north of Copper River Ranch, according to Fresno County Cal Fire.\nThe blaze was reported around 7:30 a.m. in the area of 12000 N. Friant Road, the fire department said.\n#FriantIncident Firefighters have contained a house fire on the 12000 block of N Friant, crews reporting heavy smoke & fire upon arriving.\nAssisted by @FresnoFire pic.twitter.com/lAblsOYvr1 — CALFIRE/FresnoCoFire (@FresnoCoFire) March 7, 2020Cal Fire said all residents were evacuated from the home safely and no injuries were reported.\nFire crews from Fresno Fire Department assisted county fire crews in battling the flames."}, {"url": "https://www.yourcentralvalley.com/news/local-news/fresno-teachers-association-calls-for-closure-of-fresno-unified-schools/", "title": "Fresno Teachers Association calls for closure of Fresno Unified schools", "authors": ["Troy Pope", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-13", "keywords": ["district", "closure", "community", "state", "closures", "fresno", "association", "school", "calls", "health", "schools", "unified", "teachers"], "summary": "'We believe that school closures are the best course of action.'\nFRESNO, California (KSEE/KGPE) — The Fresno Teachers Association is asking Fresno Unified School District to close schools amid the COVID-19 pandemic — which President Donald Trump on Friday declared a national emergency.\n“Therefore, in an effort to protect the health and well-being of our students, educators, and our community, the Fresno Teachers Association is calling on FUSD Supt.\nFresno State and State Center Community College District — which operates Fresno City College and other Valley community colleges — have suspended in-person classes for the time being.\nFresno Unified — nor Clovis Unified or Central Unified — have made additional statements since Thursday."}, {"url": "https://www.yourcentralvalley.com/life-health/health/coronavirus/health-department-answers-coronavirus-questions-from-local-doctors/", "title": "Coronavirus questions from local doctors answered in Fresno", "authors": ["Justin Sacher", "Jocelyn Moran", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-04", "keywords": ["mask", "fresno", "city", "coronavirus", "questions", "local", "answered", "health", "county", "youre", "going", "respiratory", "doctors"], "summary": "FRESNO, California (KSEE) – As COVID-19 continues to spread across the United States and the world, doctors in Fresno County gathered to find out how they can battle the virus.\nOn Tuesday, public health officers spoke to local physicians on best practices when dealing with possible cases of coronavirus.\nFresno County Department of Public Health officer Dr. Rais Vohra says right now the CDC is limiting testing people for the novel coronavirus.\nLocal samples are now sent to a lab in Tulare County, which can supply results in 48 hours.\nThat’s what you’re going to be asked to do whenever you enter a clinic or a hospital."}, {"url": "https://www.latimes.com/california/story/2019-11-18/fresno-shooting-police-search-for-gunmen-who-killed-4-injured-6-at-backyard-party", "title": "Fresno shooting: Police say home where 4 were killed at backyard party was targeted", "authors": ["Staff Writer", "Alejandra Reyes-Velarde Is A Metro Reporter For The Los Angeles Times. Previously She Wrote For The San Francisco Business Times", "The Sacramento Bee. A Ucla Graduate", "She Is Originally Duarte", "Calif.", "Is A Native Spanish Speaker."], "date": "2019-11-18", "keywords": ["department", "targeted", "community", "shooting", "shot", "fresno", "party", "hmong", "southeast", "say", "backyard", "died", "men", "asian", "killed"], "summary": "Fresno police are on the hunt for at least two gunmen who opened fire during a backyard family gathering Sunday night, killing four people and wounding six.\nThe partygoers, who were gathered in the backyard to watch a football game, said it was too dark to see the shooters’ faces.\nThree men died at the scene, and one died at a hospital.\n“It’s a dark day in our community, not only in our Hmong community but in our Fresno community,” Yang said during Monday’s news conference.\nThe shooting was the second in Fresno over the weekend and comes days after two other high-profile shootings in California."}, {"url": "https://www.yourcentralvalley.com/news/top-stories/person-missing-after-rv-fire-in-fresno-county/", "title": "1 dead after RV fire in Fresno County", "authors": ["John Parmer", "Jocelyn Moran", "Dom Mcandrew", "Nathaly Juarez"], "date": "2020-03-05", "keywords": ["morning", "fresno", "wait", "store", "county", "dead", "app", "weather", "rv", "crews", "brown"], "summary": "FRESNO COUNTY, California (KSEE/KGPE) – Fresno County Fire says one person died in an RV fire this morning in Raisin City, according to Fresno County Fire.\nFresno County Fire Batallion Chief Seth Brown says the fire started around 3:20 a.m.Thursday morning in the 10000 block of south Marks near Dinuba Avenue.\nWhen crews arrived they found an Rv trailer heavily involved in fire.\nBrown says crews have to wait for the RV to cool before they could search for a victim.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/local-news/man-hospitalized-after-being-trapped-in-house-fire/", "title": "Man hospitalized after being trapped in house fire", "authors": ["Nathaly Juarez", "Dennis Valera", "Yourcentralvalley.Com Staff"], "date": "2020-03-05", "keywords": ["taken", "hospitalized", "neighbor", "store", "say", "rescue", "house", "inside", "victim", "trapped", "man"], "summary": "FRESNO, Calif. (KSEE/KGPE) – A man was taken to the hospital after being trapped in a house fire Wednesday evening.\nFirefighters received a call at around 6:50 p.m. about a house fire at 1600 block of E Courtland.\nWhen firefighters arrived they were told that a man with disabilities was trapped inside the home and that a neighbor tried to rescue the victim.\nOfficials say the neighbor was unsuccessful in the rescue and left the house.\n“Our crews did an amazing job getting in there and finding that victim within two minutes,” said Batallion Chief Kirk Wanless."}, {"url": "https://gobison.com/news/2020/3/4/softball-fresno-state-bulldog-classic-next-up-for-ndsu-on-march-6-8.aspx", "title": "Fresno State Bulldog Classic Next Up for NDSU on March 6-8", "authors": [], "date": "2020-03-04", "keywords": ["hitting", "classic", "state", "vs", "fresno", "dakota", "ctbison", "68", "game", "ncaa", "season", "bulldog", "ndsu"], "summary": "Friday, March 6Saturday, March 7Sunday, March 8North Dakota State (7-11) opens with BYU (13-6) in the first game of the Fresno State Bulldog Classic at 4:30 p.m. Central Time Friday, March 6, at Margie Wright Diamond ... NDSU will also play host Fresno State (16-4), UC Davis (12-9) and East Carolina (11-7) ...\nThe schedule:Margie Wright Diamond / Fresno, Calif.BISON vs. BYU (13-6), 4:30 p.m. CTBISON at #25 Fresno State (16-4), 9:30 p.m. CTBISON vs. UC Davis (12-9), 1:30 p.m. CTBISON at #25 Fresno State, 7 p.m. CTBISON vs. East Carolina (11-7), 11 a.m. CTNorth Dakota State travels to the Loyola Marymount Tournament on March 14-17 and then.North Dakota State tied the school record with three double plays in the 4-2 win over Weber State on Feb. 22 at the Texas Invitational ...\nIt's the seventh time NDSU has turned three DPs in a game, the last at No.\nIn the NCAA statistics (2-17-20), NDSU was No.\nThe Bison have 11 DPs thru the first 14 games this season ... NDSU only had five DPs last season ... Head coachpicked up career win No."}, {"url": "https://www.yourcentralvalley.com/news/local-news/4-killed-2-injured-in-head-on-crash-near-millerton-lake/", "title": "Victims identified in deadly head-on crash near Millerton Lake", "authors": ["John Parmer", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-13", "keywords": ["lake", "near", "suffered", "headon", "deadly", "male", "toyota", "crash", "fresno", "injuries", "fatal", "victims", "nissan", "millerton", "driver", "identified"], "summary": "FRESNO COUNTY, California (KGPE) – Four people died in a head-on crash early Friday morning near Millerton Lake, according to the California Highway Patrol.\nThe crash happened around 1:30 a.m near the Friant dam on Millerton Road.\nA 74-year-old male was driving a Nissan pickup northbound on Millerton Road approaching Bellagio Road.\nThe driver of the Nissan suffered fatal injuries and was pronounced dead at the scene.\nThe three adult females, who were seated in the rear seat of the Toyota suffered fatal injuries and were also pronounced dead at the scene."}, {"url": "https://www.yourcentralvalley.com/news/miss-california/miss-fresno-county-and-miss-clovis-discuss-their-impactful-platforms-and-journey-to-miss-california/", "title": "Miss Fresno County and Miss Clovis discuss their impactful platforms and journey to Miss California", "authors": ["Megan Rupe", "Troy Pope"], "date": "2020-03-11", "keywords": ["miss", "fresno", "platforms", "discuss", "titles", "store", "county", "app", "weather", "talk", "impactful", "california", "national", "play", "clovis", "journey"], "summary": "FRESNO, Calif. (KGPE) — Miss Fresno County and Miss Clovis talk their new titles, their impactful platforms and their journey to Miss California.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/life-health/health/coronavirus/over-60-valley-residents-in-coronavirus-self-quarantine/", "title": "Over 60 valley residents in coronavirus self-quarantine", "authors": ["Kaile Hunt", "Jocelyn Moran", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-10", "keywords": ["public", "potential", "department", "fresno", "cruise", "selfquarantine", "covid19", "coronavirus", "health", "monitoring", "county", "residents", "valley", "positive", "60"], "summary": "Rais Vohra with the Fresno County Department of Public Health said numerous people tested positive for COVID-19 who were on the cruise ship.\nLeticia Berber, Health Educator with Fresno County Department of Public Health, said they are preparing for more positive COVID-19 cases.\nWe are preparing in different scenarios.”Berber said as of right now they are monitoring more than 50 potential COVID-19 cases within Fresno County.\nThese people are self quarantined inside of their homes or place of residence and checking in with the health department daily.\nIn other parts of the Central Valley, Tulare County is currently monitoring five potential COVID-19 cases, Kings County is monitoring one potential case, and Merced County is not monitoring any cases."}, {"url": "https://www.yourcentralvalley.com/life-health/health/coronavirus/diocese-of-fresno-suspending-services-starting-monday/", "title": "Diocese of Fresno suspending services starting Monday", "authors": ["Troy Pope", "Jocelyn Moran", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-14", "keywords": ["starting", "services", "suspending", "16", "fresno", "2020", "store", "app", "29", "diocese", "employees", "sites"], "summary": "FRESNO, California (KSEE/KGPE) — The Diocese of Fresno is suspending services starting Monday.\n“All parish operations, activities, ministries, meetings of any kind, etc… will be suspended from Monday, March 16 through Sunday, March 29, 2020,” the diocese said.\nThere will be no classes, events, extended day services or any athletic practices allowed at the sites in the diocese.\nThe Diocese of Fresno will provide weekly updates on its website at www.dioceseoffresno.org and consider an extension of these directives if needed.\n“All diocesan employees are to remain at home beginning Monday, March 16 through Sunday, March 29, 2020, unless directed otherwise."}, {"url": "https://www.kget.com/news/diocese-of-fresno-make-changes-in-mass-due-to-coronavirus/", "title": "Diocese of Fresno make changes in mass due to coronavirus", "authors": ["Karen Cruz-Orduña", "Eytan Wallace"], "date": "2020-03-08", "keywords": ["mass", "fresno", "catholic", "hands", "wont", "changes", "roman", "coronavirus", "diocese", "victims", "work", "file"], "summary": "FILE – In this Sept. 27, 2015 file photo, clouds are lit by the rising sun over St. Augustine Roman Catholic Church in Philadelphia.\n(AP Photo/Julio Cortez)FRESNO, Calif. (KGET) — The Diocese of Fresno has taken new precautions to prevent the spread of coronavirus infection.\nAccording to their Facebook page, the Roman Catholic Diocese of Fresno announced Saturday new changes that will be implemented in mass during the flu season.\nPlus, anyone who shows flu-like symptoms or is not feeling well, is advised not to attend mass.\nFaithfulls won’t be able to shake hands during the “sign of the peace” and will not hold hands during the prayer of “our father,” which are common practices in every mass."}, {"url": "https://calmatters.org/blogs/california-election-2020/2020/03/california-primary-election-results-2020-proposition-13-legislative-congressional-races/", "title": "Primary 2020: Here's what we know about how California voted", "authors": ["Ben Christopher"], "date": "2020-03-04", "keywords": ["voted", "heres", "democrats", "election", "state", "know", "voters", "2020", "race", "primary", "democratic", "california", "republican", "ballots", "democrat"], "summary": "As we’ve noted before, it takes California election officials up to a month to count all the votes.\nAnd for those wondering, President Trump did quite well in the California Republican Primary.\nCan a moderate, Trump-skeptic survive outside today’s California Republican Party — or will his right-of-center supporters ditch him for a member of the GOP?\nCan a moderate critic of organized labor survive in today’s California Democratic Party?\nIn California state elections, only the first- and second-place winner in the primary move on to the general election."}, {"url": "https://www.yourcentralvalley.com/cbs47-news/monster-jam-triple-threat-happening-this-weekend/", "title": "Monster Jam Triple Threat happening this weekend", "authors": ["Fabiola Ramirez", "Wealthy Gener"], "date": "2020-03-06", "keywords": ["works", "really", "wasnt", "fresno", "touch", "threat", "jam", "night", "monster", "coronavirus", "bad", "triple", "thought", "throat", "weekend", "happening"], "summary": "FRESNO, California (KGPE) - Cardiovascular tech, Jon Furlow who works at a Fresno hospital, tested positive for the coronavirus and shares his personal battle.\n“My body was really hot to the touch, chills during the night, a really bad sore throat, that’s how it started, but I wasn’t thinking I was gonna have the coronavirus or anything like that.\nI just thought I was feeling bad that night.”"}, {"url": "https://www.yourcentralvalley.com/life-health/health/coronavirus/fresno-city-college-scccd-to-suspend-in-person-classes-starting-monday/", "title": "‘It’s better to be safe than sorry’: Fresno City College, SCCCD to suspend in-person classes starting Monday", "authors": ["Troy Pope", "Dennis Valera", "Jocelyn Moran", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2020-03-13", "keywords": ["starting", "district", "services", "community", "events", "scccd", "fresno", "sorry", "college", "city", "open", "health", "students", "inperson", "classes", "suspend", "safe"], "summary": "FRESNO, California (KSEE/KGPE) — State Center Community College District, the district that operates Fresno City College and other campuses around the Valley, announced Friday it was suspending in-person, on-campus classes starting Monday amid a steady stream of closures, cancellations and postponements due to COVID-19 fears.\nOnline classes, Design Science and Reedley Middle College High School will also continue without interruption,” SCCCD said.\nFresno City College student Daniel Ramos first didn’t understand the need for the changes, however, after looking into the virus — he’s happy with the move.\nSCCCD operates Fresno City College, Reedley College, Clovis Community College, Madera Community College Center, and Oakhurst Community College Center.\nMany of you have seen the Fresno State announcement and that SCCCD is following the Fresno State Model."}, {"url": "https://www.yourcentralvalley.com/news/annual-peach-blossom-festival-at-fresno-state-canceled-due-to-coronavirus-concerns/", "title": "Annual Peach Blossom Festival at Fresno State canceled due to coronavirus concerns", "authors": ["John Parmer", "Jocelyn Moran", "Dom Mcandrew", "Joe Mcdonald", "Associated Press"], "date": "2020-03-11", "keywords": ["peach", "state", "csu", "fresno", "blossom", "annual", "chancellors", "coronavirus", "store", "visit", "festival", "concerns", "office", "canceled"], "summary": "FRESNO, California (KSEE/KGPE) – Organizers with the Peach Blossom Festival have canceled the annual event at Fresno State.\nThe CSU Chancellor’s Office says they felt it was prudent to cancel the festival due to coronavirus concerns.\nFestival organizers released a statement saying, “We deeply regret to notify you that the Peach Blossom Festival scheduled for Thursday and Friday, March 12 and 13, 2020 has been canceled.\nGiven that many people are concerned about attending large gatherings right now, CSU Chancellor’s Office felt it was prudent to cancel the Peach Blossom Festival.”Organizers say this cancellation is the first time in 62 years the Peach Blossom Festival will not be held on Fresno State’s campus.\nThe Peach Blossom Festival is an oral interpretation of poetry at Fresno State."}, {"url": "https://www.yourcentralvalley.com/news/authorities-identify-man-in-wednesday-night-southeast-fresno-shooting/", "title": "Authorities identify man in Wednesday night Southeast Fresno shooting", "authors": ["Nathaly Juarez", "Jocelyn Moran", "Dom Mcandrew", "Joe Mcdonald", "Associated Press"], "date": "2020-01-09", "keywords": ["shooting", "shot", "fresno", "victim", "southeast", "identify", "night", "vehicle", "lt", "identified", "dooley", "store", "authorities", "man"], "summary": "FRESNO, California (KSEE/KGPE) – Authorities have identified the man who was shot in Wednesday night’s shooting in Southeast Fresno.\nThe homicide investigation began after a man was found shot to death in a vehicle in Southeast Fresno Wednesday night.\nLt. Dooley said the man was shot in the face and unable to talk.\nHe was transported to Community Regional Medical Center in critical condition, but is stable, Lt. Dooley said.\nPolice are not releasing a motive for the shooting at this time as they are following up on leads."}, {"url": "https://ktla.com/news/california/man-accused-in-fresno-rampage-said-he-was-fed-up-with-racism-found-some-white-men-to-kill-police-recording/", "title": "Man accused in Fresno rampage said he was fed up with racism, ‘found some white men to kill’: Police recording", "authors": ["Associated Press", "Los Angeles Times", "Tracy Bloom", "Courtney Friel", "With Reporting Nisha Gutierrez-Jaime", "Ktla Digital Staff"], "date": "2020-03-10", "keywords": ["muhammad", "fresno", "white", "motel", "killing", "williams", "kill", "rampage", "accused", "recorded", "recording", "men", "man", "racism", "fed"], "summary": "A man accused of killing four people in California told detectives in a recorded interview he was fed up with racism against black people and since he was suspected of killing of one white man he may as well kill more.\n“I didn’t want to do nothing to law enforcement so I just found some white men to kill,” Muhammad said to police.\nA security camera recorded Muhammad come up behind the guard and shoot him.\nOn the recording, Muhammad spoke about disrespect and racism.\nOn the recording, he said that if he was “going down for murder” the best thing was to “kill as many white men” as he could."}, {"url": "https://www.yourcentralvalley.com/bulldog-sports/bulldog-insider/four-fresno-state-wrestlers-qualify-for-ncaa-championships/", "title": "Four Fresno State wrestlers qualify for NCAA Championships", "authors": ["Andrew Marden", "Julia Lopez"], "date": "2020-03-09", "keywords": ["qualified", "state", "12", "fresno", "qualify", "wrestlers", "ncaa", "big", "championship", "minneapolis", "championships", "bulldogs", "josh", "hokit"], "summary": "The Fresno State wrestling team is in Tulsa, Oklahoma this weekend for the Big 12 Championship.\nOn March 19th, four Bulldogs will be in Minneapolis for the NCAA Championships.\nFresno State will send four automatic qualifiers to the 2020 NCAA Championships in Minneapolis on March 19-21‼️1⃣3⃣3⃣ | Lawrence Saenz1⃣4⃣9⃣ | Greg Gaxiola1⃣5⃣7⃣ | Jacob Wright2⃣8⃣5⃣ | Josh Hokit#GoDogs | #PrideOfTheValley | #Big12WR pic.twitter.com/ILz2UzqW8S — FresnoStateWrestling (@FresnoStateWRES) March 8, 2020Of the four Bulldogs qualified for the NCAAs, Josh Hokit is the only one who also qualified last year.\nHokit, who finished in third place at the Big 12 Championship at heavyweight, was an all-American last season at 197 pounds."}, {"url": "https://www.yourcentralvalley.com/news/local-news/man-stabbed-multiple-times-in-central-fresno-police-say-2/", "title": "Man stabbed multiple times in Central Fresno, police say", "authors": ["Yourcentralvalley.Com Staff", "Dennis Valera", "Nathaly Juarez"], "date": "2020-03-02", "keywords": ["arrived", "times", "multiple", "fresno", "central", "according", "stabbed", "store", "app", "say", "weather", "watching", "man", "parents"], "summary": "FRESNO, Calif. (KSEE) — A man is in the hospital after being stabbed multiple times in the back on Sunday, according to authorities.\nPolice say they responded to a call at a home near Fruit and Cornell Avenues at around 7:30 p.m. about someone being stabbed or hurt with a chair.\nWhen they arrived at least two people were watching a baby in the home, when the baby’s parents arrived the parents and family members became aggressive, according to police.\nPolice say they are investigating if the case was self-defense or if any charges will be made.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.yourcentralvalley.com/news/top-stories/shooting-investigation-underway-in-merced/", "title": "Shooting investigation underway in Merced", "authors": ["Aj Kato", "Jocelyn Moran", "Dom Mcandrew", "Nathaly Juarez"], "date": "2020-03-07", "keywords": ["torso", "suspect", "taken", "shooting", "underway", "shot", "male", "investigation", "99", "store", "say", "merced", "victim"], "summary": "FRESNO, Calif. (KSEE) – A shooting investigation is underway in Merced.\nThe suspect pulled a handgun on a male shot in another vehicle.\n#BREAKING: @MercedPolice at Childs Ave and Hwy 99 after they say a road rage incident lead to a shooting.\nI’m told one adult male victim was hit more than once in his torso and lower body, condition is not known.\nKato (@AJKatoTV) March 7, 2020Authorities say the victim was shot was several times and was taken to Modesto hospital in serious condition."}, {"url": "https://www.nytimes.com/2019/11/18/us/fresno-california-mass-shooting.html", "title": "Fresno Backyard Shooting Leaves 4 Dead and 6 Injured, Police Say", "authors": ["Jacey Fortin", "Thomas Fuller", "Mihir Zaveri"], "date": "2019-11-18", "keywords": ["authorities", "shooting", "watching", "fresno", "hall", "injured", "say", "dead", "backyard", "yard", "leaves", "wounded", "witnesses", "gathering", "family", "began"], "summary": "[Sign up for our daily newsletter about news from California here.]\nFour people were fatally shot and six others wounded after at least two people opened fire at a family gathering in Fresno, Calif., on Sunday, then fled, the authorities said.\nAbout 30 friends and family members were at the gathering at a home in Fresno when the gunfire began, Andy Hall, the chief of the Fresno Police Department, said at a news conference on Monday.\nThe authorities received reports of the shooting shortly before 8 p.m. local time.\nChief Hall said the gunmen, who were armed with pistols, entered the property through an unlocked gate and began firing at people who were watching football in the yard."}, {"url": "https://www.latimes.com/california/story/2019-10-25/newsletter-fires-explode-california-newsletter", "title": "Newsletter: Fires explode across the state", "authors": ["Staff Writer", "Julia Wick Is The Author Of The"], "date": "2019-10-25", "keywords": ["angeles", "explode", "sunny", "state", "san", "newsletter", "power", "fires", "county", "sonoma", "pge", "california", "valley", "los"], "summary": "Newsletter The stories shaping California Get up to speed with our Essential California newsletter, sent six days a week.\nSign Me Up You may occasionally receive promotional content from the Los Angeles Times.\n[See also: “California’s huge, humiliating power outages expose the vulnerabilities of PG&E’s power grid” in the Los Angeles Times.]\nAs of Thursday night, there were two major fires burning in the state: the Kincade fire in Sonoma County and the Tick fire near Santa Clarita in Southern California.\nLos Angeles Timesas the blaze, pushed by wind gusts topping 70 mph, burned out of control in a rural section of Sonoma County."}, {"url": "https://abc30.com/fresno-halloween-madera-merced-visalia/5635584/", "title": "Halloween Events across Central California", "authors": [], "date": "2019-10-28", "keywords": ["treat", "events", "halloween", "ave", "fresno", "central", "trunk", "merced", "ca", "california", "info", "visalia", "annual"], "summary": "We have food trucks, decorated trunks giving out candy and fun games to play!Event name: Dia De Los MuertosTime: 6:00PM-10:00PMLocation: Meux Home Museum, 1007 R street, Fresno CA 93721Event Info: Community event.\nYou will need to bring your own pumpkin.Event name: Kids Halloween SpooktacularTime: 2:00PM-4:00PMLocation: Oakhurst Public Library, 49044 Civic Cir, Oakhurst, CA 93644Event Info: Games, prices, crafts and giveaways!Event name: Pan Am Halloween CarnivalTime: 5:30PM-8:30PMLocation: Pan American Community Center 703 Sherwood Way, Madera, CA 93638Event Info: Join us for our annual Halloween Carnival!\nWe will have Family Games, Crafts, Face Painting, and more.Event name: 6th Annual Halloween BashTime: 7:00PM-11:00PMLocation: San Joaquin Winery, 21821 Ave 16, Madera 93637Event Info: Come enjoy our 6th Annual Halloween Bash with us this year with The Valley Cats as our featured Band!\nThere will also be a contest for the \"Best Decorated\" trunk.Event name: Halloween Magic Tricks or TreatsTime: 5:00PM-8:30PMLocation: Pioneer Elementary, 8810 14th Ave, Hanford, CA 93230Event info: PEPTC is hosting a Halloween Family Night!\nCall (559) 713-4365 for more information.Event name: Visalia Senior Center Annual Halloween LuncheonTime: 11:30 a.m.-1 p.m.Location: Visalia Senior Center - 310 N. Locust StreetEvent info: Join us the Visalia Parks and Recreation Department for a Spooktacular good time at the Visalia Senior Center's annual Halloween Luncheon!"}, {"url": "https://www.theguardian.com/us-news/2019/oct/25/police-shooting-video-isiah-murrietta-golding-fresno-california", "title": "Video shows officer shooting fleeing Fresno teen in the back of the head", "authors": ["Sam Levin", "Bill Mckibben"], "date": "2019-10-25", "keywords": ["shows", "unarmed", "officer", "shooting", "teen", "fresno", "video", "murriettagolding", "officers", "footage", "head", "chandler", "fleeing"], "summary": "Newly released video shows a Fresno, California, police officer shooting a fleeing, unarmed 16-year-old in the back of the head and then handcuffing the boy as he lies motionless on the ground.\nThe footage shows the teenager running from officers, jumping a fence, falling to the ground and continuing to flee.\nMurrietta-Golding was an estimated 35 feet away from the officers when one of them fired a single bullet into his head.\nThe shooting happened nine months after Fresno police killed Dylan Noble, shooting the unarmed 19-year-old multiple times, including while he was lying on the ground, barely moving.\nChandler faulted Fresno police for failing to implement meaningful reforms after both killings of unarmed teens."}, {"url": "https://www.yourcentralvalley.com/news/local-news/everything-you-need-to-know-about-the-big-fresno-fair/", "title": "Everything you need to know about the Big Fresno Fair", "authors": ["Yourcentralvalley.Com Staff", "Dennis Valera", "Nathaly Juarez"], "date": "2019-10-02", "keywords": ["know", "fresno", "free", "day", "lot", "long", "big", "fair", "rides", "need", "carnival", "admission", "price"], "summary": "Big Fresno Fair will run from Wednesday, October 2 to Monday, October 14th.\nFans and Followers Day & $2 carnival rides (Thursday, October 3): Big Fresno Fair Facebook fans, Twitter and Instagram followers will get into the Fair FREE from 11 a.m. – 6 p.m. on Thursday, October 3 only.\nThis day is also $2 Carnival Rides where every ride is just $2 per ride all day long!\nHalf-Price Tuesday (Tuesday, October 8): Admission is just half price all day long!\nKids’ Day (Wednesday, October 9): Admission to the Fair is FREE for kids 12 and under with a paid adult admission all day long!"}, {"url": "https://www.mwcconnection.com/2020/4/15/21217951/peak-perspective-mountain-west-over-unders", "title": "Peak Perspective: Mountain West Over/Unders", "authors": ["Apr"], "date": "2020-04-15", "keywords": ["nevada", "perspective", "mountain", "wyoming", "west", "state", "schedule", "unlv", "win", "games", "wins", "overunders", "season", "winsanalysis", "peak"], "summary": "They also have Nevada, Colorado State, Wyoming, Fresno State, and Air Force, those games are a toss-up at best.\nLuckily, the road schedule is pretty light this season with games at Ball State, Louisiana, UNLV, Nevada, New Mexico & Colorado State.\nTheir home slate is much more difficult — where they will host San Diego State, Fresno State, Utah State and Wyoming.\nLooking at conference play, Nevada, UNLV, SJSU, and CSU should be easy victories.\nIn the final four games, UNLV plays on the road at Boise State (a loss) and they have another three-game stretch to end the year to win games."}, {"url": "https://californiaglobe.com/section-2/fresno-bee-alters-website-following-california-globe-article/", "title": "Fresno Bee Alters Website Following California Globe Article", "authors": [], "date": "2019-10-15", "keywords": ["website", "community", "state", "fresno", "nunes", "nonprofit", "alters", "bee", "article", "lab", "globe", "education", "california", "following"], "summary": "This article includes inaccuracies regarding The Fresno Bee and California State University, Fresno.\nThe Fresno Bee requests that the California Globe correct the following inaccurate statements:The headline inaccurately connects The Fresno Bee’s Education Lab initiative with its political reporting about Rep. Devin Nunes.\nThe Fresno Bee has not collaborated with the Institute for Media and Public Trust at Fresno State.\nYou did not reach out to me or anyone at The Fresno Bee to confirm any information prior to publishing this story.\nWe’ve also reached out to the regional education community, including Fresno State and State Center Community College District, among others."}, {"url": "https://gvwire.com/2019/10/25/the-no-1-issue-in-the-fresno-mayoral-race-is-fresno-pd/", "title": "The No. 1 Issue in the Fresno Mayoral Race Is Fresno PD", "authors": ["Bill Mcewen", "Ap News", "Randy Reed", "Jim Jakobs", "Nancy Price"], "date": "2019-10-25", "keywords": ["department", "officer", "dyer", "fresno", "race", "janz", "decisions", "chief", "mayoral", "different", "issue", "pd"], "summary": "1 Issue in the Fresno Mayoral Race Is Fresno PDThe No.\n1 Issue in the Fresno Mayoral Race Is Fresno PDFormer police chief Jerry Dyer, left, and prosecutor Andrew Janz want to be Fresno's next mayor.\n(GV Wire Composite/Alexis DeSha)SHARE THIS ARTICLE:There are many issues and candidate qualities to access in the Fresno mayoral race pitting former police chief Jerry Dyer against Fresno County prosecutor Andrew Janz.\nReviews by Fresno PD, the Fresno County District Attorney’s Office, and the city’s independent police auditor concluded that the officer was justified to use lethal force.\nMeanwhile, the mayoral race moves forward."}, {"url": "https://thebusinessjournal.com/hemp-expo-coming-to-fresno/", "title": "Hemp expo coming to Fresno", "authors": [], "date": "2019-10-24", "keywords": ["workshops", "hemp", "fresno", "counties", "expo", "registered", "products", "county", "acres", "california", "coming"], "summary": "An industrial hemp field, images via the Fresno County Sheriff's Office.\nWritten by David Castellon published on October 24, 2019 - 2:53 PMShareTweetLinkedInEmail 0 sharesHemp growers and manufacturers of hemp-based products, along with people interested in getting into these businesses, are invited to attend California Hemp Expo Nov. 5 in Fresno.\nBut growing hemp isn’t legal yet in some California counties that still are developing local regulations for commercial hemp operations, Tulare County among them.\nKern and Riverside counties had the most registered hemp acreage, at more than 8,000 acres and 6,800 acres, respectively.\nAmong the other South Valley counties, hemp growers in Madera County had 908 acres registered, and in Kings County, 742 acres were registered."}, {"url": "https://abc30.com/list-pg-e-power-shutoffs-affect-areas-in-mariposa-madera-fresno-counties/5655818/", "title": "LIST: PG&E power shutoffs affect areas in Mariposa, Madera, Fresno counties", "authors": [], "date": "2019-10-29", "keywords": ["officials", "areas", "affect", "fresno", "counties", "area", "power", "county", "say", "pge", "mariposa", "sheriffs", "ca", "shutoffs", "list", "madera", "rd"], "summary": "notFRESNO, Calif. (KFSN) -- Pacific Gas and Electric has restored power to more than half of its customers in Madera County following dangerous winds in the area.The same goes for Fresno County where power has been restored to almost 90 percent of customers, including those in Prather.\narea- Greeley Hill- Highway 140 between Yaqui Gulch Rd.\nand the Mariposa Co. line- Hornitos- Horseshoe Bend- Mt.\nBullion- Piney Creek- Raymond- Wawona- Worman Rd / Kimball Rd area- Yaqui Gulch Rd.\nOfficials say restrooms, bottled water, charging stations and air-conditioning are available.- Oakhurst area- Bass Lake area- North Fork area- Ahwahnee area- Outlying mountain areasPower shutoffs began Sunday at around 2 pm."}, {"url": "https://www.therampageonline.com/news/2019/11/13/wildfires-attack-california-and-the-valley-cant-breathe/", "title": "Wildfires Attack California and the Valley Can’t Breathe", "authors": ["Patrick Henslee"], "date": "2019-11-13", "keywords": ["attack", "know", "central", "dont", "cant", "fires", "think", "air", "breathe", "california", "valley", "residents", "los", "wildfires"], "summary": "As Californians everywhere flee from fires, Central Valley residents are left choking on the ashes.\nCalifornia’s Central Valley currently sits surrounded by a barrage of wildfires ranging north, east and south of the agricultural bowl.\nGallery | 2 Photos Photo by: Larry Valenzuela Blazing wildfires tarnished the Central Valley skyline even more than usual on Sunday, Oct. 27, 2019.\n“I don’t think the players think about it much, but it affects a couple kids with asthma issues,” said Solberg.\nValley residents are finding this to be a growingly prevalent issue and the evidence proves it."}, {"url": "https://www.latimes.com/california/story/2020-02-12/california-bullet-train-adds-another-1-billion-to-projected-costs-for-project", "title": "California bullet train adds another $1.3 billion to projected price tag", "authors": ["Associated Press", "Don Thompson"], "date": "2020-02-12", "keywords": ["state", "projected", "money", "billion", "project", "highspeed", "central", "13", "cost", "tag", "plan", "rail", "california", "train", "adds", "price", "bullet"], "summary": "But that will use up virtually all the money the project has available.\nAdvertisementIt also tries to make the case that building first in the Central Valley remains more efficient than the alternatives.\nThe 2016 business plan estimated the project would cost $64 billion.\nThe authority raised that to $77 billion in the 2018 business plan and added $2 billion to the estimate just last year.\nState Assembly Speaker Anthony Rendon (D-Lakewood) is among lawmakers who last year called for shifting more of the high-speed rail money to urban areas."}, {"url": "https://californiaglobe.com/section-2/csu-fresno-partnering-with-fresno-bee-to-raise-nonprofit-money-to-report-about-rep-devin-nunes/", "title": "CSU Fresno Partnering With Fresno Bee to Raise Nonprofit Money to Report about Rep. Devin Nunes", "authors": [], "date": "2019-10-11", "keywords": ["community", "rep", "report", "csu", "money", "fresno", "nunes", "nonprofit", "devin", "bees", "partnering", "bee", "congressman", "education", "media", "mcclatchy", "raise"], "summary": "California State University Fresno is partnering with the Fresno Bee, a McClatchy newspaper, to raise non-profit money to report about Rep. Devin Nunes (R-CA).\n“There are many people who read about The Fresno Bee’s coverage of Devin Nunes and wanted to help,” Gustus said.\n“Irby’s inaccurate story is not the only one the Fresno Bee ran making these false claims against Nunes.\nThe Fresno Bee’s unsigned editorial also falsely includes Rep. Tom McClintock (R-CA), falsely claiming that McClintock was a member of the House Intelligence Committee.\nBut that did not stop the Fresno Bee from inaccurately claiming that he sits on the committee."}, {"url": "https://calmatters.org/california-divide/2019/10/for-california-well-owners-clean-water-is-hard-to-get/", "title": "For California well owners, clean water is hard to get as state, local hurdles remain", "authors": ["Cresencio Rodriguez-Delgado"], "date": "2019-10-31", "keywords": ["remain", "clean", "wells", "hurdles", "west", "state", "fresno", "private", "owners", "local", "hard", "valenzuela", "california", "residents", "ricardo", "water", "park"], "summary": "Reliable data on private wells are hard to come by and typically provide only a glimpse at an incomplete picture.\nAdditionally, The Environmental Protection Agency and state water agencies are not mandated to test private wells, leaving that to the owners.\nThe plan could cost about half a million dollars – money West Park residents say they simply don’t have.\nFresno County would fund the project and receive reimbursement from the state, according to Bryan Potter, State Water Resources Board Tulare District Engineer.\nIt’s expected to take eight to 10 months to hear back from the State Water Resources Board on whether the project is even feasible."}, {"url": "https://abc30.com/california-highway-patrol-saddleridge-fire-los-angeles-travel-routes-from-central-valley-la/5612228/", "title": "How the Saddleridge Fire affects travelers heading to LA from the Valley", "authors": ["Nathalie Granda"], "date": "2019-10-12", "keywords": ["heading", "travelers", "way", "central", "affects", "amtrak", "valley", "open", "saddleridge", "temporarily", "service", "la"], "summary": "UPDATE #SaddleridgeFireNB I-5 is Open.\n— Caltrans District 7 (@CaltransDist7) October 12, 2019FRESNO, Calif. (KFSN) -- Travelers in the Central Valley are feeling the heat of the Saddleridge Fire.Friday afternoon, California Highway Patrol officials announced the both directions of Interstate 5 are now open after being closed for hours.However, Amtrak has temporarily stopped bus services heading to the Los Angeles area.The Saddleridge fire is continuing to grow by the minute forcing thousands to evacuate while shutting down multiple freeways, including parts of Interstate 5.That means travelers in the Central Valley were left scrambling to find a way back home.\n\"I'm shocked because my son is waiting for me to get there so he can go to work,\" she said.Signs at the train station are also alerting travelers about the disruption however, with bags in hand, Tyler Cales says the company should tell travelers sooner.\n\"It would've been nice to have been alerted ahead of time.\nAction News reached out in hopes of getting a more precise day and time, but we have yet to receive a response."}, {"url": "https://www.aviationpros.com/airlines/press-release/21112522/volaris-volaris-begins-operation-of-new-route-between-fresno-california-and-guanajuato-guanajuato", "title": "Volaris Begins Operation of New Route Between Fresno, California and Guanajuato, Guanajuato", "authors": [], "date": "2019-10-30", "keywords": ["guanajuato", "operation", "hrs", "arriving", "fresno", "states", "mexico", "route", "begins", "california", "united", "volaris"], "summary": "“Guanajuato and California are two of the main economies of North America.\nThose interested in using the Guanajuato-Fresno (BJX-FAT) route can do so on the following itinerary:Fresno, California (FAT) – Guanajuato, Guanajuato (BJX)Friday, November 1, 2019Leaving Guanajuato at 23:12 hrs., arriving in Fresno at 01:55 hrs.\nSaturday, November 2, 2019Leaving Fresno at 03:35 hrs., arriving in Guanajuato at 07:43 hrs.\nTuesday and Saturday starting November 05, 2019Leaving Guanajuato at 00:12 hrs., arriving in Fresno at 01:55 hrs.\n•Leaving Fresno at 03:35 hrs., arriving in Guanajuato at 08:43 hrs."}, {"url": "https://www.wpr.org/derailed/high-speed-rail-debate-persists-california", "title": "The High-Speed Rail Debate Persists In California", "authors": ["Bridgit Bowden", "Shawn Johnson"], "date": "2019-09-18", "keywords": ["gov", "debate", "state", "highspeed", "project", "line", "construction", "dejong", "rail", "california", "persists", "train"], "summary": "A New TrajectoryCalifornia's high-speed rail project predates Wisconsin's train debate.\nIt authorized $9 billion in bonding for a high-speed rail line to connect San Francisco to Los Angeles in less than three hours.\n'The Most Frustrating Part'Some people have argued that it’s time to throw in the towel with California’s high-speed rail project.\nCalifornia's high-speed rail line will cut straight through his property, making the future of his operation uncertain.\nBut even though several large rail construction projects are underway, many residents aren’t clear on whether or not the high-speed rail project is still happening."}, {"url": "https://www.yourcentralvalley.com/news/local-news/historic-crest-theatre-is-showing-spooky-classics-all-october-long/", "title": "Historic Crest Theatre is showing spooky classics all October long", "authors": ["Paul Schlesinger", "Dennis Valera", "Nathaly Juarez", "Yourcentralvalley.Com Staff"], "date": "2019-10-03", "keywords": ["free", "theatre", "historic", "fresno", "long", "oct", "store", "app", "classics", "pmthe", "weather", "showing", "spooky", "crest", "ticket"], "summary": "FRESNO, California (KSEE/KGPE) — For many folks, October means Halloween movies!\nAnd the historic Crest Theatre in Downtown Fresno is showing some of the spooky classics all month long.\nHere’s the lineup:The Crow, Oct. 4 at 8 p.m.Hocus Pocus (Free), Oct. 5 at 8 p.m.Frankenstein (1931), Oct. 11 at 8 p.m.\nThe Exorcist (1973), Oct. 26 at 11:55 p.m.All money raised through ticket and concession sales goes toward renovating the historic building, which was built in the 1940s.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://www.nytimes.com/2019/11/18/us/fresno-california-mass-shooting.html", "title": "Fresno Backyard Shooting Leaves 4 Dead and 6 Injured, Police Say", "authors": ["Jacey Fortin", "Thomas Fuller", "Mihir Zaveri"], "date": "2019-11-18", "keywords": ["authorities", "shooting", "watching", "fresno", "hall", "injured", "say", "dead", "backyard", "yard", "leaves", "wounded", "witnesses", "gathering", "family", "began"], "summary": "[Sign up for our daily newsletter about news from California here.]\nFour people were fatally shot and six others wounded after at least two people opened fire at a family gathering in Fresno, Calif., on Sunday, then fled, the authorities said.\nAbout 30 friends and family members were at the gathering at a home in Fresno when the gunfire began, Andy Hall, the chief of the Fresno Police Department, said at a news conference on Monday.\nThe authorities received reports of the shooting shortly before 8 p.m. local time.\nChief Hall said the gunmen, who were armed with pistols, entered the property through an unlocked gate and began firing at people who were watching football in the yard."}, {"url": "https://www.yourcentralvalley.com/med-watch-today/medwatch-today-6-million-dollar-preterm-birth-study-in-fresno/", "title": "MedWatch Today: 6 Million Dollar Preterm Birth Study in Fresno", "authors": ["Wealthy Gener"], "date": "2020-03-25", "keywords": ["birth", "provide", "medwatch", "community", "women", "fresno", "today", "dollar", "million", "group", "care", "prenatal", "preterm", "study"], "summary": "FRESNO, California (KSEE/KGPE) – About 1 in 10 babies in the U.S. are born prematurely–with Fresno county having the second highest preterm birth rate among California counties.\nUCSF Fresno, Community Medical Centers and First Five California are working together on more than a six million dollar project to find a solution.\nThis study will be looking at if group prenatal care does lower preterm birth rates in low income communities.\nGroup prenatal care in itself is a beautiful model that women have used in different places,” said Edwards.\nIf you are interested in partnering on efforts to reduce preterm birth, reach out to EMBRACE at embrace@mail.fresnostate.edu or call 559.228.2165."}, {"url": "https://alankandel.scienceblog.com/2020/04/07/despite-marked-progress-made-fresno-kern-madera-counties-remain-hot-spots-for-dirty-wintry-air/", "title": "Despite marked progress made, Fresno, Kern, Madera counties remain ‘hot spots’ for dirty wintry air", "authors": ["Peter Hurrell", "Bill Wald", "Alan Kandel"], "date": "2020-04-07", "keywords": ["district", "2020", "wintry", "kern", "remain", "fresno", "burning", "standard", "marked", "counties", "25", "air", "valley", "hot", "pollution", "madera", "progress", "spots", "dirty"], "summary": "post-Feb. 29, 2020 is allowed, it is however, as the San Joaquin Valley Air Pollution Control District (Air District) has stated, discouraged.\nAs long as high concentrations of fine particulates in wintry Valley air persist, that fact is worrisome indeed, the counties of Fresno, Kern and Madera being impacted the most.\n“In 2019, the District adopted amendments to Rule 4901 to lower the ‘No Burning Unless Registered’ and ‘No Burning for All’ thresholds in the three counties with the biggest air pollution challenges: Madera, Fresno and Kern.\nThe lower threshold led to more frequent health-protective wood burning curtailments in these ‘Hot Spot‘ counties during the 2019-2020 winter season,” the Air District in a Mar.\nNotesDr. Michael Peterson, “Fresno needs a new path to better health,” commentary, The Fresno Bee, May 8, 2014 editionThis post was last revised on Apr."}, {"url": "https://www.theguardian.com/us-news/2019/nov/24/fresno-shooting-hmong-community", "title": "'Why did you kill my son?': mass shooting leaves Fresno's Hmong community shattered", "authors": ["Sam Levin"], "date": "2019-11-24", "keywords": ["xiong", "community", "xy", "shooting", "mass", "fresno", "hmong", "fresnos", "lee", "shattered", "families", "kill", "leaves", "victims", "kou", "war", "son"], "summary": "Ten dead after California sees three mass shootings in four days Read moreXy and three other men died: 38-year-old Kou Xiong, 31-year-old Phia Vang and 40-year-old Kalaxang Thao.\nNow we see this here’The tragedy has brought national attention to Hmong Americans, and the vibrant Hmong community in Fresno, the Central Valley city 200 miles north of Los Angeles.\nVong Mouanoutoua, a local councilman in Clovis, a neighboring city, said Hmong families were drawn to the Central Valley for farming jobs and more affordable housing.\nThe siblings of Xy Lee said fans across the globe had been reaching out.\n“Friends were always asking him to sing, and he never said no,” said Kou Lee, his 31-year-old brother."}, {"url": "https://www.sfchronicle.com/crime/article/Fresno-mass-shooting-Gunmen-opened-fire-on-Hmong-14844223.php", "title": "Fresno mass shooting: Gunmen opened fire on Hmong family party", "authors": ["Megan Cassidy", "Crime Reporter", "Michael Cabanatuan", "Follow Megan On", "Https", "Www.Facebook.Com Sfchronicle", "Follow Michael On", "Matthias Gafni", "Evan Sernoffsky", "Stefanie Dazio"], "date": "2019-11-19", "keywords": ["community", "targeted", "shooting", "mass", "fresno", "gunmen", "hall", "opened", "hmong", "party", "suspects", "asian", "men", "members", "family"], "summary": "Authorities said they believe the shooting intentionally targeted members of the city’s Hmong community.\n“The witnesses described only seeing flashes of light from the weapon, as it was too dark on that side of the house to see suspects,” Hall said.\nChildren at the party were all inside at the time of the shooting and do not appear to have been targeted, Hall said.\nThe second phase will consist of healing the community, Hall said, and boosting police resources in the area of the shooting.\nWe have no problem with them.”The Fresno shooting comes just days after the Saugus High School shooting Thursday in Santa Clarita (Los Angeles County), where a student killed two classmates and injured three others before fatally shooting himself."}, {"url": "https://abc30.com/veterans-day-central-valley-events-mariposa-fresno/5688352/", "title": "All the Veterans Day events being held in the Central Valley this year", "authors": [], "date": "2019-11-10", "keywords": ["downtown", "events", "day", "veterans", "central", "event", "click", "clovis", "valley", "info", "information", "nov", "held", "11"], "summary": "FRESNO COUNTYMERCED COUNTYMARIPOSA COUNTYKINGS COUNTYTULARE COUNTYFRESNO, Calif. (KFSN) -- From parades to pinning ceremonies to pancake breakfasts, here's a list of all the ways veterans are being honored across the Central Valley on Monday.Event name: Veterans Day ParadeDate: Monday, Nov 11, 2019Time: 10:00A.M-1:00P.M.Location: Downtown FresnoEvent Info: Join us as Clawson Motorsports honors all military who have, or are currently serve our country, at the Fresno Veterans Day Parade in Downtown Fresno on November 11th.For more information, click here Event name: Veterans Day CelebrationDate: Monday, Nov 11, 2019Time: 2:00P.M-1O:00P.M.Location: VFW Post 8900, 3585 N Blythe Ave, Fresno CAEvent Info: Join us after the Central Valley Veterans Day Parade for a free luncheon.\nThis event is open to the public.For more information, click here Event name: Veterans Pinning CeremonyDate: Monday, Nov 11, 2019Time: 2:00 P.M.Location: The Windham Senior Living Community 1100 E Spruce, Fresno CAEvent Info: The Windham Senior Living will recognize our resident veterans with a Pinning Ceremony at our flag pole.\nThe Fresno State Air Force Color Guard will introduce the ceremony with a flag raising and speech.\nThere is no cost to visit the Merced Healing Field display.\nAll veterans will receive a free complimentary breakfast as our way of saying \"thank you\" for their service.For more information, click here"}, {"url": "https://abc30.com/police-searching-for-gunmen-who-shot-at-fresno-family-gathering/5709350/", "title": "Fresno Shooting: 4 killed, 6 injured after gunmen open fire on family watching football, suspects still at large", "authors": [], "date": "2019-11-21", "keywords": ["blood", "community", "shooting", "large", "watching", "fresno", "football", "gunmen", "center", "night", "injured", "say", "suspects", "victims", "open", "house", "killed"], "summary": "EMBED >More News Videos Trauma surgeon Dr. Amy Kwok discusses medical professionals' response taking in Fresno shooting vicitms at Community Regional Medical CenterI am saddened by the disturbing and senseless act of violence tonight in Southeast Fresno.\nhttps://t.co/G6qQXFfHx0 — Andreas Borgeas (@SenatorBorgeas) November 18, 2019Thank you to all those who are reaching out in support of #Fresno during this time.\n— Andreas Borgeas (@SenatorBorgeas) November 18, 2019We are closely monitoring an alleged mass shooting in Fresno this evening.\nAt this time, we are asking all eligible blood donors to please come out today or as soon as possible to donate at a blood center or mobile drive near you.\nCRMC officials say of the shooting victims it received, three are in critical condition and two have been treated and released."}, {"url": "https://www.thetrace.org/2019/12/fresno-gun-violence-advocates-advance-peace/", "title": "Advocates Push California City to Adopt Program That Pays People Who Don’t Shoot", "authors": ["J. Brian Charles", "Team Trace", "Brian Freskos", "Sarah Ryley", "Arionne Nettles"], "date": "2019-12-06", "keywords": ["community", "fresno", "stipend", "dont", "city", "woodruff", "advocates", "shoot", "pays", "california", "gun", "push", "advance", "violence", "adopt", "peace", "program"], "summary": "But it was hardly the first case of gun violence.\nIn an effort to stem the violence, many advocates and Fresno residents have pushed city leaders to adopt an innovative violence interruption model called Advance Peace.\nIn July, the Fresno City Council heeded activists’ calls and authorized $200,000 to fund the program in 2020.\nA dearth of independent analysis for community violence prevention programs is not uncommon.\nThe Trace contacted Brand’s office to see whether or not the report had changed his opinion on funding Advance Peace."}, {"url": "https://buffalonews.com/2020/04/15/ub-buffalo-mens-basketball-malik-zachery-signing-day-2020-april/", "title": "Malik Zachery commits to UB men's basketball", "authors": ["Rachel Lenzi"], "date": "2020-04-15", "keywords": ["commits", "zachery", "seasons", "ub", "guard", "malik", "mens", "basketball", "games", "chipola", "points", "season", "program"], "summary": "On Wednesday, Zachery announced his commitment to the University at Buffalo men’s basketball team, and chose the Bulls over Ole Miss, California and UCF.\nAs a freshman at Chipola in 2018-19, Zachery averaged 8.5 points, 5.8 assists and 3.9 rebounds in 32 games.\n“This whole year was stressful,” said Zachery, who redshirted this season at Chipola and has three years of eligibility remaining.\nZachery said he signed his national letter of intent with the Bulls on Wednesday, the start of the spring signing period for men’s and women’s basketball.\nYoung joins UB womenUB announced Wednesday that Jazmine Young will join the women's basketball program as a transfer."}, {"url": "https://www.mercurynews.com/2019/12/31/six-arrested-in-connection-with-fresno-backyard-killings/", "title": "Six arrested in connection with Fresno backyard killings", "authors": ["The Associated Press"], "date": "2019-12-31", "keywords": ["xiong", "vang", "shooting", "used", "fresno", "hall", "arrested", "gang", "connection", "backyard", "killings", "believed", "weapons", "california"], "summary": "The victims were killed Nov. 17 when gunmen entered the back of a Fresno home through an unlocked gate and used semiautomatic weapons to open fire on people watching a football game in the backyard.\nBilly Xiong, 25, of Fresno, was arrested on suspicion of mail theft on Dec. 17, and authorities found one of the weapons used in the killing of the four men, Hall said.\nAlso arrested were Anthony Montes, 27; Jhovanny Delgado, 19; Pao Vang, 30; Porge Kue, 26; and Johnny Xiong.\nBoth Vang and Xiong were children when they moved to the United States from Thailand as part of refugee relocation efforts.\nIn California, Hmong settled in Fresno and the Central Valley, where sponsors hoped they could find work given their agricultural background."}, {"url": "https://californiahealthline.org/morning-briefing/monday-november-18-2019/", "title": "Monday, November 18, 2019", "authors": [], "date": "2019-11-18", "keywords": ["read", "shooting", "fresno", "rooms", "stanford", "theres", "2019", "california", "wounded", "18", "men", "hospital"], "summary": "A San Francisco jury ruled against an anti-abortion rights activist in the fetal tissue case over secretly filmed videos from 2015.\nRead more on that below, but first, here are your top California health stories of the day.\nIt was the third mass shooting in California in less than a week.\nRead more from Joshua Tehee, Brianna Calix and Larry Valenzuela of the Fresno Bee, and Laura Newberry of the Los Angeles Times.\nRead more from Joseph Geha of the Bay Area News Group and Rebecca Robbins of Stat."}, {"url": "https://www.latimes.com/california/story/2019-11-15/california-bullet-train-project-state-leaders-divided", "title": "Spending for California’s bullet train divides state leaders as never before", "authors": ["Ralph Vartabedian", "A Former National Correspondent At The Los Angeles Times", "Joined The Newspaper In"], "date": "2019-11-15", "keywords": ["authority", "state", "san", "central", "project", "spending", "divides", "plan", "rail", "californias", "valley", "leaders", "train", "bullet"], "summary": "Even after a decade of abrupt U-turns for California’s high-speed rail project, state leaders are now split like never before.\nFor the record: A previous version of this story misspelled the names of rail authority board member Daniel Curtin and Assemblyman Jim Frazier.\nThe authority argues that it would demonstrate to voters and private investors that the state can actually build and operate a bullet train.\nThe moves follow several other changes of bullet train personnel in recent months.\nRendon began the debate this summer when he called for spending more money on the bullet train route from Burbank to Anaheim and in San Francisco."}, {"url": "https://abc30.com/fresno-fire-department-firefighters-business-east-central/5725783/", "title": "Crews investigating cause of two-alarm fire at east central Fresno auto shop", "authors": [], "date": "2019-11-29", "keywords": ["scene", "twoalarm", "update", "fresno", "shop", "central", "business", "requested", "belmont", "auto", "say", "reported", "east", "cause", "crews", "investigating"], "summary": "UPDATE: Command has requested a 2nd Alarm on the Belmont incident.\npic.twitter.com/6V6bgxI51f — Fresno Fire PIO (@FresnoFire) November 29, 2019FRESNO, Calif. (KFSN) -- Fresno Fire is investigating the cause of a two-alarm fire at an autobody shop in east central Fresno.The fire was first reported around 7:30 a.m. Friday at a business near Belmont and Backer.Fire crews say five cars were inside the shop and were damaged by the fire.Firefighters will be at the business until 9:30 a.m. to clean up the scene."}, {"url": "https://www.aviationpros.com/airlines/press-release/21112522/volaris-volaris-begins-operation-of-new-route-between-fresno-california-and-guanajuato-guanajuato", "title": "Volaris Begins Operation of New Route Between Fresno, California and Guanajuato, Guanajuato", "authors": [], "date": "2019-10-30", "keywords": ["guanajuato", "operation", "hrs", "arriving", "fresno", "states", "mexico", "route", "begins", "california", "united", "volaris"], "summary": "“Guanajuato and California are two of the main economies of North America.\nThose interested in using the Guanajuato-Fresno (BJX-FAT) route can do so on the following itinerary:Fresno, California (FAT) – Guanajuato, Guanajuato (BJX)Friday, November 1, 2019Leaving Guanajuato at 23:12 hrs., arriving in Fresno at 01:55 hrs.\nSaturday, November 2, 2019Leaving Fresno at 03:35 hrs., arriving in Guanajuato at 07:43 hrs.\nTuesday and Saturday starting November 05, 2019Leaving Guanajuato at 00:12 hrs., arriving in Fresno at 01:55 hrs.\n•Leaving Fresno at 03:35 hrs., arriving in Guanajuato at 08:43 hrs."}, {"url": "https://patch.com/california/fresno/calendar/event/20191128/678890/turkey-trot-2019-fresno", "title": "Turkey Trot 2019: Fresno", "authors": [], "date": "2019-10-23", "keywords": ["thanksgiving", "participants", "family", "trot", "turkey", "start", "awards", "fresno", "tradition", "2019", "walk"], "summary": "Turkey Trot FresnoThursday, November 28, 2019 - 8 a.m.Woodward Park Mountain View Shelter, 7775 N. Friant Road, Fresno, CA US 93720From organizers:\"Fresno's Annual Turkey Trot benefiting Fresno Community Food Bank!\n\"What a great way to start your Thanksgiving!\nRun or walk on Thanksgiving morning and then eat your Thanksgiving feast guilt-free.\n\"For 2019 we are offering a long sleeve Thanksgiving shirt and a 4\" personal pie for all of our participants.\n\"FAMILY TRADITION: This family tradition is presented by Sierra Challenge Express Running Club."}, {"url": "https://gvwire.com/2019/11/04/california-economic-summit-in-fresno-is-biggest-ever/", "title": "California Economic Summit in Fresno Is Biggest Ever", "authors": ["David Taub", "Ap News", "Randy Reed", "Jim Jakobs", "Nancy Price"], "date": "2019-11-04", "keywords": ["economic", "biggest", "state", "summit", "fresno", "regions", "california", "weber", "valley", "economy", "waiting"], "summary": "Downtown Fresno is hosting the California Economic Summit on Thursday and Friday.\n(California Forward)SHARE THIS ARTICLE:For the eighth year — and the first time in Fresno — California Forward is holding an economic summit focused on how to improve the Golden State across many different sectors.\nAnd, according to California Forward’s co-chairman Pete Weber, the two-day event — dubbed “Regions Rise Together” — will be the biggest in history.\nThe California Economic Summit itself starts Thursday at the DoubleTree Hotel in downtown Fresno.\nWe are making progress in building our human capital like never before.”Related Story: Valley Economy Will Get a Close Look From Newsom at Summit"}, {"url": "https://www.montgomeryadvertiser.com/story/sports/college/auburn/2020/04/12/4-star-power-forward-jt-thor-commits-auburn-basketball-bruce-pearl-jalen-green-greg-brown-recruiting/2978612001/", "title": "Could 4-star PF JT Thor's commitment be the start of a huge recruiting month for Auburn?", "authors": ["Josh Vitale", "Published A.M. Ct April"], "date": "2020-04-12", "keywords": ["thor", "start", "2020", "tigers", "pf", "class", "month", "auburn", "commitment", "jt", "power", "forward", "thors", "memphis", "huge", "recruiting", "4star", "pearl", "land"], "summary": "On Easter Sunday, they landed the first — JT Thor, a four-star power forward out of Norcross, Georgia, ranked as the No.\n51 overall player in the 2020 class, announced his commitment to Auburn over Oklahoma State.\n\"Bruce Pearl and the class that's coming in, it jelled well with me,\" Thor told Evan Daniels during a commitment video shot by 247Sports.\nAuburn returns Williams at power forward and Akingbola at center, and will now add Thor and three-star West Memphis, Arkansas, power forward Chris Moore, who signed in November.\n1 overall pick in next year's NBA draft — Auburn's 2020 class would jump up to No."}, {"url": "https://calmatters.org/california-divide/2019/11/economic-summit-4-2-billion-fresno-investment-plan-announced/", "title": "Economic summit: $4.2-billion Fresno investment plan announced", "authors": ["Manuela Tobias"], "date": "2019-11-08", "keywords": ["community", "economic", "42billion", "newsom", "state", "summit", "fresno", "plan", "investment", "need", "california", "valley", "leaders", "announced"], "summary": "The Central Valley Community Foundation announced a plan to attract $4.2 billion in investments to revitalize Fresno at the eighth annual California Economic Summit.\nThe Fresno investment plan is the brainchild of more than 300 community leaders who came up with the DRIVE initiative, which stands for Developing the Region’s Inclusive and Vibrant Economy.\nOther community leaders spoke about the struggles facing the Central Valley, from a dearth of high-paying jobs to poor air quality.\nSaúl Jiménez-Sandoval, provost of Fresno State, said education is key to attracting employers, but his university turned away 8,260 eligible students this fall.\n“We need more because we are not restricted at Fresno State by capacity."}, {"url": "https://abc30.com/sports/fresno-state-loses-to-utah-state-37-35/5686515/", "title": "Fresno State loses to Utah State, 37-35", "authors": ["Stephen Hicks", "Brianna Mellon"], "date": "2019-11-10", "keywords": ["loses", "west", "state", "fresno", "week", "win", "game", "touchdown", "went", "utah", "dogs", "3735", "yards"], "summary": "Dogs taking on Utah State (whose QB I covered in high school).\nThe Dogs welcomed in Utah State who dropped back-to-back games against Air Force and BYU.The game was tied at 14 in the second quarter.\nUtah State scored on back-to-back drives.\nHe went 30 yards, initially ruled a touchdown.\nThe Aztecs sit atop the MW West division with a record of 7-1 (MW 4-1) prior to their game against Nevada."}, {"url": "https://www.yourcentralvalley.com/news/crime/suspect-in-fresno-mass-shooting-extradited-from-minnesota/", "title": "Suspect in Fresno mass shooting extradited from Minnesota", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-02-02", "keywords": ["xiong", "suspect", "extradited", "shooting", "murder", "mass", "fresno", "street", "minnesota", "charges", "target", "county", "office"], "summary": "FRESNO, Calif. (KSEE/KGPE) — A man who police say was involved in the mass shooting in Fresno that killed four men and injured six in November was extradited Friday from Minnesota into the Fresno County Jail, according to jail records.\nGer Lee, 27, was transferred from Sherburne County custody and into Fresno County custody at 6 a.m. PST and was booked into the county jail at 10:16 p.m. PST, jail records said.\nLee was wanted in the Fresno case, but was held on unrelated charges in Minnesota.\nRELATED: Charges filed in Fresno mass shooting caseThe Fresno County District Attorney’s Office says Lee is charged on 17 counts — including murder, street gang activity, street terrorism, and other charges.\nLee is said to have signed an extradition waiver which cleared the way for him to be returned to Fresno to face his charges."}, {"url": "https://www.cnn.com/2019/11/18/us/five-things-november-18-trnd/index.html", "title": "5 things to know for November 18: Fresno shooting, Hong Kong protests, impeachment testimony", "authors": ["Aj Willingham"], "date": "2019-11-18", "keywords": ["hong", "shooting", "videos", "know", "fresno", "watch", "watched", "impeachment", "prince", "testimony", "protests", "andrew", "18", "replay", "epstein", "things", "kong", "trump"], "summary": "(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily.\nFresno shootingA shooting at a football watch party in Fresno yesterday ended with four people dead, six others wounded and very few answers as to who's responsible.\nHong KongIt was a weekend of intense battles and prolonged standoffs between police and protesters in Hong Kong.\nJUST WATCHED Universities are new battleground in Hong Kong protests Replay More Videos ... MUST WATCH Universities are new battleground in Hong Kong protests 02:424.\nThis latest interview was the first time Prince Andrew has spoken publicly about the allegations, and the result drew almost universal condemnation."}, {"url": "https://abc30.com/5629562/", "title": "Latino Life: Local trailblazers getting recognition in southeast Fresno", "authors": [], "date": "2019-10-20", "keywords": ["recognition", "community", "university", "fresno", "training", "life", "southeast", "local", "latino", "sefceda", "2019", "yvonne", "luncheon", "getting", "work", "trailblazers"], "summary": "Yvonne Romero, Former Fresno Bee Community Relations OfficerAdrian Alvarez, Fresno Police SergeantDr. Joseph Jones, Fresno Pacific University PresidentRobert Pao Ly, Business OwnerAttorney Pat Brown, Life-Time Achievement AwardDr. Theresa Perez, Posthumous AwardFRESNO, Calif. (KFSN) -- Local community leaders will be honored in November for their impact on southeast Fresno.Southeast Fresno Community Economic Development Association, or SEFCEDA, will hold its annual Trailblazers for Prosperity Awards Luncheon Wednesday, November 6, 2019, at 11:30 a.m. at the Fresno Fairgrounds.SEFCEDA CEO Jose Leon Barraza says the organization is connecting southeast Fresno residents with job training and educational opportunities.SEFCEDA is also on a mission to create a new park and soccer complex in Southeast Fresno.Barraza joined Latino Life host Graciela Moreno in the ABC30 studios on October 17, 2019, to discuss the work of SEFCEDA and the luncheon that will honor community members for their contributions to the area.Honorees include:"}, {"url": "https://abc30.com/valley-weather-fresno-madera-mariposa/5712448/", "title": "Drive safe! Two storms will hit the Valley during Thanksgiving and on Black Friday", "authors": ["Kevin Musso"], "date": "2019-11-22", "keywords": ["thanksgiving", "potential", "hit", "storms", "pass", "snow", "drive", "air", "major", "northern", "los", "valley", "california", "black", "storm", "rain", "safe"], "summary": "FRESNO, Calif. (KFSN) -- Two storm systems are expected to slam California next week just in time for the busy travel days leading up to Thanksgiving.According to AccuWeather, the first storm is expected to start spreading rain across the state on Nov. 26 while a second system will move across California on Black Friday.Snow is likely to cause disruptions over the major passes, including along I-80 and perhaps I-5.AccuWeather says heavy downpours could lead to localized flooding and even a few mudslides in burn scar areas that have been impacted by wildfires recently.\nRoads can also be slippery in these areas at the onset as the lack of rain in the past couple of months has allowed oil to build up on the pavement.Even though the storm will be moving across Northern California, a strong onshore flow of moisture from the southwest will bring the potential for rain at times down to Los Angeles and San Diego.Across Southern California, the most likely time to see rain will be during the day on Wednesday.\nAs the storm helps to pull down colder air, some of the showers could contain small hail, especially across Northern California.The colder air diving down will also mean that snow will be a major concern for travelers trying to get through some of the passes.Snow levels are forecast to drop to around 5,000 feet and perhaps even lower, which will lead to accumulating snow at Donner Pass along Interstate 80.\nThere is the potential for around a foot or more of snow at the pass from this storm.If the cold air really drills deep down into California, it's not out of the question that some wet snow could mix in at Tejon Pass in Los Angeles County."}, {"url": "https://www.eastbaytimes.com/2019/11/20/deadly-attack-leaves-california-hmong-community-in-shock-2/", "title": "Popular Hmong singer among victims in Fresno mass shooting", "authors": ["Associated Press"], "date": "2019-11-20", "keywords": ["xiong", "community", "shooting", "mass", "fresno", "hall", "according", "hmong", "party", "killing", "singer", "victims", "men", "popular", "killed"], "summary": "By TERENCE CHEA and OLGA R. RODRIGUEZ | The Associated PressFRESNO — A close-knit Hmong community was in shock after gunmen burst into a California backyard gathering and shot 10 men, killing four, including a popular singer who used to live in Long Beach.\nSunday evening’s attack killed Xy Lee, a Hmong singer and musician ― and a former Long Beach resident — whose videos on YouTube have been viewed millions of times.\nAlso killed were Phia Vang, 31; Kou Xiong, 38; and Kalaxang Thao, 40, all of Fresno, according to the coroner’s office.\nThere are about 300,000 Hmong living in the U.S., according to the 2017 American Community Survey by the U.S. Census.\nPolice were investigating whether the shooting was connected to a recent disturbance involving some of the people at the party, Hall said."}, {"url": "https://www.theguardian.com/us-news/2019/nov/18/california-mass-shootings-gun-violence-control", "title": "Ten dead after California sees three mass shootings in four days", "authors": ["Sam Levin"], "date": "2019-11-18", "keywords": ["killed", "shooting", "mass", "sees", "dead", "working", "children", "days", "california", "safety", "gun", "victims", "shootings", "violence"], "summary": "Ten people were killed in three mass shootings in California in just four days, marking a particularly brutal wave of gun violence incidents in the state.\n“There’s a moment where you just feel hopeless,” said Kasey Zahner, the San Diego group lead for Moms Demand Action, a gun safety organization.\nThe group defines mass shootings as cases in which four or more people are shot and killed, excluding the shooter.\nThe group’s analysis of 173 mass shootings in recent years found that 59% of them happen in private homes.\nAri Freilich, state policy director with the Giffords Law Center to Prevent Gun Violence, noted that California had some of the strongest gun laws in the country and that research had shown Californians are significantly safer from gun violence than the rest of the country."}, {"url": "https://thebusinessjournal.com/public-notices-11-8-19/", "title": "Public Notices 11/8/19", "authors": [], "date": "2019-11-08", "keywords": ["public", "fresno", "court", "notices", "county", "sale", "date", "notice", "california", "information", "trustee", "property", "11819"], "summary": "The law requires that information about trustee sale postponements be made available to you and to the public, as a courtesy to those not present at the sale.\nB, Temecula, CA 92590 (619) 465-8200 FOR TRUSTEE’S SALE INFORMATION PLEASE CALL (800) 280-2832 The Mortgage Law Firm, PLC.\nThe law requires that information about trustee sale postponements be made available to you and to the public, as a courtesy to those not present at the sale.\nA-4709659 11/08/2019, 11/15/2019, 11/22/201911/08/2019, 11/15/2019, 11/22/2019———————————–NOTICE OF TRUSTEE’S SALE Trustee Sale No.\nA-4708508 11/01/2019, 11/08/2019, 11/15/201911/01/2019, 11/08/2019, 11/15/2019———————————–NOTICE OF TRUSTEE’S SALE Trustee Sale No."}, {"url": "https://abc30.com/fresno-fire-firefighters-smoke-building/5716863/", "title": "Firefighters battle green waste fire in southeast Fresno", "authors": [], "date": "2019-11-25", "keywords": ["waste", "green", "battle", "maple", "large", "fresno", "investigation", "recycling", "southeast", "facility", "north", "crews", "firefighters"], "summary": "#GreenIncident Firefighters are battling a large green waste fire at a green waste recycling facility located on North & Maple.\nApprox 100ft x 100ft pile of green waste.\nCrews are reporting exposures threatened but not involved.\nCause is under investigation.\npic.twitter.com/akrNvSsvjQ — CALFIRE/FresnoCoFire (@FresnoCoFire) November 25, 2019FRESNO, Calif. (KFSN) -- Fire crews are battled a large fire at a green waste recycling facility in southeast Fresno.CAL FIRE Fresno County firefighters responded to the building on East North Avenue and Maple Avenue Sunday afternoon.Officials say firefighters worked to keep the flames away from nearby buildings.The cause of the fire is under investigation."}, {"url": "https://abc30.com/fresno-shooting-man-shot-online-sale-exchange-police/5692882/", "title": "Man shot during online sale exchange in southwest Fresno, police searching for suspect", "authors": [], "date": "2019-11-14", "keywords": ["suspect", "shot", "southwest", "fresno", "searching", "exchange", "meet", "sell", "sale", "say", "youre", "substations", "man", "online", "safe"], "summary": "\"He came over to sell an item off one of these apps where you can post items for sale, met with a guy, unknown what happened.\nHe got shot,\" McKnight said.Investigators now believe the shooting happened near Annadale and MLK Jr Boulevard.After he was shot, they say the injured man got in his car and drove to the nearest place he could find help.\n\"At each one of our five police district substations, we have about the area right in front of our substations for a safe exchange,\" McKnight said.\nYou're better off using one of these safe exchange stations.\n\"At this point, police have only told Action News that the suspect is described as a younger man with dreadlocks.Anyone with information is asked to contact the Fresno Police Department."}, {"url": "https://gvwire.com/2019/11/18/blood-donations-needed-after-fresno-mass-shooting/", "title": "Blood Donations Needed After Fresno Mass Shooting", "authors": ["Ap News", "Randy Reed", "Jim Jakobs", "Nancy Price"], "date": "2019-11-18", "keywords": ["blood", "community", "tragedy", "senseless", "shooting", "mass", "fresno", "center", "mayor", "donations", "responsible", "needed"], "summary": "SHARE THIS ARTICLE:The Central California Blood Center needs blood following a mass shooting in southeast Fresno that killed four men and critically injured six other people Sunday.\npic.twitter.com/AqOMOIPlXN — CenCABloodCenter (@CenCABlood) November 18, 2019Use this link to locate a blood center or blood drive in your vicinity.\nAt 5 p.m. Monday, a blood center official told GV Wire that while donations had been steady throughout the day, more blood was still needed.\n– AJ — Andrew Janz (@JanzAndrew) November 18, 2019We are closely monitoring an alleged mass shooting in Fresno this evening.\n-AJ — Andrew Janz (@JanzAndrew) November 18, 2019Related Story: Fresno Police Hunt for Suspects in Mass Shooting"}, {"url": "https://www.mercurynews.com/2019/11/19/california-capital-of-gun-control-sees-three-mass-shootings-in-four-days/", "title": "California — capital of gun control — sees three mass shootings in four days", "authors": ["John Woolfolk", "John Woolfolk Is A Reporter For The Bay Area News Group", "Based At The Mercury News. A Native Of New Orleans", "He Grew Up Near San Jose. He Is A Graduate Of The Uc Berkeley School Of Journalism", "Has Been A Journalist Since", "Covering Cities", "Counties", "Law Enforcement", "Courts", "Other General News. He Also Has Worked As An Editor Since"], "date": "2019-11-19", "keywords": ["shooting", "state", "mass", "sees", "deaths", "laws", "control", "days", "california", "gun", "shootings", "capital", "recent"], "summary": "But the Golden State also has seen three mass shootings in four days and four in the last three weeks.\nDoes gun control work?\nThe states with the lowest rates of gun deaths also tend to be those with the strictest gun laws.\nAnd recent mass shootings are adding to California’s grim tally for 2019.\nIt’s unclear whether the recent mass shootings involved violations or gaps in existing state and federal law."}, {"url": "https://abc30.com/cal-fire-fresno-county-highway-168-crash-buckeye-hellport/5708229/", "title": "1 injured after vehicle goes off cliff, catches fire on Hwy 168 in Fresno Co.", "authors": [], "date": "2019-11-20", "keywords": ["highway", "168", "firefighters", "fresno", "hwy", "near", "goes", "vehicle", "injured", "rescue", "cliff", "driver", "officers", "heliport", "catches"], "summary": "#BuckeyeIncident Firefighters are on scene of a vehicle over the side on HWY 168 & Buckeye Heliport, near the top of the 4-lane.\nOne patient injured - needing rescue with vehicle on fire.\nFresno County Fire Rescue Team responding.\npic.twitter.com/mWX6I9e8CJ — CALFIRE/FresnoCoFire (@FresnoCoFire) November 20, 2019FRESNO, Calif. (KFSN) -- California Highway Patrol officers say one person was severely injured when their vehicle caught fire after crashing over a cliff on Highway 168 near the top of the four-lane.CAL FIRE Fresno County firefighters responded to the area of Buckeye Heliport along the highway just before 5:30 p.m.Crews were able to douse the flames and rescue the driver.\nThe victim was airlifted to Community Regional Medical Center with major injuries.The cause of the crash is under investigation, but CHP officers believe the driver may have had trouble with the brakes."}, {"url": "https://abc30.com/5665382/", "title": "1 injured in central Fresno drive-by shooting, police searching for suspect", "authors": [], "date": "2019-11-02", "keywords": ["tyler", "suspect", "shooting", "fresno", "searching", "central", "vehicle", "injured", "nathalie", "driveby", "abc30", "victim", "granda", "nathalieabc30"], "summary": "#UPDATE Fresno Police say the two victims were shot at by a suspects in another car.\n@ABC30 — Nathalie Granda (@NathalieABC30) November 2, 2019Fresno police appear to be looking at this car.\n@ABC30 pic.twitter.com/ctrUCQ1J3r — Nathalie Granda (@NathalieABC30) November 1, 2019Active scene on Tyler and Fisher.\nNeighbors tell me they believe it was a shooting, and heard at least 4 rounds.\nOne victim, a man in his 30s, was grazed in the stomach, and the other was not injured.Police do not believe the shooting was gang-related."}, {"url": "https://www.yourcentralvalley.com/cvt/saturdays-fresno-cares-event-downtown-highlights-community/", "title": "Saturday’s “Fresno Cares” event downtown highlights community", "authors": ["Wealthy Gener"], "date": "2019-11-16", "keywords": ["community", "downtown", "cares", "awards", "saturdays", "fresno", "workplace", "business", "today", "support", "questions", "event", "working", "yes", "highlights", "childfriendly", "parents"], "summary": "It is the annual mission of the Child-Friendly Business Awards to highlight businesses in our community that go above and beyond for working parents.\nNow, more than ever, child-friendly business practices are being put into effect and should be celebrated.\nComplete the following questions to see if your company qualifies as child-friendlyIf you answered yes to both questions above and would like to acknowledge your workplace for all they do to support parents in the workplace, nominate them for the Child-Friendly Business Awards today: https://www.first5fresno.org/cfb-awards/"}, {"url": "https://abc30.com/family-of-48-year-old-man-found-dead-in-fresno-canal-sought/5667208/", "title": "Authorities seeking family of 48-year-old man found dead in Fresno canal", "authors": [], "date": "2019-11-05", "keywords": ["canal", "48yearold", "fresno", "near", "coroners", "penas", "belmont", "discovered", "county", "dead", "say", "office", "seeking", "authorities", "man", "family"], "summary": "EMBED >More News Videos Fresno Police say the man was discovered in the water near Yosemite and Belmont Avenues just before 12:30 p.m.FRESNO, Calif. (KFSN) -- The Fresno County Coroner's Office is searching for the family of 48-year-old Thomas Pena, whose body was found in a central Fresno canal Saturday.Pena was discovered near Belmont and Fulton Avenues.\nOfficials say there were no signs of trauma to his body.Officials say they want to find Pena's family to allow for him to have a proper burial.Anyone who is related or may have information about Pena's relatives is asked to contact the Fresno County Coroner's Office at 559-600-3400."}, {"url": "https://nmstatesports.com/news/2020/4/14/football-aggies-ink-five-more-signees-for-2020.aspx", "title": "Aggies Ink Five More Signees for 2020", "authors": [], "date": "2020-04-14", "keywords": ["wide", "ink", "hs", "community", "nm", "state", "holmes", "2020", "defensive", "signees", "offensive", "calif", "played", "aggies"], "summary": "NEW SIGNEESPREVIOUS SIGNEES++ NM State ++– Five more student-athletes, including two transfers from FBS schools, have made their commitments to play football at NM State.Defensive backs Olan Cazad Jr. and D.J.\nMcCullough, defensive tackle Darvis Holmes, offensive lineman Gabriel Preciado and tight end Anthony Roberson signed with the Aggies on Wednesday, strengthening the program's 2020 signing class.\n\"Holmes and Roberson each come to NM State from FBS programs.\nThe Imperial Beach, Calif., native spent the 2019 campaign at Southwestern CC in Chula Vista, Calif.Wednesday's additions raise NM State's group of signees to 22.\n| Coffeyville Community College6-0 | 180 | Wide ReceiverTwentynine Palms, Calif. | Saddleback College6-1 | 170 | SafetyPompano Beach, Fla. | Independence Community College6-0 | 200 | Wide ReceiverTruckee, Calif. | Truckee HS | Saddleback College6-1 | 190 | CornerbackLiberty, Mo."}, {"url": "https://abc30.com/5734533/", "title": "Valley's rain total now almost at normal after cold-weather storm system", "authors": ["Cristina Davies"], "date": "2019-12-05", "keywords": ["total", "valleys", "wont", "thats", "getting", "fresno", "mean", "snow", "normal", "system", "coldweather", "valley", "seeing", "usually", "storm", "rain"], "summary": "FRESNO, Calif. (KFSN) -- The Central Valley is getting soaked.Starting last week, California was hit with a cold system, one that's a little unusual for November.\n\"It doesn't mean it won't rain, or we won't get any snow.\nIt just might be below the typical value,\" said Ochs.This could eventually mean trouble out on the roads.\n\"If we don't get the low-pressure systems like we've been getting and we get more of the high pressure, that's usually more favorable for tule fog.\n\"The Valley has already seen some bad weather-related wrecks this year, so whether we are seeing rain, snow, or fog, remember to take it slow out on the roads."}, {"url": "https://thecapitalsportsreport.com/2020/04/09/espn-disney-forces-ufc-dana-white-stand-down/", "title": "ESPN/Disney forces UFC, Dana White to stand down", "authors": ["Anthony Caruso Iii", "View All Posts Anthony Caruso Iii", "About Anthony Caruso Iii", "Anthony Caruso Iii Is The Publisher Of The Capital Sports Report."], "date": "2020-04-09", "keywords": ["gonna", "report", "vs", "tachi", "dana", "white", "forces", "fight", "stand", "espn", "disney", "espndisney", "ufc", "capital"], "summary": "By Anthony Caruso III | PublisherAccording to ESPN, UFC has been forced to postpone all fight cars indefinitely.\nDana White announced on Thursday — two days after he announced that UFC 249 would continue on April 18th — that the fight would no longer take place.\nDisney Logo (Photo by Disney)The UFC President had said that April 18th fight would be on ESPN.\nIt was previously reported this week that White had planned to host events in the United States.\nThe Capital Sports Report and its logo are official trademarks of Anthony Caruso III and Anthony Caruso Enterprises."}, {"url": "https://www.yourcentralvalley.com/news/crime/deputies-seek-person-of-interest-connected-to-december-fresno-homicide/", "title": "Deputies seek person of interest connected to December Fresno homicide", "authors": ["Paul Schlesinger", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2020-03-06", "keywords": ["fresno", "saiddeputies", "person", "store", "seek", "homicide", "deputies", "connected", "jose", "seeking", "identified", "man", "botti", "interest"], "summary": "FRESNO, Calif. (KSEE/KGPE) — Deputies are seeking the public’s help in finding a person of interest in connection to a late December homicide in Fresno, according to the Fresno County Sheriff’s Office.\nThe person deputies are seeking is identified as Jose Luis Godinez, 35, who goes by the nickname of “Bola,” spokesman Tony Botti said.\nDeputies received a call on Dec. 29, 2019 regarding an injured man inside the garage of a home in the area of 5200 E. Belmont Avenue in Fresno.\nGodinez, who is believed to have been at the home at the time of the murder, has been identified as a person of interest in the investigation, Botti said.\nDeputies said Godinez is from Sanger, but also frequents northwest Fresno and the area of McKinley and Marks avenues."}, {"url": "https://www.yourcentralvalley.com/news/crime/police-investigate-central-fresno-shooting/", "title": "Police investigate central Fresno shooting", "authors": ["John Parmer", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2019-12-05", "keywords": ["transported", "shooting", "stay", "fresno", "central", "unknownif", "store", "app", "tuned", "weather", "investigate", "urged", "victim"], "summary": "FRESNO, California (KSEE/KGPE) – Fresno Police are investigating a shooting in central Fresno.\nPolice said they responded around 11:30 a.m. to the 600 block of N Safford Avenue, for a victim of a shooting.\nIf you have any information you are urged to contact the Fresno Police Department at (559) 621-7000.\nStay tuned on-air and online for more information.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/5761100/", "title": "5-year-old Fresno girl hit in eye after shots fired into family's apartment", "authors": ["Gilbert Magallon"], "date": "2019-12-17", "keywords": ["rounds", "targeted", "hit", "complex", "familys", "shooting", "suspect", "fresno", "5yearold", "apartment", "shots", "fired", "say", "eye", "girl", "bullet"], "summary": "HAPPENING NOW: Fresno Police continue to investigate a shooting at the Ashmark Arms apartment complex off Ashlan & Marks.\nA 5-year-old girl was injured and is expected to be okay.\nPolice say a bullet or bullet fragment hit her left eye.\nMore details on @ABC30 at 11. pic.twitter.com/FJn5pWQ3q8 — Gilbert Magallon (@GilbertABC30) December 17, 2019FRESNO, Calif. (KFSN) -- A 5-year-old girl has been injured in a shooting in central Fresno.Police say shots were fired into her family's apartment in what they believe was a targeted attack.The shooting took place at about 6:15 p.m. at the Ashmark Arms apartment complex off Ashlan and Marks.According to detectives, a suspect went onto the complex and fired through the door of a unit.Inside, there was a family a five - a father, mother and their three children.Their five-year-old daughter was struck.Police say a bullet or bullet fragment hit the 5-year-old's left eye, but she is expected to be ok.\"They were inside not doing anything in particular when all of a sudden shots rang out and rounds started coming through their front door,\" said Lt. Bill Dooley.Police say multiple rounds were fired into the home.One witness told us they heard at least 11 gunshots and heard a vehicle take off.Detectives believe the home was targeted, but they don't know why.Those who live in the complex say they haven't had any shootings happen in recent history and management has been trying to keep the complex clean.Police tell us they were able to acquire surveillance video from the complex.They're hoping through this they'll be able to get a better look at the suspect since right now they don't have a description."}, {"url": "https://buffalonews.com/2020/04/15/ub-buffalo-mens-basketball-malik-zachery-signing-day-2020-april/", "title": "Malik Zachery commits to UB men's basketball", "authors": ["Rachel Lenzi"], "date": "2020-04-15", "keywords": ["commits", "zachery", "seasons", "ub", "guard", "malik", "mens", "basketball", "games", "chipola", "points", "season", "program"], "summary": "On Wednesday, Zachery announced his commitment to the University at Buffalo men’s basketball team, and chose the Bulls over Ole Miss, California and UCF.\nAs a freshman at Chipola in 2018-19, Zachery averaged 8.5 points, 5.8 assists and 3.9 rebounds in 32 games.\n“This whole year was stressful,” said Zachery, who redshirted this season at Chipola and has three years of eligibility remaining.\nZachery said he signed his national letter of intent with the Bulls on Wednesday, the start of the spring signing period for men’s and women’s basketball.\nYoung joins UB womenUB announced Wednesday that Jazmine Young will join the women's basketball program as a transfer."}, {"url": "https://www.nytimes.com/2019/11/18/us/fresno-california-mass-shooting.html", "title": "Fresno Backyard Shooting Leaves 4 Dead and 6 Injured, Police Say", "authors": ["Jacey Fortin", "Thomas Fuller", "Mihir Zaveri"], "date": "2019-11-18", "keywords": ["authorities", "shooting", "watching", "fresno", "hall", "injured", "say", "dead", "backyard", "yard", "leaves", "wounded", "witnesses", "gathering", "family", "began"], "summary": "[Sign up for our daily newsletter about news from California here.]\nFour people were fatally shot and six others wounded after at least two people opened fire at a family gathering in Fresno, Calif., on Sunday, then fled, the authorities said.\nAbout 30 friends and family members were at the gathering at a home in Fresno when the gunfire began, Andy Hall, the chief of the Fresno Police Department, said at a news conference on Monday.\nThe authorities received reports of the shooting shortly before 8 p.m. local time.\nChief Hall said the gunmen, who were armed with pistols, entered the property through an unlocked gate and began firing at people who were watching football in the yard."}, {"url": "https://www.yourcentralvalley.com/news/crime/police-investigate-fatal-shooting-at-southeast-fresno-apartment-complex/", "title": "Police investigate fatal shooting at southeast Fresno apartment complex", "authors": ["Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2019-12-09", "keywords": ["complex", "shooting", "chamalbide", "multiple", "fresno", "apartment", "fatal", "southeast", "store", "investigate", "witnesses", "officers", "victim"], "summary": "FRESNO, Calif. (KSEE/KGPE) — Authorities are investigating a fatal shooting Sunday afternoon at a southeast Fresno apartment complex, according to the Fresno Police Department.\nOfficers received multiple reports of eight to 10 rounds of gunfire at an apartment complex in the area Eleventh Street and Home Avenue around 1 p.m., Lt. Charlie Chamalbide said.\nArriving officers found a chaotic scene of family members and witnesses surrounding a 30-year-old black man down in front of an apartment unit, he said.\nDetectives are going door to door in the complex to get any information they can on what happened.\nIt appeared that the shooting took place in a breezeway between apartment units, Chamalbide said."}, {"url": "https://abc30.com/5699760/", "title": "Latino Life: Fiesta Navideña Has Fashion, Mariachis and Cultural Displays", "authors": [], "date": "2019-11-16", "keywords": ["mariachis", "displays", "women", "fresno", "wearing", "life", "fiesta", "latino", "local", "county", "fashion", "cultural", "league", "navideña", "mexicanamerican"], "summary": "FRESNO, Calif. (KFSN) -- Mariachis and models will take center stage at Fiesta Navideña.The annual fundraising event organized by the Fresno County League of Mexican-American Women promises fun and a celebration of Latino culture.Fiesta Navideña is Saturday, December 7, 2019 at 10:30a.m.\nat Pardini's in North Fresno.\nThe morning starts with mariachis and a champagne brunch.The catwalk comes alive with women, men and children wearing fashion by local retailers.\nFresno County LMAW uses all proceeds to support scholarships for local students.The day also includes a Posada plus Latino-inspired artwork, silent auction items and centerpieces.\nLilia Chavez is a member of Fresno County League of Mexican-American Women, she joined Latino Life host Graciela Moreno in the ABC30 studios November 14 to talk about the mission of the organization and to give a preview of what attendees can expect at Fiesta Navideña.December 7Pardini's"}, {"url": "http://agnetwest.com/hlb-quarantine-regulation-change-to-further-protect-california-citrus/", "title": "HLB Quarantine Regulation Change to Further Protect California Citrus", "authors": ["About The Author", "Taylor Hillman", "Agnet Media Operations Manager", "Farm News Director For Agnet West."], "date": "2020-04-15", "keywords": ["hlb", "protect", "change", "regulation", "zone", "area", "zones", "rules", "acp", "psyllid", "california", "citrus", "quarantine"], "summary": "Adult Asian citrus psyllid on a citrus leaf.\nUSDA/ARS Photo by David HallA slight change in California Asian citrus psyllid (ACP) quarantine rules should further help fight against the spread of the huanglongbing (HLB) disease.\nIn 2018, the California Department of Food and Agriculture implemented a bulk regional quarantine plan that included seven zones.\nZones 2,3,4,5 and 7 were areas of the state that had Asian citrus psyllid detections but no confirmed cases of HLB disease.\nZone 6 is the quarantine area in Southern California where all of the HLB detections were located and are under quarantine."}, {"url": "https://www.yourcentralvalley.com/news/local-news/pedestrian-struck-and-killed-on-highway-168-in-fresno-chp/", "title": "Pedestrian struck and killed on the 168 Freeway ID’d as Clovis man", "authors": ["Paul Schlesinger", "Mederios Babb", "Dom Mcandrew", "Jocelyn Moran"], "date": "2019-12-14", "keywords": ["struck", "killed", "168", "freeway", "fresno", "area", "spokesman", "pedestrian", "victim", "store", "westbound", "identified", "idd", "clovis", "man"], "summary": "FRESNO, Calif. (KSEE/KGPE) — The pedestrian struck and killed Saturday morning by at least one vehicle on the 168 Freeway in Fresno has been identified as a Clovis man.\nThe victim was identified Sunday as 23-year-old Marshall Fuller of Clovis, according to Spokesman Tony Botti of the Fresno County Sheriff’s Office.\nThe collision was reported around 1:30 a.m. in the area of the 168 and Ashlan Avenue, said Spokesman Mike Salas of the California Highway Patrol.\nA male pedestrian was walking in the freeway’s westbound lanes and was struck by a blue Hyundai Elantra going 60 mph in the number two-lane.\nThe Fresno County Coroner’s Office was later called to the scene when the man was declared dead."}, {"url": "https://abc30.com/woman-struck-killed-by-vehicle-in-west-central-fresno/5779453/", "title": "Woman dies after she's struck by vehicle in west central Fresno", "authors": [], "date": "2019-12-23", "keywords": ["crossing", "struck", "west", "street", "way", "fresno", "shes", "central", "vehicle", "womans", "say", "dies", "woman", "driver", "womanauthorities"], "summary": "FRESNO, Calif. (KFSN) -- A woman was struck and killed while crossing the street in west central Fresno Sunday night.Fresno police say the driver was heading northbound on Marks Avenue and as he passed through the intersection at McKinley, he hit the woman.Authorities say the driver stopped and cooperated with the investigation.It is unknown why the woman was crossing the street, but officers say the driver had the right of way.\nHe told police he didn't have time to stop when he saw her.The woman's name and age have not been released."}, {"url": "https://abc30.com/shooting-central-fresno-gunfire-east/5775279/", "title": "1 man injured after fistfight leads to gunfire in Fresno", "authors": [], "date": "2019-12-21", "keywords": ["survivepolice", "hit", "started", "track", "fresno", "shooter", "leads", "shots", "injured", "say", "gunfire", "witnesses", "fistfight", "man", "involved"], "summary": "FRESNO, Calif. (KFSN) -- A big fight led to gunfire and one man hit in east central Fresno on Friday night.Fresno Police say it started as a lot of people involved in a fistfight on Chestnut, just north of McKinley right before midnight.Officers say someone fired off several shots and one of them hit a man.Paramedics rushed him to the hospital and they say he'll survive.Police are relying on some witnesses to help track down the shooter and anyone else involved."}, {"url": "https://abc30.com/fresno-house-fire-firefighters-central/5762157/", "title": "2 killed, mother and 4 kids in hospital after house fire in central Fresno", "authors": ["Brian Johnson", "Nathalie Granda"], "date": "2019-12-18", "keywords": ["smoke", "fresno", "central", "wife", "victim", "say", "mother", "died", "house", "nicholas", "rodriguez", "killed", "kids", "hospital", "firefighters"], "summary": "#BREAKING: Fresno Co. sheriff’s office confirms a second victim from this morning’s house fire in Fresno Co. has died.\nAuthorities say she and Nicholas Rodriguez are not related.\n@ABC30 — Nathalie Granda (@NathalieABC30) December 18, 2019Family members of Nicholas Rodriguez are looking for financial help after he died in a Fresno County house fire yesterday.\nHis wife and kids were also hurt and are still at the hospital.\nHe's not sure about burns.Chavez, who just moved in a few weeks ago, doesn't have any physical injuries.But he lost all his possessions."}, {"url": "https://abc30.com/fresno-new-years-madera-merced-visalia/5802215/", "title": "New Year's Day and New Year's Eve events across Central California", "authors": [], "date": "2019-12-31", "keywords": ["events", "ave", "fresno", "central", "day", "dj", "click", "eve", "california", "info", "information", "st", "visalia", "caevent"], "summary": "Tuesday, December 31stWednesday, January 1stTuesday, December 31stTuesday, December 31stWednesday, January 1stTuesday, December 31stWednesday, January 1stTuesday, December 31stTuesday, December 31stWednesday, January 1stTime: 5:00PM-12:30PMLocation: Brewery District on Inyo St & Broadway St, Fresno, CAEvent Info: The very first Brew Years Eve Block Party.\nJoin us in your best dapper and flapper attire!For more information, click here Time: 8:00PM-1:00AMLocation: Perico Productions, Visalia, CAEvent info: New Year's celebration at the Visalia.For more information, click here Time: 6:00PM-2:00AMLocation: T.D.E.S.\nPortuguese Hall of Tulare 515 N I st, Tulare, CAEvent info: Doors open 6 pm.\nKids 10 and under $10 adults $40For more information, click here Time: 7:00PM-12:30AMLocation: Barmageddon, 126 E Kern Ave, Tulare, CAEvent info: Barmageddon's Masquerade New Year's Eve Party!For more information, click here Time: 10:00AM-12:00PMLocation: Downtown Visalia, Visalia, CAEvent Info: Kick off the New Year the right way with a healthy run.\nThis fundraising event will benefit in sending 60 kids to our PAL honor camp at Camp San Joaquin in the Sequoia National Forest.For more information, click here"}, {"url": "https://abc30.com/fresno-county-house-fire-destroyed/5743905/", "title": "Family of 5 loses home in Fresno County fire", "authors": [], "date": "2019-12-10", "keywords": ["total", "took", "loses", "fresno", "area", "watts", "county", "woke", "tollhouse", "valley", "road", "family"], "summary": "FRESNO, Calif. (KFSN) -- A family of five lost their home in an overnight fire in Fresno County.The fire broke out in the area of Watts Valley Road and Maxon Road in the Tollhouse area shortly before 2 a.m.It took firefighters about 30 minutes to arrive on the scene due to the home being in a remote location.\nThe home was fully engulfed in flames when they arrived.Four adults and one child made it out of the house safely.\n\"(That person) got everyone out of bed and out of the house.\n\"The home is a total loss, and the Red Cross is helping the family find a temporary home.\nThe blaze did not pose a threat to other properties nearby, and no one was hurt.The cause of the fire is under investigation."}, {"url": "https://www.yourcentralvalley.com/news/crime/two-in-critical-condition-after-early-morning-shooting-in-fresno/", "title": "Two in critical condition after early morning shooting in Fresno", "authors": ["Mederios Babb", "Yourcentralvalley.Com Staff", "Associated Press", "Dom Mcandrew"], "date": "2019-12-30", "keywords": ["morning", "condition", "shooting", "critical", "wounds", "fresno", "early", "kings", "near", "winery", "multiple", "store", "victims", "men", "palace"], "summary": "(KGPE) – Two men are at the hospital in critical condition after they were shot multiple times early Monday morning in southeast Fresno.\nThe Fresno Police Department responded around 2:30 a.m. after six rounds were fired near the Kings Palace Luxury Apartments near Winery Avenue and Kings Canyon Road.\nWhen first responders arrived, they found two men, both around 29 years old, with multiple gunshot wounds to the stomach.\nAround 2:30 this morning there was a shooting near the King’s Palace Luxury Apartments (corner of Winery and Kings Canyon Road).\npic.twitter.com/8NbHw2AT6Z — Mederios Babb (@mederiosbabb) December 30, 2019They were taken to the hospital and are in critical but stable condition."}, {"url": "https://abc30.com/fresno-central-shooting-dakota-police-activity/5741993/", "title": "Man shot in drive-by shooting outside central Fresno home", "authors": [], "date": "2019-12-09", "keywords": ["yurong", "shooting", "shot", "fresno", "drove", "central", "dakota", "angus", "outside", "suspects", "driveby", "man", "leg"], "summary": "Fresno Police on the lookout for suspects who drove up and shot a man who was outside of his home at Angus and Dakota.\nBullet went right through his leg.\npic.twitter.com/koghToFRwb — Dale Yurong (@DaleYurongABC30) December 9, 2019FRESNO, Calif. (KFSN) -- Fresno Police are searching for the suspects who shot a man outside his central Fresno home Monday morning.Officers say the suspects drove up to the home on Angus Street near Dakota Avenue and opened fire at around 10:20 a.m.The victim suffered a gunshot wound to his leg and is expected to be OK."}, {"url": "https://www.yourcentralvalley.com/news/top-stories/firefighters-battling-fire-at-northwest-fresno-duplex/", "title": "Firefighters battling fire at Northwest Fresno duplex", "authors": ["Kirsten Mitchell", "Mederios Babb", "Jocelyn Moran", "Dom Mcandrew"], "date": "2019-12-23", "keywords": ["scene", "started", "west", "northwest", "fresno", "duplex", "person", "unit", "23", "working", "battling", "fresnofire", "firefighters"], "summary": "FRESNO, California (KSEE/KGPE) – Firefighters are on scene of an fire in Northwest Fresno.\npic.twitter.com/I2rAt0V2dR — Fresno Fire PIO (@FresnoFire) December 23, 2019According to Fresno Fire Battalion Chief Bob Van Tassel, the fire started around 7 p.m. at a duplex on N. West Avenue.\n#BREAKING 2-Alarm Fire in NW Fresno off West near Bullard.\n@FresnoFire says it started in unit at the left, spreading to the one on the right.\nTen units are on scene and 40 firefighters as they continue to work to put out the fire and prevent further damage."}, {"url": "https://abc30.com/5733378/", "title": "Authorities identify man who died after hydroplaning, crashing into tree in northwest Fresno", "authors": [], "date": "2019-12-05", "keywords": ["authorities", "traveling", "highway", "taken", "southbound", "northwest", "fresno", "chp", "tree", "vehicle", "identify", "99", "died", "crashing", "man", "hydroplaning"], "summary": "FRESNO, Calif. (KFSN) -- A man is dead after hydroplaning, crashing into a tree off Highway 99 in northwest Fresno, according to the California Highway Patrol.Just before 6:30 a.m. Wednesday, the CHP says a 32-year-old James Eagleton of San Francisco was traveling southbound on 99 when he lost control of his vehicle going off the highway near the Herndon exit.Officers say the man crashed into a tree and was taken to the hospital where he later died from his injuries.The Fresno County Sheriff's Office says there was also a dog in the car that was killed in the crash.The CHP does not believe drugs or alcohol were a factor in the accident."}, {"url": "https://www.nytimes.com/2019/12/30/realestate/400000-homes-in-california.html", "title": "$400,000 Homes in California", "authors": ["Julie Lasky"], "date": "2019-12-30", "keywords": ["walls", "homes", "fresno", "wall", "french", "ceiling", "miles", "room", "california", "kitchen", "gardens", "400000", "square"], "summary": "Elementary schools, a high school, Fresno City College and Gazebo Gardens, a nursery that dates to 1922, are all within easy walking distance.\nA shopping mall is less than two miles east, and the Fresno Yosemite International Airport is a 15-minute drive.\nPassing through a vestibule with an ornamental niche, you enter a living room with faux-finished plaster walls and ceiling and an elaborate tiled fireplace.\nNext to this room is a formal dining room, followed by a sunny breakfast nook with built-in cabinets, and a narrow kitchen.\nA breakfast bar divides the kitchen from a brick-floored sitting room with bead-board walls and a ceiling that are painted glossy white."}, {"url": "https://gvwire.com/2019/12/06/who-besides-the-obvious-are-running-for-fresno-mayor/", "title": "Who Besides the Obvious Are Running for Fresno Mayor?", "authors": ["David Taub", "Ap News", "Randy Reed", "Jim Jakobs", "Nancy Price"], "date": "2019-12-06", "keywords": ["district", "democrats", "caprioglio", "council", "fresno", "obvious", "candidates", "county", "mayor", "office", "running", "political"], "summary": "Who Besides the Obvious Are Running for Fresno Mayor?\nWho Besides the Obvious Are Running for Fresno Mayor?\nAnd although things have been somewhat quiet among the two frontrunners, the campaigns of Fresno County prosecutor Andrew Janz and former police chief Jerry Dyer are about to rev up.\nYoung Dems Rally Around Local CandidatesThe Fresno County Young Democrats held a fundraising get-together Tuesday night.\nSenator Kamala Harris’ Fresno office, St. Rest Baptist Church pastor D.J."}, {"url": "https://abc30.com/fresno-shooting-funeral-shields-41-whats-happening/5755737/", "title": "Fresno Police searching for suspects after 2 injured in shooting", "authors": [], "date": "2019-12-15", "keywords": ["took", "suspect", "shooting", "fresno", "searching", "center", "injured", "say", "trying", "suspects", "parking"], "summary": "HAPPENING NOW: Fresno police searching for a gunman after two people were shot in Central Fresno at the Glass House Event Center in front of Manchester Center.\nBoth victims are expected to survive.\nMore tonight on @ABC30 at 6. pic.twitter.com/vhy7YVYQRO — Gilbert Magallon (@GilbertABC30) December 15, 2019FRESNO, Calif. -- Fresno Police are searching for suspects involved in a shooting that sent two men to the hospital.It all took place on Thursday afternoon at the Glass House Event Center in central Fresno off Shields and Highway 41.Police say about 100 people were there for an after-funeral ceremony when a fight broke out ending in gunfire.Police responded a little after three.They say when they arrived they found two men in their mid-twenties on the floor, who had been shot.They were quickly rushed to the hospital and are expected to survive.Detectives say it all started as a fight inside the building, then escalated into the parking lot where according to police, multiple people possibly exchanged gunfire.After the shooting, police say the scene was hectic and took several minutes to stabilize.\n\"When officers arrived it was pretty chaotic with people running through the parking lot, cars leaving, and trying to ascertain who was injured, who was not, who was a suspect and who was a victim,\" said Fresno Police sergeant Bob Reynolds.At this point police are still trying to determine who was involved and don't have a suspect description.Detectives say they're not sure if it was gang-related, but are looking into the possibility.A stretch of Hunter Street between Effie and Clark was also closed after the shooting.According to police, multiple people fled towards that direction and there's a possibility the suspects may have too."}, {"url": "https://www.yourcentralvalley.com/news/top-stories/man-killed-by-train-in-central-fresno-police-say/", "title": "Man killed by train in Central Fresno, police say", "authors": ["Alliz Clavijo", "Mederios Babb", "Jocelyn Moran", "Dom Mcandrew"], "date": "2019-12-30", "keywords": ["killed", "west", "warn", "fresno", "central", "tracks", "store", "app", "say", "weather", "unable", "train", "victim", "man"], "summary": "FRESNO, California (KSEE/KGPE) – A man was hit and killed by a train in Central Fresno Sunday night.\nFresno Police say the train conductor saw him at the tracks and attempted to warn him, but he didn’t respond.\nThe train was unable to stop.\nFamily and friends were contacted and said the victim, who was in his 70’s lived nearby.\nFor local, national, and breaking news, and to get weather alerts, download our FREE mobile app from the Apple App Store or the Google Play Store."}, {"url": "https://abc30.com/community-events/holidays-heroes-blood-drive-begins-at-sierra-vista-mall/5768539/", "title": "Holidays Heroes Blood Drive begins at Sierra Vista Mall in Clovis", "authors": [], "date": "2019-12-19", "keywords": ["mall", "vista", "heroes", "blood", "teaming", "fresno", "sierra", "seasonthe", "holiday", "drive", "runs", "sheriffs", "begins", "holidays", "stop", "clovis"], "summary": "FRESNO, Calif. (KFSN) -- You can help give the gift of life this holiday season.The Fresno County Sheriff's Office is teaming up with Central California Blood Center for its annual Holiday Heroes Blood Drive.Those who would like to donate can stop by the east end of the Sierra Vista Mall in Clovis, between Famous Footwear and La Bella Rose.The drive runs Thursday, December 19 through Monday, December 23, from 1 p.m. to 6 p.m. each day."}, {"url": "https://abc30.com/grapevine-interstate-5-fort-tejon-chp/5787507/", "title": "Traffic resumes on major highways connecting Central Valley to southern California", "authors": [], "date": "2019-12-28", "keywords": ["highways", "closure", "highway", "connecting", "chp", "caltrans", "central", "southern", "heavy", "grapevine", "roadway", "major", "open", "need", "traffic", "valley", "california", "resumes"], "summary": "Grapevine: CHP no longer pacing over the Grapevine.\n@CaltransDist7 #Grapevine — Caltrans District 6 (@CaltransDist6) December 28, 2019GRAPEVINE: I-5 is now OPEN with CHP escorting traffic over the pass.\nWith heavy traffic, expect long delays getting through Tehachapi.\nDrivers should expect delays.Travelers driving home from the Christmas holiday were left stuck on either side of the mountains after the highway closure.\nSome drivers were forced to take Highway 101 to get between Southern California and the Central Valley."}]