[{"url": "https://www.rhinotimes.com/news/sba-makes-low-interest-disaster-loans-available-for-nc-businesses/", "title": "SBA Makes Low Interest Disaster Loans Available For NC Businesses", "authors": ["John Hammer"], "date": "2020-03-24", "keywords": ["available", "makes", "sba", "small", "low", "businesses", "loans", "financial", "economic", "disaster", "result", "nc", "coronavirus", "interest"], "summary": "The Small Business Administration (SBA) has announced that low interest federal disaster loans are now available for small businesses in North Carolina.\nThe loans, at 3.75 percent, are available to businesses that have suffered substantial economic injury as a result of the coronavirus.\nRoy Cooper, President Donald Trump declared the state a disaster area, which made funds available under the Coronavirus Preparedness and Response Supplemental Appropriations Act signed by the president.\nSBA Administrator Jovita Carranza said, “SBA is strongly committed to providing the most effective and customer-focused response possible to assist North Carolina small businesses with federal disaster loans.\nApplicants may apply online or receive additional disaster assistance information at https://disasterloan.sba.gov/ela, by calling the SBA Customer Service Center at 800-659-2955 or by emailing disastercustomerservice@sba.govThe deadline for applying for these disaster assistance loans is Dec. 18, 2020."}, {"url": "https://www.wxii12.com/article/coronavirus-north-carolina-map/32039323", "title": "Coronavirus in North Carolina: Map shows COVID-19 cases by county", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-04-16", "keywords": ["county", "number", "cases", "carolina", "shows", "states", "state", "north", "president", "coronavirus", "governor", "soon", "map", "covid19"], "summary": "Coronavirus in North Carolina: Map shows number of cases by county Share Shares Copy Link CopyHide Transcript Show TranscriptTHANK YOU.\n802 MORE THAN 50 100 PEOPLE HAVE BEEN DIAGNOSED WITH THE CORONAVIRUS IN NORTH CAROLINA.\nLET’S TAKE A LOOK AT THIS CHART WHICH SHOWS THE NUMBER OF CASES IN THE TRIAD COMPARED TO STATE NUMBERS.\nWELL, SENATOR TILLIS WOULD NOT SAY IF YOU THOUGHT EARLY MAY WAS TOO SOON BRAS, BUT HE SAID NORTH CAROLINA HAS NOT YET.\nI’M JOHN LAWRENCE REPORTING THE CURRENT FEDERAL GUIDELINES FOR SOCIAL DISTANCING EXPIRE AT THE END OF THE MON"}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/weather-stories/2020/01/13/when-will-north-carolina-s-snow-drought-end-", "title": "When Will North Carolina's Snow Drought End?", "authors": ["Published Pm Et Jan."], "date": "2020-01-13", "keywords": ["winter", "drought", "snow", "records", "trace", "winters", "north", "measurable", "weather", "end", "11", "reported", "dating", "carolinas"], "summary": "Outside of the mountains, most of the rest of the state did not see any measurable snow in 2019.\nDuring that time, there have been only 11 winters where there was no measurable snow reported.\nDuring that time, there have been only 11 winters where there was no measurable snow reported.\nDuring that time, there have been only six winters where there was no measurable snow reported.\nDuring that time, there have been only 11 winters where there was no measurable snow reported."}, {"url": "https://www.wral.com/coronavirus/coronavirus-coverage-in-north-carolina-april-9-2020-outbreaks-expand-in-nursing-homes-across-triangle/19048777/", "title": "Coronavirus coverage in North Carolina, April 9, 2020: Outbreaks expand in nursing homes across Triangle :: WRAL.com", "authors": [], "date": "2020-04-09", "keywords": ["county", "state", "expand", "coronavirus", "residents", "wralcom", "positive", "carolina", "north", "tested", "homes", "triangle", "officials", "staff", "coverage", "nursing", "health", "outbreaks", "care"], "summary": "4:50 p.m.: Thirty residents and three staff members at Louisburg Nursing Center have tested positive for the coronavirus, officials said.\nPublic health officials in Riverside, say only one of the 13 scheduled nursing assistants came to work.\nThe center didn’t say how many residents tested positive but that they are at UNC hospitals.\nThe Bulls thanked health care workers and asked the public to stay inside to protect everyone.\nMore than 3,500 people have tested positive for COVID-19 in North Carolina."}, {"url": "https://myfox8.com/news/5-charged-with-selling-counterfeits-at-greensboro-flea-market/", "title": "5 charged with selling counterfeits at Greensboro flea market", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-16", "keywords": ["market", "products", "secretary", "security", "state", "charged", "north", "selling", "counterfeits", "counterfeit", "nc", "trademarked", "homeland", "greensboro", "flea"], "summary": "GREENSBORO, N.C. — Five people face charges after investigators found counterfeit trademarked products at a Greensboro flea market, according to the North Carolina Department of the Secretary of State.\nSaturday, Secretary of State agents, Homeland Security and Greensboro police swept “The Flea,” located at 3220 North O’Henry Boulevard, and seized the counterfeits of trademarked products worth a total of $460,000.\n“This enforcement sweep took counterfeit products with an estimated retail value of nearly half a million dollars off Greensboro’s streets,” said NC Secretary of State Elaine Marshall in a news release.\n“Counterfeit products do real economic harm to legitimate manufacturers and merchants, pose a health and safety hazard to consumers, and can help fund organized crime.\nEvette Delynn Daouda, 53, fo Greensboro, Felicia Dianne Able, 46, of Greensboro, and Joey Ray Willis, 39, of Danville, Virginia, are charged with misdemeanor trademark violations."}, {"url": "https://wtkr.com/2020/01/02/i-killed-everybody-i-shot-my-baby-sister-of-woman-accused-of-north-carolina-triple-homicide-recounts-phone-call-tmw/", "title": "‘I killed everybody … I shot my baby’ Sister of N.C. triple homicide suspect recounts chilling phone call", "authors": [], "date": "2020-01-02", "keywords": ["wghp", "baby", "told", "shot", "recounts", "laila", "triple", "nc", "killed", "homicide", "everybody", "suspect", "phone", "say", "merritt", "friends", "sister"], "summary": "GREENSBORO, N.C. (WGHP) – A North Carolina mom could face the death penalty after police say she shot and killed three people Wednesday morning.\nMcKinney's sister and mother told WGHP it's an extremely difficult and tragic time for the entire family.\nInvestigators say McKinney shot and killed her 10-year-old daughter Mkenzie and 2-year-old niece Serenity.\n\"She's like, 'My baby, my baby, I shot my baby.'\nMerritt told WGHP she thinks her sister was just overwhelmed with life and it just became too hard for her."}, {"url": "https://patch.com/north-carolina/greensboro/city-greensboro-announces-holiday-closings", "title": "City Of Greensboro Announces Holiday Closings", "authors": [], "date": "2019-12-16", "keywords": ["2020", "25", "center", "26", "greensboro", "holiday", "closed", "city", "24", "31", "announces", "service", "closings"], "summary": "The following services and facilities will operate on a holiday schedule:There are no trash and recycling collections on Wednesday, December 25.\nThe Greensboro Public Library system and the Greensboro History Museum will be closed Tuesday, December 24 through Thursday, December 26, as well as Wednesday, January 1, 2020.\nThe Greensboro Cultural Center closed at 6 pm on Monday, December 23 and is closed Tuesday, December 24 through Thursday, December 26.\nCity lakes, including Brandt, Higgins and Townsend are closed Tuesday, December 24 through Thursday, December 26, and Wednesday, January 1.\nThis press release was produced by the City of Greensboro."}, {"url": "https://myfox8.com/weather/flurries-spotted-in-charlotte-as-low-pressure-system-spreads-precipitation-in-carolinas/", "title": "Snowflakes spotted across NC, including in the Piedmont Triad", "authors": ["Van Denton", "Kate Garner", "Allison Smith", "Associated Press", "Digital Desk"], "date": "2020-01-31", "keywords": ["triad", "snow", "including", "videoplease", "12", "watch", "temperatures", "nc", "javascript", "spotted", "piedmont", "enable", "snowflakes", "areas", "period"], "summary": "Please enable Javascript to watch this videoWe've seen snow reports across parts of South Carolina and North Carolina, including here in the Piedmont Triad.\nIf you've been hoping to see some snow, your wish may come true today!\nFoothill counties stand the best chance to also see some snow and snow/rain mix with 1/2\" to locally 1\" possible in these areas.\nAgain, in the Piedmont, ours will be mainly cold rain, mixed at times with snow and possibly a brief period of all snow.\n❄️ pic.twitter.com/VpgO00LOr5 — Charlotte Motor Speedway (@CLTMotorSpdwy) January 31, 2020Please enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this video35.227087 -80.843127"}, {"url": "https://myfox8.com/news/2-adults-4-children-displaced-after-house-fire-in-greensboro/", "title": "2 adults, 4 children displaced after house fire in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-09", "keywords": ["pichard", "house", "startedno", "videogreensboro", "greensboro", "adults", "tonight", "displaced", "watch", "started", "place", "children", "street", "stay", "reportedthe"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Six people will need a place to stay tonight after a house fire on Thursday evening, according to the Greensboro Fire Department.\nThe fire happened at a home on Pichard Street where two adults and four children lived.\nThey were all out of the home by the time firefighters arrived but were inside when the fire started.\nNo injuries were reported.\nThe family said the fire started during cooking."}, {"url": "https://myfox8.com/news/erratic-behavior-at-north-carolina-church-leads-to-arrest/", "title": "'Erratic behavior' at North Carolina church leads to arrest", "authors": ["Cnn Wire", "Nexstar Media Wire"], "date": "2020-01-07", "keywords": ["county", "man", "bennett", "deputies", "things", "carolina", "officials", "taken", "behavior", "north", "leads", "say", "church", "craven", "erratic", "arrest"], "summary": "CRAVEN COUNTY, N.C. — A Craven County man has been arrested after officials say they were called to an Ernul church regarding his behavior.\nOfficials say he was treated at the scene for minor injuries he received while trying to enter the church and taken to the Craven County Confinement Facility.\nAccording to Major David McFadyen, the family member told deputies Bennett had been using crystal methamphetamine.\nChurch members say Bennett was inside the church before being asked to leave — that is when they say things escalated.\nOfficials say Bennett is being held in the Craven County Confinement Facility."}, {"url": "https://myfox8.com/news/person-killed-by-train-on-bryan-park-road-in-greensboro/", "title": "Person killed by train on Bryan Park Road in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-20", "keywords": ["park", "victims", "townsend", "traina", "hit", "videogreensboro", "person", "road", "watch", "scenepolice", "bryan", "killed", "greensboro", "train"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — A person was hit by a train and killed Sunday evening, according to Greensboro police.\nAt about 8:23 p.m., officers responded to Bryan Park Road, near Townsend Road, on a report of a person hit by a train.\nA person was found dead at the scene.\nPolice have not released the victim's name.\n36.072635 -79.791975"}, {"url": "https://myfox8.com/news/person-taken-to-hospital-with-gunshot-wound-after-shooting-on-primrose-avenue-in-greensboro/", "title": "Person taken to hospital with gunshot wound after shooting on Primrose Avenue in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-28", "keywords": ["hospital", "taken", "person", "woundthe", "officers", "gunshot", "wound", "shooting", "greensboro", "primrose", "avenue", "victim"], "summary": "GREENSBORO, N.C. — A person was taken to the hospital after a shooting on Primrose Avenue, according to Greensboro police.\nAt about 6:29 a.m. Tuesday, officers responded to a report of a gunshot wound on the 3500 block of Primrose Avenue.\nAt the scene, officers found one person suffering from a gunshot wound.\nThe victim was taken to a hospital and is expected to recover.\nPolice say they have no suspect information at this time."}, {"url": "https://fox6now.com/2020/01/05/i-killed-everybody-north-carolina-mom-could-face-death-penalty-in-shooting-of-daughter-niece-friend/", "title": "‘I killed everybody:’ North Carolina mom could face death penalty in shooting of daughter, niece, friend", "authors": ["Cnn Wire Service"], "date": "2020-01-05", "keywords": ["merritt", "involved", "friend", "sister", "north", "niece", "daughter", "killed", "shooting", "penalty", "mom", "face", "death", "hayes", "mckinney", "shot", "mckinneys", "everybody", "baby"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A Greensboro, North Carolina mom could face the death penalty -- accused of fatally shooting her daughter, niece, and a man who was living with them.\nBrittany McKinney, 28, faced a judge for the first time on Thursday, Jan. 2 after police said she shot and killed three people Wednesday morning, Jan. 1.\nWGHP spoke with McKinney's sister and mother, and someone who said they were with McKinney just minutes after the crimes took place.\nI shot everybody in the house,'\" said Delilah Merritt, McKinney's sister.\nMerritt said she thinks her sister was just overwhelmed with life and it just became too hard for her."}, {"url": "https://www.wfmynews2.com/article/news/health/health-officials-investigating-possible-coronavirus-north-carolina/83-e5a11db8-d054-4a03-9e37-761d4fd90a2e", "title": "Possible case of Coronavirus in N.C., Triad doctor says still low-risk in U.S.", "authors": ["Author", "Marissa Tansino", "Wfmy", "Published", "Am Est January", "Updated"], "date": "2020-01-25", "keywords": ["triad", "possible", "case", "symptoms", "lowrisk", "wuhan", "north", "health", "sense", "doctor", "nc", "coronavirus", "older", "respiratory"], "summary": "GREENSBORO, N.C. — Even with an investigation into a possible case of Coronavirus in North Carolina, a Triad doctor says it shouldn't be a huge concern for the general population.\nRELATED: Health officials monitoring 2 Minnesotans for possible coronavirusRELATED: What's new in the China coronavirus outbreakThe North Carolina Department of Health says the person arrived at Raleigh-Durham International Airport on Thursday, Jan. 23, 2020.\nThe patient had mild respiratory symptoms and is currently in good condition and being cared for at Duke University Hospital, according to officials.\nRELATED: What are the symptoms of the Wuhan coronavirus?\nRELATED: Possible case of coronavirus in North CarolinaRELATED: Second US case of Wuhan coronavirus confirmed, France reports 1st Europe cases"}, {"url": "https://myfox8.com/news/3-dead-in-homicide-investigation-on-sweet-birch-drive-in-greensboro/", "title": "3 dead in homicide investigation on Sweet Birch Drive in Greensboro", "authors": ["Digital Desk", "Hayley Fixler", "Nexstar Media Wire"], "date": "2020-01-01", "keywords": ["victims", "birch", "dead", "investigation", "scene", "crime", "information", "drive", "welfare", "officers", "woman", "homicide", "check", "greensboro", "sweet"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — Greensboro police announced Wednesday afternoon that a homicide investigation involves three deceased victims.\nAbout a dozen officers were on the scene after an assault on Sweet Birch Drive in Greensboro.\nAt 11:14 a.m. Wednesday, police responded for a welfare check on the 3600 block of Sweet Birch Drive.\nNo suspect information or information on how the victims were killed has been released.\nThat's what prompted the welfare check and proceeding homicide investigation."}, {"url": "https://myfox8.com/news/fox-found-in-greensboro-is-first-rabies-case-of-2020-guilford-county-health-officials-say/", "title": "Fox found in Greensboro is first rabies case of 2020, Guilford County health officials say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-15", "keywords": ["county", "fox", "case", "contact", "guilford", "say", "stray", "wild", "wildlife", "rabies", "2020", "animal", "officials", "outside", "try", "animals", "health", "greensboro", "pets"], "summary": "This is the first confirmed case of animal rabies in 2020.\nEven animals in outdoor fenced areas should have current rabies vaccinations because wild animals can get into these areas and attack pets.\nIf you find a sick or injured animal, contact Animal Control at 336-641-5990 and let them handle it.\nReport all stray animals to Animal Control at 336-641-5990 in Greensboro and 336-883-3224 in High Point.\nStray animals may not be vaccinated against rabies and run the risk of carrying rabies."}, {"url": "https://www.wraltechwire.com/2019/12/02/2020-is-almost-here-first-look-at-47-events-more-across-nc-for-your-jan-calendar/", "title": "2020 is almost here: First look at 47 events & more across NC for your Jan. calendar", "authors": [], "date": "2019-12-02", "keywords": ["startups", "event", "2020", "presentations", "weekly", "events", "north", "calendar", "look", "nc", "community", "program", "47", "entrepreneurs", "jan", "tech", "join"], "summary": "Plenty of technology and life science events and deadlines are on tap for January, and we suggest you pencil them into your calendar soon.\nJanuary 3, 7:30-9 a.m. @Prestonwood Country ClubAt this event, NC State University economist Michael Walden will present his annual economic forecast update.\nJanuary 8, 9-10 a.m. @East ForkAsheville’s startup community meets weekly to hear presentations and support one another in continuing to grow.\nJanuary 15, 9-10 a.m. @East ForkAsheville’s startup community meets weekly to hear presentations and support one another in continuing to grow.\nJanuary 22, 9-10 a.m. @East ForkAsheville’s startup community meets weekly to hear presentations and support one another in continuing to grow."}, {"url": "https://myfox8.com/news/local-businesses-react-to-coronavirus-outbreak/amp/", "title": "Local businesses react to coronavirus outbreak", "authors": ["Danielle Jackson"], "date": "2020-01-29", "keywords": ["market", "impact", "local", "point", "businesses", "high", "precautions", "come", "coronavirus", "worried", "leong", "greensboro", "outbreak", "react", "company"], "summary": "Fujian is more than 400 miles from Wuhan, which is currently ground zero for the coronavirus.\nOther businesses in the Triad are also facing concerns over the global outbreak.\nThe High Point Market Authority invites people from around the world to it's April furniture shows.\nThey fear the coronavirus could impact attendance, so they've been monitoring the outbreak.\n'I don`t want to jump to any conclusions or scare anybody, but it is something we are watching every single day,\" said Tom Conley, President and CEO of High Point Market."}, {"url": "https://myfox8.com/news/crash-on-yanceyville-road-in-greensboro-leaves-1-dead-2-injured/", "title": "Crash on Yanceyville Road in Greensboro leaves 1 dead, 2 injured", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-17", "keywords": ["crash", "leaves", "headed", "dead", "clark", "road", "silverado", "serious", "greensboro", "injured", "yanceyville", "left"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- One person is dead and two others have serious injuries after a crash in Greensboro on Thursday, according to a news release from Greensboro police.\nThe crash happened on Yanceyville Road at 3:04 p.m.Michael Allen Clark, 64, of Browns Summit, was headed north on Yanceyville Road in a 1998 Mazda Protégé when he went left of center and hit a 2005 Chevrolet Silverado that was headed south.\nClark was pronounced dead at the scene.\nThe driver and a passenger in the Silverado were taken to Moses Cone Hospital for treatment of serious injuries.\nThere is no word on what caused Clark to drive left of center."}, {"url": "https://myfox8.com/news/woman-accused-of-killing-man-in-greensboro-hit-and-run-now-facing-charges/", "title": "Woman accused of killing man in Greensboro hit-and-run now facing felony charge", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-08", "keywords": ["accused", "man", "walking", "hitandrun", "hit", "theres", "felony", "facing", "charge", "lot", "swing", "suk", "killing", "stop", "shin", "traffic", "road", "woman", "greensboro"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — The woman arrested after allegedly hitting and killing a man in a Greensboro hit-and-run is now facing a felony charge.\nAccording to the Guilford County jail, Moon Suk Shin, 76, is charged with felony hit and run injury.\nPolice say Moon Suk Shin was behind the wheel of the car that hit him.\nPeople walking along Swing Road and sitting at the bus stop said that the road becomes crowded during commute times and doesn’t have sufficient lighting.\nAmong the planned improvements, sidewalks will be installed along Swing Road from Market Street to Burnt Poplar Road."}, {"url": "https://www.rhinotimes.com/news/in-greensboro-2020-begins-with-a-triple-homicide/", "title": "In Greensboro, 2020 Begins With A Triple Homicide", "authors": ["John Hammer"], "date": "2020-01-02", "keywords": ["neighborhoods", "2020", "crime", "murders", "violence", "city", "triple", "homicide", "begins", "cure", "violent", "greensboro", "program"], "summary": "In 2019, a year when Greensboro had 44 homicides, which is the most murders Greensboro has ever had in a year, the first homicide was reported on Jan. 16, 2019.\nThe first homicide for 2020 was reported on Jan. 1, and it was a triple homicide.\nThe Greensboro City Council in 2019 signed a contract to start a Cure Violence program in two neighborhoods that have historically had the most murders.\nCure Violence does not work with or share its information with local law enforcement.\nDetractors claim that Cure Violence moves violent crime out of one neighborhood and into another."}, {"url": "https://myfox8.com/news/charges-filed-after-fatal-2019-crash-in-greensboro/", "title": "Charges filed after fatal 2019 crash in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-23", "keywords": ["fatal", "filed", "crash", "unsecured", "touring", "silver", "videogreensboro", "west", "nissan", "watch", "vehicle", "2019", "charges", "greensboro", "victory", "yield"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Charges have been filed in connection with a fatal December 2019 crash, according to a news release from Greensboro police.\nOn Dec. 28 at 6:06 p.m., officers came to West Gate City Boulevard and High Point Road.\nA silver 2017 Nissan Murano and a black 2005 Victory Touring motorcycle collided in the intersection.\nThe motorcyclist, Bengy Christopher Austin, died from his injuries on Jan. 11.\nOn Thursday, the driver of the Nissan, identified as Fatou Gueye, was charged with misdemeanor death by motor vehicle and failure to yield causing serious injury."}, {"url": "https://www.wfmynews2.com/article/news/crime/police-release-surveillance-video-armed-robbery-greensboro/83-b1321a33-a933-4bcf-a675-4f347ff1aad5", "title": "Video: Two men wanted for armed robbery at Greensboro gas station", "authors": ["Author", "Marissa Tansino", "Wfmy", "Published", "Am Est January", "Updated", "Pm Est January"], "date": "2020-01-17", "keywords": ["station", "searching", "great", "men", "video", "wfmy", "west", "say", "armed", "greensboro", "robbery", "robbed", "wanted", "gas", "waives"], "summary": "GREENSBORO, N.C. — Police are looking to identify the two people in surveillance video from a robbery at Great Stops.\nPolice say the men demanded money from the business and left the scene.\nRELATED: Police searching for man who robbed Greensboro shoe storeNo one was injured.\nAnyone with information about this incident is asked to contact Greensboro/Guilford Crime Stoppers at 336-373-1000.\nThe new WFMY News 2 phone and tablet app has a modern look and feel—download now."}, {"url": "https://www.wfmynews2.com/article/news/local/2020-toyota-us-figure-skating-championships-fanfest/83-48ab18b6-d7c7-453a-b1a9-5f424a0ad129", "title": "2020 Toyota U.S. Figure Skating Championships Fanfest, Tuesday", "authors": ["Author", "Terrence Jefferies", "Published", "Pm Est January", "Updated"], "date": "2020-01-20", "keywords": ["frozen", "kid", "skating", "fanfest", "championships", "2020", "game", "autographs", "toyota", "painting", "meet", "elsa", "figure", "face"], "summary": "Figure Skating FanFest daily special activity schedule:RELATED: 2020 U.S.\nRoll N Gamez – Video Game Trailer – Game Zone4:30 - 5:30 p.m. Area Sports Teams Mascots Convene at FanFest6 - 7 p.m. Skating Demonstration with Mia Horvath – FanFest Rink7 -8 p.m. Musical Performance by Stewart Coley – FanFest Stage7 - 8:30 p.m. Skating Demonstration with Summit Figure Skating Club – FanFest Rink8:30 p.m. FanFest ClosesThursday, Jan. 239:30 a.m. FanFest Opens10 - 11 a.m.\nRoll N Gamez – Video Game Trailer – Game Zone7:15 p.m. FanFest ClosesFriday, Jan. 242 p.m. FanFest Opens2 - 2:30 p.m. Skating Demonstration with Carlie Morton – FanFest Rink2 - 4 p.m. Musical Performance with Dana Bearror – FanFest Stage2 -6 p.m.\nIllusions and Confusions Face Painting and Balloon Twisting – Kids Zone2:30 - 3:15 p.m. Skating Demonstration with Mia Horvath – FanFest Rink3:15 - 3:30 p.m. Benny the Ice Skating Dog – FanFest Rink3:30 - 4:30 p.m.\nJunior Ladies Victory Ceremony, Autographs & Photos – FanFest Rink & Athlete Zone4:00 - 4:30 p.m. Skating Demonstration with Lilly Hoffman – FanFest Rink4 - 6 p.m."}, {"url": "https://www.wfmynews2.com/article/life/holidays/christmas-events-in-north-carolina-holidays/83-5cc1473a-fd6c-4831-b18e-f3c4d6229eec", "title": "Christmas In North Carolina! 2019 List of Holiday Events Across The State", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated"], "date": "2019-11-26", "keywords": ["lights", "carolina", "state", "events", "north", "holiday", "ride", "2019", "season", "list", "town", "train", "santa", "christmas", "details"], "summary": "Celebrate the holiday season by making a new Christmas tradition and escaping to check out these lavish holiday light displays!\nHere’s a list of events happening in North Carolina from now until Christmas that will add some magic to the holiday season!\nSpecial events include the annual Christmas Town 5K on Nov. 30 and the Christmas Town Festival on Dec. 12.\nMore Details: Christmas Town USAChristmas Town USAVisit NCNORTH CAROLINA HOLIDAY FLOTILLANov. 29-30, 2019, Wrightsville BeachWilmington and other nearby beaches launch the holiday season with a boat parade on the Intracoastal Waterway.\nMore Details: Find out about ticket prices and moreOTHER HOLIDAY STORIESRELATED: CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, And More!"}, {"url": "https://myfox8.com/news/driver-turns-herself-in-after-man-killed-in-greensboro-hit-and-run-police-say/", "title": "Driver turns herself in after man killed in Greensboro hit-and-run, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-05", "keywords": ["man", "hitandrun", "road", "cook", "lee", "reportedly", "turned", "cooks", "say", "killed", "greensboro", "work", "driver", "turns"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- The driver of a vehicle involved in a fatal Greensboro hit-and-run turned herself in Saturday, according to a Greensboro Police Department news release.\nA 76-year-old Burlington woman reportedly turned herself in at 2:15 p.m.Charges have not been filed and police say impairment is not suspected.\nAround 6:10 a.m., Earnest Lee Cook was walking in the road near the intersection of South Swing Road and Tri-Port Court and was reportedly hit by a 2015 Subaru Forrester, the release says.\nEarnest Lee Cook (credit: Kaleema Williams)The driver did not stay at the scene.\nPolice say the undercarriage of an officer's cruiser made contact with Cook's body after he had died."}, {"url": "https://myfox8.com/news/greensboro-police-department-to-announce-new-police-chief/", "title": "Greensboro Police Department announces new police chief", "authors": ["Tess Bargebuhr", "Digital Desk", "Nexstar Media Wire"], "date": "2020-01-14", "keywords": ["davis", "chief", "james", "greensboro", "officer", "candidates", "city", "community", "announces", "department", "wanted"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — Brian L. James, a current deputy chief of the Greensboro Police Department, will rise to become the new police chief, the department announced Tuesday.\nAs police chief, James will earn a $150,000 salary with an annual executive allowance of $4,320.\nThe search for the next Greensboro police chief recently narrowed down to two candidates, according to Assistant City Manager Trey Davis.\nNineteen of which were already holding a high-ranking position like a police chief or deputy chief in their respective cities.\n\"Residents want to see a police chief who can bring transparency and accountability to the police department."}, {"url": "https://myfox8.com/news/crash-involving-serious-injury-closes-down-section-of-martin-luther-king-jr-in-greensboro-police-say/", "title": "Martin Luther King Jr. reopens in Greensboro after crash involving serious injury , police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-25", "keywords": ["reopens", "st", "unknown", "luther", "king", "drive", "involving", "serious", "closed", "jr", "stoppers", "say", "greensboro", "injury", "martin"], "summary": "GREENSBORO, N.C. — Martin Luther King Jr. Drive was closed at E. Bragg St. after a crash involving serious injury Saturday and is now reopen, according to a Greensboro Police Department news release.\nThe Martin Luther King Jr. Drive entrance ramp from Gate City Boulevard was also closed and reopened.\nIt is still unknown at this time how many people were injured in the crash.\nAnyone with information about this incident is asked to contact Greensboro/Guilford Crime Stoppers at (336) 373-1000.\n36.072635 -79.791975"}, {"url": "https://www.wfmynews2.com/article/entertainment/events/greensboro-hosts-2020-us-figure-skating-championships-thousands-expected/83-59fea2dd-87c5-4bb3-93bf-d23ec6f27819", "title": "2020 U.S. Figure Skating Championships glide through Greensboro", "authors": ["Author", "Marissa Tansino", "Wfmy", "Published", "Am Est January", "Updated"], "date": "2020-01-19", "keywords": ["short", "dance", "skating", "2020", "championships", "glide", "ladies", "men", "free", "greensboro", "figure", "pairs"], "summary": "Figure Skating Championships are gliding through Greensboro.\nFigure Skating competitive structure.\nFigure Skating Championships FanFest kicks off this TuesdayThe events, in addition to the competition, consists of Fan-Fest.\nFigure Skating Championships are on sale now at Ticketmaster.com and the Greensboro Coliseum Box Office.\nRELATED: Greensboro to Host 2020 US Figure Skating ChampionshipsFollow WFMY News 2 on Facebook."}, {"url": "https://spectrumlocalnews.com/nc/triad/news/2020/01/13/greensboro-naacp-strengthening-relationship-with-jewish-community", "title": "Greensboro NAACP Strengthening Relationship with Jewish Community", "authors": ["Published Am Et Jan."], "date": "2020-01-13", "keywords": ["whats", "meetings", "jewish", "branch", "relationship", "monthly", "strengthening", "community", "kilimanjaro", "greensboro", "important", "naacp", "worship"], "summary": "GREENSBORO, N.C. -- The Greensboro branch of the NAACP is conducting three of its monthly meetings at the historic Temple Emanuel in downtown Greensboro.\nThe branch rotates between different place of worship for its monthly meetings.\nSharon Hightower, the treasure of the NAACP Greensboro branch, says because of recent hate crimes, it's important to strengthen the organization's relationship with the Jewish community.\nAfrique Kilimanjaro, a member of both the NAACP and the Jewish community, says solidarity is key.\n\"I think that it's important for Jews, Christians, Muslims, Shinto, Hindo, we all need to come together and be vocal about what's happening in our society,\" says Kilimanjaro."}, {"url": "https://patch.com/north-carolina/greensboro/activist-natalie-warne-keynote-mlk-celebration", "title": "Activist Natalie Warne To Keynote MLK Celebration", "authors": [], "date": "2020-01-09", "keywords": ["uncg", "natalie", "king", "dr", "activist", "celebration", "legacy", "unc", "students", "keynote", "mlk", "uncgs", "program", "campus", "warne"], "summary": "Activist, advocacy educator, youth engagement expert, producer, and TED Talk speaker Natalie Warne will deliver this year's keynote address for the program, with the theme, \"Reflect to Envision: 2020.\"\n\"The joint program is the perfect opportunity for both campuses to continue the collaborative legacy of Dr. King.\n\"For the last six years, UNCG has jointly celebrated the legacy of Dr. King with N.C. A&T.\nThe winner of the A&T MLK Oratory Contest and UNCG's MLK Service Award recipient will also be announced.\nShuttle transportation to and from A&T's campus will be provided for UNCG students, faculty, and staff."}, {"url": "https://myfox8.com/news/wwe-friday-night-smackdown-coming-to-greensboro-coliseum/", "title": "WWE Friday Night SmackDown coming to Greensboro Coliseum", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-11-18", "keywords": ["smackdown", "wrestling", "wwe", "battle", "coming", "champion", "wyattthe", "womens", "night", "world", "coliseum", "greensboro", "universal"], "summary": "GREENSBORO, N.C. — Wrestling fans, it’s time to get ready for some excitement because WWE Friday Night SmackDown is coming to the Greensboro Coliseum in January!\nThe show will premiere on Fox and be broadcast to the world live on Friday, Jan. 17, 2020 at 7:45 p.m.Daniel Bryan will battle Universal Champion “The Fiend” Bray Wyatt.\n“The Big Dog” Roman Reigns is set to take on King Corbin.\nPlus, SmackDown Tag Team Champions The New Day, SmackDown Women’s Champion Bayley, Braun Strowman, “The Boss” Sasha Banks, Intercontinental Champion Shinsuke Nakamura and many more will battle it out for audiences.\nTickets go on sale Friday, Nov. 22 at 12:00 p.m. through Ticketmaster.com."}, {"url": "https://myfox8.com/news/police-investigating-after-man-shot-in-greensboro/", "title": "Police investigating after man shot in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-12", "keywords": ["man", "walked", "shot", "information", "vehicle", "stoppers", "woundthe", "shooting", "investigating", "greensboro", "unspecified", "suspect", "victim"], "summary": "GREENSBORO, N.C. — Greensboro police are investigating after a shooting on Tuesday night, according to a news release.\nAt 9:36 p.m., officers were called to Moses Cone Hospital after someone walked in with a gunshot wound.\nThe victim, identified only as a man, was shot inside a vehicle at an unspecified location, the release said.\nNo suspect information has been released.\nAnyone with information on this shooting is asked to call Crime Stoppers at (336) 373-1000."}, {"url": "https://www.rhinotimes.com/news/greensboro-gearing-up-for-big-mlk-day/", "title": "Greensboro Gearing Up For Big MLK Day", "authors": ["Scott D. Yost"], "date": "2020-01-06", "keywords": ["jan", "museum", "mlk", "gearing", "king", "day", "parade", "luther", "jr", "greensboro", "kings", "big", "martin"], "summary": "The first major holiday of the year is fast approaching – Martin Luther King Jr. Day, on Monday, Jan. 20 – and Greensboro is getting ready.\nThe big item on the menu that day is, of course, the annual Martin Luther King, Jr. Day Parade in Greensboro, which honors King’s birthday in the city’s Ole Asheboro neighborhood.\nThe route will start at Benbow Professional Building and end at the intersection of Martin Luther King Jr. Drive and Gorrell Street.\nThe parade will begin at 11 a.m.On Sunday, Jan. 19, the Greensboro NAACP and the Pulpit Forum are sponsoring a “Martin Luther King, Jr. Day Celebration and Gospelfest.” That gospel music-infused event will be at United Institutional Baptist Church at 802 E. Market St in Greensboro.\nIn honor of the day, the civil rights museum is also, in partnership with Greensboro Urban Ministry, holding a canned food drive."}, {"url": "https://myfox8.com/news/meet-the-first-baby-girl-and-boy-born-at-cone-health-womens-hospital-in-greensboro/", "title": "Meet the first baby girl and boy born at Cone Health Women’s Hospital in Greensboro in 2020", "authors": ["Nexstar Media Wire"], "date": "2020-01-01", "keywords": ["mosely", "kelvin", "little", "meet", "cone", "hospital", "girl", "arrived", "health", "hes", "womens", "madden", "greensboro", "born", "boy", "baby", "dad"], "summary": "At 1:51 a.m., Kelsea Alexzandria Mosely arrived at Cone Health Women’s Hospital.\nShe was the first baby born at the hospital in 2020.\nThe little baby girl is named after her dad and grandfather, Kelvin Alexander.\n“We lost him this year, late July,” said Kelvin Mosely, Kelsea’s dad.\nThree girls and five boys were born at the Cone Health Women’s Hospital as of around 4 p.m.36.072635 -79.791975"}, {"url": "https://myfox8.com/news/2-injured-at-greensboro-steak-n-shake-taken-to-hospital-police-say/", "title": "2 injured at Greensboro Steak 'n Shake, taken to hospital, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-19", "keywords": ["n", "steak", "hospital", "taken", "started", "fought", "say", "shake", "greensboro", "injured", "customer"], "summary": "A fight at a Greensboro Steak ‘N Shake led to gunfire.\nNo one was shot, but the two men involved were taken to a hospital with non-life-threatening injuries.\nPlease enable Javascript to watch this videoGREENSBORO, N.C. -- Two people were taken to the hospital after being injured at a Greensboro Steak n' Shake Sunday, according to police.\nThe two people who were taken to the hospital reportedly have non-life threatening injuries.\nI just spoke with a couple employees at the Steak n’ Shake."}, {"url": "https://myfox8.com/news/officer-involved-shooting-leaves-suspect-dead-at-north-carolina-zoo-after-chase-out-of-rowan-county/", "title": "Suspect killed in deputy-involved shooting at North Carolina Zoo identified", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-07", "keywords": ["county", "deputies", "carolina", "deputyinvolved", "north", "road", "chase", "watch", "tried", "killed", "zoo", "shooting", "suspect", "identified", "rowan", "driver", "caster"], "summary": "Please enable Javascript to watch this videoASHEBORO, N.C. — A chase from Rowan County to the North Carolina Zoo ended with an deputy-involved shooting, according to the Randolph County Sheriff's Office.\nThe Rowan County Sheriff's Office identified the man killed as Troy Chase Caster, 21.\nThe driver tried to wrestle the gun away from the passenger and the gun went off, firing through the vehicle's window.\nThrough the night, Rowan County deputies tried to find Caster at multiple places in the area.\nThe suspect led deputies on a chase from Rowan County through Stanly County and Davidson County and into Randolph County."}, {"url": "https://myfox8.com/news/candidate-for-district-court-judge-hit-by-vehicle-critically-injured-in-downtown-greensboro/", "title": "Candidate for District Court judge hit by vehicle, critically injured in downtown Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-09", "keywords": ["downtown", "district", "taken", "hit", "vehicle", "candidate", "west", "warrior", "wants", "critically", "judge", "greensboro", "injured", "street", "court", "tomlinsonpemberton"], "summary": "GREENSBORO, N.C. — A candidate for District Court judge was hit by a vehicle in downtown Greensboro on Wednesday, according to Ron Glenn, with Greensboro police.\nCaroline Tomlinson-Pemberton was crossing the street at the intersection of North Edgeworth Street and West Market Street on Wednesday around 8:20 a.m. when she was hit.\nTomlinson-Pemberton was taken to the hospital in critical condition.\nA close family friend of Tomlinson-Pemberton said, “She is a warrior.\nShe wants everyone to know that she is not going to let this bump in the road deter her from becoming District Court Judge.”36.072635 -79.791975"}, {"url": "https://patch.com/north-carolina/greensboro/hoop-basketball-contemporary-art-opens-jan-31", "title": "\"To the Hoop: Basketball and Contemporary Art\" Opens Jan. 31", "authors": [], "date": "2020-01-28", "keywords": ["works", "hoop", "museum", "basketball", "exhibit", "north", "31", "courtesy", "art", "x", "unc", "jan", "contemporary", "artist", "opens"], "summary": "So much so that UNC Greensboro's Weatherspoon Art Museum is opening a new, original exhibition exploring all things basketball.\n\"To the Hoop: Basketball and Contemporary Art\" opens Friday, Jan. 31, at 7 p.m.\nThe exhibit examines basketball's intersection with contemporary art and culture, offering an opportunity to consider our world through the overlapping lenses of sport and art.\nStamey expects the show to attract basketball fans who may have never stepped foot in a contemporary art museum.\nBut she also hopes the reverse will happen – that, through the exhibit, art aficionados will be drawn to the sport."}, {"url": "https://myfox8.com/news/driver-dies-in-head-on-lexington-crash-troopers-say/", "title": "Driver dies in head-on Lexington crash, troopers say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-29", "keywords": ["crash", "crossed", "dies", "center", "suv", "seriousat", "troopers", "say", "killed", "lexington", "timeno", "headon", "lexus", "driver"], "summary": "LEXINGTON, N.C. — A driver was killed in a head-on crash in Lexington on Tuesday night, according to highway patrol.\nA Lexus crossed the center line and hit an SUV head on.\nThe driver of the Lexus was reportedly killed in the crash.\nOne person in the SUV was hurt, but their injuries are not serious.\nAt this point, troopers do not know why the driver of the Lexus crossed the center line."}, {"url": "https://myfox8.com/sports/u-s-figure-skating-championships-kick-off-monday-in-greensboro/", "title": "U.S. Figure Skating Championships kick off Monday in Greensboro", "authors": ["Stephanie Doyle"], "date": "2020-01-17", "keywords": ["click", "skating", "fanfest", "championships", "parking", "ice", "events", "kick", "passes", "greensboro", "figure"], "summary": "GREENSBORO, N.C. — The Toyota U.S. National Figure Skating Championships 2020 kick off Monday.\nThe Championships will be held Jan. 20 to 26 at the Greensboro Coliseum.\nFigure Skating Championships.\nFigure Skating.\nWeeklong parking passes are available for $60 from the Greensboro Coliseum Complex via Ticketmaster."}, {"url": "https://myfox8.com/news/alamance-county-family-to-hike-every-nc-state-park-with-shelter-dogs/amp/", "title": "Alamance County family to hike every NC state park with shelter dogs", "authors": [], "date": "2020-01-23", "keywords": ["park", "county", "family", "baker", "dogs", "alamance", "state", "animal", "visited", "hike", "help", "nc", "shelter", "burlington", "michel", "services"], "summary": "ALAMANCE COUNTY, N.C. -- An Alamance County family is challenging themselves this 2020 to help local shelter pets.\nIn 2019, the entire Baker family visited all 41 state parks in North Carolina.\nThis year, they are doing it again and bringing along different shelter dogs from Burlington Animal Services.\nThe Baker family got the idea from the foster express challenge happening at Burlington Animal Services.\nShe believes the shelter wouldn’t be as successful without support from community members, like the Baker family."}, {"url": "https://www.cbs17.com/news/north-carolina-news/nc-mom-speaks-out-after-daughter-grabbed-nearly-kidnapped-at-biscuitville/", "title": "NC mom speaks out after daughter grabbed, nearly kidnapped at Biscuitville", "authors": ["Laura Smith", "Joedy Mccreary", "Russ Bowen"], "date": "2020-01-04", "keywords": ["owen", "nearly", "speaks", "mom", "good", "west", "grabbed", "nc", "daughter", "samaritan", "saw", "kidnapped", "street", "biscuitville", "incident", "somebody"], "summary": "GREENSBORO, N.C. (WGHP) — A Greensboro mother is counting her blessings after her 8-year-old daughter was almost kidnapped last week.\nThe incident happened inside of the West Market Street Biscuitville restaurant on Friday, Dec. 27 around 8:20 a.m.Heather Owen is a regular at this Biscuitville and she and her daughter love to get breakfast.\nThe good Samaritan was able to snap a few pictures of the man and his license plate.\nThe pictures the good Samaritan provided to the officers on the scene were enough to track down and arrest 55-year-old Timothy Fry.\nWe join Ms. Owen in being extremely grateful to the good Samaritan at Biscuitville who stepped up to address the situation.”"}, {"url": "https://myfox8.com/news/motorcyclist-in-critical-condition-after-greensboro-crash-with-2-juveniles-in-suv-police-say/", "title": "Motorcyclist in critical condition after Greensboro crash with 2 juveniles in SUV, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-04", "keywords": ["crash", "motorcyclist", "intersection", "condition", "witnessed", "touring", "suv", "west", "unit", "week", "wendys", "say", "juveniles", "greensboro", "victory", "critical"], "summary": "GREENSBORO, N.C. — A motorcyclist is in critical condition after a crash with two juveniles in an SUV last week, Greensboro police say.\nBengy Christopher Austin, 52, was reportedly taken to the hospital after a crash at 4898 West Gate City Blvd., according to a police report.\nA silver 2017 Nissan Murano and a black 2005 Victory Touring motorcycle crashed in an intersection on Dec. 28, police say.\nPolice responded at 6:06 p.m. to the intersection, which is in front of a Wendy’s and Lidl grocery store.\nIf you witnessed this crash or can provide any information about this crash, please contact Officer J.P. Geisler with the Crash Reconstruction Unit at (336) 412-3914."}, {"url": "https://ncataggies.com/news/2020/3/31/promising-baseball-season-comes-to-an-end.aspx", "title": "Promising Baseball Season Comes to An End", "authors": [], "date": "2020-03-31", "keywords": ["aggies", "promising", "carolina", "conference", "defeated", "went", "feb", "season", "end", "senior", "baseball", "return", "comes", "strikeouts"], "summary": "The North Carolina A&T baseball team was poised for another big season in 2020 before the Mid-Eastern Athletic Conference (MEAC) announced the cancellation of all spring sports due to the coronavirus.The Aggies were the favorites to win the conference this season.N.C.\nOver the weekend of Feb. 22-23, Knapp went 5-fof-9 with a double and five RBI.The Aggies had four preseason All-MEAC selections.\nThe other first teamers were senior shortstop, senior relieverand senior catcherWith the NCAA allowing seniors of spring sports to return for an additional year, the Aggies could return all four players in 2021.Senior outfieldercould also return.\nHe was riding a 16-game hitting streak when the season came to a close and was third on the team in batting average at .317.\n9 NC State in Raleigh, but gave up three runs in the bottom of the ninth and fell just short, 8-7."}, {"url": "https://www.wral.com/coronavirus/coronavirus-coverage-in-north-carolina-april-6-2020-cumberland-infant-tests-positive/19043849/", "title": "Coronavirus coverage in North Carolina, April 6, 2020: Cumberland infant tests positive :: WRAL.com", "authors": [], "date": "2020-04-06", "keywords": ["county", "positive", "2020", "carolina", "cases", "officials", "north", "health", "coverage", "tests", "cumberland", "coronavirus", "wake", "masks", "covid19", "wralcom", "infant"], "summary": "— Here are the latest updates on the impact of the coronavirus outbreak in North Carolina and across the globe:What you need to know:At least 2,947 people in 91 North Carolina counties have tested positive for the coronavirus.\nAt least 44 people have died in North Carolina, and about 270 people are hospitalized.\n11:30 a.m.: Almost 2,900 people in North Carolina have been diagnosed with coronavirus, and 40 have died as of Monday.\nHe moved to North Carolina, where he joined Thomasville Furniture Industries and became president and CEO eight years later.\nMost towns along the North Carolina coast are closing beach access points, even parking lots to help keep people away from each other."}, {"url": "https://www.citizen-times.com/story/news/local/2020/03/27/some-earth-fare-stores-coming-back-local-investors/2925020001/", "title": "Some Earth Fare stores coming back. Whole Foods buys S. Asheville store", "authors": ["John Boyle", "Mackensy Lunsford", "Published A.M. Et March"], "date": "2020-03-27", "keywords": ["stores", "s", "buys", "investors", "fare", "coming", "store", "earth", "foods", "asheville", "group", "company", "turon"], "summary": "Earth Fare abruptly announced its closure and filed for bankruptcy in February, shocking employees, customers and founder Roger Derrough.\nThat includes Randy Talley, who worked for Earth Fare for years and then founded the Green Sage cafes, which Derrough later invested in.\nLooking for more investorsThe new Asheville-based investment group ultimately hopes to reopen \"seven or eight\" former Earth Fare stores, and will use the Earth Fare name.\n\"We’re working with people who are interested in financing and being part of the future financial success of Earth Fare,\" Turon said.\n\"Earth Fare was made up of so many great people, and our intention is to allow those people who made Earth Fare to stay part of this wonderful company."}, {"url": "https://myfox8.com/news/police-investigating-after-man-shot-in-greensboro/", "title": "Police investigating after man shot in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-12", "keywords": ["man", "walked", "shot", "information", "vehicle", "stoppers", "woundthe", "shooting", "investigating", "greensboro", "unspecified", "suspect", "victim"], "summary": "GREENSBORO, N.C. — Greensboro police are investigating after a shooting on Tuesday night, according to a news release.\nAt 9:36 p.m., officers were called to Moses Cone Hospital after someone walked in with a gunshot wound.\nThe victim, identified only as a man, was shot inside a vehicle at an unspecified location, the release said.\nNo suspect information has been released.\nAnyone with information on this shooting is asked to call Crime Stoppers at (336) 373-1000."}, {"url": "https://www.wral.com/coronavirus/coronavirus-coverage-in-north-carolina-april-9-2020-outbreaks-expand-in-nursing-homes-across-triangle/19048777/", "title": "Coronavirus coverage in North Carolina, April 9, 2020: Outbreaks expand in nursing homes across Triangle :: WRAL.com", "authors": [], "date": "2020-04-09", "keywords": ["county", "state", "expand", "coronavirus", "residents", "wralcom", "positive", "carolina", "north", "tested", "homes", "triangle", "officials", "staff", "coverage", "nursing", "health", "outbreaks", "care"], "summary": "4:50 p.m.: Thirty residents and three staff members at Louisburg Nursing Center have tested positive for the coronavirus, officials said.\nPublic health officials in Riverside, say only one of the 13 scheduled nursing assistants came to work.\nThe center didn’t say how many residents tested positive but that they are at UNC hospitals.\nThe Bulls thanked health care workers and asked the public to stay inside to protect everyone.\nMore than 3,500 people have tested positive for COVID-19 in North Carolina."}, {"url": "https://www.robesonian.com/opinion/letters/133531/vital-everyone-fills-out-census-form", "title": "Vital everyone fills out Census form", "authors": [], "date": "2020-04-08", "keywords": ["county", "form", "roughly", "federal", "state", "means", "person", "fills", "complete", "responded", "robeson", "vital", "census"], "summary": "To the editorWhile we attempt to flatten the curve through social distancing, one thing we can all do is complete the 2020 Census.\nAs of April 5 everyone with a home mailing address should have received an invitation to complete the 2020 Census.\nIf you have misplaced it or put it off, you can complete the form online at the Census.gov.\nDespite the obvious importance, Robeson County has only a 33% self-response rate as of April 5.\nIf you have not yet responded to the Census, take five minutes to help yourself and your community in this time of uncertainty."}, {"url": "https://weather.com/safety/floods/news/2020-02-20-south-heavy-rain-flood-threat-north-carolina-virginia-snow", "title": "Winter Storm Nash Brought Snow to Carolinas, Virginia and More Rain Unneeded Rain Across the South", "authors": [], "date": "2020-02-20", "keywords": ["winter", "carolinas", "inches", "precipitation", "snow", "carolina", "parts", "unneeded", "storm", "north", "brought", "south", "nash", "wettest", "rain", "virginia"], "summary": "Some parts of the South saw several inches of snow.\nA quick shot of snow blanketed parts of the South, bringing parts of Virginia and North Carolina their first accumulating snow of the season.\nMore than 4 inches of snow has fallen so far in southeastern Virginia and the Appalachians of North Carolina and eastern Tennessee.\nBoth Charlotte, North Carolina, and Norfolk, Virginia picked up 0.3 inches of snow.\nHaleyville, Alabama (32.35 inches), and Highlands, North Carolina (35.66 inches), have each picked up over 30 inches of precipitation since Dec. 1."}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/weather-stories/2020/01/13/when-will-north-carolina-s-snow-drought-end-", "title": "When Will North Carolina's Snow Drought End?", "authors": ["Published Pm Et Jan."], "date": "2020-01-13", "keywords": ["winter", "drought", "snow", "records", "trace", "winters", "north", "measurable", "weather", "end", "11", "reported", "dating", "carolinas"], "summary": "Outside of the mountains, most of the rest of the state did not see any measurable snow in 2019.\nDuring that time, there have been only 11 winters where there was no measurable snow reported.\nDuring that time, there have been only 11 winters where there was no measurable snow reported.\nDuring that time, there have been only six winters where there was no measurable snow reported.\nDuring that time, there have been only 11 winters where there was no measurable snow reported."}, {"url": "https://www.democratandchronicle.com/story/sports/high-school/2020/04/10/jaden-bradley-cannon-high-school-north-carolina-class-of-2022-top-recruit-rochester-ny-native/2974270001/", "title": "Meet Jaden Bradley, 'a Rochester kid' and a top basketball recruit in the Class of 2022", "authors": ["Billy Heyen", "Rochester Democrat", "Chronicle Usa Today", "Published A.M. Et April"], "date": "2020-04-10", "keywords": ["bradley", "rochester", "kid", "2022", "meet", "gray", "roth", "class", "basketball", "carolina", "game", "north", "nate", "recruit", "jaden", "school"], "summary": "Rochester basketball has seen its former stars begin to flourish at higher levels in recent years.\nIn what could be a new golden era of Rochester basketball making a name for itself beyond the city, Bradley’s got next.\nBradley was named the Gatorade player of the year in North Carolina and is a top recruit in the class of 2022.\nThe room changes when he comes in.”Maintaining tiesThe Bradley family: Nate Bradley Sr., Mialisha Bradley, Jaden Bradley and Nate Bradley Jr.\nWhen he gets the chance to write where he’s from on paperwork, Bradley often seeks to list Rochester, Gray said."}, {"url": "https://www.wfmynews2.com/article/entertainment/things-to-do-in-greensboro-march-2020-ncaa-tournament-greensboro-coliseum-folk-festival/83-f9369186-187c-4e03-bdb0-3b841019301e", "title": "Things to do in Greensboro March 2020", "authors": ["Author", "Chris Venzon", "Wfmy", "Published", "Pm Est February", "Updated"], "date": "2020-02-27", "keywords": ["park", "weekend", "mens", "things", "2020", "center", "basketball", "tanger", "music", "live", "greensboro", "tournament"], "summary": "GREENSBORO, N.C. — The Greensboro Coliseum Complex, LeBauer Park and the Steven Tanger Center for the Performing Arts are all capable of featuring world-class entertainment acts on any given weekend.\nRELATED: NCAA Men's Basketball Tournament Returning To Greensboro In 2020At the time, Governor Roy Cooper remarked on the financial boost the tournament offers for cities hosting the tournament.\nFolk in the Park will feature free live music, as well as food, dancing and family activities at LeBauer Park in downtown Greensboro.\nThe Greensboro Coliseum also will hosts live music on the 21st, with country music singer Cody Johnson visiting.\nOn Sunday the 22nd, Jay Leno rolls into the Tanger Center at 7:00 p.m. as a part of his national comedy tour."}, {"url": "https://myfox8.com/news/detectives-investigating-greensboro-shooting-after-victim-taken-to-hospital-police-say/", "title": "Detectives investigating Greensboro shooting after victim taken to hospital, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-29", "keywords": ["detectives", "hospital", "taken", "videogreensboro", "watch", "nc", "say", "shooting", "investigating", "greensboro", "summit", "tobacco", "victim"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Detectives are investigating a shooting in Greensboro after a victim was taken to the hospital Saturday, according to a Greensboro Police Department news release.\nAt 11:05 a.m., police responded to a shooting at the NC Tobacco Shop at 1000 Summit Avenue.\nThe victim was found at the scene and taken to a local hospital by Guilford County EMS.\nThe investigation is ongoing.\nAnyone with information about this incident is asked to contact Greensboro/Guilford Crime Stoppers at (336) 373-1000."}, {"url": "https://www.wfmynews2.com/article/news/local/basketball-sports/83-9abeec59-63a0-4dfe-83f0-00571bd4c9ee", "title": "NCAA Basketball on WFMY this weekend: Feb. 22-23", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Est February", "Updated"], "date": "2020-02-22", "keywords": ["weekend", "ncaa", "2020ncaa", "text", "basketball", "wfmy", "2223", "traffic", "state", "feb", "400600pm", "weather", "word", "etncaa"], "summary": "GREENSBORO, N.C. — Saturday, Feb. 22, 2020NCAA BASKETBALL: TENNESSEE @ AUBURN - 12:00n-2:00pm ETNCAA BASKETBALL: TEXAS @ KANSAS STATE - 2:00-4:00pm ETNCAA BASKETBALL: UCLA @ COLORADO - 4:00-6:00pm ETSunday, Feb. 23, 2020NCAA BASKETBALL: ST. JOHN’S @ SETON HALL - 2:00-4:00pm ETNCAA BASKETBALL: MARYLAND @ OHIO STATE - 4:00-6:00pm ETOther stories:Police: Lexington man arrested, accused of dragging woman into basement before trying to sexually assault her'From Murphy to Manteo,' snow fell in every corner of North Carolina ThursdayFour 2 Five: Smith High School's first black athlete shares his storyStay connected to local, national and breaking news: Download the new WFMY News 2 app.\n►Text the word APP to 336-379-5775►DOWNLOAD FOR IPHONE HERE►DOWNLOAD FOR ANDROID HERE►For the latest weather conditions and forecast text the word WEATHER to 336-379-5775►For traffic alerts text the word TRAFFIC to 336-379-5775"}, {"url": "https://myfox8.com/news/ef-1-tornado-touches-down-in-liberty-national-weather-service-says/", "title": "EF-1 tornado touches down in Liberty, National Weather Service says", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-07", "keywords": ["national", "tree", "tornado", "roof", "winds", "watch", "phillips", "damage", "touches", "ef1", "liberty", "weather", "teams", "power", "service"], "summary": "Please enable Javascript to watch this videoLIBERTY, N.C. — An EF-1 tornado touched down in Liberty Thursday, according to the National Weather Service.\nA string of storms hit the community Thursday, leaving many trees and power lines down in several residential streets.\nThe National Weather Service says the teams are not only investigating possible tornado damage in Liberty, but also other unspecified areas in central North Carolina.\nSurvey teams confirmed that an EF-1 tornado occurred yesterday in the town of Liberty, NC, with winds up to 100 mph.\nPhillips and her family were inside of their Liberty home the moment a large tree fell into the side of their house, crashing into the roof."}, {"url": "https://myfox8.com/news/more-than-97000-still-without-power-in-north-carolina-in-wake-of-storms/", "title": "More than 114,000 still without power in North Carolina in wake of storms", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-07", "keywords": ["county", "restoration", "duke", "energy", "carolina", "114000", "state", "storms", "regions", "north", "power", "severe", "service", "wake"], "summary": "Duke EnergyMore than 100,000 people are without power in North Carolina after severe storms rolled through the state Thursday.\nAs of 11 a.m. Friday, 114,214 North Carolinians were still waiting for power to return, according to Duke Energy.\nFor the State of North Carolina, Mecklenburg was the county hit the hardest with 19,287 Duke Energy customers still without power, followed by Wake County with 14,689.\nDuke Energy says any regions without an estimated restoration time should have one by 12 p.m. Friday.\n♦️POWER OUTAGE♦️We are aware of the power outages in the city, please contact your service provider to report your service being disrupted (City Electric or Duke Energy)."}, {"url": "http://www.therepublic.com/2020/04/09/ap-oly-virus-outbreak-sports-affected-a-g-3/", "title": "List of sports events affected by the coronavirus pandemic", "authors": ["The Associated Press", "The Ap Is One Of The Largest", "Most Trusted Sources Of Independent Newsgathering. Ap Is Neither Privately Owned Nor Government-Funded", "Instead", "As A Not-For-Profit News Cooperative Owned Its American Newspaper", "Broadcast Members", "It Can Maintain Its Single-Minded Focus On Newsgathering", "Its Commitment To The Highest Standards Of Objective", "Accurate Journalism."], "date": "2020-04-09", "keywords": ["pandemic", "cup", "championships", "vs", "postponed", "events", "international", "affected", "open", "feb", "world", "list", "coronavirus", "marathon", "china"], "summary": "Portuguese International Championships in Caldas da Rainha from March 5-8 canceled.\nAsia Cup qualifiers: Philippines vs. Thailand on Feb. 20; Japan vs. China on Feb. 21; China vs. Malaysia on Feb. 24, postponed.\nWorld Cup canoe sprint (Olympic qualifier) in Racice, Czech Republic from May 8-10 canceled.\nAll-Around World Cup in Milwaukee on March 7: Russia team withdrew.\nArtistic World Cup in Baku, Azerbaijan, from March 14, Day 3 of 4, canceled."}, {"url": "https://www.wfmynews2.com/article/news/local/good-morning-show/north-carolina-early-voting-starts-tomorrow/83-311eebb1-6833-4ff6-9ab0-78961f0a5fb2", "title": "In-person early voting for 2020 Primary Election begins today", "authors": ["Author", "Kandace Redd", "Published", "Pm Est February", "Updated", "Am Est February"], "date": "2020-02-12", "keywords": ["voting", "2020", "board", "primary", "early", "voters", "today", "vote", "north", "election", "begins", "voter", "ballot", "inperson"], "summary": "GREENSBORO, N.C. — The in-person early voting period for the 2020 primary election begins Thursday, February 13, and ends Saturday, February 29.\nDuring the early voting period, registered voters may update their name or address, but may not change their party affiliation.\n“We hope voters take advantage of this opportunity in this important election year.”What is a primary election?\n:In a primary election, voters select which candidates will appear on the ballot for a given political party in the general election in November.\nNote: During the early voting period, the State Board office will post daily early voting statistics here."}, {"url": "https://patch.com/north-carolina/greensboro/calendar/event/20200222/778206/leap-year-fun-with-slime", "title": "Leap Year Fun with Slime", "authors": ["Added Allen Gottfried"], "date": "2020-02-18", "keywords": ["glitter", "programs", "weekends", "fun", "leap", "slimes", "glow", "scent", "greensboro", "libraries", "slime", "play"], "summary": "Design it, play with it, and slime your friends.\nCreate slimes and add glitter, scent, color, beads, and more.\nThis is part of the G.L.O.W.\n-Greensboro Libraries on Weekends programs for all ages."}, {"url": "https://myfox8.com/news/driver-killed-in-crash-on-plainfield-drive-in-guilford-county/", "title": "Driver killed in crash on Plainfield Road in Guilford County identified", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-27", "keywords": ["county", "crash", "highway", "guilford", "west", "road", "plainfield", "troopers", "killed", "wearing", "identified", "driver"], "summary": "GUILFORD COUNTY, N.C. — One person was killed in a crash on Plainfield Road in Guilford County, according to Highway Patrol.\nAt about 11:24 a.m., troopers responded to a crash near the intersection of Northmore Trace and Plainfield Road, north of Greensboro.\nA pick-up truck was heading west on Plainfield Road when it crossed left of the centerline and off the road, troopers say.\nThe driver then overcorrected and ran off the road to the right, hitting a utility pole and overturning.\nThe driver, identified as Stephen Keith Dorsett, 58, of Greensboro, died at the scene."}, {"url": "https://patch.com/north-carolina/greensboro/calendar/event/20200218/741504/greensboro-job-fair-february-18-2020", "title": "Greensboro Job Fair - February 18, 2020", "authors": ["Added Allen Gottfried"], "date": "2020-01-12", "keywords": ["sales", "2020", "meet", "fair", "18", "opportunity", "job", "career", "greensboro", "free", "hiring", "face", "level"], "summary": "Meet face to face with top employers hiring for Sales, Customer Service, Retail, Financial Services, Management, I.T., Government positions and more!\nThis hiring event is FREE to Job Seekers.\nYou are invited to attend our upcoming Job Fair, attendance is free!\nThis will be a great opportunity to meet local, regional, and Fortune 500 Companies with immediate job openings in your area.\nMake sure to register so that companies can review your resume prior to attending the career fair."}, {"url": "https://myfox8.com/news/convicted-murderer-killed-in-north-carolina-prison-fight/", "title": "Convicted murderer killed in North Carolina prison fight", "authors": ["Associated Press", "Nexstar Media Wire"], "date": "2020-02-24", "keywords": ["sheriffs", "weapon", "youngjohnson", "carolina", "investigation", "state", "sentence", "north", "treated", "murderer", "killed", "say", "convicted", "prison", "struck", "fight", "serving"], "summary": "HOOKERTON, N.C. (AP) — North Carolina officials say a convicted murderer has been killed in a prison fight.\nAuthorities say 23-year-old Andre Young-Johnson was fatally injured Friday morning when he was struck with a homemade weapon at Maury Correctional Institution.\nYoung-Johnson was serving a 25-year sentence after pleading guilty to second-degree murder in Mecklenburg County.\nThe other offender who was involved in the incident was treated for non-life-threatening injuries.\nThe state Department of Public Safety says it is conducting an internal investigation and is cooperating with a criminal investigation by the Greene County Sheriff’s Office."}, {"url": "https://myfox8.com/news/hundreds-participate-in-2020-moral-march-in-raleigh/", "title": "Hundreds participate in 2020 Moral March in Raleigh", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-09", "keywords": ["moral", "hundreds", "2020", "died", "participate", "vote", "workers", "thats", "healthcare", "boyd", "love", "access", "raleigh", "rights"], "summary": "He couldn’t get access to the screenings he needed or treatment — until it was too late, Boyd said.\nThat’s why she took part in the 14th annual Moral March on Raleigh and Historic Thousands on Jones Street.\nHundreds came together in downtown Raleigh on Saturday for the event.\nThis year’s theme was, “When we vote, we win.”Attendees and organizers highlighted voter rights and the overall importance of voting.\nAlong with healthcare, immigration, war and workers’ rights were some of the other issues discussed."}, {"url": "https://myfox8.com/news/victim-dies-after-shooting-in-bunker-hill-road-area-in-greensboro/", "title": "Victim dies after shooting in Bunker Hill Road area in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-17", "keywords": ["dies", "shot", "information", "person", "road", "hill", "officers", "unidentified", "medical", "shooting", "area", "greensboro", "facility", "vehiclekernersville", "bunker", "victim"], "summary": "GREENSBORO, N.C. — Police say a person died after he was shot in Greensboro, according to Greensboro police.\nAt 6:30 a.m. Sunday, Kernersville police called in Greensboro officers to help with a homicide investigation.\nThe victim was initially taken to a Forsyth County medical facility in a private vehicle.\nKernersville police responded to the medical facility but turned the case over to GPD after getting information that suggested the killing happened in Greensboro.\nOfficers believe the unidentified, male victim was shot during a conflict in the area of the 400 block of Bunker Hill Road."}, {"url": "https://fox6now.com/2020/02/19/north-carolina-police-arrest-18-in-drug-investigation-seize-140-pounds-of-meth/amp/", "title": "North Carolina police arrest 18 in drug investigation, seize $800K+ worth of illegal drugs", "authors": ["Cnn Wire Service"], "date": "2020-02-19", "keywords": ["drug", "grams", "investigation", "carolina", "months", "worth", "north", "illegal", "seize", "drugs", "800k", "release", "18", "supervised", "pounds", "prison", "narcotics", "arrest"], "summary": "North Carolina police arrest 18 in drug investigation, seize $800K+ worth of illegal drugsHIGH POINT, N.C. (WGHP) — High Point police say 140 pounds of methamphetamine and other drugs are off the street after a drug investigation ended with 18 arrests.\nOn Thursday, the police department’s Vice Narcotics Unit worked with the Greensboro DEA Task Force and U.S. Attorney’s Office to complete an investigation into heroin, fentanyl, meth and cocaine trafficking.\nThe city noticed an increase in the use of the drugs in late 2018 and early 2019.\nIn 2018, 17 people died of overdoses, and, in 2019, 23 more people died of overdoses.\nFrom early 2019 to mid-2019, officers were able to identify several suspected key players in narcotics distribution and related violence."}, {"url": "https://www.rhinotimes.com/news/obama-invited-to-civil-rights-museums-february-1st-gala/", "title": "Obama Invited to Civil Rights Museum’s February 1st Gala", "authors": ["Scott D. Yost"], "date": "2020-01-02", "keywords": ["civil", "event", "award", "museum", "greensboro", "invited", "gala", "president", "museums", "1st", "rights", "anniversary", "obama", "brown"], "summary": "The “Gala 2020” will be held on Saturday, Feb. 1 at the Special Events Center at the Greensboro Coliseum with tickets costing $150 per person.\nAt the gala this year, the museum will celebrate national and local activists who’ve made major contributions to human and civil rights.\nThe civil rights museum was founded by Guilford County Commissioner Skip Alston and former Greensboro City Councilmember and former state Rep. Earl Jones in an effort that took years.\nAl Sharpton will be honored with a “Lifetime Achievement Award” for his work in civil rights.\nBrown and Emma Washington as the “2020 Sit-In Participant Award honorees,” for their involvement in the 1960 Woolworth’s lunch counter protest."}, {"url": "https://myfox8.com/news/nc-at-state-uses-campus-alerts-to-keep-students-safe/", "title": "NC A&T State uses campus alerts to keep students safe", "authors": ["Michelle Wolf", "Nexstar Media Wire"], "date": "2020-02-10", "keywords": ["alerts", "robbery", "uses", "state", "alert", "whitaker", "west", "nc", "students", "feel", "campus", "safe", "tell", "area", "know"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — Students put on alert after a reported robbery near the North Carolina A&T State University campus.\nThe location is about a mile away from N.C. A&T, which prompted the Aggie Alert warning students to be careful and on the lookout for the suspects.\nEach situation prompted an “Aggie Alert.”It’s a campus system in place to alert students, families and faculty of emergencies.\nDespite the recent spike in alerts, students we spoke with tell me they feel secure on campus.\nFOX8 reached out to Greensboro police and campus police to find out if any students were victims in the robbery."}, {"url": "https://myfox8.com/weather/snowfall-is-still-a-possibility-late-thursday-early-friday-chief-meteorologist-van-denton-says/", "title": "‘Snowfall is still a possibility’ late Thursday, early Friday", "authors": ["Digital Desk", "Allison Smith", "Associated Press"], "date": "2020-02-18", "keywords": ["upper", "snowfall", "snow", "low", "model", "shows", "early", "late", "light", "byrd", "likely", "possibility", "piedmont", "raleigh"], "summary": "Thursday and Thursday night, Byrd says chilly air will settle into the Tar Heel State, setting the scene for some possible rain/snow mixture or light snow.\nDenton says the Short Range Ensemble Forecast model shows the possibility of the Triad getting more than 7 inches.\nThe new GFS model shows the same with lighter amounts in the Piedmont and more in southeastern North Carolina.\n\"At this point, it is way too early to determine if we're going to have accumulations here in the Piedmont,\" Byrd says.\nBeginning Friday, expect sunshine and warmer temperatures reaching into the low 40s Friday and low 50s Saturday, Byrd said."}, {"url": "https://myfox8.com/news/friends-fans-of-the-special-olympics-take-polar-plunge-in-greensboro/", "title": "Friends, fans of the Special Olympics take polar plunge in Greensboro", "authors": ["Digital Desk", "Chad Tucker"], "date": "2020-02-29", "keywords": ["fans", "nordeen", "carolina", "special", "olympics", "north", "friends", "plunge", "started", "polar", "greensboro", "sonorthcarolina", "schools"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Special Olympics North Carolina gave local thrill-seekers a reason to take the polar plunge Saturday in Greensboro.\nThe organization says they have already raised over $50,000 throughout the two-day event that started Friday and continues Saturday.\n@myfox8 @SONorthCarolina pic.twitter.com/iDdQ11cdAH — Katie Nordeen (@KatieNordeen) February 29, 2020Friends and fans of the Special Olympics took the polar plunge at Wet'n Wild Emerald Pointe.\nSpecial Olympics Unified Champion Schools and Special Olympics North Carolina joined to rally and plunge for inclusion.\npic.twitter.com/NQ1tV13G0l — Special Olympics North Carolina (@SONorthCarolina) February 29, 2020"}, {"url": "https://nsjonline.com/article/2020/02/holding-honors-long-time-nc-conservation-leader/", "title": "Holding honors long-time NC conservation leader", "authors": ["A.P. Dillon", "About A.P. Dillon", "A.P. Dillon Is A North State Journal Reporter Located Near Raleigh", "North Carolina. Find Her On Twitter"], "date": "2020-02-12", "keywords": ["wildlife", "leader", "holding", "conservation", "north", "truly", "project", "nc", "habitat", "bridges", "longtime", "million", "eddie", "honors"], "summary": "WASHINGTON, D.C. — Rep. George Holding (R-NC) took to the floor of the House of Representatives on Feb. 5 to honor Greensboro resident Eddie Bridges.\n“Greensboro’s Eddie Bridges is such a rare person, Madam Speaker,” Holding said.\nHolding recounted Bridges’ accomplishments, such as found the NC Wildlife Habitat Foundation.\nBridges projects listed by Rep. Holding include a quail habitat project at Sandhills Game Land, a bass habitat project at Jordan Lake, and an NCSU black bear research project in Hyde County.\nIn his remarks, Holding credited Bridges with the idea for the NC Wildlife Resources Commission’s Wildlife Endowment Fund, the state waterfowl stamp and the state income tax check-off for non-game and endangered wildlife."}, {"url": "https://www.supermarketnews.com/retail-financial/publix-build-distribution-center-greensboro-nc", "title": "Publix to build distribution center in Greensboro, N.C.", "authors": [], "date": "2020-02-27", "keywords": ["stores", "distribution", "jobs", "todd", "carolina", "center", "lakeland", "north", "publix", "nc", "greensboro", "jones", "roy", "build"], "summary": "Publix Super Markets has broken ground on a new refrigerated distribution center in Greensboro, N.C.\nThe 940,000-square-foot facility will be Publix’s 10th DC overall and first in North Carolina.\nPublix CEO Todd Jones, North Carolina Gov.\nRelated: Publix names Norman Badger as bakery/meat business VPPublix Publix CEO Todd Jones (left) with North Carolina Gov.\nOverall, the supermarket chain operates 1,243 stores in Florida, Georgia, Alabama, Tennessee, South Carolina, North Carolina and Virginia."}, {"url": "https://myfox8.com/news/snowfall-is-still-a-possibility-thursday-night-friday-morning/", "title": "‘Snowfall is still a possibility’ Thursday night, Friday morning", "authors": ["Van Denton", "Emily Byrd", "Nexstar Media Wire"], "date": "2020-02-18", "keywords": ["triad", "snowfall", "snow", "forecast", "model", "shows", "north", "morning", "night", "possibility", "piedmont", "van", "raleigh"], "summary": "Highs on Thursday will be in the low-40’s with lows dipping into the mid-20’s Friday morning.\nHighs will be in the upper-30s while lows drop below freezing into the upper-20s by Friday morning.\nAfter studying model ensembles, confidence is highest in eastern NC for measurable snowfall and therefore more is put there.\npic.twitter.com/ELcu56z4gr — Van Denton (@VanFOX8Weather) February 18, 2020Denton says the Short Range Ensemble Forecast model shows the possibility of the Triad getting more than 7 inches.\nThe new GFS model shows the same with lighter amounts in the Piedmont and more in southeastern North Carolina."}, {"url": "https://myfox8.com/news/winston-salem-forsyth-county-schools-to-dismiss-2-hours-early-on-thursday/", "title": "Some Piedmont Triad schools to dismiss early on Thursday due to weather", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-19", "keywords": ["county", "school", "winter", "triad", "system", "dismiss", "early", "hours", "afterschool", "weather", "piedmont", "schools"], "summary": "Guilford County Schools will dismiss two hours early on Thursday.\n\"Due to the threat of inclement weather, GCS schools will dismiss two hours early for students on Thursday, Feb. 20, with an option to close.\nWinston-Salem/Forsyth County Schools will dismiss two hours early on Thursday in anticipation of winter weather.\n\"Due to inclement weather, we will dismiss school early for tomorrow Thursday, February 20.\nThe Piedmont Triad will be under a Winter Weather Advisory on Thursday and Friday, according to the National Weather Service."}, {"url": "https://theacc.com/news/2020/2/4/athlete-awards-north-carolina-sweeps-first-acc-mens-lacrosse-weekly-honors-for-2020-season.aspx", "title": "North Carolina Sweeps First ACC Men’s Lacrosse Weekly Honors for 2020 Season", "authors": [], "date": "2020-02-04", "keywords": ["mens", "2020", "goals", "carolina", "weekly", "north", "week", "lacrosse", "season", "player", "tar", "acc", "scored", "honors", "sweeps"], "summary": "Men's Lacrosse February 04, 2020 North Carolina Sweeps First ACC Men’s Lacrosse Weekly Honors for 2020 SeasonGREENSBORO, N.C. (theACC.com) – North Carolina junior attackman Chris Gray claimed the first ACC Men’s Lacrosse Offensive Player of the Week honors for the 2020 season, while Tar Heel sophomore goalkeeper Caton Johnson earned ACC Defensive Player of the Week laurels.\nA native of Wading River, New York, Gray scored six points (four goals, two assists) on Saturday in his North Carolina debut in a 19-6 triumph against Colgate.\nThe last Tar Heel to have six points in a game was Chris Cloutier, who scored six goals against Mercer on Feb. 28, 2018.\nThe 2019 ACC Freshman of the Year, Johnson started his season strong by making nine saves and surrendering just two goals on 20 shots faced in the season opener versus Colgate.\n2020 ACC Offensive Player of the Week HonorsFeb. 4 – Chris Gray, Jr., A, North Carolina2020 ACC Defensive Player of the Week HonorsFeb. 4 – Caton Johnson, So., GK, North Carolina"}, {"url": "https://myfox8.com/news/today-marks-60th-anniversary-of-historic-greensboro-sit-in/", "title": "Today marks 60th anniversary of historic Greensboro sit-in", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-01", "keywords": ["historic", "protest", "event", "60th", "marks", "today", "sitin", "woolworths", "sitins", "stood", "greensboro", "anniversary", "held"], "summary": "(News & Record)Please enable Javascript to watch this videoGREENSBORO, N.C. -- Saturday marks the 60th anniversary of the historic sit-ins held at Woolworth's in downtown Greensboro from February 1, 1960, to July 25, 1960.\nThe Greensboro sit-ins were a series of non-violent events held to protest racial segregation in the south.\nTo commemorate the anniversary, an event will be held at the Greensboro Coliseum at 7 p.m.NC A&T held a Sit-In Commemorative Program at the Alumni-Foundation Event Center on 200 N. Benbow Rd.\nFormer President Barack Obama tweeted about the anniversary, saying:\"Sixty years ago today, the Greensboro Four stood up to injustice by sitting down at a lunch counter.\nSixty years ago today, the Greensboro Four stood up to injustice by sitting down at a lunch counter."}, {"url": "https://www.wnct.com/news/north-carolina/mike-bloomberg-to-visit-n-c-on-first-day-of-early-vote/", "title": "Mike Bloomberg to visit N.C. on first day of early vote", "authors": ["Dalisa Robles", "Fantasia Harvey", "Associated Press"], "date": "2020-02-10", "keywords": ["doors", "visit", "st", "voters", "early", "bloomberg", "mike", "vote", "day", "open", "north", "nc", "greensboro", "raleigh"], "summary": "President Donald Trump and Mike Bloomberg could hardly be more different as people but now they both want the same job: Trump’s.\n(AP Photo/Sue Ogrocki, File)CHARLOTTE, N.C. (WNCT) Democratic presidential candidate Mike Bloomberg will campaign in Winston-Salem, Greensboro, and Raleigh on Thursday.\nDoors open at 7:00 a.m.Greensboro: Greensboro Mike 2020 Field Office, Cadillac Service Garage, 304 E Market St, Greensboro, NC 27401.\nDoors open at 9 a.mRaleigh: Raleigh Union Station, 510 W Martin St, Raleigh, NC 27601.\nDoors open at 11:45 a.m."}, {"url": "https://patch.com/north-carolina/greensboro/uncg-2019-20-track-field-schedule-announced", "title": "UNCG 2019-20 Track & Field Schedule Announced", "authors": [], "date": "2019-12-06", "keywords": ["invitational", "spartans", "compete", "va", "jdl", "outdoor", "201920", "track", "announced", "high", "season", "schedule", "unc", "field", "uncg"], "summary": "From UNC Greensboro Athletics:December 3, 2019GREENSBORO, N.C. – The UNC Greensboro 2019-20 indoor/outdoor track & field schedule has been finalized, Coach Pearson announced Monday.\n\"Overall, we are very excited about our upcoming 2019-20 indoor schedule along with our 2020 outdoor schedule,\" said Pearson.\nOUTDOORTo open the outdoor season, UNC Greensboro will head to the coast for the Seahawk Invitational in Wilmington, N.C. (March 13-14).\nThe 2019-20 SoCon Outdoor Track & Field Championships take place May 2-3 in Birmingham, Ala.\nThe outdoor season will wrap up at the NCAA Division I Championships, held June 10-13 in Austin, Texas."}, {"url": "https://myfox8.com/news/man-dies-after-crashing-through-fence-in-greensboro-hitting-parked-vehicles-police-say/", "title": "Man dies after crashing through fence in Greensboro, hitting parked vehicles, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-01", "keywords": ["crash", "man", "fence", "parked", "crashing", "dies", "taken", "greensboro", "road", "unit", "right", "sophia", "nc", "say", "hitting", "reconstruction", "vehicles"], "summary": "GREENSBORO, N.C. — An NC man died Saturday morning after a fatal crash in Greensboro, according to the Greensboro Police Department.\nCharles Henry Brown, 32, of Sophia, was driving his 2013 Dodge Charger north on U.S. 29 at 4:09 a.m.\nThe car ran off the road to the right, jumped a median and then crashed through a fence into parked vehicles at 1332 N O’Henry Blvd.\nBrown was taken to the hospital with critical injuries where he was pronounced dead.\nThe Greensboro Police Department Crash Reconstruction Unit is investigating the crash."}, {"url": "https://myfox8.com/weather/photos-show-flooding-across-piedmont-triad/", "title": "Video, photos show flooding, damage across Piedmont Triad", "authors": ["Digital Desk", "Allison Smith", "Associated Press"], "date": "2020-02-06", "keywords": ["triad", "flooding", "trying", "timing", "video", "dont", "storms", "tore", "damage", "piedmont", "worsei", "woof", "worx", "photos", "know"], "summary": "Severe storms tore through the Piedmont Triad early Monday morning, and for many people, Mother Nature's timing couldn't have been worse.\n\"I guess I'm a little bit in shock.\nI don't know what to do.\nReally we are just trying to clean.\nI just don't know where to go from here,\" said Azure Hensley, owner of Woof Worx."}, {"url": "https://www.tampabay.com/sports/high-schools/2020/02/29/female-wrestler-makes-history-with-north-carolina-state-title-win/", "title": "Female wrestler makes history with North Carolina high school state title win", "authors": ["Associated Press"], "date": "2020-02-29", "keywords": ["history", "wrestlers", "title", "wrestler", "makes", "winning", "state", "won", "north", "thought", "high", "win", "school", "female"], "summary": "RALEIGH, N.C. — A female wrestler has made history by winning a state high school championship in North Carolina.\nJunior Heaven Fitch of Uwharrie Charter became the first female to win one of the North Carolina High School Athletic Association’s individual state championships, the association said on its website.\nOverall, she was one of three female wrestlers in the tournament, he said.\nLast year she became the first female wrestler to place, coming in fourth in her division.\nFitch said that when she started high school, she would have never expected to have this much success."}, {"url": "https://myfox8.com/news/woman-charged-with-assaulting-deaf-woman-outside-greensboro-starbucks/", "title": "Woman charged with assaulting deaf woman outside Greensboro Starbucks", "authors": ["Hayley Fixler", "Nexstar Media Wire"], "date": "2020-02-13", "keywords": ["wished", "parker", "davis", "starbucks", "assaulting", "reported", "outside", "way", "grabbed", "woman", "deaf", "uncomfortable", "greensboro", "tell", "charged", "know"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A woman is charged with assaulting a deaf woman outside of a Greensboro Starbucks.\n\"She said a lady had come up behind her, tapped her, and grabbed her,\" said Jennifer Parker, the victim's daughter.\nParker's mom says Davis grabbed her and tried to get into her car.\nA guy came up and grabbed [Davis] and pulled her off of the car so my mom could shut it and lock it,\" Parker said.\nParker wished more people reported their stories to police, rather than posting about them after the fact."}, {"url": "https://myfox8.com/news/20-year-old-killed-in-crash-on-interstate-85-in-greensboro/", "title": "20-year-old killed in crash on Interstate 85 in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-06", "keywords": ["85", "crash", "word", "craver", "went", "videogreensboro", "interstate", "watch", "vehiclethe", "killed", "greensboro", "control", "southbound", "20yearold"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A person was killed in a crash on southbound Interstate 85 in Greensboro, according to a news release from Greensboro police.\nThe crash happened on I-85 near South Elm-Eugene Street around 9 a.m.Matthew Craver, 20, of Lexington, was driving a 1999 Mercedes-Benz and lost control of the vehicle.\nThe Mercedes went off into the median and traveled back across the southbound lanes where it was hit by a tractor-trailer.\nCraver was taken to the hospital and died from his injuries.\nThere is no word on what caused Craver to lose control of the vehicle."}, {"url": "https://myfox8.com/news/endangered-fish-thriving-at-north-carolina-zoo/", "title": "Endangered fish thriving at North Carolina Zoo", "authors": ["Shannon Smith", "Nexstar Media Wire"], "date": "2020-02-14", "keywords": ["wildthat", "fish", "carolina", "thrived", "north", "weeks", "watch", "zoo", "endangered", "thriving", "threatened", "videoasheboro"], "summary": "Please enable Javascript to watch this videoASHEBORO, N.C. — The North Carolina Zoo is home to many animals that are threatened or even endangered in the wild.\nThat includes a fish that once thrived in North Carolina, but now the short-nosed sturgeon is basically extinct in our state.\nShannon Smith shows us this special fish in this week's Zoo Filez."}, {"url": "https://theacc.com/news/2020/2/25/swimming-diving-2020-acc-mens-swimming-championships-start-wednesday.aspx", "title": "2020 ACC Men's Swimming Championships Start Wednesday", "authors": [], "date": "2020-02-25", "keywords": ["mens", "title", "2020", "start", "championships", "championship", "swimming", "state", "conference", "north", "acc", "tech", "poll", "virginia"], "summary": "NC State men look to capture sixth straight conference title– The 2020 Atlantic Coast Conference Men’s Swimming Championships begin Wednesday, Feb. 26, and continue through Saturday, Feb. 29, at the Greensboro Aquatics Center in Greensboro, North Carolina.Reigning ACC Champion NC State enters the Championship ranked No.\nThe Wolfpack is led by head coach Braden Holloway and has won the last five conference titles.No.\n9 Louisville is looking to win their first ACC title after finishing as the runner-up for the last five years.\nArthur Albiero leads the Cardinals, and has been at the helm since 2003.Also featured in the poll are No.\n19 Virginia Tech and No."}, {"url": "https://myfox8.com/news/remarkable-women-news/remarkable-women-2020-dr-kelly-graves-is-passionate-about-working-with-children-and-families/", "title": "Remarkable Women 2020: Dr. Kelly Graves is passionate about working with children and families", "authors": ["Natalie Wilson"], "date": "2020-02-25", "keywords": ["remarkable", "women", "university", "2020", "families", "start", "kellin", "named", "foundation", "north", "passionate", "graves", "working", "nonprofit", "children", "kelly", "dr"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Dr. Kelly Graves is passionate about working with children and families and helping communities empower each other.\nSince opening, Graves says The Kellin Foundation has helped more than 25,000 people.\nAnother milestone is that The Kellin Foundation was named as a partner with The National Child Traumatic Stress Network.\nRemarkable Women is part of a nationwide Nexstar Media initiative to honor the influence that women have had on public policy, social progress and the quality of life.\nPlease also follow the Remarkable Women Facebook page here for stories about these Remarkable Women across the country!"}, {"url": "https://myfox8.com/news/traffic-backs-up-in-i-40-west-in-greensboro-after-crash/", "title": "Crash involving 4 vehicles on I-40 west in Greensboro leaves traffic backed up", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-02-04", "keywords": ["crash", "backed", "leaves", "chevrolet", "traffic", "west", "involving", "nc", "i40", "lanes", "greensboro", "department", "pickup", "driver", "vehicles"], "summary": "Traffic backs up in I-40 west in Greensboro after crash.\n(North Carolina Department of Transportation)GREENSBORO, N.C. — A crash in Greensboro shut down two lanes on Interstate 40 west in Greensboro, according to the N.C. Department of Transportation.\nTroopers say a Chevrolet 3500 pickup merged into the path of a Chevrolet 1500 pickup, causing the two to crash.\nThe driver of the 1500 and the driver of one of the cars were reportedly hurt and taken to a hospital.\nAn NCDOT traffic cam shows traffic backed up on the highway."}, {"url": "https://www.wfmynews2.com/article/news/local/coronavirus-live-updates-nc-blog-wfmy/83-6c1f8cf6-8c47-4bf0-b863-819dd6b9d49e", "title": "BLOG | Guilford County issues tighter restrictions, limits groups", "authors": ["Author", "Wfmy News Digital Team", "Published", "Am Edt March", "Updated"], "date": "2020-03-23", "keywords": ["county", "carolina", "issues", "guilford", "state", "blog", "north", "groups", "health", "center", "closed", "coronavirus", "restrictions", "school", "limits", "tighter", "schools"], "summary": "RELATED: Coronavirus in North Carolina: County-by-county breakdown of positive cases7:45 a.m. - Join our digital newscast AFTER GMS!\nRELATED: List of businesses to close by 5pm Wednesday7:25 p.m. - Guilford County Schools gives an update on a plan moving forward following Gov.\n4:37 p.m. - Randolph County Health makes the following changes based on recommendations.\n4:00 p.m. - In accordance with the Governor’s announcement, Winston-Salem/Forsyth County Schools will remain closed for in-person instruction through May 15, 2020.\n8:00 a.m. - Today is the first day of online learning for Guilford County Schools."}, {"url": "https://www.wfmynews2.com/article/news/local/greensboro-guilford-county-high-point-stay-at-home-order-mandate-shelter-coronavirus-nc/83-61a12197-0732-4fee-bca4-db91a854c811", "title": "Stay-at-home orders issued for Greensboro, High Point, Guilford County", "authors": ["Author", "Megan Allman", "Wfmy News Digital", "Alma Mccarty", "Published", "Pm Edt March", "Updated"], "date": "2020-03-25", "keywords": ["county", "point", "orders", "guilford", "state", "stayathome", "high", "issued", "residents", "greensboro", "order"], "summary": "GREENSBORO, N.C. — Guilford County, Greensboro, and High Point officials have now issued a Stay-at-Home order effective Friday, March 27 at 5:00 p.m.\nThe order will remain in effect through Thursday, April 16 for residents in Greensboro, High Point and in Guilford County.\nGreensboro Mayor Nancy Vaughan, High Point Mayor Jay Wagner, Guilford County Commissioners Chairman Jeff Phillips addressed citizens during the briefing.\nRELATED: Stay-at-home order issued for Mecklenburg CountyNorth Carolina Governor Roy Cooper has not issued a stay-at-home order for the state at this time but said additional orders are coming.\nStay-at-home orders can vary between local governments and states, but typically the orders are not total lockdowns."}, {"url": "https://www.wfmynews2.com/article/news/health/coronavirus/coronavirus-real-time-updates-blog-nc/83-6f488f69-b12a-4d21-b73d-2570f7ceb9d0", "title": "Blog: Trump signs $2.2 trillion stimulus bill", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Megan Allman", "Chris Venzon", "Wfmy", "Brian Bennett", "Lea Wilson", "Published", "Am Edt March"], "date": "2020-03-25", "keywords": ["county", "carolina", "state", "blog", "north", "health", "22", "stayathome", "bill", "city", "trump", "trillion", "stimulus", "coronavirus", "open", "order", "signs"], "summary": "North Carolina officials say staying homes can save lives, to stand six feet away from others, wash your hands, cough into your elbows.\nNorth Carolina Governor Roy Cooper is holding a press conference at 4 p.m. We will stream it LIVE in this story.\nWEDNESDAY, MARCH 25:10:45 p.m. - Winston-Salem Police said they will enforce the stay-at-home order even if it means issuing citations.\nRELATED: High Point University student tests positive for COVID-199:00 p.m. - President Trump has approved a major disaster declaration for North Carolina.\nGovernor Cooper said a number of patients in North Carolina are in hospitals, and some are in critical condition."}, {"url": "https://triad-city-beat.com/daily-coronavirus-roundup-monday-march-23-2020/", "title": "Coronavirus Daily Update: Monday March 23, 2020", "authors": ["Publisher. Executive Editor. Head Paperboy."], "date": "2020-03-23", "keywords": ["whats", "salons", "daily", "2020", "facilities", "cases", "state", "video", "23", "nc", "shopping", "coronavirus", "centers", "update", "number"], "summary": "Monday morning coronavirus quarterbackingThe day began in NC with a Gov.\nAirports, bus and train stations, shopping centers, offices, factories and childcare centers are exempt, as are medical facilities.\nAirports, bus and train stations, shopping centers, offices, factories and childcare centers are exempt, as are medical facilities.\nPublic schools are officially closed until May 15 for in-person learning; classes will continue online, and the Class of 2020 will graduate on time.\nOf those new cases, none seem to have come from Forsyth or Guilford, which remain at 12 and 11 cases, respectively."}, {"url": "https://triad-city-beat.com/daily-coronavirus-roundup-march-20-2020/", "title": "Coronavirus Daily Update: Friday, March 20, 2020", "authors": ["Publisher. Executive Editor. Head Paperboy."], "date": "2020-03-21", "keywords": ["county", "market", "daily", "20", "2020", "supplies", "release", "journal", "press", "coronavirus", "according", "virus", "update", "order", "covid19"], "summary": ", with 72 beds, and an adequate supply of COVID-19 test kits — though he said no inmates have presented themselves as sick.\nCounty Manager Marty Lawing asked all restaurants and bars to close their seating areas , in compliance with Gov.\nThere are 172 known cases in North Carolina as of 9 p.m.of COVID-19, like the others someone who had been traveling.\nCone Health closed its COVID-10 testing sites just after 5 p.m. today, according to a press release, because they ran out of supplies.\njust after 5 p.m. today, according to a press release, because they ran out of supplies."}, {"url": "https://triad-city-beat.com/daily-coronavirus-roundup-sunday-march-23-2020/", "title": "Coronavirus Daily Update: Sunday, March 22, 2020", "authors": ["Publisher. Executive Editor. Head Paperboy."], "date": "2020-03-22", "keywords": ["daily", "2020", "state", "page", "way", "told", "paul", "22", "week", "spread", "coronavirus", "town", "update", "thats", "tomorrow"], "summary": "Last Friday my email kept pinging with incoming messages, each one a canceled event or a corporate response to the coronavirus.\nThe CDC page, which hasn’t refreshed since Friday, won’t update until 4 p.m. Monday.\nThe state page updates every morning, even the weekend, so the local count is solid, but certainly trending up.\nAnd then there’s this great resource, a page developed by a Washington state teenager that’s clocking the entire pandemic.\nThe timing is unfortunate: Last week his father, Sen. Ron Paul, warned that the coronavirus might be a hoax."}, {"url": "https://www.northcarolinahealthnews.org/2020/03/23/drive-thru-test-sites-come-and-go/", "title": "COVID-19 drive-thru test sites come and go in NC", "authors": ["Liora Engel-Smith", "Glenn Field", "Candice Manning", "Rose Hoban", "North Carolina Health News"], "date": "2020-03-23", "keywords": ["testing", "site", "sites", "clinics", "drivethru", "state", "health", "week", "nc", "test", "come", "unc", "patients", "covid19"], "summary": "Drive-thru sites allow people whose doctor deemed the test necessary to get evaluated and swabbed for COVID-19 in their vehicles.\nAt least two sites — Cone Health and Pardee UNC Health drive-thru at a local community college — have experienced supply shortages that quickly led to their closure.\nFor more information: UNC drive-thru clinic : UNC Health can only test UNC patients who have a doctor’s prescription.\nFor more information, contact UNC’s COVID-19 helpline, 888-850-2684.: UNC Health can only test UNC patients who have a doctor’s prescription.\nThe drive-thru site was initially opened daily since last Sunday but has changed its hours, according to spokeswoman Erica Allison, who said the drive-thru site is using different kits than the UNC Health testing sites."}, {"url": "https://apnews.com/9f45358a342a2f2f2806fcbe4c2f8846", "title": "North Carolina’s largest county issues stay-at-home order", "authors": ["Gary D. Robertson"], "date": "2020-03-24", "keywords": ["county", "carolinas", "shelterinplace", "carolina", "issues", "state", "cooper", "cases", "north", "health", "stayathome", "statewide", "order", "largest"], "summary": "The North Carolina capital, like many cities across the country, is virtually shut down in the face of the COVID-19 pandemic.\nThe North Carolina capital, like many cities across the country, is virtually shut down in the face of the COVID-19 pandemic.\nMecklenburg County Health Director Gibbie Harris said the county had more than 140 positive cases as of Tuesday afternoon.\nMore than 15 states have some kind of “stay-at-home” or “shelter-in-place” order.\nThe North Carolina Healthcare Association, representing the state’s hospitals, also penned a letter Monday asking Cooper to issue a statewide shelter-in-place order."}, {"url": "https://www.northcarolinahealthnews.org/2020/03/26/covid-19-icu-beds/", "title": "Will NC have enough ICU beds for COVID-19?", "authors": ["Rose Hoban", "Matt Case", "Jean Aycock", "Tom Linden", "Leon Franzen", "North Carolina Health News"], "date": "2020-03-26", "keywords": ["carolina", "icu", "state", "north", "health", "rural", "beds", "nc", "hospitals", "patients", "care", "covid19"], "summary": "By Rose HobanYesterday, state health officials announced the first deaths of North Carolina patients who had acquired the novel coronavirus, known as COVID-19.\nScaling back for the surgeWhen inquiring about the number of ICU beds North Carolina has, the answer often comes back that there is no one number.\nWhen first queried, Doug Allred, the communications director at the Cone Health, said there were 100 ICU beds across that system.\nA few minutes later, he emailed with an update that Cone could “flex” to 125 ICU beds.\nHolmes’ center published a report Wednesday looking at the number of rural ICU beds versus urban ICU beds which noted that while rural ICU beds have, on average, fewer patients in them, there are fewer of those beds overall."}, {"url": "https://www.northcarolinahealthnews.org/2020/03/18/coronavirus-today-march-18/", "title": "Coronavirus Today – March 18 – New risk group, scam warnings, telehealth expansion - North Carolina Health News", "authors": ["Nathan Pieratt", "Richard Andrews", "Editor", "North Carolina Health News"], "date": "2020-03-18", "keywords": ["state", "states", "coronavirus", "complaints", "telehealth", "north", "office", "emergency", "warnings", "today", "covid19", "stores", "risk", "health", "workers", "expansion", "food", "group", "scam"], "summary": "He also said his office handled 136 complaints of price gouging since the governor declared a state of emergency last week.\nGrocery stores will remain openThere are no plans to close grocery stores during the COVID-19 outbreak, Sprayberry said.\nThe state’s list of high COVID-19 risk groups also includes seniors and people with underlying health conditions.\nThe court in Charlotte, which covers both South and North Carolina, does not typically have hearings for detained cases.\nTelehealth flexibilityThe U.S. Department of Health and Human Services announced new flexibility for telehealth visits during the COVID-19 national emergency."}, {"url": "https://www.wfmynews2.com/article/news/health/coronavirus/5-north-carolina-ymca-sites-become-emergency-child-care-facilities/83-3987afa0-f727-473b-8f3b-754427058d32", "title": "Several North Carolina YMCA sites to become emergency child care facilities", "authors": ["Author", "Lea Wilson", "Published", "Pm Edt March", "Updated"], "date": "2020-03-22", "keywords": ["family", "facilities", "sites", "children", "carolina", "child", "need", "north", "serve", "workers", "day", "nc", "students", "staff", "ymca", "care", "emergency"], "summary": "GREENSBORO, N.C. — The YMCA of Northwest North Carolina will transition several of its branches into emergency child care sites, the company said on its website Sunday.\nThe sites will serve first-responders, health care workers, grocery store workers, pharmacy, and others.\nThe weekly rate is $100 per week for these sites, as well as William G. White, Jr. No registration fee will be charged.\nAll areas will be cleaned several times a day, including every time children enter and leave a space.\nHandwashing of all staff and children will take place many times throughout the day."}, {"url": "https://www.wraltechwire.com/2020/03/22/layoffs-costing-hundreds-of-people-their-jobs-in-nc/", "title": "Layoffs costing hundreds of people their jobs in NC but notices don’t capture true scope of cuts", "authors": [], "date": "2020-03-22", "keywords": ["hundreds", "filed", "workforce", "jobs", "notices", "state", "layoffs", "dont", "true", "notice", "warn", "costing", "workers", "nc", "job", "scope", "department", "cuts"], "summary": "But the official notices are – so far- only a small indicator of job cuts.\nOnly seven formal notices had been filed in recent days as the number of job cuts soared, according to the NC Department of Commerce which lists the filings.\nHowever, as of March 20 no WARN notice had been filed, according to the latest Department of Commerce update.\nSome 800 other job cuts were disclosed in other filings from across the state earlier in the month.\nRead more about WARN notices at this website."}, {"url": "https://www.wfmynews2.com/article/news/local/triad-group-stuck-in-peru-border-lockdown/83-e9e9ce9f-aafa-4e3a-b15a-e8dca9338dca", "title": "'They gave us 27 hours to get out' | Triad travelers stuck in Peru as country closes borders", "authors": ["Author", "Taheshah Moise", "Published", "Pm Edt March", "Updated"], "date": "2020-03-19", "keywords": ["state", "gave", "monesmith", "borders", "north", "hours", "department", "stuck", "peru", "27", "closes", "countries", "country", "americans", "smith", "peruvian", "triad", "travel", "travelers"], "summary": "GREENSBORO, N.C. — A group of Triad travelers are among the more than 1,500 Americans trapped in Peru after the border shut down unexpectedly.\nIt was supposed to be the trip of a lifetime to Peru for Greensboro resident Caroline Smith and her five travel buddies.\nThe State Department is not helping.\nThey are calling the State Department daily and getting the runaround,\" Monesmith said.\nA spokesperson said back this statement writing:Rep. Walker is aware of the Americans stuck in Peru and other overseas countries."}, {"url": "https://www.wbtv.com/2020/03/22/christmas-march-mcadenville-isnt-confused-this-is-love-time-covid-/", "title": "Christmas in March? McAdenville isn’t confused. This is love in the time of COVID-19.", "authors": ["Rebecca Jeffery", "Published At Am", "Published Am At Am"], "date": "2020-03-22", "keywords": ["mcadenville", "usa", "trees", "towns", "lights", "web", "isnt", "traditional", "turn", "confused", "love", "town", "til", "spectacular", "christmas", "covid19"], "summary": "North Carolina has officially cosigned, with “Christmas Town USA” joining the party.\nMcAdenville, known for its spectacular light displays, will turn on lights 7:30-11 p.m. nightly ‘til the end of the month.\nThe display will not be quite as impressive as its traditional December town lighting: the organizers posted on the town’s web site that about 65 percent of the town’s lights had already been removed from its trees."}, {"url": "https://www.wfmynews2.com/article/news/local/greensboro-restaurants-takeout-delivery-orders-closed-during-coronavirus-pandemic-food/83-a570141d-ab6a-49ad-8f7d-79b870edae35", "title": "List: Triad restaurants offering takeout, delivery, or both", "authors": ["Author", "Megan Allman", "Wfmy News Digital", "Carrie Hodgin", "Published", "Am Edt March", "Updated", "Pm Edt April"], "date": "2020-03-18", "keywords": ["restaurants", "delivery", "curbside", "triad", "takeout", "restaurant", "eats", "uber", "doordash", "offering", "grubhub", "list", "postmates"], "summary": "The Chamber of Commerce put together a list of restaurants that are doing takeout, delivery, or both.\nGREENSBORO RESTAURANTS OFFERING TAKEOUT, DELIVERY, OR BOTH:1618 Downtown: TakeoutAcropolis: Takeout and delivery via Grubhub and Takeout CentralB. Christopher's Steakhouse: TakeoutBad Daddy's Burger Bar: Takeout and delivery via DoorDashBaked Downtown: TakeoutBayside Seafood Family Restaurant: CarryoutBernie's Barbecue: TakeoutBill’s Pizza Pub: Takeout, curbside delivery upon requestBlackginger Sushi: Takeout and delivery via Uber Eats, Postmates, DoorDashBlaze Pizza: Takeout and delivery via Postmates and DoorDashBlue Denim: Takeout and deliveryBonchon: Delivery via DoorDash, Grubhub, Uber EatsBravo: Takeout and delivery via GrubhubCafe Pasta & Grille: Takeout, delivery, and Grubhub, Takeout Central, Doordash, and PostmatesCarrabba's: Takeout and deliveryCheesecakes by Alex: Takeout and delivery via DoorDashCherry Pit Café and Pie Shop: Takeout and delivery via Takeout Central, Grubhub, Uber Eats, Postmates, and DoorDashChez Genese: TakeoutCincy’s: GrubhubCoreLife Eatery: TakeoutCountry Kitchen Restaurant and Catering: Open normal hours for both pick-up and delivery.\nLos Chicos: TakeoutM’Couls: TakeoutMachete: TakeoutManny's Universal Café: Takeout and delivery via Grubhub, PostmatesMarco’s Pizza - Takeout and deliveryMcAlister's Deli - Takeout and on DoorDash, Uber Eats, Postmates, and GrubHub.\nMellow Mushroom: Delivery via Uber Eats, Takeout CentralMelt Kitchen and Bar: TakeoutMidori Japanese Hibachi: Takeout and delivery via GrubhubMJ's Restaurant and Catering: TakeoutMythos Grill (Battleground and West Market): Takeout, delivery and online ordering through ChowNowNatty Green's Pub: Takeout and delivery via ChowNowOutback Steakhouse: Takeout and DeliveryOlive Garden: Takeout and DeliveryPanera Bread: Deliver through Panera drivers and pick upPapa Murphy’s Pizza: Takeout and delivery via Grubhub and DoorDashPizzeria L’italiano: Takeout and delivery via GrubhubPoke Bowl: TakeoutPorterhouse Burger Company: Takeout and (delivery via Takeout Central at the Greensboro location)Rascals Tavern: Takeout and delivery via GrubhubRed Lobster on Wendover Ave: Takeout, delivery, and Grubhub, Uber Eats, Postmates, and DoorDashRed Robin: Takeout, deliveryRearn Thai Restaurant: Takeout, GrubhubRuth's Chris Steak House: TakeoutSage Mule: TakeoutSarah's Kabob Shop: TakeoutScrambled Southern Diner: Takeout and deliverySmith Street Diner: TakeoutSmohk'd: TakeoutTaste of Ethiopia: GrubHub, DoorDash, Postmates, and Uber EatsTGI Fridays: Takeout, Online Ordering, UberEats, DoorDash, GrubHubThe Social on Friendly: Takeout and delivery via DoorDash, ChowNowSteak 'n Shake Open 24 Hours: Drive-thru, takeout, online ordering, delivery via UberEats and DoorDash.\nKERNERSVILLE-Prissy Polly's BBQ: Takeout, curbside service, and delivery through Grubhub & DoorDash-WHOLLY GUACAMOLE: 6307 Burlington Road in Whitsett is offering curbside pick-up and delivery via DoorDash and Grubhub."}, {"url": "https://www.citizen-times.com/story/news/local/2020/03/18/asheville-coronavirus-liquor-sales-booming-store-hours/2868035001/", "title": "Coronavirus: Asheville Liquor sales booming, but stores will curtail hours", "authors": ["John Boyle", "Published P.M. Et March"], "date": "2020-03-18", "keywords": ["stores", "sales", "combs", "abc", "store", "hours", "liquor", "curtail", "asheville", "coronavirus", "booming", "watson", "employees", "close", "brockwell"], "summary": "CLOSEKelly Brockwell, left, store manager of the Arden ABC store, rings up customer Ronnie Waldrup on Wednesday, March 18.\nThe store, like others in the nine-store Asheville ABC system, has been seeing near-record sales in the wake of the coronavirus pandemic.\nShorter store hours comingThe Asheville stores are curtailing hours, though, starting Friday, March 20.\nThe Arden ABC store, like the other eight in the Asheville ABC system, has employees wiping down credit card machines after every transaction.\nIn Asheville, staff will still come in at 10 a.m., but they'll spend the first hour intensely cleaning the stores, Combs said."}, {"url": "https://www.wfmynews2.com/article/news/local/fred-curly-neal-of-the-harlem-globetrotters-dies-at-the-age-of-77-greensboro/83-4e882420-6029-4cd7-b2bb-79e66d0250bc", "title": "Greensboro’s own ‘Curly’ Neal of the Harlem Globetrotters dies at the age of 77", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Edt March", "Updated"], "date": "2020-03-26", "keywords": ["neal", "greensboros", "triad", "known", "77", "keyword", "dies", "text", "globetrotters", "age", "curly", "greensboro", "fred", "harlem"], "summary": "For years, Fred ‘Curly’ Neal has delighted basketball fans as one of the best magical dribblers and shooters in the history of basketball.\nCurly Neal – the Harlem Globetrotters icon passed away Thursday morning in his home outside of Houston at the age of 77.\nHe always made time for his many fans and inspired millions.”The Harlem Globetrotters tweeted: \"Fred “Curly” Neal – the Harlem Globetrotters icon known worldwide for his trademark shaved head and charismatic smile – passed away this morning in his home outside of Houston at the age of 77. \"\nDudley also paid their own respect to Neal by tweeting the following:\"RIP to Dudley Alum and basketball legend Fred “Curly” Neal.\nYou brought joy to so many people through the game we love #RIPCurly\"You can share your memories of watching Curly Neal by texting WFMY News 2 at 336-379-5775."}, {"url": "http://www.davidsonian.com/trump-expands-north-carolina-campaign-presence-for-2020/", "title": "Trump Expands North Carolina Campaign Presence for 2020", "authors": [], "date": "2020-03-24", "keywords": ["expands", "campaign", "2020", "presence", "carolina", "state", "north", "senate", "rural", "trump", "meadows", "republicans", "republican", "nc11"], "summary": "In the face of a heated election period this year, President Trump is dedicating special attention to his campaign in North Carolina.\nBlack Voices for Trump, a national coalition funded by Trump with chapters across North Carolina, reiterates such groups’ frustrations and looks to Trump for solutions.\nTrump is also increasing his presence and voter-appeal in North Carolina by hosting the Republican National Convention in Charlotte this August.\nSuch hotly contested races draw significant investment from presidential campaigns, indicating why Trump has chosen to center his energy around North Carolina.\nRoberts added, “North Carolina would just be a sweet prize […] because [it] is not a slam dunk on either side."}, {"url": "https://patch.com/north-carolina/greensboro/greensboro-temporarily-waives-yard-waste-fees-residents", "title": "Greensboro Temporarily Waives Yard Waste Fees For Residents", "authors": [], "date": "2020-03-31", "keywords": ["landfill", "way", "waste", "yard", "city", "fees", "right", "residents", "greensboro", "white", "street", "vans", "temporarily", "waives"], "summary": "Press release from the City of Greensboro:3/31/2020 - 5:57 PMThe City of Greensboro is temporarily waiving yard waste fees at the White Street Landfill for City of Greensboro residents in cars, vans, passenger vans, pickup trucks and non-dumping trailers.\nRegular yard waste fees of $40 per ton will continue to apply for dump trucks and dump trailers.\nFollow the black yard waste signs and turn right into the yard waste and compost area.\nThe City of Greensboro suspended all residential curbside yard waste collection on March 30 due to issues around COVID-19.\nResidents should not place yard waste at the curb during this suspension."}, {"url": "https://www.spokesman.com/stories/2020/mar/21/ap-was-there-david-thompson-wolfpack-end-uclas-lon/", "title": "AP Was There: David Thompson, Wolfpack end UCLA’s long run in ’74", "authors": [], "date": "2020-03-21", "keywords": ["bruins", "74", "ucla", "field", "uclas", "long", "ap", "state", "run", "game", "wolfpack", "david", "thompson", "nc", "end", "scored", "points", "lead"], "summary": "Monty Towe, the smallest player on the court at 5-foot-7, triggered N.C. State’s rally with two free throws that trimmed the UCLA lead to 74-69.\nThompson then took over the flow of the dramatic game with a field goal at 2:55 that brought N.C. State within four.\nThe dazzling forward penetrated UCLA for the go-ahead field goal that put the Wolfpack into a 76-75 lead with 53 seconds left.\nThompson, another All-American, had 28 points and 10 rebounds for State, which won its 29th game in 30 outings this year.\nBehind Thompson and Burleson, N.C. State fought back to tie the score at 53-53 with 4:34 remaining in regulation time."}, {"url": "https://theacc.com/news/2020/3/19/five-from-acc-womens-basketball-named-associated-press-all-americans.aspx", "title": "Five from ACC Women’s Basketball Named Associated Press All-Americans", "authors": [], "date": "2020-03-19", "keywords": ["associated", "rebounds", "field", "3point", "20", "games", "basketball", "womens", "press", "team", "acc", "percentage", "named", "allamericans", "points"], "summary": "Women's Basketball March 19, 2020 Five from ACC Women’s Basketball Named Associated Press All-AmericansGREENSBORO, N.C. (theACC.com) - Five Atlantic Coast Conference Women’s Basketball student-athletes have been named to the Associated Press All-America Teams, announced on Thursday.\nEvans was tabbed ACC Player of the Year after leading the league in 3-point field goals (90), 3-point field goals made per game (3.0), 3-point field goal percentage (43.1%) and free throw percentage (89.0%).\nHer 90 3-point field goals ranked 12th in the country and eighth all-time in Louisville program history.\nCunane becomes the first NC State women's basketball player to earn a spot on one of the three AP All-American teams after six honorable mention recognitions in program history.\nMompremier eclipsed the 1,000 rebound mark this season, becoming the 13th active NCAA Division I women's basketball player to reach 1,000 points and 1,000 rebounds in her career."}, {"url": "https://theacc.com/news/2020/3/23/womens-basketball-acc-places-four-on-usbwa-all-america-teams.aspx", "title": "ACC Places Four on USBWA All-America Teams", "authors": [], "date": "2020-03-23", "keywords": ["rebounds", "field", "usbwa", "3point", "games", "20", "second", "guard", "teams", "places", "allamerica", "acc", "percentage", "team", "points"], "summary": "Women's Basketball March 23, 2020 ACC Places Four on USBWA All-America TeamsGREENSBORO, N.C. (theACC.com) - Four Atlantic Coast Conference Women’s Basketball student-athletes have been tabbed to the United States Basketball Writers Association (USBWA) All-America Teams, announced Monday by the organization.\nLouisville junior guard Dana Evans earned second team accolades, while NC State sophomore center Elissa Cunane and Duke graduate guard Haley Gorecki were named to the third team.\nEvans was tabbed ACC Player of the Year after leading the league in 3-point field goals (90), 3-point field goals made per game (3.0), 3-point field goal percentage (43.1%) and free throw percentage (89.0%).\nHer 90 3-point field goals ranked 12th in the country and eighth all-time in Louisville program history.\nThe junior from Gary, Indiana, had 10 games with 20 or more points, which was tied for fourth in the league."}, {"url": "https://www.wfmynews2.com/article/entertainment/things-to-do-in-greensboro-march-2020-ncaa-tournament-greensboro-coliseum-folk-festival/83-f9369186-187c-4e03-bdb0-3b841019301e", "title": "Things to do in Greensboro March 2020", "authors": ["Author", "Chris Venzon", "Wfmy", "Published", "Pm Est February", "Updated"], "date": "2020-02-27", "keywords": ["park", "weekend", "mens", "things", "2020", "center", "basketball", "tanger", "music", "live", "greensboro", "tournament"], "summary": "GREENSBORO, N.C. — The Greensboro Coliseum Complex, LeBauer Park and the Steven Tanger Center for the Performing Arts are all capable of featuring world-class entertainment acts on any given weekend.\nRELATED: NCAA Men's Basketball Tournament Returning To Greensboro In 2020At the time, Governor Roy Cooper remarked on the financial boost the tournament offers for cities hosting the tournament.\nFolk in the Park will feature free live music, as well as food, dancing and family activities at LeBauer Park in downtown Greensboro.\nThe Greensboro Coliseum also will hosts live music on the 21st, with country music singer Cody Johnson visiting.\nOn Sunday the 22nd, Jay Leno rolls into the Tanger Center at 7:00 p.m. as a part of his national comedy tour."}, {"url": "https://hbr.org/2020/03/what-your-coworkers-need-right-now-is-compassion", "title": "What Your Coworkers Need Right Now Is Compassion", "authors": [], "date": "2020-03-30", "keywords": ["youre", "going", "things", "dont", "right", "worline", "stress", "coworkers", "im", "work", "need", "compassion"], "summary": "When you’re under extreme stress, it’s not always easy to be patient and understanding with your coworkers.\nAnd remember that your coworkers are likely suffering in ways that you don’t see or necessarily understand.\n“When we are in a crisis, we change the way we interpret things going around us.\nFor example, Caza suggests you explain to your coworkers that you might need some space, especially if things are moving fast.\nBut I’m going to keep trying because it’s what my coworkers and I deserve."}, {"url": "https://www.the-dispatch.com/photogallery/NC/20200311/PHOTOGALLERY/311009970/PH/1", "title": "Photos: PHOTOS: ACC Tournament: Syracuse 81, North Carolina 53", "authors": [], "date": "2020-03-11", "keywords": ["delivery", "choose", "digital", "carolina", "print", "syracuse", "north", "plan", "81", "right", "acc", "53", "access", "tournament", "thats", "photos"], "summary": "Choose the plan that’s right for you.\nDigital access or digital and print delivery."}, {"url": "http://goldsborodailynews.com/blog/2020/03/10/n-c-officials-5-more-coronavirus-cases-for-7-total-statewide/", "title": "N.C. Officials: 5 More Coronavirus Cases For 7 Total Statewide", "authors": ["Ken Conners"], "date": "2020-03-10", "keywords": ["county", "unrelated", "officials", "cases", "conference", "carolina", "north", "health", "statewide", "nc", "coronavirus", "department", "total", "wake"], "summary": "RALEIGH, N.C. (AP) — North Carolina health officials say five more people have tested positive for the new coronavirus, bringing the total number of cases to seven statewide.\nThe N.C. Department of Health and Human Services says all five new patients are from Wake County and each traveled to Boston in late February to attend a conference.\nThe department said in a statement Monday that several cases of COVID-19 across the country have been linked to the conference.\nNorth Carolina reported two earlier, unrelated cases: one in Wake County and another in Chatham County.\nThis material may not be published, broadcast, rewritten or redistributed."}, {"url": "https://www.kinston.com/sports/20200311/acc-tournament-to-continue-without-fans-over-coronavirus-concerns", "title": "ACC tournament to continue without fans over coronavirus concerns", "authors": ["Eric", "Boynton Staff Writer"], "date": "2020-03-11", "keywords": ["fans", "concerns", "ncaa", "continue", "state", "limited", "coronavirus", "acc", "played", "greensboro", "tournament", "statement", "covid19"], "summary": "GREENSBORO, N.C. – The Atlantic Coast Conference announced just after halftime of Wednesday’s third game between Notre Dame and Boston College the ACC tournament will proceed without fans in the Greensboro Coliseum beginning with Thursday’s quarterfinals.\n\"In light of the rapidly changing landscape regarding COVID-19, the latest developments nationally from health authorities and today’s announcement by the NCAA COVID-19 Advisory Panel, the ACC will alter the remainder of the ACC Tournament,\" a league statement said.\nWe will move forward and conduct championships consistent with the current information and will continue to monitor and make adjustments as needed.\"\n8 Clemson opens Thursday play at 12:30 against top-seeded Florida State followed at 2:30 p.m. by No.\nThe evening session match-ups have yet to be determined at this time."}, {"url": "https://www.jdnews.com/photogallery/NC/20200311/PHOTOGALLERY/311009979/PH/1", "title": "Photos: PHOTOS: ACC Tournament: NC State 73, Pittsburgh 58", "authors": [], "date": "2020-03-11", "keywords": ["delivery", "choose", "pittsburgh", "73", "58", "digital", "state", "print", "plan", "right", "nc", "acc", "access", "tournament", "thats", "photos"], "summary": "Choose the plan that’s right for you.\nDigital access or digital and print delivery."}, {"url": "https://www.wfmynews2.com/article/news/local/watch-live-nc-super-tuesday-results/83-3d1a3065-e913-4700-a513-453ee74abaff", "title": "Watch Live: NC Super Tuesday Results", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est March", "Updated", "Am Est March"], "date": "2020-03-04", "keywords": ["text", "page", "wfmy", "watch", "nc", "election", "results", "live", "word", "facebook", "super", "download", "app"], "summary": "Watch WFMY News 2!\nText keyword RESULTS to 336-379-5775 to get election results throughout the night.\nWFMY News 2HOW TO WATCH COVERAGEStay on top of election results on social media and real-time coverage.\nFacebook page - turn to the WFMY News 2 News Facebook page from 8:00 p.m. - 11:30 p.m.4.\nWatch WFMY News 2 at 11."}, {"url": "https://www.the-dispatch.com/photogallery/NC/20200311/NEWS/311009994/PH/1", "title": "Photos: PHOTOS: ACC Tournament Day 1 wrap-up", "authors": [], "date": "2020-03-11", "keywords": ["delivery", "choose", "digital", "print", "plan", "day", "right", "photos", "acc", "access", "tournament", "thats", "wrapup"], "summary": "Choose the plan that’s right for you.\nDigital access or digital and print delivery."}, {"url": "https://myfox8.com/news/2-shot-in-greensboro-being-treated-at-hospital-police-say/", "title": "2 shot in Greensboro, being treated at hospital, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-03-14", "keywords": ["victims", "hospital", "told", "shot", "videogreensboro", "taken", "treated", "watch", "say", "woundsboth", "greensboro"], "summary": "2 shot in Greensboro, being treated at hospital, police sayPlease enable Javascript to watch this videoGREENSBORO, N.C. -- Two people were shot in Greensboro Saturday, according to a Greensboro Police Department news release.\nAt 12:16 p.m., officers responded to 4405 Baker Avenue when they were told about a gun being fired.\nWhen they arrived, they found two victims with gunshot wounds.\nBoth victims were taken to a local hospital where they were treated, police say.\nThe investigation in ongoing."}, {"url": "https://www.wfmynews2.com/article/news/local/coronavirus-real-time-updates-nc/83-cc19d19e-f6ba-4a00-af90-45451156ea96", "title": "BLOG | NC coronavirus updates", "authors": ["Author", "Wfmy News Digital Team", "Published", "Am Edt March", "Updated"], "date": "2020-03-15", "keywords": ["county", "public", "carolina", "state", "conference", "blog", "north", "health", "updates", "nc", "coronavirus", "greensboro", "school"], "summary": "RELATED: 9 of your coronavirus questions, answeredCORONAVIRUS BLOGTUESDAY, MARCH 179:50 p.m. - List of school districts with coronavirus hotlinesRELATED: LIST | School districts release coronavirus hotlines for parents and students8:15 p.m. - Coronavirus cases in all 50 states.\nRight now, there are 41 cases of coronavirus in the state, that's according to NCDHHS and the Guilford County Public Health Department.\n11:00 a.m. - Guilford County Division of Public Health announces it received a confirmation of a positive coronavirus case in Guilford County.\n5:10 p.m. - The North Carolina Coronavirus Hotline has received 6,273 calls since it opened.\nNC CORONAVIRUS HOTLINEThe state also has a special hotline set up where you can call 866-462-3821 for more information on the coronavirus."}, {"url": "https://patch.com/north-carolina/charlotte/smithsonian-museum-day-2020-participating-north-carolina-museums", "title": "Smithsonian Museum Day 2020: Participating North Carolina Museums", "authors": [], "date": "2020-03-05", "keywords": ["smithsonian", "2020", "museum", "carolina", "fayetteville", "north", "participating", "day", "hours", "museums", "nc", "wilmington", "430", "charlotte"], "summary": "NORTH CAROLINA — April 4 is Museum Day, a nationwide initiative when participating museums in North Carolina and across the United States allow visitors to experience offerings for free.\nMore than 1,200 museums in all 50 states — including 20 in North Carolina — are expected to take part in this year's Museum Day.\nThose wishing to visit a local museum that day should go to Smithsonian Magazine's website, locate a museum and download a ticket.\nBlowing Rock Art & History Museum , Blowing Rock, N.C., Hours: 10 a.m. - 5 p.m., Blowing Rock, N.C., Hours: 10 a.m. - 5 p.m. Cape Fear Museum , Wilmington, N.C., Hours: 9 a.m. - 5 p.m., Wilmington, N.C., Hours: 9 a.m. - 5 p.m. Fascinate-U Children's Museum , Fayetteville, N.C., Hours: 10 a.m. - 5 p.m., Fayetteville, N.C., Hours: 10 a.m. - 5 p.m. Frisco Native American Museum & Natural History Center , Frisco, N.C., Hours: 10:30 a.m. - 5 p.m., Frisco, N.C., Hours: 10:30 a.m. - 5 p.m. High Point Museum, High Point , N.C., Hours: 10 a.m. - 4:30 p.m., N.C., Hours: 10 a.m. - 4:30 p.m.\nThe Country Doctor Museum , Bailey, N.C., Hours: 10 a.m. - 4 p.m., Bailey, N.C., Hours: 10 a.m. - 4 p.m. Tobacco Farm Life Museum , Kenly, N.C., Hours: 9:30 a.m. - 5 p.m., Kenly, N.C., Hours: 9:30 a.m. - 5 p.m. UNC Charlotte Botanical Gardens , Charlotte, N.C., Hours: 9 a.m. - 4 p.m., Charlotte, N.C., Hours: 9 a.m. - 4 p.m. Wilmington Railroad Museum, Wilmington, N.C., Hours: 10 a.m. - 5 p.m."}, {"url": "https://myfox8.com/news/nc-central-university-football-player-shot-killed/", "title": "NC Central University football player shot, killed", "authors": ["Nexstar Media Wire"], "date": "2020-03-03", "keywords": ["school", "vandyke", "trevor", "scene", "shot", "morning", "player", "nc", "killed", "central", "shooting", "2019", "university", "played", "durham", "football"], "summary": "DURHAM, N.C. (WNCN) — A shooting Monday night in Durham left a North Carolina Central University student dead, according to school officials.\nPolice arrived at the scene and found that a man had been shot and killed.\nAccording to a note sent from the university to its students, the man has been identified as Trevor VanDyke, a sophomore at the school.\nOur 💙are broken this morning in #CometCountry as we learn of the tragic passing of Trevor VanDyke.\nThe football roster lists VanDyke as a cornerback for the 2019 season and he is also featured on the Eagles’ 2020 preseason roster."}, {"url": "https://www.jdnews.com/photogallery/NC/20200311/PHOTOGALLERY/311009975/PH/1", "title": "Photos: PHOTOS: ACC Tournament: Notre Dame 80, Boston College 58", "authors": [], "date": "2020-03-11", "keywords": ["delivery", "choose", "58", "boston", "digital", "print", "dame", "80", "college", "plan", "right", "acc", "notre", "access", "tournament", "thats", "photos"], "summary": "Choose the plan that’s right for you.\nDigital access or digital and print delivery."}, {"url": "https://myfox8.com/news/coronavirus/nc-sees-covid-19-cases-increase-to-at-least-23/", "title": "NC sees COVID-19 cases increase to at least 24", "authors": ["Nexstar Media Wire", "Digital Desk"], "date": "2020-03-14", "keywords": ["increase", "cases", "carolina", "state", "north", "sees", "health", "watch", "24", "declares", "nc", "trump", "tests", "reported", "covid19"], "summary": "Please enable Javascript to watch this videoRALEIGH, N.C. (WNCN) – There are at least 24 cases of COVID-19 in North Carolina, health officials said early Saturday.\nThat marks an increase of nine cases reported by the North Carolina Department of Health and Human Services since Friday.\nThe increase in North Carolina comes a day after President Donald Trump declared the outbreak a national emergency.\nThe N.C. State Laboratory of Public Health has completed 101 tests and currently has the capability to conduct 680 more.\nRoy Cooper declares State of EmergencyMarch 11: World Health Organization declares COVID-19 a pandemicMarch 13: President Trump declares National EmergencyPlease enable Javascript to watch this video"}, {"url": "https://myfox8.com/news/person-shot-near-dudley-high-school-identified-as-teen/", "title": "Person shot near Dudley High School identified as teen", "authors": ["Digital Desk", "Daniel Pierce", "Nexstar Media Wire"], "date": "2020-03-05", "keywords": ["teen", "shot", "dudley", "person", "videoplease", "watch", "high", "victim", "javascript", "students", "shooting", "school", "identified", "enable", "near"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — A person shot near Dudley High School on Thursday has been identified as a teen, according to Greensboro police.\nPolice say the shooting happened at about 8:54 a.m. at 1100 Willow Road and that there was no shooting on school grounds.\nAfter the shooting, the victim was taken onto Dudley High School property and later taken to a hospital.\n“I thought it was a drill at first,” Dudley High School teacher Christopher Owens said.\nPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this video"}, {"url": "https://myfox8.com/news/coronavirus/coronavirus-case-in-wake-county-is-isolated-incident-health-official-says/", "title": "Coronavirus case in North Carolina is isolated incident, health official says", "authors": ["Nexstar Media Wire", "Digital Desk"], "date": "2020-03-04", "keywords": ["county", "case", "carolina", "patient", "officials", "state", "north", "health", "official", "tested", "isolated", "coronavirus", "kippes", "public", "incident", "covid19", "wake"], "summary": "RALEIGH, N.C. (WNCN) – Wake County health officials said the case of coronavirus in the state is considered to be an isolated incident and the risk to the public remains low.\nChris Kippes, Wake County Public Health Division director, said there is no reason to cancel events due to yesterday’s announcement of a man testing presumptively positive for COVID-19.\nRoy Cooper announced a Wake County man tested positive for the virus after returning from Washington state on Feb. 22.\nSome of those who have been contacted are outside of Wake County.\nThe COVID-19 patient is at his home in isolation and will remain there until he has tested negative for the virus."}, {"url": "https://myfox8.com/news/7-family-members-killed-in-north-carolina-shooting-sheriffs-office-says/", "title": "7 family members killed in North Carolina shooting, sheriff’s office says", "authors": ["Nexstar Media Wire"], "date": "2020-03-16", "keywords": ["ray", "victims", "family", "moncure", "suspected", "carolina", "scene", "terrible", "north", "sanderford", "seven", "office", "members", "killed", "shooting", "sheriffs"], "summary": "MONCURE, N.C. (WNCN) – Seven people are dead following a shooting Sunday in Moncure, the Chatham County Sheriffs Office said.\nDeputies first responded to a “shots fired” call off of Moncure Flatwood Road shortly after 5:30 p.m. on Sunday.\nOnce on scene, it became apparent that the shooting extended to more than one residence.\nThe suspected shooter and victims were all members of the same family, the sheriff’s office said.\n“To lose any family member is devastating, but to lose several at once to unexpected violence is unimaginable."}, {"url": "https://myfox8.com/community/greensboro-pitch-competition-draws-entrepreneurs-from-across-north-carolina/", "title": "Greensboro pitch competition draws entrepreneurs from across North Carolina", "authors": ["Allison Smith", "Digital Desk", "Chad Tucker"], "date": "2020-03-05", "keywords": ["pitch", "times", "minutes", "triad", "carolina", "draws", "competition", "north", "arnoldarnold", "practiced", "really", "capital", "entrepreneurs", "greensboro"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — The competition was tough and lightning-fast Wednesday night as entrepreneurs had as little as two minutes to pitch to investors.\nCompetitors from across the state spent the evening in Greensboro hoping to grow their businesses with some financial backing.\nI've been running my presentation, it's only two minutes, but because it's only two minutes you got to really nail it.\nLaunch Greensboro brought back their annual pitch competition, also known as Capital Connects.\nArnold won the six-minute pitch competition and walked away with the $7,500 prize."}, {"url": "https://www.wfmynews2.com/article/news/politics/elections/nc-district-6-race-election-results-candidates-congress/83-c2fb2c8b-690c-490e-9985-6d708440e933", "title": "Race for the Triad: Manning, Haywood win 6th District primaries", "authors": ["Author", "Megan Allman", "Wfmy News Digital", "Published", "Pm Est March", "Updated"], "date": "2020-03-03", "keywords": ["county", "district", "triad", "guilford", "wfmy", "page", "primaries", "watch", "manning", "haywood", "win", "election", "nc", "results", "race", "6th"], "summary": "GUILFORD COUNTY, N.C. — The race for the Triad is on.\nRELATED: Text RESULTS to get real-time NC Primary Election results to your phone!\nWatch WFMY News 2!\nWatch WFMY News 2 at 11.\nRELATED: Guilford County voters using paper ballots for the first time in years"}, {"url": "https://www.pgatour.com/news/2020/04/16/pga-tour-schedule-adjustments-2019-2020-fedexcup-season-2020-2021-regular-season-coronavirus.html", "title": "PGA TOUR announces schedule adjustments for remainder of 2019-20 FedExCup season, releases fall portion of 2020-21 PGA TOUR Regular Season schedule", "authors": [], "date": "2020-04-16", "keywords": ["tour", "portion", "championship", "scheduled", "events", "club", "fedexcup", "open", "season", "schedule", "remainder", "releases", "fall", "regular", "golf", "originally", "pga"], "summary": "With additional time needed to ensure PGA TOUR tournaments are staged in the most safe and responsible manner possible given the ongoing COVID-19 crisis, the PGA TOUR is announcing further schedule modifications for the remainder of the 2019-20 season, as well as plans for the opening portion of the 2020-21 PGA TOUR Regular Season, the restart of the 2020 Korn Ferry Tour season and updates regarding the Mackenzie Tour – PGA TOUR Canada schedule.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\nAs such, the TOUR will continually review available COVID-19-related protocols that could be implemented at PGA TOUR events to ensure the health and well-being for all involved.\nMackenzie Tour – PGA TOUR CanadaThe Mackenzie Tour – PGA TOUR Canada is postponing the first six scheduled events of its 2020 season.\nPGA TOUR Champions, PGA TOUR Latinoamérica and PGA TOUR Series-ChinaInformation regarding PGA TOUR Champions and the PGA TOUR’s other two International Tours, in Latin America and China, will be announced in the coming weeks."}, {"url": "https://upnewsinfo.com/2020/04/16/revised-pga-tour-schedule-for-the-2019-20-season-and-early-2020-21-golf-news/", "title": "Revised PGA Tour schedule for the 2019-20 season and early 2020-21", "authors": ["Sky Sports Golf", "Please Enter Your Name Here"], "date": "2020-04-16", "keywords": ["tour", "tpc", "championship", "country", "early", "201920", "club", "resort", "open", "202021", "season", "schedule", "classic", "golf", "revised", "tournament", "pga"], "summary": "A look at the revised dates, venues and tournament schedule for the 2019-2020 PGA Tour season and the first part of the 2020-21 campaign.\nJuly 23-26 – 3M Open, TPC Twin Cities, Blaine, MinnesotaJuly 30 to August 2 – WGC-FedEx St. Jude Invitational – TPC Southwind, Memphis, TennesseeJuly 30 to August 2 – Barracuda Championship – Tahoe Mountain Club (Old Greenwood), Truckee, CaliforniaPGA Tour confirms return in June The PGA Tour announced that they plan to resume from June 11-14, with the first four events behind closed doors.\nAugust 6-9 – PGA Championship – TPC Harding Park, San Francisco, CaliforniaAugust 13-16 – Wyndham Championship – Sedgefield Country Club, Greensboro, North CarolinaAugust 20-23 – The Northern Trust – TPC Boston, Norton, MassachusettsAugust 27-30 – BMW Championship – Olympia Fields Country Club (North), Olympia Fields, IllinoisSeptember 4-7 – Tour Championship – East Lake Golf Club, Atlanta, GeorgiaThe Tour Championship, where McIlroy is the defending champion, will end on a Monday to coincide with Labor Day.\nEarly 2020-2021 season scheduleSeptember 10-13 – Safeway Open – Silverado Resort and Spa North, Napa, CaliforniaSeptember 17-20 – United States Open, Winged Foot Golf Club, Mamaroneck, New YorkSeptember 25-27 – Ryder Cup, Whistling Straits, Kohler, WisconsinSeptember 24-27 – Corales Puntacana Resort & Club Championship – Corales Golf Club, Punta Cana, Dominican RepublicOctober 1-4 – Sanderson Farms Championship – Country Club of Jackson, Jackson, MississippiThe complexities of the return of golf.\nPaul McGinley looks at the challenges facing professional golf courses in the coming months."}, {"url": "https://www.dallasnews.com/sports/golf/2020/04/16/pga-tour-will-return-to-action-in-june-with-fort-worths-charles-schwab-challenge-at-colonial-but-no-fans-are-allowed/", "title": "PGA Tour will return to action in June with Fort Worth’s Charles Schwab Challenge at Colonial. But no fans are allowed.", "authors": ["Scott Bell", "Brad Townsend", "Mark Kazlowski", "Dom Difurio", "Tom Steele", "Loyd Brumfield", "Steve Brown", "Catherine Marfin", "John Hancock"], "date": "2020-04-16", "keywords": ["fans", "tour", "challenge", "tpc", "championship", "scheduled", "worths", "club", "colonial", "open", "schedule", "fort", "golf", "originally", "schwab", "charles", "pga", "return"], "summary": "The PGA Tour is returning to action in June.\nAll eyes will be on the D-FW Metroplex as the return happens at Fort Worth’s Colonial Country Club.\nThe Charles Schwab Challenge in Fort Worth, originally scheduled to take place May 18-24, will be the first tournament on the shortened schedule.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\n1 priority, and our hope is to play a role – responsibly – in the world’s return to enjoying the things we love,” said PGA Tour commissioner Jay Monahan."}, {"url": "https://www.sportsvideo.org/2020/04/16/pga-tour-lays-out-new-schedule-hoping-to-tee-off-on-june-8/", "title": "PGA TOUR Lays Out New Schedule, Hoping to Tee off on June 8", "authors": ["Ken Kerschbaumer", "Editorial Director"], "date": "2020-04-16", "keywords": ["lays", "tour", "championship", "scheduled", "events", "club", "open", "schedule", "tee", "golf", "originally", "pga", "hoping"], "summary": "PGA TOUR Lays Out New Schedule, Hoping to Tee off on June 8Story HighlightsWith additional time needed to ensure PGA TOUR tournaments are staged in the most safe and responsible manner possible given the ongoing COVID-19 crisis, the PGA TOUR is announcing further schedule modifications for the remainder of the 2019-20 season.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\n1 priority, and our hope is to play a role – responsibly – in the world’s return to enjoying the things we love,” says PGA TOUR Commissioner Jay Monahan.\nAs such, the TOUR will continually review available COVID-19-related protocols that could be implemented at PGA TOUR events to ensure the health and well-being for all involved.\nMackenzie Tour – PGA TOUR CanadaThe Mackenzie Tour – PGA TOUR Canada is postponing the first six scheduled event"}, {"url": "https://www.ourquadcities.com/john-deere-classic/its-on-john-deere-classic-stays-put-in-revised-pga-tour-schedule/", "title": "It’s on: John Deere Classic stays put in revised PGA Tour schedule", "authors": ["Owen Hoke", "Jay Kidwell"], "date": "2020-04-16", "keywords": ["deere", "stays", "tour", "tpc", "john", "championship", "country", "club", "open", "week", "season", "schedule", "classic", "golf", "revised", "pga"], "summary": "The John Deere Classic is part of an ambitious revised schedule the PGA Tour laid out Thursday.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\n1 priority, and our hope is to play a role – responsibly – in the world’s return to enjoying the things we love,” said PGA Tour Commissioner Jay Monahan in a news release announcing the changes.\nThe PGA Tour season would conclude with the Tour Championship on Labor Day, and a new season would start the following week (Sept. 10-13) in Napa, California.\nThat would mean only one major — the PGA Championship — is held in this 2019-20 season, and as many as seven majors would apply to the following season."}, {"url": "https://gopsusports.com/news/2020/4/8/mens-golf-2019-20-season-in-review.aspx", "title": "Men's Golf 2019-20 Season in Review", "authors": [], "date": "2020-04-08", "keywords": ["mens", "invitational", "seniors", "state", "201920", "lions", "5th", "season", "schedule", "review", "golf", "team", "tournament", "nittany"], "summary": "The Penn State men’s golf team posted six top-five finishes in its abbreviated 2019-20 season, with impressive outings against at the Florida Gators Invitational (t-3rd), Rod Myers Invitational (t-4th), Old Town Club Collegiate (5th), Bearcat Invitational (5th) and UNCG/Grandover Collegiate (5th).\nIn addition to tournament play, the Nittany Lions advanced to the final of the Big Ten Match Play Championship.The Nittany Lions showed promise after coming off a challenging fall schedule and early spring events where they kept themselves in the hunt for postseason play.\nDue to the coronavirus pandemic, the remainder of the Nittany Lions’ schedule was cancelled on March 12.\n“We had just finished three-straight winter events that moved our ranking upward and inside the number to qualify for the NCAA Regionals.\nOther than seniors Alec Bard and Ryan Davis, however, nine of the 11 Nittany Lions had never started in a tournament at the outset of the 2019-20 season."}, {"url": "https://www.rhinotimes.com/news/greensboro-to-issue-stay-at-home-order-this-afternoon/", "title": "Greensboro To Issue Stay At Home Order This Afternoon", "authors": ["John Hammer"], "date": "2020-03-25", "keywords": ["terry", "businesses", "city", "afternoon", "spread", "community", "healthcare", "press", "greensboro", "order", "issue", "stay"], "summary": "The City of Greensboro is planning to issue a stay at home order at a press conference at 4 p.m. Wednesday, March 25.\nWhen that order will go into effect has not yet been announced.\nCharlotte issued a stay at home order on Tuesday, March 24.\nThe complete list of essential businesses that will not be closed by the stay at home order is expected to be extensive and cover a broad range of businesses.\nThe details of what the stay at home order in Greensboro will include will be made public at a 4 p.m. press conference."}, {"url": "https://www.rhinotimes.com/news/big-marijuana-bust-in-northwest-greensboro/", "title": "Big Marijuana Bust in Northwest Greensboro", "authors": ["Scott D. Yost"], "date": "2020-03-19", "keywords": ["seized", "sheriffs", "vice", "stolen", "pounds", "road", "bust", "unit", "marijuana", "northwest", "greensboro", "department", "big", "narcotics"], "summary": "The drug bust occurred when the department’s Vice and Narcotics Unit exercised a search warrant at 2205 New Garden Road in northwest Greensboro where suspected drug activity was taking place.\nThe address is in northwest Greensboro between Battleground Road and Old Battleground Road, near the Walmart supercenter.\nThe bust comes after a productive year for the Vice and Narcotics Unit of the Sheriff’s Department.\nThe Vice and Narcotics Unit isn’t the only unit in the Sheriff’s Department that confiscated drugs last year.\nThe department’s Specialized Enforcement Unit seized 1,578 pounds of marijuana and 63 pounds of other THC products."}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/news/2019/10/10/amber-alert-for-3-year-old-in-greensboro", "title": "Suspect in Amber Alert Case in Custody, From Raleigh", "authors": ["Published Pm Et Oct."], "date": "2019-10-10", "keywords": ["custody", "avenue", "amber", "degree", "case", "alert", "lancaster", "phillips", "issued", "suspect", "greensboro", "safe", "raleigh"], "summary": "GREENSBORO N.C. – An Amber Alert has been suspended for a 3-year-old girl after she was found safe the night of October 10.\nAn Amber Alert was issued for Ahlora Ashanti-Sample Lindiment.\nPolice issued the Amber Alert after she was reportedly abducted in the area of 2411 Phillips Avenue in Greensboro around 6:30 p.m. on October 9.\nThe female suspect is still missing and has not been identified.\nPolice also believe the suspect went to the park on Phillips Avenue with the intention to abduct a child."}, {"url": "https://www.wfmynews2.com/article/entertainment/events/5-things-to-do-in-the-triad-this-weekend/83-f75b8277-e631-4cdf-aac7-53ba117e6ca3", "title": "5 Things To Do In The Triad This Weekend: Oct. 18-20", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated"], "date": "2019-10-18", "keywords": ["albums", "weekend", "triad", "things", "rock", "united", "states", "selling", "1820", "songs", "vallín", "latin", "singles", "oct", "sergio"], "summary": "Having formed in Guadalajara, Mexico in 1986, the quartet of Fher Olvera, Alex González, Sergio Vallín and Juan Calleros have gone on to be global envoys for the Latin Rock genre, while selling over 40 million albums.\nHere in the United States, Maná holds an impressive nine #1 albums and ten #1 singles -more than any other band in the history of Billboard's \"Hot Latin Songs\" chart."}, {"url": "https://myfox8.com/news/2-hurt-in-possible-drive-by-shooting-in-greensboro/", "title": "2 hurt in possible drive-by shooting in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-26", "keywords": ["wounds", "possible", "streetofficers", "taken", "videogreensboro", "watch", "hurt", "shooting", "suspect", "greensboro", "stable", "reported", "driveby", "released36072635"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Two people were injured in a shooting in Greensboro on Friday night.\nThe shooting was reported at 8:37 p.m. from the 2000 block of Byrd Street.\nOfficers came to the area and found two people with gunshot wounds.\nThey were taken to the hospital by EMS and are in stable condition.\nPolice believe the shooting may have been a drive-by."}, {"url": "https://www.wfmynews2.com/article/news/local/halloween-events-piedmont-triad-greensboro-winston-salem-high-point-burlington-lexington/83-d2627ca4-0546-49c0-b7ad-1986d65ba43d", "title": "Spooky Fun! Where To Trick-or-Treat And Other Halloween Haunted Happenings In The Triad", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Edt October", "Updated"], "date": "2019-10-04", "keywords": ["spooky", "triad", "books", "29", "fun", "library", "haunted", "rhymes", "storytime", "happenings", "short", "costume", "trickortreat", "halloween"], "summary": "Halloween Costume Shop at Central Library: October 19, 10 am to 12 noonHalloween is less than two weeks away!\nHalloween Fun Storytime at Hemphill Library: October 31, 10-11 amJoin us for a toddler and preschool storytime with books, rhymes, and a fun art activity.\nWhen: Tuesday, October 8 at 6:00 p.m.Find out more: Spooky Cruise’NBURLINGTONDark in the ParkWhat: Dive into Halloween fun at Dark in the Park in Burlington!\nThe event includes amusement rides, Halloween costume contests, carnival games, and a lot more spooky fun!\nWhen: Saturday, October 26 from 5:00 p.m. – 9:00 p.m.Find out more: Dark in the ParkDowntown SpooktacularWhat: Includes trick-or-treating fun plus a Halloween costume parade!"}, {"url": "https://www.wfmynews2.com/article/entertainment/events/5-things-to-do-weekend/83-a9423403-fe9f-4c8c-8d2c-e0629a7d2cb3", "title": "5 Things To Do In The Triad This Weekend: Oct. 12-13", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated", "Am Edt October"], "date": "2019-10-10", "keywords": ["weekend", "site", "triad", "things", "university", "cookies", "parking", "refer", "forest", "1213", "coliseum", "greensboro", "oct", "wake"], "summary": "The Greensboro Invitational, the 25 th stop on the premier PBR Unleash The Beast, will buck into the Greensboro Coliseum for two days of edge-of-your-seat action on October 12-13.\nWhat: FairWhen: Oct. 4-13Where: Winston-Salem FairgroundsTime: Refer to websiteGeneral Info Parking is available at the LJVM Coliseum lot and BB&T Field parking lots owned and operated by Wake Forest University.\nWhat: Jazz MusicWhen: Oct. 12Where: O.Henry HotelTime: 7 p.m.Happenings at O.Henry Hotel in Greensboro, NC Sign Up Awards Logos This site uses cookies.\nBy continuing to browse the site, you are agreeing to our use of cookies.\nFollow WFMY News 2 on Facebook and Twitter► Make it easy to keep up to date with more stories like this."}, {"url": "https://www.wfmynews2.com/article/news/local/high-point-furniture-market-stars-diane-keaton-carson-kressley-hillary-farr/83-9be8bfe2-5810-4f58-9df2-984a88bd51ab", "title": "From Hollywood To High Point: Some of the Celebs at the 2019 Fall Furniture Market", "authors": ["Author", "Ben Briscoe", "Published", "Pm Edt October", "Updated"], "date": "2019-10-19", "keywords": ["market", "hollywood", "point", "guilford", "chickfila", "college", "diane", "high", "keaton", "2019", "celebs", "actress", "fall", "nc", "greensboro", "furniture"], "summary": "HIGH POINT, N.C. — This weekend is your chance to catch a glimpse of some household names as they make their way to the High Point Furniture Market to sell their furniture lines.\nActress Diane Keaton Makes Surprise Stop at a Chick-Fil-A in GreensboroOr Hillary Far from HGTV's Love It Or List It.\nPHOTOS | Actress Diane Keaton Makes Food Stop at a Chick-Fil-A in Greensboro Actress Diane Keaton at Chick-Fil-A Guilford College in Greensboro, NC.\nActress Diane Keaton at Chick-Fil-A Guilford College in Greensboro, NC.\nRELATED: The Best 10 Places to Take an Instagram Selfie in High Point"}, {"url": "https://www.wfmynews2.com/article/news/local/fall-festivals-haunted-attractions-pumpkin-patches-farms-hayrides-corn-mazes-nc/83-d8a34dc5-3117-44a1-a470-28778e9e82eb", "title": "It’s Fall Y'all! List of Fall Festivals, Spooky Attractions, Pumpkin Patches, Corn Mazes, Hayrides In North Carolina", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Am Edt September", "Updated", "Pm Edt October"], "date": "2019-09-26", "keywords": ["hayrides", "pumpkin", "spooky", "visit", "yall", "festival", "information", "north", "fun", "farm", "ncmore", "list", "fall", "festivals", "mazes", "patches", "includes"], "summary": "If you want your fall festival, haunted attraction, or farm to be featured send an email to webteam@wfmy.com Add Attn: Fall Event in the subject line.\nCORN MAZES, HAYRIDES, PUMPKIN PATCHESCornfield Maize Adventure (Archdale): 10-acre corn maze at Kersey Valley (1615 Kersey Valley Rd.)\nCheck It Out: Go Apple or Pumpkin Picking In The TriadJ.Razz and Tazz Farm: Includes pumpkin patch, cow train rides, corn maze, haunted forest hayrides, and farm equipment on display.\nFind out more by visiting McKee Cornfield MazeMillstone Creek Orchards (Ramseur): Includes pumpkin patch, pick your own apples, hayrides, cider mill, and more.\nBush-N-Vine Fall Farm (York): Pick your own pumpkin and enjoy Saturday hayrides."}, {"url": "https://www.rhinotimes.com/news/2019-nc-folk-festival-sets-new-attendance-record/", "title": "2019 NC Folk Festival Sets New Attendance Record", "authors": ["John Hammer"], "date": "2019-10-23", "keywords": ["folk", "event", "sets", "festival", "threeday", "hosted", "record", "nc", "attendance", "2019", "artists", "performing", "greensboro"], "summary": "The North Carolina Folk Festival announced another record-breaking year.\nThe estimate is that 156,000 people attended the NC Folk Festival in 2019.\nFor three years Greensboro hosted the American Folk Festival, which moves every three years.\nSo, in 2018, the NC Folk Festival was created and for attendance to increase in the second year, means the NC Folk Festival is headed in the right direction.\nThere were 106 separate performances and workshops over the three-day festival with more than 45 different artists performing at five outdoor stages and nine indoor venues."}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/weather-stories/2019/10/04/heat-records-shattered-across-north-carolina-thursday", "title": "Heat Records Shattered across North Carolina Thursday", "authors": ["Published Am Et Oct."], "date": "2019-10-04", "keywords": ["reep", "heat", "laughter", "episode", "carolina", "records", "joins", "need", "north", "talk", "shattered", "right", "medicine", "jon", "podcast"], "summary": "NEW PODCAST EPISODE Is laughter the medicine we need right now?\nJon Reep joins us to talk comedy in the time of coronavirus."}, {"url": "https://myfox8.com/news/1-dead-2-arrested-3-with-life-threatening-injuries-after-assault-with-motor-vehicle-at-greensboro-gas-station-police-say/", "title": "1 dead, 2 arrested, 3 with life-threatening injuries after ‘assault with motor vehicle’ at Greensboro gas station, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-12", "keywords": ["victims", "anquette", "firstdegree", "say", "lifethreatening", "gas", "dead", "fana", "murder", "station", "run", "motor", "injuries", "assault", "vehicle", "watch", "greensboro", "chantel", "watlington"], "summary": "Left to right Meranda Chantel Watlington and Fana Anquette FeltonThis is an archived article and the information in the article may be outdated.\nMeranda Chantel Watlington, 28, and Fana Anquette Felton, 27, were arrested Saturday.\nWatlington is charged with first-degree murder, five counts of attempted first-degree murder, driving while impaired, felony death by vehicle and felony hit and run, according to jail records.\nMeranda Chantel WatlingtonFana Anquette FeltonLeft to right Meranda Chantel Watlington and Fana Anquette FeltonHer next court date is Monday.\nFelton is charged with first-degree murder and five counts of attempted first-degree murder."}, {"url": "https://myfox8.com/news/2-shot-in-greensboro-police-say/", "title": "2 shot in Greensboro, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-27", "keywords": ["victims", "told", "shot", "videogreensboro", "taken", "watch", "say", "gunshot", "suspect", "greensboro", "stable", "wounds"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Two people were found with gunshot wounds in Greensboro early Sunday morning, according to a Greensboro Police Department news release.\nPolice responded to 5323 Fox Cove Lane at 1:55 a.m. Sunday when they were told shots were fired in the area.\nOfficers say they found two gunshot victims in stable condition.\nThey were taken to the hospital.\nNo suspect information is available."}, {"url": "https://myfox8.com/news/2-taken-to-hospital-after-shooting-in-greensboro/", "title": "2 taken to hospital after shooting in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-30", "keywords": ["word", "victims", "hospital", "taken", "information", "arrived", "vehiclethere", "shooting", "wound", "greensboro", "victim"], "summary": "GREENSBORO, N.C. — Two people were injured in a shooting in Greensboro on Tuesday night, according to a news release from Greensboro police.\nWhen officers arrived, they found a victim with a gunshot wound.\nThat victim was taken to the hospital for treatment.\nA second victim arrived at a local hospital via a private vehicle.\nAnyone with information on this shooting is asked to call Greensboro/Guilford Crime Stoppers at (336) 373-1000."}, {"url": "https://abc11.com/amber-alert-greensboro-nc-update/5607210/", "title": "3-year-old abducted from Greensboro playground found safe; kidnapper remains at large", "authors": [], "date": "2019-10-11", "keywords": ["suspected", "abducted", "stripe", "3yearold", "girl", "black", "playground", "kidnapper", "large", "woman", "ahlora", "remains", "greensboro", "safe", "short", "surveillance"], "summary": "Surveillance image shows woman suspected of abducting 3-year-old girl from Greensboro playground.\nGREENSBORO, N.C. (WTVD) -- A 3-year-old girl has been found safe nearly 24 hours after being abducted in Greensboro.Greensboro Police Department confirmed Ahlora Ashanti-Sample Lindiment was found safe Thursday night, but her kidnapper remains at large.During a Thursday night press release Greensboro Police Chief Wayne Scott said Ahlora was found a little after 8 p.m. via a tip line where a woman said a girl was at Word of Faith Christian Center on Dillard Street; she was then taken to the hospital with no apparent injuries.By 9:45 p.m., Ahlora was reunited with her family.After announcing the safe return of Ahlora, Greensboro Police Department officially identified the woman shown in surveillance pictures as the girl's suspected kidnapper.The woman's identity is unknown, but she was described as a black woman in her 20's, who stands 5-foot 6-inches and weighs 135 pounds.\nThe woman had a short ponytail and was wearing a short sleeve black crop top with black pants with tiger print faces on them, a yellow stripe one leg and a white stripe on the other leg, dark flip flops and a gold chain.Anyone with information about her identity is asked to call 336-574-4035."}, {"url": "https://www.wfmynews2.com/article/news/local/greene-street-nightclub-closing-downtown-greensboro/83-9f98efe1-c410-4fa3-9aca-40ca41ff36ba", "title": "Greene Street Nightclub Closing In Downtown Greensboro After More Than A Decade In Business", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Edt October", "Updated"], "date": "2019-10-26", "keywords": ["downtown", "opens", "business", "greene", "southall", "party", "club", "nightclub", "community", "greensboro", "street", "served", "decade", "closing"], "summary": "GREENSBORO, N.C. — After more than a decade in business, Greene Street Nightclub will soon close its doors.\nThe Greene Street Nightclub located on North Greene Street will host its last event, the SunDaze Day Party on October 27, 2019, to cap off its NC A&T State University’s Homecoming festivities.\nThe club and its owners Mike Clark, Joe Shepard, and Jon Southall have served thousands of college students in the Triad.\nIt has also been a venue for dozens of nonprofits and businesses and also a way to promote independent artists.\n“Our goal was always to impact the community while operating a successful business,” Southall said."}, {"url": "https://www.northcarolinahealthnews.org/2019/10/14/deq-greensboro-wont-id-industry-contaminated-downstream-drinking-water-with-14-dioxane/", "title": "DEQ, Greensboro won't ID pollution source", "authors": ["Greg Barnes", "Mary Lehman", "Emily Paterson", "Rachel Velez", "North Carolina Health News"], "date": "2019-10-14", "keywords": ["source", "id", "dioxane", "water", "parts", "release", "deq", "drinking", "pollution", "wont", "billion", "14", "greensboro", "public"], "summary": "The release of 1,4 dioxane caused large, temporary spikes of the probable carcinogen in drinking water for Fayetteville and Pittsboro.\nGreensboro officials and the state Department of Environmental Quality also won’t say how the release of 1,4 dioxane happened and how much of the chemical was discharged.\nYoung said Greensboro told the DEQ about the release in late September and never revealed the industry that was responsible.\nWilliams declined to identify the company or say how much 1,4 dioxane was released or how the accident happened.\nOfficials in Asheboro and Reidsville have revealed the names of companies in their cities that have released 1,4 dioxane."}, {"url": "https://myfox8.com/news/suspects-identified-after-greensboro-shooting-leaves-victim-in-critical-condition-police-say/", "title": "Suspects identified, charged after Greensboro shooting leaves victim in critical condition , police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-27", "keywords": ["leaves", "condition", "wayne", "suspects", "charged", "vehicle", "officers", "washington", "jr", "shots", "say", "shooting", "greensboro", "stolen", "street", "identified", "critical", "victim"], "summary": "Jeremy Wayne Hasty, 29, of Greensboro was charged with assault with a deadly weapon on a government official.\nChristopher Brooks Sellers Jr., 17, of High Point was held for an outstanding warrant for failure to appear on possession of a stolen vehicle.\nOn Sunday at 2:09 a.m., officers responded to the intersection of S. Elm Street and E. Washington Street when they got a report of shots fired.\nFour officers fired at the vehicle at Washington Street and Davie Street, the release says.\nThe found a male victim who is believed to be the victim of the original shots fired call on S. Elm Street and E. Washington Street, the release says."}, {"url": "https://www.wfmynews2.com/article/news/local/coyotes-nc-october-november-sightings/83-a46dfe45-32a4-4d28-8445-6a9d013b95a1", "title": "Do you hear more howling? Coyotes love October, November", "authors": ["Author", "Wfmy News Digital Team", "Marissa Tansino", "Published", "Pm Edt October", "Updated"], "date": "2019-10-16", "keywords": ["wildlife", "wild", "howling", "hearing", "coyote", "humans", "hear", "travel", "love", "young", "pets", "coyotes", "seeing"], "summary": "If you think you're seeing and hearing more coyotes this month, it's because you are, according to NC Wildlife Resources Commission (NCWRC).\nWildlife officers say it is common for North Carolinians to report seeing and hearing coyotes more often in October and November.\nFall is the time of year when young coyotes, that were born in early spring, leave their parents’ territory to find a mate and establish their own territory, NCWRC says.\nHere's another wild fact: young coyotes often travel with their siblings during this time of year and can travel long distances--which is upward of 300 miles before settling down into their own territories!\nFortunately, hearing or seeing a coyote, even during the day, is usually no cause for alarm."}, {"url": "https://myfox8.com/news/greensboro-woman-killed-while-helping-driver-move-vehicle-off-meadowood-street-identified/", "title": "Greensboro woman killed while helping driver move vehicle off Meadowood Street identified", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-23", "keywords": ["crash", "wreck", "helping", "videogreensboro", "vehicle", "meadowood", "road", "xterrabonner", "watch", "woman", "killed", "greensboro", "street", "identified", "wendover", "w", "driver"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — A woman is dead after a crash on Meadowood Street, according to Greensboro police.\nAt about 7:02 a.m., police responded to wreck in the area of 4206 W. Wendover Ave.Police believe 40-year-old Sheanna Lavesi Bonner, of Greensboro, was helping another driver move a broken down vehicle off the road when she was hit by a 2001 Nissan Xterra.\nNo charges have been filed.\nPolice said their crash reconstruction team was on the scene.\nThe road was closed but has since reopened."}, {"url": "https://www.wfmynews2.com/article/news/politics/elections/nc-election-primary-voting-politics/83-8639d094-82f5-4578-9fa3-0ad7fc1ab903", "title": "Primary Day polls open in NC, High Point, Burlington, Mount Airy", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated", "Am Est November"], "date": "2019-10-07", "keywords": ["registration", "burlington", "primary", "open", "high", "mount", "election", "airy", "absentee", "voting", "point", "nc", "registered", "early", "day", "vote", "polls", "voter", "ballot"], "summary": "GREENSBORO, N.C. — Election Day 2019 is here as voters head to the polls on Tuesday, November 5 to decide who will be their municipal representative.\nAbsentee by-mail votingAny registered N.C. voter may request and absentee ballot by mail by filling out the State Absentee Ballot Request Form.\nThe voter then returns the voter ballot to his or her county board of elections.\nIn-person early voting and Early voting allows any registered voter to cast an absentee ballot in person on select days before Election Day.\nDuring early voting, registered voters may vote at any early voting site in their county of residence."}, {"url": "https://myfox8.com/news/why-did-she-kill-my-daughter-women-accused-of-running-over-killing-woman-at-greensboro-gas-station-appear-in-court/", "title": "‘Why did she kill my daughter?’: Women accused of running over, killing woman at Greensboro gas station appear in court", "authors": ["Digital Desk", "Daniel Pierce", "Nexstar Media Wire", "Cnn Wire", "Web"], "date": "2019-10-14", "keywords": ["running", "firstdegree", "say", "gas", "felton", "daughter", "edmondson", "kill", "tried", "murder", "court", "women", "station", "run", "killing", "fight", "woman", "greensboro", "watlington"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — The two women accused of murder after a woman was run over and killed at a Greensboro gas station appeared in court Monday.\nMeranda Chantel Watlington, 28, and Fana Anquette Felton, 27, were arrested Saturday and are charged with first-degree murder and attempted murder charges.\nShe's charged with first-degree murder and five counts of attempted first-degree murder.\nShe is charged with first-degree murder, five counts of attempted first-degree murder, driving while impaired, felony death by vehicle and felony hit and run, according to jail records.\nPlease enable Javascript to watch this videoThe father of 30-year-old Zanelle S. Tucker, who died, spoke and asked the court, \"Why did she kill my daughter?"}, {"url": "https://myfox8.com/news/power-outages-trees-down-reported-after-halloween-storms-in-the-triad/", "title": "Power outages, trees down reported after Halloween storms in the Triad", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-11-01", "keywords": ["wedding", "trees", "triad", "dogs", "block", "outages", "tree", "1030", "storms", "power", "roads", "lake", "living", "reported", "halloween"], "summary": "Please enable Javascript to watch this videoThere are reports of power outages and trees down in the Triad after storms rolled through on Halloween.\nA tree fell on a house near the intersection of Lawndale and Lake Jeanette roads in Greensboro.\nThey got home around 6:30 p.m., saw the tree and start panicking because they knew they had their two dogs inside.\nThe dogs were inside of their kennels just inches away from where the tree crashed down in their living room.\nMore than 2,600 Duke Energy customers in Guilford County are without power as of 10:30 p.m."}, {"url": "https://www.wfmynews2.com/article/news/local/north-carolina-weather-triad-in-review-2019/83-c0eed131-1182-4c64-8452-18f346d5e072", "title": "It's gotta be 'North Carolina weather!' A year of Triad Weather; 2019 in Review", "authors": ["Author", "Christian Morgan", "Wfmy", "Published", "Pm Est December", "Updated"], "date": "2020-01-01", "keywords": ["sticking", "triad", "gotta", "carolina", "days", "north", "hurricane", "morning", "2019", "wet", "review", "weather", "came"], "summary": "GREENSBORO, N.C. — As we bring 2019 to a close, looking back it was quite a busy year for weather in the Triad.\nWe tied records, broke records, and set new ones too; not that you’d expect anything different from a year in North Carolina weather, right?\nWFMY’s Christian Morgan said one of those days came in November and was record setting; Nov 13.\nWFMYAnd, there was only one Hurricane of the 2019 season to make landfall in North Carolina.\nThose are just some highlights for the year, because well…you know…North Carolina weather."}, {"url": "https://myfox8.com/news/at-least-1-killed-in-wreck-at-guilford-county-intersection/", "title": "At least 1 killed in wreck at Guilford County intersection", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-11", "keywords": ["county", "roadtroopers", "wreck", "updatedguilford", "guilford", "information", "person", "stamp", "troopers", "killed", "article", "intersection", "vehicles"], "summary": "This is an archived article and the information in the article may be outdated.\nGUILFORD COUNTY, N.C. — At least one person was killed in a wreck Thursday in Guilford County, according to Highway Patrol.\nAt about 5:02 p.m., troopers responded to a report of a crash involving two vehicles at Old Julian Road and Coble Church Road.\nTroopers confirmed at least one person was killed.\nHighway Patrol has not provided any identifying information and has not commented on any possible charges."}, {"url": "https://www.montanasports.com/sports/rodeo/jess-lockwood-2nd-after-opening-round-in-greensboro", "title": "Jess Lockwood 2nd after opening round in Greensboro", "authors": [], "date": "2019-10-13", "keywords": ["standings", "lockwood", "points", "texas", "mitchell", "jess", "cattle", "teel", "world", "pbr", "live", "greensboro", "2nd", "opening", "round"], "summary": "Davis concluded the opening night of the Greensboro, North Carolina, event $3,580 richer, in addition to collecting 100 world points.\n1 Leme’s lead, 2017 PBR World Champion Jess Lockwood (Volborg, Montana) finished second, netting $2,750 and 60 world points.\n1 Leme as the season marches ever closer to the season-culminating PBR World Finals in Las Vegas on Nov. 6-10.\nThe 22-year-old covered Whiskey River (Bronco’s Bucking Bulls) for 84.75 points to earn $850 and 30 world points.\nAction inside the Greensboro Coliseum will continue with Round 2 and the championship round on Sunday, starting at 1:45 p.m. EDT."}, {"url": "https://www.wfmynews2.com/article/life/food/recipes/from-the-news-2-kitchen/cafe-pasta-greensboro-police-department-united-way-fundraiser-food-cause-giving-campaign/83-2674f924-eaf5-4ebe-bfe0-20bd0d05f8fd", "title": "Italian Cooking for a Cause", "authors": ["Author", "Wfmy News Digital", "Published", "Am Edt October", "Updated"], "date": "2019-10-06", "keywords": ["italian", "virgin", "united", "great", "way", "olive", "kick", "pepper", "giving", "cause", "cooking", "greensboro", "segment"], "summary": "GREENSBORO, N.C. — Here’s a look at some of the food you can see at this week’s United Way Fundraiser in Greensboro.\nIngredients:6 jumbo fresh shrimpMushrooms Button or Shiitake cut upCherry tomatoesFresh SpinachShallots & GarlicExtra Virgin Olive oilButter & Italian herbsHalf & Half with equal Heavy CreamParmesan cheeseTri-Color Rotini pastaSalt and Pepper to tasteThe second segment is the Mediterranean Rosemary Chicken.\nPlease join us for great food for a great cause.\nThe goal of the event is to kick off the City of Greensboro’s campaign of giving to the United Way.\nDate: 10/8/2019Time: 5-10pmLocation: 305 State Street, Greensboro, North Carolina 27408Menu Options:· All you can eat Buffet $9.95 a person· Takeout orders are accepted"}, {"url": "https://myfox8.com/news/person-taken-to-hospital-after-shooting-in-greensboro-2/", "title": "Person taken to hospital after shooting in Greensboro, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-16", "keywords": ["hospital", "taken", "information", "told", "person", "woundhe", "stoppers", "say", "shooting", "suspect", "greensboro", "suffering", "victim"], "summary": "GREENSBORO, N.C. — A person has been taken to the hospital after a shooting in Greensboro, according to a Greensboro Police Department news release.\nThe person shot, described by police as a male victim, is reportedly in stable condition.\nWhen they arrived, police say the victim was in a parking lot at the apartment complex suffering from a gunshot wound.\nHe was then taken to the hospital.\nNo suspect information is available right now."}, {"url": "https://myfox8.com/news/greensboro-firefighters-working-to-free-multiple-people-from-overturned-pickup-truck/", "title": "Greensboro firefighters working to free multiple people from overturned pickup truck", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-10-28", "keywords": ["truck", "multiple", "professional", "credit", "overturned", "working", "greensborogreensboro", "free", "greensboro", "firefighters", "pickup"], "summary": "Greensboro firefighters working to free multiple people from over-turned pickup truck (credit: Professional Firefighters of Greensboro)Greensboro firefighters working to free multiple people from over-turned pickup truck (credit: Professional Firefighters of Greensboro)Greensboro firefighters working to free multiple people from over-turned pickup truck (credit: Professional Firefighters of Greensboro)Greensboro firefighters working to free multiple people from over-turned pickup truck (credit: Professional Firefighters of Greensboro)GREENSBORO, N.C. — Firefighters in Greensboro are currently working to free several people from an overturned pickup truck, according to Professional Firefighters of Greensboro.\nThe pickup truck is overturned on the corner of Cone Boulevard and Elm Street.\nOne person has reportedly been freed.\nEast Cone Boulevard and North Elm Street have reopened.\n36.072635 -79.791975"}, {"url": "https://www.wfmynews2.com/article/news/local/good-morning-show/barnabas-network-furniture-sale-greensboro-discount-fundraiser-wfmy/83-b8ba21f6-45ca-4847-a549-9e33ea854c89", "title": "Huge Sale Offers Like-New Furniture at a Discount", "authors": ["Author", "Tracey Mccain", "Published", "Am Edt October", "Updated"], "date": "2019-10-16", "keywords": ["likenew", "sale", "nonprofitthe", "local", "warehouse", "network", "prices", "networks", "help", "barnabas", "furniture", "huge", "discount", "offers"], "summary": "The Barnabas Network has a Warehouse Sale at least twice a year.\nYou get new and like-new furniture at amazing prices while raising money for the local non-profit.\nThe furniture is donated by local retailers and manufacturers and benefits the Barnabas Networks mission to help people in need.\nThe Barnabas Network's Fall Warehouse Furniture Sale is this Saturday, October 19, 2019, from 9 a.m. to 3 p.m. and Sunday, October 20, 2019, from Noon until 3 p.m.\nFor more information about the Barnabas Network, click here."}, {"url": "https://myfox8.com/news/scotty-mccreery-coming-to-greensboro/", "title": "Scotty McCreery coming to Greensboro", "authors": ["Digital Desk"], "date": "2020-01-15", "keywords": ["california", "angeles", "03", "country", "coming", "music", "novo", "2019", "greensboro", "mccreery", "scotty", "los"], "summary": "LOS ANGELES, CALIFORNIA – OCTOBER 03: Scotty McCreery performs onstage at Los Angeles’ Novo Celebrating Seasons Change’s Success at The Novo Theater at L.A. Live on October 03, 2019 in Los Angeles, California.\nScotty McCreery performs onstage at Los Angeles' Novo Celebrating Seasons Change's Success at The Novo Theater at L.A. Live on October 03, 2019 in Los Angeles, California.\n(Photo by Kevin Winter/Getty Images for Scotty McCreery/Triple 8 Management/Triple Tigers Records)LOS ANGELES, CALIFORNIA - OCTOBER 03: Scotty McCreery performs onstage at Los Angeles' Novo Celebrating Seasons Change's Success at The Novo Theater at L.A. Live on October 03, 2019 in Los Angeles, California.\nScotty McCreery performs onstage at Los Angeles' Novo Celebrating Seasons Change's Success at The Novo Theater at L.A. Live on October 03, 2019 in Los Angeles, California.\n(Photo by Jason Kempin/Getty Images)LOS ANGELES, CALIFORNIA - OCTOBER 03: Scotty McCreery performs onstage at Los Angeles' Novo Celebrating Seasons Change's Success at The Novo Theater at L.A. Live on October 03, 2019 in Los Angeles, California."}, {"url": "https://www.rhinotimes.com/news/state-uses-seasons-first-flu-death-as-a-public-warning/", "title": "State Uses Season’s First Flu Death As A Public Warning", "authors": ["Scott D. Yost"], "date": "2019-10-24", "keywords": ["county", "vaccination", "seasons", "uses", "officials", "state", "flu", "north", "health", "death", "deaths", "season", "public", "warning"], "summary": "Officials with the NC Department of Health and Human Services’ Division of Public Health announced Thursday that the first reported flu-related death of the new flu season involved an adult in the central part of the state.\nThe Division of Public Health’s surveillance for the 2019-20 flu season began on Sunday, Sept. 29 and will continue through late May.\nIn 2018-19, there were 208 flu deaths reported in North Carolina, down from 391 deaths during the 2017-18 flu season that proved very deadly.\nThe Thursday press release from the state notes: “Vaccination is the best way to prevent infection with the flu.\nLocal and state health officials also suggest taking the following measures:"}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/weather-stories/2019/09/26/drought-conditions-spread-across-north-carolina", "title": "Drought Conditions Spread across North Carolina", "authors": ["Published Am Et Sep."], "date": "2019-09-26", "keywords": ["drought", "carolina", "state", "crops", "north", "driest", "month", "spread", "conditions", "rain", "dry"], "summary": "The latest drought monitor released Thursday shows much of North Carolina from the mountains to near Raleigh is either under abnormally dry or moderate drought conditions.\nMost of the rain that has fallen in the state during the month of September came from Hurricane Dorian.\nThat is keeping eastern North Carolina out of drought conditions for now.\nIn the most recent weekly crops report, several county extension offices noted the dry conditions are taking on toll on crops including soybeans, hay, and tobacco.\nOnly very small rain chances are in the forecast across the state for the rest of the month."}, {"url": "https://www.rhinotimes.com/news/high-point-high-on-being-named-a-city-of-the-future/", "title": "High Point High On Being Named A “City Of The Future”", "authors": ["Scott D. Yost"], "date": "2019-10-29", "keywords": ["internationally", "point", "companies", "magazine", "international", "investment", "north", "high", "city", "named", "recognition", "future"], "summary": "The City of High Point has been recognized as one of the “American Cities of the Future” for 2019-2020 by an internationally known publication.\nIn the magazine, High Point was ranked in the “Top 10” in the category of “cost effectiveness” for municipalities in North and South America with populations between 100,000 and 350,000.\nThis week, Loren Hill, the president of the High Point Economic Development Corp., which works to bring new businesses to High Point, said he’s very pleased with the recognition that he says is well-deserved for the city.\n“There’s a reason why High Point calls itself ‘North Carolina’s International City,’” Hill said.\nHigh Point currently has over 80 fulltime international companies with fulltime operations in the city."}, {"url": "https://www.pgatour.com/news/2020/04/16/pga-tour-schedule-adjustments-2019-2020-fedexcup-season-2020-2021-regular-season-coronavirus.html", "title": "PGA TOUR announces schedule adjustments for remainder of 2019-20 FedExCup season, releases fall portion of 2020-21 PGA TOUR Regular Season schedule", "authors": [], "date": "2020-04-16", "keywords": ["tour", "portion", "championship", "scheduled", "events", "club", "fedexcup", "open", "season", "schedule", "remainder", "releases", "fall", "regular", "golf", "originally", "pga"], "summary": "With additional time needed to ensure PGA TOUR tournaments are staged in the most safe and responsible manner possible given the ongoing COVID-19 crisis, the PGA TOUR is announcing further schedule modifications for the remainder of the 2019-20 season, as well as plans for the opening portion of the 2020-21 PGA TOUR Regular Season, the restart of the 2020 Korn Ferry Tour season and updates regarding the Mackenzie Tour – PGA TOUR Canada schedule.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\nAs such, the TOUR will continually review available COVID-19-related protocols that could be implemented at PGA TOUR events to ensure the health and well-being for all involved.\nMackenzie Tour – PGA TOUR CanadaThe Mackenzie Tour – PGA TOUR Canada is postponing the first six scheduled events of its 2020 season.\nPGA TOUR Champions, PGA TOUR Latinoamérica and PGA TOUR Series-ChinaInformation regarding PGA TOUR Champions and the PGA TOUR’s other two International Tours, in Latin America and China, will be announced in the coming weeks."}, {"url": "https://upnewsinfo.com/2020/04/16/revised-pga-tour-schedule-for-the-2019-20-season-and-early-2020-21-golf-news/", "title": "Revised PGA Tour schedule for the 2019-20 season and early 2020-21", "authors": ["Sky Sports Golf", "Please Enter Your Name Here"], "date": "2020-04-16", "keywords": ["tour", "tpc", "championship", "country", "early", "201920", "club", "resort", "open", "202021", "season", "schedule", "classic", "golf", "revised", "tournament", "pga"], "summary": "A look at the revised dates, venues and tournament schedule for the 2019-2020 PGA Tour season and the first part of the 2020-21 campaign.\nJuly 23-26 – 3M Open, TPC Twin Cities, Blaine, MinnesotaJuly 30 to August 2 – WGC-FedEx St. Jude Invitational – TPC Southwind, Memphis, TennesseeJuly 30 to August 2 – Barracuda Championship – Tahoe Mountain Club (Old Greenwood), Truckee, CaliforniaPGA Tour confirms return in June The PGA Tour announced that they plan to resume from June 11-14, with the first four events behind closed doors.\nAugust 6-9 – PGA Championship – TPC Harding Park, San Francisco, CaliforniaAugust 13-16 – Wyndham Championship – Sedgefield Country Club, Greensboro, North CarolinaAugust 20-23 – The Northern Trust – TPC Boston, Norton, MassachusettsAugust 27-30 – BMW Championship – Olympia Fields Country Club (North), Olympia Fields, IllinoisSeptember 4-7 – Tour Championship – East Lake Golf Club, Atlanta, GeorgiaThe Tour Championship, where McIlroy is the defending champion, will end on a Monday to coincide with Labor Day.\nEarly 2020-2021 season scheduleSeptember 10-13 – Safeway Open – Silverado Resort and Spa North, Napa, CaliforniaSeptember 17-20 – United States Open, Winged Foot Golf Club, Mamaroneck, New YorkSeptember 25-27 – Ryder Cup, Whistling Straits, Kohler, WisconsinSeptember 24-27 – Corales Puntacana Resort & Club Championship – Corales Golf Club, Punta Cana, Dominican RepublicOctober 1-4 – Sanderson Farms Championship – Country Club of Jackson, Jackson, MississippiThe complexities of the return of golf.\nPaul McGinley looks at the challenges facing professional golf courses in the coming months."}, {"url": "https://www.dallasnews.com/sports/golf/2020/04/16/pga-tour-will-return-to-action-in-june-with-fort-worths-charles-schwab-challenge-at-colonial-but-no-fans-are-allowed/", "title": "PGA Tour will return to action in June with Fort Worth’s Charles Schwab Challenge at Colonial. But no fans are allowed.", "authors": ["Scott Bell", "Brad Townsend", "Mark Kazlowski", "Dom Difurio", "Tom Steele", "Loyd Brumfield", "Steve Brown", "Catherine Marfin", "John Hancock"], "date": "2020-04-16", "keywords": ["fans", "tour", "challenge", "tpc", "championship", "scheduled", "worths", "club", "colonial", "open", "schedule", "fort", "golf", "originally", "schwab", "charles", "pga", "return"], "summary": "The PGA Tour is returning to action in June.\nAll eyes will be on the D-FW Metroplex as the return happens at Fort Worth’s Colonial Country Club.\nThe Charles Schwab Challenge in Fort Worth, originally scheduled to take place May 18-24, will be the first tournament on the shortened schedule.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\n1 priority, and our hope is to play a role – responsibly – in the world’s return to enjoying the things we love,” said PGA Tour commissioner Jay Monahan."}, {"url": "https://golfweek.usatoday.com/2020/04/16/pga-tour-schedule-charles-schwab-challenge-coronavirus/", "title": "PGA Tour releases revised schedule with restart set for June", "authors": ["Steve Dimeglio", "Jason Lusk", "Greg Mattura", "North Jersey Record", "Todd Kelly", "Beth Ann Nichols", "David Dusek"], "date": "2020-04-16", "keywords": ["tour", "tpc", "set", "championship", "restart", "events", "club", "open", "releases", "schedule", "season", "golf", "revised", "pga"], "summary": "“The health and safety of all associated with the PGA Tour and our global community continues to be our No.\n1 priority, and our hope is to play a role – responsibly – in the world’s return to enjoying the things we love,” PGA Tour commissioner Jay Monahan said in a statement.\nNine tournaments, including the Open Championship, already had been canceled before the latest schedule alteration.\nEight tournaments – including the Masters, U.S. Open, PGA Championship and the FedExCup Playoffs – had been moved to later dates.\nThe Tour hopes to conclude the season with the Tour Championship over Labor Day weekend."}, {"url": "https://www.sportsvideo.org/2020/04/16/pga-tour-lays-out-new-schedule-hoping-to-tee-off-on-june-8/", "title": "PGA TOUR Lays Out New Schedule, Hoping to Tee off on June 8", "authors": ["Ken Kerschbaumer", "Editorial Director"], "date": "2020-04-16", "keywords": ["lays", "tour", "championship", "scheduled", "events", "club", "open", "schedule", "tee", "golf", "originally", "pga", "hoping"], "summary": "PGA TOUR Lays Out New Schedule, Hoping to Tee off on June 8Story HighlightsWith additional time needed to ensure PGA TOUR tournaments are staged in the most safe and responsible manner possible given the ongoing COVID-19 crisis, the PGA TOUR is announcing further schedule modifications for the remainder of the 2019-20 season.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\n1 priority, and our hope is to play a role – responsibly – in the world’s return to enjoying the things we love,” says PGA TOUR Commissioner Jay Monahan.\nAs such, the TOUR will continually review available COVID-19-related protocols that could be implemented at PGA TOUR events to ensure the health and well-being for all involved.\nMackenzie Tour – PGA TOUR CanadaThe Mackenzie Tour – PGA TOUR Canada is postponing the first six scheduled event"}, {"url": "https://www.rhinotimes.com/news/coronavirus-infects-guilford-countys-revenue/", "title": "Coronavirus Infects Guilford County’s Revenue", "authors": ["Scott D. Yost"], "date": "2020-03-24", "keywords": ["county", "budget", "sales", "taxes", "revenue", "guilford", "hit", "coronavirus", "tax", "countys", "fiscal", "infects"], "summary": "The coronavirus pandemic has wreaked havoc on most people’s 401(k) plans and it has also been doing some damage to the 2019-2020 Guilford County budget that was approved last summer.\nThe county’s two major sources of revenue are from property taxes and sales taxes and Halford said that the sales tax side of the equation is where the coronavirus will do the most damage.\nGuilford County projected about $90 million in revenue from sales taxes in fiscal 2019-2020, but now that number is in doubt.\nGuilford County Finance Director Harley Will said that Guilford County will also take a financial hit due to an inability to get any significant interest income on its investments.\nThat means, in the current interest rate environment, Guilford County will earn next to nothing on its savings account going forward."}, {"url": "https://www.rhinotimes.com/news/big-marijuana-bust-in-northwest-greensboro/", "title": "Big Marijuana Bust in Northwest Greensboro", "authors": ["Scott D. Yost"], "date": "2020-03-19", "keywords": ["seized", "sheriffs", "vice", "stolen", "pounds", "road", "bust", "unit", "marijuana", "northwest", "greensboro", "department", "big", "narcotics"], "summary": "The drug bust occurred when the department’s Vice and Narcotics Unit exercised a search warrant at 2205 New Garden Road in northwest Greensboro where suspected drug activity was taking place.\nThe address is in northwest Greensboro between Battleground Road and Old Battleground Road, near the Walmart supercenter.\nThe bust comes after a productive year for the Vice and Narcotics Unit of the Sheriff’s Department.\nThe Vice and Narcotics Unit isn’t the only unit in the Sheriff’s Department that confiscated drugs last year.\nThe department’s Specialized Enforcement Unit seized 1,578 pounds of marijuana and 63 pounds of other THC products."}, {"url": "https://www.wfmynews2.com/article/entertainment/events/5-things-to-do-in-the-triad-this-weekend/83-1daf6ca4-b2ed-43b3-87b5-44dd7a8fd0c8", "title": "5 Things To Do In The Triad This Weekend: Nov. 1-3", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated"], "date": "2019-11-01", "keywords": ["woods", "weekend", "triad", "things", "13", "event", "tickets", "wfmy", "greensboro", "2019", "nc", "wellness", "users", "nov"], "summary": "GREENSBORO, N.C. —What: MarketWhere: Greensboro ColiseumWhen: Nov. 1-3Time: Refer to websiteHoliday Market | Greensboro Coliseum Complex Event Schedule November 1, 2019- Fri. (10am - 9pm) November 2, 2019- Sat.\nWhat: Drum CircleWhere: Center City ParkWhen: Nov. 1Time: 6:30 p.m.First Friday Drum Circle Art event in Greensboro, NC by Greensboro Downtown Parks, Inc. and 2 others on Friday, November 1 2019 with 111 people interested.\nWhen: Nov. 1-2Time: Refer to websiteBuy Tickets for The Woods of Terror Greensboro NC Buy Tickets for Woods of Terror on Church Street!\nFollow WFMY News 2 on Facebook and Twitter► Make it easy to keep up to date with more stories like this.\nDownload the WFMY News 2 App: Apple Users, Android Users"}, {"url": "https://www.wfmynews2.com/article/news/politics/elections/nc-election-primary-voting-politics/83-8639d094-82f5-4578-9fa3-0ad7fc1ab903", "title": "Primary Day polls open in NC, High Point, Burlington, Mount Airy", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated", "Am Est November"], "date": "2019-10-07", "keywords": ["registration", "burlington", "primary", "open", "high", "mount", "election", "airy", "absentee", "voting", "point", "nc", "registered", "early", "day", "vote", "polls", "voter", "ballot"], "summary": "GREENSBORO, N.C. — Election Day 2019 is here as voters head to the polls on Tuesday, November 5 to decide who will be their municipal representative.\nAbsentee by-mail votingAny registered N.C. voter may request and absentee ballot by mail by filling out the State Absentee Ballot Request Form.\nThe voter then returns the voter ballot to his or her county board of elections.\nIn-person early voting and Early voting allows any registered voter to cast an absentee ballot in person on select days before Election Day.\nDuring early voting, registered voters may vote at any early voting site in their county of residence."}, {"url": "https://www.wfmynews2.com/article/life/holidays/christmas-events-in-north-carolina-holidays/83-5cc1473a-fd6c-4831-b18e-f3c4d6229eec", "title": "Christmas In North Carolina! 2019 List of Holiday Events Across The State", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated"], "date": "2019-11-26", "keywords": ["lights", "carolina", "state", "events", "north", "holiday", "ride", "2019", "season", "list", "town", "train", "santa", "christmas", "details"], "summary": "Celebrate the holiday season by making a new Christmas tradition and escaping to check out these lavish holiday light displays!\nHere’s a list of events happening in North Carolina from now until Christmas that will add some magic to the holiday season!\nSpecial events include the annual Christmas Town 5K on Nov. 30 and the Christmas Town Festival on Dec. 12.\nMore Details: Christmas Town USAChristmas Town USAVisit NCNORTH CAROLINA HOLIDAY FLOTILLANov. 29-30, 2019, Wrightsville BeachWilmington and other nearby beaches launch the holiday season with a boat parade on the Intracoastal Waterway.\nMore Details: Find out about ticket prices and moreOTHER HOLIDAY STORIESRELATED: CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, And More!"}, {"url": "https://patch.com/north-carolina/greensboro/greensboro-veterans-day-parade-set-november-9", "title": "Greensboro Veterans Day Parade Set For November 9", "authors": [], "date": "2019-11-04", "keywords": ["n", "set", "veterans", "takes", "day", "parade", "elm", "greensboro", "lindsay", "street", "honors", "left"], "summary": "From the City of Greensboro:Post Date:11/04/2019 8:00 AMThe Firth Annual Greensboro Honors Veterans Parade takes place in downtown Greensboro at noon on Saturday, November 9.\nThe parade honors all veterans, as well as active duty personnel and Gold Star families, of Guilford County.\nThe Greensboro History Museum is providing a float with actors portraying veterans with ties to this area.\nThe parade begins at the intersection of E. Lindsay Street and N. Elm Street, then takes a left on N. Elm Street, a left on E. Friendly Avenue, a left on N. Church Street and a left on E. Lindsay Street.\nParking is available in the following decks:Church Street – 215 N. Church St.Davie Street – 109 E. Market St.Bellemeade Street – 220 N. Greene St."}, {"url": "https://www.wfmynews2.com/article/news/local/north-carolina-weather-triad-in-review-2019/83-c0eed131-1182-4c64-8452-18f346d5e072", "title": "It's gotta be 'North Carolina weather!' A year of Triad Weather; 2019 in Review", "authors": ["Author", "Christian Morgan", "Wfmy", "Published", "Pm Est December", "Updated"], "date": "2020-01-01", "keywords": ["sticking", "triad", "gotta", "carolina", "days", "north", "hurricane", "morning", "2019", "wet", "review", "weather", "came"], "summary": "GREENSBORO, N.C. — As we bring 2019 to a close, looking back it was quite a busy year for weather in the Triad.\nWe tied records, broke records, and set new ones too; not that you’d expect anything different from a year in North Carolina weather, right?\nWFMY’s Christian Morgan said one of those days came in November and was record setting; Nov 13.\nWFMYAnd, there was only one Hurricane of the 2019 season to make landfall in North Carolina.\nThose are just some highlights for the year, because well…you know…North Carolina weather."}, {"url": "https://www.wfmynews2.com/article/entertainment/christmas-events-list-parades-ice-skating-tree-lightings-holidays-greensboro-winston-salem-nc/83-2f706732-287a-4c15-b3f1-f4cea9adbaec", "title": "CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, and More!", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated", "Am Est December"], "date": "2019-11-19", "keywords": ["lights", "pmwhere", "events", "holiday", "parade", "jamestown", "2019", "parades", "nc", "greensboro", "santa", "christmas", "details"], "summary": "CHRISTMAS PARADESJamestown Christmas ParadeWhat: It’s all about a holiday good time at the Jamestown Christmas Parade!\nWhen: December 1 at 3:00 p.m.Where: Main StreetMore Details: Jamestown Christmas ParadeSights and sounds of the 2019 Jamestown Parade:PHOTOS | Jamestown Christmas ParadePHOTOS | Check Out the 2019 Jamestown Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas ParadeLexington Christmas ParadeWhat: Christmas is Uptown Lexington!\nWhen: Saturday, December 7 at noon(rain or shine)Where: Starts on North Greene Street in GreensboroMore Details: Holiday Parade Route MapWinston-Salem Jaycees Holiday ParadeWhat: Come to downtown Winston-Salem for the 29th Annual Winston-Salem Jaycees Holiday Parade.\nMore Details: Winston-Salem Jaycees Holiday ParadeHigh Point Holiday Festival ParadeWhat: Get into the Holiday spirit with the High Point Holiday Festival Parade!\nMore Details: High Point ParadeBurlington Christmas ParadeWhat: Oh, what fun it is to be at the Burlington Christmas Parade!"}, {"url": "https://patch.com/north-carolina/greensboro/greensboro-celebrates-season-city-sponsored-holiday-events", "title": "Greensboro Celebrates The Season With City-Sponsored Holiday Events", "authors": [], "date": "2019-11-05", "keywords": ["park", "recreation", "citysponsored", "center", "celebrates", "events", "holiday", "crafts", "library", "parks", "season", "greensboro", "santa"], "summary": "From the City of Greensboro:November 5, 2019Greensboro Celebrates The Season With City-Sponsored Holiday EventsGreensboro offers a wide range of special events and activities this holiday season, including Thanksgiving events, winter festivals, New Year's events for children and adults, musical performances, kids' crafts, and giving opportunities.\nFall Festival at Griffin Recreation Center: November 16, 5-8 pmThis family-friendly event includes music, games, food, and lots of raffle prizes.\n'Tis the Season: Brown Recreation Center, December 7, 2-5 pmA holiday festival for the whole family.\nThe gifts will be distributed to local families in need this holiday season.\nWreaths Across America at Forest Lawn Cemetery: December 14, 11 amVolunteers place wreaths at veterans' graves to show their gratitude and appreciation during the holiday season."}, {"url": "https://patch.com/north-carolina/greensboro/greensboros-veterans-parade-set-november-9", "title": "Greensboro's Veterans Parade Set For November 9", "authors": [], "date": "2019-11-06", "keywords": ["greensboros", "set", "veterans", "ties", "parade", "city", "views", "turns", "greensboro", "street", "dav", "left"], "summary": "From the City of Greensboro:1/06/2019The Disabled American Veterans (DAV) in partnership with the City of Greensboro and other local veterans' organizations will presenting the fifth annual Greensboro Honors Veterans Parade in Downtown Greensboro at 12 pm, Saturday, November 9.\nThe parade will honor veterans as well as active duty personnel and Gold Star families of Guilford County.\nThe Greensboro History Museum will provide a float with actors portraying veterans with ties to this area.\nThe parade begins on Elm Street at the Lindsey Street intersection.\nIt turns left on Friendly Avenue, left on Church Street, and then left onto Lindsay Street."}, {"url": "https://www.wholehogsports.com/news/2020/apr/15/ua-hoops-set-to-add-to-the-mix-20200415/", "title": "UA hoops set to add to the mix", "authors": [], "date": "2020-04-15", "keywords": ["averaged", "tate", "guard", "hoops", "set", "state", "points", "add", "mix", "season", "ua", "shooting", "sign", "arkansas", "hogs"], "summary": "The Hogs are expected to sign graduate transfers forward Vance Jackson and guard Jalen Tate today.\nHe averaged 13.9 points, 5.4 rebounds and 3.6 assists as a redshirt junior and was the Horizon League Defensive Player of the Year.\nTwo of Arkansas' high school commitments, center Jaylin Williams and shooting guard Moses Moody plan to sign but have yet to set a date.\nHe averaged 11.6 points while shooting 60.1% from the field, 46.9% from three-point range and 82.1 % from the free-throw line this season.\n10 shooting guard and No."}, {"url": "https://patch.com/north-carolina/greensboro/greensboros-loose-leaf-collection-begins-november-12", "title": "Greensboro's Loose Leaf Collection Begins November 12", "authors": [], "date": "2019-11-05", "keywords": ["plastic", "collection", "greensboros", "leaves", "loose", "12", "yard", "city", "leaf", "begins", "white", "street"], "summary": "From the City of Greensboro:November 5, 2019Greensboro's Loose Leaf Collection Begins November 12The City's first round of loose leaf collection begins November 12 and ends December 23, subject to inclement weather delays.\nThe second collection begins December 27 and ends January 25, 2020.\nCheck the interactive map to find out where your neighborhood is on the leaf collection schedule.\nPut them at the curb in clear plastic bags or a plastic or metal garbage can on your regular trash collection day.\nResidents may purchase the compost for $20 per truckload at the White Street Landfill, 2503 White St., 336-373-7658."}, {"url": "https://triad-city-beat.com/the-triad-100-the-100-people-places-and-things-that-shaped-the-triad-in-2019/", "title": "The Triad 100: The 100 people, places and things that shaped the Triad in 2019", "authors": [], "date": "2019-12-26", "keywords": ["county", "things", "triad", "black", "shaped", "north", "high", "places", "winstonsalem", "2019", "city", "members", "greensboro", "school", "100"], "summary": "Triad City Beat delved into the case in 2019, although Fairbanks was arrested in early 2018.\nTriad City Beat broke the story, and it commanded the largest audience of any in 2019.\nAll four visited different locations in Greensboro from Bennett College and NC A&T University to Smith High School and Natty Greene’s.\nTriad City Beat wins awardsThe TCB team took home two national Altweekly Awards, awarded at the annual convention in July, both for political writing.\nBlack Panther PartyThe Winston-Salem Black Panther Party’s 50th year celebration in October was a bittersweet affair."}, {"url": "https://patch.com/north-carolina/greensboro/greensboro-city-closes-offices-facilities-thanksgiving-holiday", "title": "Greensboro City Closes Offices / Facilities For Thanksgiving Holiday", "authors": [], "date": "2019-11-14", "keywords": ["closes", "facilities", "water", "28", "center", "holiday", "29", "closed", "day", "offices", "city", "greensboro", "thanksgiving", "services"], "summary": "From the City of Greensboro:November 14, 2019Greensboro City Closes Offices / Facilities For Thanksgiving HolidayCity of Greensboro offices and facilities are closed Thursday, November 28, and Friday, November 29, in observance of Thanksgiving.\nThe Greensboro Sportsplex, Greensboro Cultural Center, City Arts, Adaptive and Inclusive Recreation, Greensboro Youth Council, Caldcleugh Multicultural Arts Center, Greensboro Beautiful and Greensboro Parks and Recreation administrative offices are closed November 28 and 29.\nCity cemeteries are open, but no services are allowed on Thanksgiving Day.\nBarber, Hester and Keeley parks are closed Thanksgiving Day only.\nCountry Park closes after the \"Gobbler Run\" for the remainder of Thanksgiving Day and re-opens Friday, November 29."}, {"url": "https://www.wral.com/coronavirus/coronavirus-coverage-in-north-carolina-april-6-2020-cumberland-infant-tests-positive/19043849/", "title": "Coronavirus coverage in North Carolina, April 6, 2020: Cumberland infant tests positive :: WRAL.com", "authors": [], "date": "2020-04-06", "keywords": ["county", "positive", "2020", "carolina", "cases", "officials", "north", "health", "coverage", "tests", "cumberland", "coronavirus", "wake", "masks", "covid19", "wralcom", "infant"], "summary": "— Here are the latest updates on the impact of the coronavirus outbreak in North Carolina and across the globe:What you need to know:At least 2,947 people in 91 North Carolina counties have tested positive for the coronavirus.\nAt least 44 people have died in North Carolina, and about 270 people are hospitalized.\n11:30 a.m.: Almost 2,900 people in North Carolina have been diagnosed with coronavirus, and 40 have died as of Monday.\nHe moved to North Carolina, where he joined Thomasville Furniture Industries and became president and CEO eight years later.\nMost towns along the North Carolina coast are closing beach access points, even parking lots to help keep people away from each other."}, {"url": "https://www.wfmynews2.com/article/news/politics/elections/election-day-results-nc-2019/83-188f5766-4d21-41ab-ac12-a450bc1e28db", "title": "Election Day 2019 | See Results, More WFMY News 2 Coverage", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated"], "date": "2019-11-05", "keywords": ["app", "wfmy", "day", "watch", "mayor", "yes", "election", "2019", "results", "youtube", "facebook", "challenger", "coverage"], "summary": "GREENSBORO, N.C. — Voters in several Triad cities and counties headed to the polls Tuesday on Election Day.\nDownload the WFMY News 2 App, tap on Election Results - Apple | Android2.\nClick on the Election Results tab on the WFMY News 2 site.\nWatch WFMY News 2!\nHOW TO WATCH COVERAGEStay on top of election results on social media and real-time coverage."}, {"url": "https://swimswam.com/2019-pro-swim-series-greensboro-day-3-finals-live-recap/", "title": "2019 Pro Swim Series – Greensboro: Day 3 Finals Live Recap", "authors": [], "date": "2019-11-09", "keywords": ["ledecky", "trials", "second", "season", "day", "recap", "200", "2019", "world", "finals", "live", "series", "greensboro", "pro", "free", "record", "swim"], "summary": "2019 USA SWIMMING PRO SWIM SERIES – GREENSBOROCatch Katie Ledecky aiming for 2-for-2 wins, taking the top seed in both the 200 free and 400 IM.\nAlso doing the FR/IM double is Jay Litherland, who will swim in the 200 free A-final and headline the men’s 400 IM.\nAlong with Litherland, watch out for the all-star clash of the prodigies and veterans in the men’s 200 free.\nLedecky’s winning time of 1:55.68 marks her fastest individual 200 free time of the entire year of 2019.\nFINA POINT LEADERSThe swimmer with the single best swim in FINA points for the full 2019-2020 Pro Swim Series will win the $10,000 prize – one for women and one for men."}, {"url": "https://www.wfmynews2.com/article/news/local/fall-festivals-haunted-attractions-pumpkin-patches-farms-hayrides-corn-mazes-nc/83-d8a34dc5-3117-44a1-a470-28778e9e82eb", "title": "It’s Fall Y'all! List of Fall Festivals, Spooky Attractions, Pumpkin Patches, Corn Mazes, Hayrides In North Carolina", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Am Edt September", "Updated", "Pm Edt October"], "date": "2019-09-26", "keywords": ["hayrides", "pumpkin", "spooky", "visit", "yall", "festival", "information", "north", "fun", "farm", "ncmore", "list", "fall", "festivals", "mazes", "patches", "includes"], "summary": "If you want your fall festival, haunted attraction, or farm to be featured send an email to webteam@wfmy.com Add Attn: Fall Event in the subject line.\nCORN MAZES, HAYRIDES, PUMPKIN PATCHESCornfield Maize Adventure (Archdale): 10-acre corn maze at Kersey Valley (1615 Kersey Valley Rd.)\nCheck It Out: Go Apple or Pumpkin Picking In The TriadJ.Razz and Tazz Farm: Includes pumpkin patch, cow train rides, corn maze, haunted forest hayrides, and farm equipment on display.\nFind out more by visiting McKee Cornfield MazeMillstone Creek Orchards (Ramseur): Includes pumpkin patch, pick your own apples, hayrides, cider mill, and more.\nBush-N-Vine Fall Farm (York): Pick your own pumpkin and enjoy Saturday hayrides."}, {"url": "https://myfox8.com/news/greensboro-police-on-scene-as-nc-at-state-university-warn-of-shooting-nearby/", "title": "Victim in critical condition after shooting near NC A&T State University", "authors": ["Hayley Fixler", "Nexstar Media Wire"], "date": "2019-11-07", "keywords": ["hayley", "condition", "myfox8", "state", "victim", "bop", "fixler", "huffman", "way", "hayleyfixlertv", "nc", "shooting", "university", "young", "street", "critical", "near"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- One person is in critical condition after a shooting on Huffman Street, right by North Carolina A&T, just before noon.\n\"Bop, bop, bop, bop.\nNow, he's planning on leaving Huffman Street to keep his family safe.\n@myfox8 pic.twitter.com/VBBwatrAZj — Hayley Fixler (@HayleyFixlerTV) November 7, 2019This crime scene stretches about a block.\nI’ve counted about 11 from my view point @myfox8 — Hayley Fixler (@HayleyFixlerTV) November 7, 2019Anyone with information is asked to contact Greensboro/Guilford Crime Stoppers at (336) 373-1000."}, {"url": "https://www.wect.com/2019/11/13/elton-john-will-return-nc-final-leg-farewell-tour/", "title": "Elton John will return to N.C. for final leg of farewell tour", "authors": ["Laurel Mallory", "Published Am At Am", "Published April", "At Pm"], "date": "2019-11-13", "keywords": ["sold", "leg", "tour", "2020", "john", "elton", "mark", "final", "nc", "worldwide", "farewell", "stop", "far", "return"], "summary": "Each stop of his worldwide tour has sold out so far in the first two years.\n2020 will mark the final year of his tour."}, {"url": "https://www.wfmynews2.com/article/news/local/veterans-day-2019-events-in-the-triad/83-d8b27b8c-c3e7-40bf-86bf-cfeda3542cce", "title": "LIST | Veterans Day 2019 Parades, Ceremonies in the Triad", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Est November", "Updated"], "date": "2019-11-07", "keywords": ["triad", "pmwhere", "war", "veterans", "day", "parade", "starting", "ceremonies", "parades", "list", "2019", "series", "honor", "street", "left"], "summary": "Info: The parade will honor veterans as well as active-duty personnel and Gold Star families of Guilford County.\nWinston-Salem Veterans Day ParadeWhen: Saturday, November 9 starting at 9 a.m.Where: Starting near Broad and Fourth streets.\nHigh Point Veterans Day ParadeWhen: Sunday, November 10- Starting at 3:00 p.m.Where: The parade will start along Main Street in downtown high Point.\nVeterans Day Service at Carolina Field of HonorWhen: Monday, November 11 starting at 11 a.m.Where: Carolina Field of Honor in KernersvilleInfo: The service will honor veterans past and present.\nAlamance County Veterans Day Parade and FestivalWhen: Saturday, November 9 from 9 a.m. to 5 p.m.Where: Downtown GrahamInfo: The event is sponsored by Alamance County Veterans group."}, {"url": "https://www.wfmynews2.com/article/news/local/small-business-saturday-in-the-triad/83-4060d796-ba64-4932-b004-d9633f8f20ac", "title": "Your guide to shopping on Small Business Saturday in the Triad", "authors": ["Author", "Laura Brache", "Published", "Am Est November", "Updated", "Pm Est November"], "date": "2019-11-29", "keywords": ["market", "business", "triad", "small", "25", "businesses", "book", "guide", "holiday", "9am", "shopping", "shop"], "summary": "According to American Express, on the Saturday after Thanksgiving communities encourage people to Shop Small and bring more holiday shopping to small businesses.\nSmall Business Saturday Shopping Specials at Wallburg Emporium & Coffee Shop, 9AM - 5PM: $1.00 off any coffee before noon, all-day specials throughout the store.\nBlack Friday & Small Business Saturday at Corks Caps & Taps, Nov. 29 from 3PM through Nov. 30.\nSmall Business Saturday at Kinnaman's Furniture, 9:30AM- 6PM: Entire purchase will be 10% off for the day only.\nSmall Business Saturday Shopping Event at Sentinel Commons, 10AM - 4PM: Join Fearless, Winston Salem Fashion Week, Sentinel Commons and 20+ vendors and designers for the nationwide Small Business Saturday at Sentinel Commons on 418 N. Marshall Street."}, {"url": "https://www.wfmynews2.com/article/news/local/restaurants-open-on-thanksgiving-day/83-c283e8a3-dd07-4ad4-a997-85732a57d81d", "title": "The 2019 LIST of Triad restaurants open on Thanksgiving day", "authors": ["Author", "Wfmy News Digital Team", "Brian Bennett", "Carrie Hodgin", "Wfmy News Digital", "Jaelen Gilkey", "Published", "Pm Est November", "Updated", "Am Est November"], "date": "2019-11-24", "keywords": ["restaurants", "stuffing", "triad", "southern", "salad", "turkey", "day", "sauce", "open", "2019", "list", "meal", "pie", "thanksgiving", "sweet"], "summary": "Dine-in with us on Thanksgiving Day and enjoy our delicious Three-Course Thanksgiving Meal!\nYou can choose between the turkey or ham option, two sides, bread, and dessert for $11.99Carolina's Diner, 5605 W Friendly Ave., GreensboroWill be open up until 3 pm Thanksgiving Day.\nOffering a Thanksgiving meal that includes turkey, stuffing, two vegetables, cranberry sauce, and your choice of pie (apple or cherry).\nThis meal is offered for $11.99 for adults and $5.99Cracker Barrel, All Triad LocationsOn Thanksgiving Day, Cracker Barrel will serve a special in-store Thanksgiving meal from 11 a.m. to close at all of its locations.\nGolden Corral, All Triad LocationsWill be open from 10 am-8 pm on Thanksgiving day."}, {"url": "https://spectrumlocalnews.com/nc/triad/news/2019/11/07/triad-native-competes-in-pro-swim-series-in-greensboro", "title": "Triad Native Competes in Pro Swim Series in Greensboro", "authors": ["Published Am Et Nov."], "date": "2019-11-07", "keywords": ["usa", "baker", "triad", "olympic", "swimmers", "team", "series", "greensboro", "pro", "tyr", "swim", "competes", "native"], "summary": "GREENSBORO, N.C. -- A Triad native competed in the 2019 TYR Pro Swim Series event at the Greensboro Aquatic Center.\nThe 2019 TYR Pro Swim Series is happening in Greensboro.\nToday is the first full day of competition here at the Greensboro Aquatic Center for the TYR Pro Swim Series.\nIt’s the first time the series featuring some of the world’s top swimmers has been in Greensboro.\nThe series attracts between 400-600 of the best swimmers in the world including USA National Swim Team members, USA Junior National Swim Team members, and top 50 world-ranked swimmers."}, {"url": "https://www.politico.com/magazine/story/2019/11/03/greensboro-massacre-white-nationalism-klan-229873", "title": "The Massacre That Spawned the Alt-Right", "authors": ["Bill Mahoney", "Josh Gerstein", "Madina Touré", "Shaun Assael", "Peter Keating"], "date": "2019-11-03", "keywords": ["altright", "carolina", "dawson", "north", "klansmen", "nazis", "griffin", "greensboro", "white", "massacre", "spawned", "klan", "covington"], "summary": "The Greensboro Massacre, as it became known, was the coming-out bloodbath for the white nationalist movement that is upending our politics today.\nLeft: Virgil Griffin speaks at a KKK rally at the North Carolina State Capitol in 1973.\nAnd Covington saw no one in the back-country klaverns of North Carolina capable of stepping into the void.\n| Greensboro History MuseumThe leftists had plausible reasons for choosing to organize and demonstrate in North Carolina.\nTwenty-six years after the massacre, Virgil Griffin surprised everyone at the Greensboro Commission by showing up and taking questions."}, {"url": "https://www.wfmynews2.com/article/news/local/coyotes-nc-october-november-sightings/83-a46dfe45-32a4-4d28-8445-6a9d013b95a1", "title": "Do you hear more howling? Coyotes love October, November", "authors": ["Author", "Wfmy News Digital Team", "Marissa Tansino", "Published", "Pm Edt October", "Updated"], "date": "2019-10-16", "keywords": ["wildlife", "wild", "howling", "hearing", "coyote", "humans", "hear", "travel", "love", "young", "pets", "coyotes", "seeing"], "summary": "If you think you're seeing and hearing more coyotes this month, it's because you are, according to NC Wildlife Resources Commission (NCWRC).\nWildlife officers say it is common for North Carolinians to report seeing and hearing coyotes more often in October and November.\nFall is the time of year when young coyotes, that were born in early spring, leave their parents’ territory to find a mate and establish their own territory, NCWRC says.\nHere's another wild fact: young coyotes often travel with their siblings during this time of year and can travel long distances--which is upward of 300 miles before settling down into their own territories!\nFortunately, hearing or seeing a coyote, even during the day, is usually no cause for alarm."}, {"url": "https://www.wfmynews2.com/article/news/local/halloween-trick-or-treating-delay-postpone-alternative-indoor-events-family-free-kids/83-f9b150d3-f215-423f-8049-d8d72aa85303", "title": "LIST | When Weather is Anything But a Treat, You Do Halloween the Day After", "authors": ["Author", "Alma Mccarty", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated", "Pm Edt November"], "date": "2019-10-30", "keywords": ["neighborhood", "park", "treat", "moved", "day", "1st", "trick", "weather", "list", "church", "greensboro", "trickortreating", "halloween"], "summary": "GREENSBORO, N.C. — Weather on Halloween was anything but a treat.\nHere's a list of the new dates and times Greensboro-area neighborhoods are hosting pose Halloween Day family fun events.\nSteeplegate Community's Trick or Treat Event: Trinity's Steeplegate community has moved their trick or treat to Friday night, November, 1st.\nKingsfield Forest in Archdale: Celebrations for Halloween moved to Friday, November 1.\nRELATED: Severe Weather Halts Lindley Park Trick-Or-Treating Until FridayThe new WFMY News 2 phone and tablet app boasts a modernized look and feel—download now."}, {"url": "https://www.wfmynews2.com/article/entertainment/kiss-end-of-the-road-greensboro/83-c0ba20c4-3d3f-4e94-b09b-54102415618e", "title": "KISS 'End of the Road' Farewell Tour Coming to Greensboro", "authors": ["Author", "Chris Venzon", "Wfmy", "Published", "Pm Est November", "Updated"], "date": "2019-11-14", "keywords": ["rock", "tour", "roll", "simmons", "greensboro", "coming", "road", "kiss", "york", "final", "end", "farewell"], "summary": "GREENSBORO, N.C. — Legendary rock 'n' roll band 'KISS' announced touring locations for the final leg of its 'End of the Road' World Tour.\nBassist/co-lead singer Gene Simmons, now 70 years old, has insisted this is the band's final farewell tour, despite other 'final' tours in the past.\nThe 'End of the Road' tour will finish nearly 20 years after the initial 'KISS Farewell' tour in 2000-01.\nPhoto by Theo Wargo/Getty ImagesThe 'End of the Road' tour began in January 2019 and will conclude July 21, 2021 in New York City.\nRELATED: Members Of KISS Offering Free Meals To TSA Workers During Government ShutdownRELATED: Kiss 'End of the Road' Farewell Tour Will Stop, Rock and Roll In North CarolinaRELATED: Holy Cow!"}, {"url": "https://www.wfmynews2.com/article/news/local/greensboro-suv-attack-meranda-chantel-watlington-fana-felton-court-crime/83-a71892b6-ae45-4a9f-892d-835aafd077f2", "title": "Deadly Greensboro SUV Assault: Accused Women Make Their First Court Appearance, Here’s What Happened", "authors": ["Author", "Laura Brache", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Edt October", "Updated", "Am Edt October"], "date": "2019-10-14", "keywords": ["accused", "victims", "women", "assault", "suv", "vehicle", "happened", "thats", "driving", "deadly", "greensboro", "attack", "heres", "appearance", "watlington", "court", "charged"], "summary": "GREENSBORO, N.C. — Two women, accused of First-Degree Murder in an SUV attack that killed a Greensboro woman, appeared in court.\nIt was revealed in court, Watlington has also been charged with Driving While Impaired (DWI), Felony Death by Motor Vehicle, Felony Hit-and-Run, Driving While License Revoked, and Failure to Reduce Speed.\nDuring Watlington’s first court hearing Monday, the victim’s father spoke to the court.\nRELATED: First Appearance: 2 Charged With Murder in Greensboro SUV Assault at Gas Station Have Day in CourtWatlington and Felton will appear in court again on November 14, 2019.\nRELATED: Accused Murderer's Mother on SUV Attack at Gas Station: 'Oh God!"}, {"url": "https://myfox8.com/your-local-election-hq/sen-elizabeth-warren-to-speak-at-nc-at-state-university-in-greensboro-on-thursday/", "title": "Sen. Elizabeth Warren to speak at NC A&T State University in Greensboro on Thursday", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-07", "keywords": ["warren", "hall", "elizabeth", "campaign", "carolina", "state", "greensboro", "nc", "south", "town", "university", "warrens", "sen", "speak", "stops"], "summary": "Sen. Elizabeth Warren (D-MA) acknowledges the crowd as she walks on stage to deliver remarks on the first day of the Democratic National Convention at the Wells Fargo Center, July 25, 2016 in Philadelphia, Pennsylvania.\n(Photo by Joe Raedle/Getty Images)GREENSBORO, N.C. — The presidential campaign trail will take U.S. Sen. Elizabeth Warren to Greensboro Thursday morning, according to Warren’s campaign.\nThe Democratic candidate has three days worth of campaign stops in the Carolinas slated for Thursday and Friday.\nAfter, she will head to Raleigh for a town hall, including U.S. Rep. Ayanna Pressley, at 6:30 p.m. at Needham B., Broughton High School.\nFriday, Warren stop in South Carolina for Mijente’s Latinx Town Hall El Chisme 2020 at noon, followed by the 2019 Presidential Forum on Environmental Justice set for 7 p.m. at South Carolina State University."}, {"url": "https://swimswam.com/how-to-watch-the-2019-pro-swim-series-greensboro-this-weekend/", "title": "How to Watch the 2019 Pro Swim Series – Greensboro This Weekend", "authors": [], "date": "2019-11-06", "keywords": ["timed", "weekend", "usa", "usaswimmingorg", "swimming", "watch", "nbc", "2019", "finals", "session", "series", "greensboro", "pro", "swim", "eastern"], "summary": "2019 USA Swimming Pro Swim Series – GreensboroNovember 6th-9th, 2019Greensboro Aquatic Center, Greensboro, North Carolina50m (LCM)Prelims at 9:00AM Eastern Time/Finals at 6:00PM Eastern Time (4:00 Eastern for Wednesday timed finals)Live ResultsPsych SheetsNBC and USA Swimming will continue their strategy of splitting the webcast between two different feeds this week in Greensboro as they kick off the 2019-2020 Pro Swim Series.\nThe one exception is Thursday, November 7th, where the full finals session will be watchable on USASwimming.org.\nBecause NBC is not televising that session, there is no need to split the stream.\nThe finals sessions for Friday and Saturday (November 7th and 8th) will be televised, with Friday airing on the Olympic Channel and Saturday on NBC Sports.\nThe full coverage schedule, both on television and on the internet, is below:"}, {"url": "https://swimswam.com/tickets-on-sale-for-tyr-pro-swim-series-in-greensboro/", "title": "Tickets on Sale for Pro Swim Series in Greensboro", "authors": [], "date": "2019-10-04", "keywords": ["sale", "olympic", "national", "tickets", "2020", "events", "team", "series", "greensboro", "pro", "tyr", "swim"], "summary": "Courtesy: USA SwimmingCOLORADO SPRINGS, Colo. – With an exciting 2019-2020 swim season just around the corner, tickets are now on sale for the first TYR Pro Swim Series stop in Greensboro, N.C.\nHeadlining the opening event of the 2020 TYR Pro Swim Series is six-time Olympic medalist Katie Ledecky (Bethesda, M.d./Stanford Swimming/Alto Swim club).\nLedecky claimed 10 TYR Pro Swim Series victories in 2019, the most of any female competitor and also good for the top record by a female since 2015.\nGreensboro also marks the first of five stops on the 2020 TYR Pro Swim Series calendar, which features trips to Knoxville, Tenn., Des Moines, Iowa, Mission Viejo, Calif. and Indianapolis, Ind.\nFor more information on the TYR Pro Swim Series at Greensboro, visit usaswimming.org."}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/weather-stories/2019/09/26/drought-conditions-spread-across-north-carolina", "title": "Drought Conditions Spread across North Carolina", "authors": ["Published Am Et Sep."], "date": "2019-09-26", "keywords": ["drought", "carolina", "state", "crops", "north", "driest", "month", "spread", "conditions", "rain", "dry"], "summary": "The latest drought monitor released Thursday shows much of North Carolina from the mountains to near Raleigh is either under abnormally dry or moderate drought conditions.\nMost of the rain that has fallen in the state during the month of September came from Hurricane Dorian.\nThat is keeping eastern North Carolina out of drought conditions for now.\nIn the most recent weekly crops report, several county extension offices noted the dry conditions are taking on toll on crops including soybeans, hay, and tobacco.\nOnly very small rain chances are in the forecast across the state for the rest of the month."}, {"url": "https://www.rhinotimes.com/news/2019-nc-folk-festival-sets-new-attendance-record/", "title": "2019 NC Folk Festival Sets New Attendance Record", "authors": ["John Hammer"], "date": "2019-10-23", "keywords": ["folk", "event", "sets", "festival", "threeday", "hosted", "record", "nc", "attendance", "2019", "artists", "performing", "greensboro"], "summary": "The North Carolina Folk Festival announced another record-breaking year.\nThe estimate is that 156,000 people attended the NC Folk Festival in 2019.\nFor three years Greensboro hosted the American Folk Festival, which moves every three years.\nSo, in 2018, the NC Folk Festival was created and for attendance to increase in the second year, means the NC Folk Festival is headed in the right direction.\nThere were 106 separate performances and workshops over the three-day festival with more than 45 different artists performing at five outdoor stages and nine indoor venues."}, {"url": "https://patch.com/north-carolina/charlotte/fall-foliage-peak-map-2019-when-autumn-leaves-are-best-nc", "title": "Fall Foliage Peak Map 2019: When Autumn Leaves Are Best In NC", "authors": [], "date": "2019-08-30", "keywords": ["park", "prediction", "leaves", "autumn", "angotti", "state", "peak", "color", "foliage", "nc", "2019", "fall", "best", "map"], "summary": "You can't know precisely, but there's a handy tool to help you plan excursions when fall foliage should be at its most spectacular.\nThe Fall Foliage Prediction Map, found on the Smoky Mountain National Park website, includes predictions not just for the Smokies, which rise above the Tennessee-North Carolina border, but for all 50 states.\n\"Our nationwide fall foliage prediction map is unique — it is one of the only fall leaf tools that provides accurate predictions for the entire continental United States.\"\nThe major factors that determine the fall foliage peak are sunlight, precipitation, soil moisture and temperature.\nWhere To Find The Best Fall ColorAngotti and his team monetize the Fall Foliage Prediction Map with Smoky Mountain cabin rentals."}, {"url": "https://myfox8.com/news/suspect-shot-by-police-officer-after-pursuit-crash-on-business-85-in-greensboro/", "title": "Suspect shot by police officer after pursuit, crash on Business 85 in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-11-20", "keywords": ["85", "crash", "business", "word", "wayne", "pursuit", "truck", "shot", "officer", "north", "road", "officers", "suspect", "greensboro"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A suspect was shot in an officer-involved shooting in Greensboro on Wednesday afternoon, according to Police Chief Wayne Scott.\nAt 3:30 p.m., officers saw a truck speeding on Business 85 North and attempted a traffic stop.\nThe truck crashed on Business 85 North near the Randleman Road exit.\nAn officer got out of his patrol vehicle and ran toward the median where the truck had crashed.\nScott said the suspect then pulled out a gun and fired at the officer."}, {"url": "https://myfox8.com/news/woman-identified-after-killed-by-impaired-driver-in-greensboro-police-say/", "title": "Woman identified after killed by impaired driver in Greensboro, police say", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2019-11-07", "keywords": ["mobile", "crime", "impaired", "stoppers", "road", "woman", "driving", "say", "killed", "tip", "submit", "greensboro", "identified", "burlington", "driver"], "summary": "GREENSBORO, N.C. — Police have identified the woman who died after she was hit by a car in Greensboro.\nAt about 6:58 p.m. Wednesday, police responded to a fatal crash on the 3800 block of Burlington Road, according to a news release.\nPolice say Kenneth Hodge, of Gibsonville, was driving a 2008 Hyundai Elantra east on Burlington Road, from Penry Road, when he crashed into 51-year-old Virginia Reid, of Greensboro, in the outside through lane of Burlington Road.\nAnyone with information is asked to contact Greensboro/Guilford Crime Stoppers at (336) 373-1000.\nYou can also download the mobile P3tips app for Apple or Android phones to submit a mobile tip or go to P3tips.org to submit a web tip."}, {"url": "https://theacc.com/news/2019/11/29/north-carolina-advances-to-ncaa-womens-soccer-college-cup.aspx", "title": "North Carolina Advances to NCAA Women’s Soccer College Cup", "authors": [], "date": "2019-11-29", "keywords": ["ncaa", "goal", "ucla", "cup", "carolina", "advances", "state", "match", "north", "college", "womens", "soccer"], "summary": "Women's Soccer November 29, 2019 North Carolina Advances to NCAA Women’s Soccer College CupGREENSBORO, N.C. (theACC.com) – For the 15th consecutive year, the Atlantic Coast Conference will be represented at the NCAA Women’s Soccer College Cup as the North Carolina Tar Heels earned a 3-2 win against Southern California Friday night at Dorrance Field.\nThe College Cup (Final Four) is set for Friday, Dec. 6 and Sunday, Dec. 8, at Avaya Stadium in San Jose, California, home of the San Jose Earthquakes of Major League Soccer.\nNorth Carolina is appearing in the NCAA College Cup for the 29th time in program history and second consecutive after finishing as the runner-up last year.\nThe ACC has had at least one team advance to the College Cup in 37 of the 38 years of the tournament’s existence.\nNorth Carolina 3, USC 2 – Dorrance Field (Chapel Hill, N.C.)Southern California struck first with a goal in the 16th minute, the first goal that North Carolina allowed in the NCAA Championship."}, {"url": "https://www.swimmingworldmagazine.com/news/tyr-pro-swim-series-tickets-on-sale-for-greensboro-stop-in-november/", "title": "TYR Pro Swim Series Tickets on Sale For Greensboro Stop in November", "authors": [], "date": "2019-10-04", "keywords": ["sale", "tickets", "pro", "series", "greensboro", "stop", "tyr", "swim"], "summary": ""}, {"url": "https://patch.com/north-carolina/greensboro/uncg-mens-basketball-begin-play-spartan-invitational", "title": "UNCG Men's Basketball To Begin Play In The Spartan Invitational", "authors": [], "date": "2019-11-12", "keywords": ["mens", "invitational", "spartans", "begin", "games", "basketball", "spartan", "state", "vs", "averett", "unc", "greensboro", "uncg", "play"], "summary": "From UNC Greensboro Athletics:November 10, 2019UNCG Men's Basketball To Begin Play In The Spartan InvitationalGREENSBORO, N.C. – UNC Greensboro men's basketball will host four games during an eight-day span for the Spartan Invitational, beginning Monday night with a tilt against Averett.\nWho: AverettWhere: Greensboro Coliseum | Greensboro, N.C.\nWhen: Monday, Nov. 11 | 7 p.m.Five Facts To Know-- For the second time in three years, the Spartans will host a tournament in Greensboro as UNCG will face Averett, Tennessee Tech, Montana State and Appalachian State over the next week in the Spartan Invitational-- Including last Tuesday's 33-point victory over North Carolina A&T, UNCG is now 32-3 in its last 35 home games-- UNCG enters the matchup with Averett with a 1-1 record, as the Spartans knocked off the Aggies in the opener before falling to No.\nThis press release was produced by UNC Greensboro Athletics.\nThe views expressed here are the author's own."}, {"url": "https://www.news-journalonline.com/sports/20191116/b-cu-falls-to-north-carolina-at-47-17", "title": "B-CU falls to North Carolina A&T, 47-17", "authors": ["Special To The News-Journal"], "date": "2019-11-16", "keywords": ["4717", "wildcats", "second", "sims", "carolina", "quarter", "yards", "north", "run", "bcu", "robinson", "scored", "falls", "play"], "summary": "Martin scored on a 66-yard run on the Aggies' second play from scrimmage and on a four-yard run shortly after a Wildcat (6-4,4-3) turnover.\n\"We felt like we had energy and a good game plan together, we just didn't execute offensively,\" said B-CU coach Terry Sims.\nAfter William Simpson's 6-yard run gave the Aggies a 20-0 lead on the first play of the second quarter, B-CU started to show signs of life.\n\"We weren't calling anything differently,\" Sims said about the second quarter.\nB-CU found some momentum when Eric Alford blocked North Carolina A&T's third point-after attempt and Davonte Lawrence made a long return."}, {"url": "https://www.wfmynews2.com/article/news/local/lidi-greensboro-new-store-opening/83-4cceb8cf-addc-4a4e-be28-e5f83edb2fc2", "title": "Lidl Opens in Greensboro, And You Could See Prices Drop at Nearby Stores", "authors": ["Author", "Callie Clendenin", "Published", "Pm Edt October", "Updated", "Pm Est November"], "date": "2019-10-29", "keywords": ["stores", "lidl", "drop", "wfmy", "coming", "store", "prices", "wont", "nearby", "greensboro", "grocery", "near", "opens"], "summary": "A new Lidl store just opened in Greensboro.\nA study from the University of North Carolina found that grocery stores located near Lidl food markets dropped their prices for individual products by as much as 55 percent.\nThe Greensboro store is Lidl’s fifth in the Triad.\nOTHER STORIESRELATED: Lidl Hiring up to 100 Positions for its Distribution Center in MebaneRELATED: Is Lidl Coming To Eden?\nRELATED: New Lidl Store Coming To Greensboro, 5 Other Stores To Open In NCRELATED: Lidl Stores Impacting What You Pay for Groceries, According to StudyThe new WFMY News 2 phone and tablet app boasts a modernized look and feel—download now."}, {"url": "https://www.rhinotimes.com/news/greensboro-loves-parks-and-recreation/", "title": "Greensboro Loves Parks And Recreation", "authors": ["John Hammer"], "date": "2019-11-02", "keywords": ["recreation", "loves", "greensboros", "does", "category", "parks", "compared", "cost", "greensboro", "raleigh", "cities"], "summary": "The Greensboro Parks and Recreation Department has won a passel of awards and the Greensboro City Council never misses a chance to brag about the successes of the department.\nSo how does the Greensboro Parks and Recreation Department do when compared to the parks and recreation departments in 12 other cities in the state?\nSo it’s not that Greensboro has a whole bunch of little parks but has more parks and bigger parks.\nNot only does Greensboro compare favorably in facilities, Greensboro provides parks and recreation services at a lower cost.\nThe average cost per capita for parks and recreation of the 13 cities in the study is $104 and Greensboro’s cost is $61."}, {"url": "https://www.pgatour.com/news/2020/04/16/pga-tour-schedule-adjustments-2019-2020-fedexcup-season-2020-2021-regular-season-coronavirus.html", "title": "PGA TOUR announces schedule adjustments for remainder of 2019-20 FedExCup season, releases fall portion of 2020-21 PGA TOUR Regular Season schedule", "authors": [], "date": "2020-04-16", "keywords": ["tour", "portion", "championship", "scheduled", "events", "club", "fedexcup", "open", "season", "schedule", "remainder", "releases", "fall", "regular", "golf", "originally", "pga"], "summary": "With additional time needed to ensure PGA TOUR tournaments are staged in the most safe and responsible manner possible given the ongoing COVID-19 crisis, the PGA TOUR is announcing further schedule modifications for the remainder of the 2019-20 season, as well as plans for the opening portion of the 2020-21 PGA TOUR Regular Season, the restart of the 2020 Korn Ferry Tour season and updates regarding the Mackenzie Tour – PGA TOUR Canada schedule.\n“The health and safety of all associated with the PGA TOUR and our global community continues to be our No.\nAs such, the TOUR will continually review available COVID-19-related protocols that could be implemented at PGA TOUR events to ensure the health and well-being for all involved.\nMackenzie Tour – PGA TOUR CanadaThe Mackenzie Tour – PGA TOUR Canada is postponing the first six scheduled events of its 2020 season.\nPGA TOUR Champions, PGA TOUR Latinoamérica and PGA TOUR Series-ChinaInformation regarding PGA TOUR Champions and the PGA TOUR’s other two International Tours, in Latin America and China, will be announced in the coming weeks."}, {"url": "https://www.highschoolot.com/ben-l-smith-forward-silas-mason-picks-up-offer-from-north-carolina-a-t/19042917/", "title": "Ben L. Smith forward Silas Mason picks up offer from North Carolina A&T", "authors": ["Zack Adams", "Highschoolot Reporter"], "date": "2020-04-05", "keywords": ["offer", "mason", "forward", "picks", "carolina", "state", "second", "ben", "north", "small", "l", "received", "player", "silas", "smith", "senior", "team", "points"], "summary": "— Ben L. Smith small forward Silas Mason received a scholarship offer from North Carolina Agriculture and Technical State University on Saturday night, per his Twitter account.\nThe Aggies are the 21st school to extend an opportunity to Mason for his services at the next level.\nOther notable institutions showing interest in the small forward are Appalachian State, Charlotte, East Carolina, Elon, Florida, Georgetown, Houston, Kansas State, Oklahoma State, Providence, Texas, UNC-Greensboro, and UNC-Wilmington.\nBen L. Smith went 21-8 overall in its 2019-20 campaign, while going 7-3 in a very competitive Piedmont Triad Conference.\nMason received many accolades for his efforts as a senior."}, {"url": "https://www.wfmynews2.com/article/news/local/north-carolina-weather-triad-in-review-2019/83-c0eed131-1182-4c64-8452-18f346d5e072", "title": "It's gotta be 'North Carolina weather!' A year of Triad Weather; 2019 in Review", "authors": ["Author", "Christian Morgan", "Wfmy", "Published", "Pm Est December", "Updated"], "date": "2020-01-01", "keywords": ["sticking", "triad", "gotta", "carolina", "days", "north", "hurricane", "morning", "2019", "wet", "review", "weather", "came"], "summary": "GREENSBORO, N.C. — As we bring 2019 to a close, looking back it was quite a busy year for weather in the Triad.\nWe tied records, broke records, and set new ones too; not that you’d expect anything different from a year in North Carolina weather, right?\nWFMY’s Christian Morgan said one of those days came in November and was record setting; Nov 13.\nWFMYAnd, there was only one Hurricane of the 2019 season to make landfall in North Carolina.\nThose are just some highlights for the year, because well…you know…North Carolina weather."}, {"url": "https://www.wfmynews2.com/article/weather/remembering-greensboro-snow-2018-piedmont-triad/83-c0014153-1a99-4b45-ac8a-4375c7a3e4b0", "title": "It was a big snowstorm! Remembering the 2018 snowstorm", "authors": ["Author", "Christian Morgan", "Wfmy", "Published", "Pm Est December", "Updated"], "date": "2019-12-10", "keywords": ["snowstorm", "triad", "remembering", "snow", "2018", "snowiest", "storm", "day", "record", "weather", "greensboro", "number", "big"], "summary": "The storm closed schools for a week and caused more than 200,000 power outages across the state of North Carolina.\nIt was a big storm!\nThe number one snowiest day on record for Greensboro was in March 1927 with 20\", and number two was in December 1930 with a little over 14\".\nSince that big snow, we haven't had any accumulating snow in the Triad.\nRELATED: RECORD SNOW | Third Snowiest 'One Day' In Greensboro HistoryWFMYVERIFY: Can The Triad Get A Lot of Snow In March, April?"}, {"url": "https://www.wfmynews2.com/article/entertainment/christmas-events-list-parades-ice-skating-tree-lightings-holidays-greensboro-winston-salem-nc/83-2f706732-287a-4c15-b3f1-f4cea9adbaec", "title": "CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, and More!", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated", "Am Est December"], "date": "2019-11-19", "keywords": ["lights", "pmwhere", "events", "holiday", "parade", "jamestown", "2019", "parades", "nc", "greensboro", "santa", "christmas", "details"], "summary": "CHRISTMAS PARADESJamestown Christmas ParadeWhat: It’s all about a holiday good time at the Jamestown Christmas Parade!\nWhen: December 1 at 3:00 p.m.Where: Main StreetMore Details: Jamestown Christmas ParadeSights and sounds of the 2019 Jamestown Parade:PHOTOS | Jamestown Christmas ParadePHOTOS | Check Out the 2019 Jamestown Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas ParadeLexington Christmas ParadeWhat: Christmas is Uptown Lexington!\nWhen: Saturday, December 7 at noon(rain or shine)Where: Starts on North Greene Street in GreensboroMore Details: Holiday Parade Route MapWinston-Salem Jaycees Holiday ParadeWhat: Come to downtown Winston-Salem for the 29th Annual Winston-Salem Jaycees Holiday Parade.\nMore Details: Winston-Salem Jaycees Holiday ParadeHigh Point Holiday Festival ParadeWhat: Get into the Holiday spirit with the High Point Holiday Festival Parade!\nMore Details: High Point ParadeBurlington Christmas ParadeWhat: Oh, what fun it is to be at the Burlington Christmas Parade!"}, {"url": "https://patch.com/north-carolina/greensboro/city-greensboro-announces-holiday-closings", "title": "City Of Greensboro Announces Holiday Closings", "authors": [], "date": "2019-12-16", "keywords": ["2020", "25", "center", "26", "greensboro", "holiday", "closed", "city", "24", "31", "announces", "service", "closings"], "summary": "The following services and facilities will operate on a holiday schedule:There are no trash and recycling collections on Wednesday, December 25.\nThe Greensboro Public Library system and the Greensboro History Museum will be closed Tuesday, December 24 through Thursday, December 26, as well as Wednesday, January 1, 2020.\nThe Greensboro Cultural Center closed at 6 pm on Monday, December 23 and is closed Tuesday, December 24 through Thursday, December 26.\nCity lakes, including Brandt, Higgins and Townsend are closed Tuesday, December 24 through Thursday, December 26, and Wednesday, January 1.\nThis press release was produced by the City of Greensboro."}, {"url": "https://myfox8.com/news/charges-filed-after-fatal-2019-crash-in-greensboro/", "title": "Charges filed after fatal 2019 crash in Greensboro", "authors": ["Digital Desk", "Nexstar Media Wire"], "date": "2020-01-23", "keywords": ["fatal", "filed", "crash", "unsecured", "touring", "silver", "videogreensboro", "west", "nissan", "watch", "vehicle", "2019", "charges", "greensboro", "victory", "yield"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Charges have been filed in connection with a fatal December 2019 crash, according to a news release from Greensboro police.\nOn Dec. 28 at 6:06 p.m., officers came to West Gate City Boulevard and High Point Road.\nA silver 2017 Nissan Murano and a black 2005 Victory Touring motorcycle collided in the intersection.\nThe motorcyclist, Bengy Christopher Austin, died from his injuries on Jan. 11.\nOn Thursday, the driver of the Nissan, identified as Fatou Gueye, was charged with misdemeanor death by motor vehicle and failure to yield causing serious injury."}, {"url": "https://www.wfmynews2.com/article/traffic/new-greensboro-urban-loop-i-840-to-open-traffic/83-ba29c9a3-3503-4a69-9708-89ee5bb86d2b", "title": "New Section Of I-840 Urban Loop To Open In December", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated"], "date": "2019-11-07", "keywords": ["ncdot", "portion", "lawndale", "open", "loop", "i840", "elm", "battleground", "greensboro", "avenue", "urban"], "summary": "GREENSBORO, N.C. — The North Department of Transportation (NCDOT) plans to open another big section of the Greensboro I-840 Urban Loop in December.\nThe portion of the loop will open on December 31, 2019.\nGovernor Roy Cooper attended a ribbon-cutting Thursday in Greensboro for the new section of I-840 between Battleground Avenue and Lawndale Drive.\nThe other section of the Urban Loop is divided into two phases including the portion of Lawndale to Elm, and Elm to Highway 29.\nOTHER URBAN LOOP STORIESRELATED: As Greensboro Urban Loop Inches Toward Completion, Neighbors Complain Of Near-Constant NoiseRELATED: Urban Loop Noise Wall Replaces Townhome Parking Lot Creating A Big Problem For Greensboro NeighborhoodRELATED: Greensboro Urban Loop Impacting WildlifeRELATED: Construction On Greensboro Urban Loop To Start Near Lake JeanetteRELATED: Urban Loop | Some Greensboro Homeowners Face New Reality Of Bare Backyards, NoiseRELATED: Engineers Reveal Plan To Widen Section of Battleground Avenue in GreensboroRELATED: Greensboro Urban Loop Work Moving Faster Than ExpectedRELATED: Clearing The Way For The Greensboro Urban LoopRELATED: Neighbors Dealing With Red Dust from Greensboro Road ConstructionThe new WFMY News 2 phone and tablet app boasts a modernized look and feel—download now."}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/weather-stories/2020/01/13/when-will-north-carolina-s-snow-drought-end-", "title": "When Will North Carolina's Snow Drought End?", "authors": ["Published Pm Et Jan."], "date": "2020-01-13", "keywords": ["winter", "drought", "snow", "records", "trace", "winters", "north", "measurable", "weather", "end", "11", "reported", "dating", "carolinas"], "summary": "Outside of the mountains, most of the rest of the state did not see any measurable snow in 2019.\nDuring that time, there have been only 11 winters where there was no measurable snow reported.\nDuring that time, there have been only 11 winters where there was no measurable snow reported.\nDuring that time, there have been only six winters where there was no measurable snow reported.\nDuring that time, there have been only 11 winters where there was no measurable snow reported."}, {"url": "https://www.wfmynews2.com/article/life/holidays/christmas-events-in-north-carolina-holidays/83-5cc1473a-fd6c-4831-b18e-f3c4d6229eec", "title": "Christmas In North Carolina! 2019 List of Holiday Events Across The State", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated"], "date": "2019-11-26", "keywords": ["lights", "carolina", "state", "events", "north", "holiday", "ride", "2019", "season", "list", "town", "train", "santa", "christmas", "details"], "summary": "Celebrate the holiday season by making a new Christmas tradition and escaping to check out these lavish holiday light displays!\nHere’s a list of events happening in North Carolina from now until Christmas that will add some magic to the holiday season!\nSpecial events include the annual Christmas Town 5K on Nov. 30 and the Christmas Town Festival on Dec. 12.\nMore Details: Christmas Town USAChristmas Town USAVisit NCNORTH CAROLINA HOLIDAY FLOTILLANov. 29-30, 2019, Wrightsville BeachWilmington and other nearby beaches launch the holiday season with a boat parade on the Intracoastal Waterway.\nMore Details: Find out about ticket prices and moreOTHER HOLIDAY STORIESRELATED: CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, And More!"}, {"url": "https://www.wfmynews2.com/article/news/local/new-nc-laws-death-by-distribution-ride-share-sex-abuse-no-means-no/83-c0b9a59f-3a8f-47dd-b276-63bca4ccd675", "title": "30 new or amended NC laws in effect as of December 1, 2019", "authors": ["Author", "Associated Press", "Published", "Pm Est December", "Updated"], "date": "2019-12-02", "keywords": ["sexual", "changes", "criminal", "30", "effect", "law", "assault", "child", "adult", "amended", "nc", "2019", "laws", "abuse", "young", "court"], "summary": "RALEIGH, N.C. — Significant changes to North Carolina’s justice system for young offenders and sex-related offenses begin this weekend.\nNo longer will 16- and 17-year-olds be automatically tried in adult court for most nonviolent or less serious felonies as the state’s long-awaited “Raise the Age” initiative takes effect.\nThese changes are among about 30 state laws passed or amended this year that will be enforced starting Sunday.\nMotor-vehicle cases will remain in adult court.\nAdvocates for sexual assault victims and prevention had sought the changes for years, saying the consent restriction created a loophole that made prosecution difficult."}, {"url": "https://patch.com/north-carolina/greensboro/uncg-2019-20-track-field-schedule-announced", "title": "UNCG 2019-20 Track & Field Schedule Announced", "authors": [], "date": "2019-12-06", "keywords": ["invitational", "spartans", "compete", "va", "jdl", "outdoor", "201920", "track", "announced", "high", "season", "schedule", "unc", "field", "uncg"], "summary": "From UNC Greensboro Athletics:December 3, 2019GREENSBORO, N.C. – The UNC Greensboro 2019-20 indoor/outdoor track & field schedule has been finalized, Coach Pearson announced Monday.\n\"Overall, we are very excited about our upcoming 2019-20 indoor schedule along with our 2020 outdoor schedule,\" said Pearson.\nOUTDOORTo open the outdoor season, UNC Greensboro will head to the coast for the Seahawk Invitational in Wilmington, N.C. (March 13-14).\nThe 2019-20 SoCon Outdoor Track & Field Championships take place May 2-3 in Birmingham, Ala.\nThe outdoor season will wrap up at the NCAA Division I Championships, held June 10-13 in Austin, Texas."}, {"url": "https://patch.com/north-carolina/greensboro/calendar/event/20191220/712359/awake-the-white-wintry-queen", "title": "Awake The White & Wint'ry Queen", "authors": ["Added Allen Gottfried"], "date": "2019-11-30", "keywords": ["winter", "concert", "vocalists", "theatrical", "video", "awake", "queen", "wintry", "weave", "updated", "white", "traverse"], "summary": "“Awake the White & Wint’ry Queen” - A Concert Event for the Winter Solstice, spans melodic moods from quietly contemplative, to dramatically riveting!\nThe show builds in momentum, featuring moments of grand spectacle, as we traverse the longest night of the year, embracing the joyous return of the light.\nThe concert experience comes alive with seven principal vocalists, dance performances that weave gracefully through the storyline, and original video elements that play backdrop to the action.\nA smash hit with diverse audiences in its initial run, this updated production for 2019 will captivate and delight music-lovers and theatrical aficionados, alike."}, {"url": "https://www.fox61.com/article/news/i-wasnt-going-down-without-a-fight-north-carolina-mom-fights-back-against-alleged-carjacker/520-3a17e390-b014-464f-ae38-22b559b50565", "title": "‘I wasn’t going down without a fight’: North Carolina mom fights back against alleged carjacker", "authors": [], "date": "2019-12-20", "keywords": ["going", "man", "car", "davis", "carolina", "north", "carjacker", "fights", "parked", "mom", "alleged", "wasnt", "shopping", "fight", "wghp", "center", "passenger", "greensboro", "thought"], "summary": "GREENSBORO, N.C. (WGHP) — Jamie Davis says she parked her car at Oakcrest Shopping Center in Greensboro, North Carolina moments before a man approached he...GREENSBORO, N.C. (WGHP) -- Jamie Davis says she parked her car at Oakcrest Shopping Center in Greensboro, North Carolina moments before a man approached her window.\n“[He] puts the gun right to my face and says, ‘You’re going with me.’ And my first instinct was to push the gun away,” she said.\nShe ran into the nearby Cat Clinic in the shopping center, and asked employees to lock the door and call 911.\nHer SUV sustained damage to the passenger side and Davis said her cellphone had been thrown onto the side of the road.\n“I never thought it would happen to me, I never thought it would happen to anyone I know, and it did,” she said."}, {"url": "https://www.wfmynews2.com/article/news/crime/greensboro-south-holden-shooting/83-eb740cf2-7078-46d2-a2cf-827907de21fb", "title": "Greensboro ties city record for homicides in a year with 44th fatal shooting of 2019", "authors": ["Author", "Thomas Robinson", "Chris Venzon", "Wfmy", "Published", "Pm Est December", "Updated"], "date": "2019-12-18", "keywords": ["homicides", "fatal", "44th", "problem", "parrish", "ties", "gun", "violence", "city", "record", "2019", "holden", "south", "shooting", "greensboro", "richey"], "summary": "GREENSBORO, N.C. — Police are investigating a deadly shooting on South Holden Road Wednesday afternoon.\nThe homicide is the 44th in Greensboro, North Carolina this year, tying the all-time city record for murders in a single year, set earlier in 2017.\nPolice then closed off South Holden from Patterson Street to West Florida Street and began their investigation.\nThe gun violence problem in Greensboro is not simply a police problem,\" Richey said, \"It is a community problem that we've got to focus on as a holistic approach within the community.\"\nDisabled man killed, found behind home: Police16-year-old son charged in shooting death of his mother, bond set at $1 million21-year-old dies following shooting in Greensboro"}, {"url": "https://myfox8.com/news/person-sent-to-hospital-after-reported-shooting-on-brown-boulevard-in-greensboro/", "title": "Authorities search for gunmen after man shot, killed outside his house in Greensboro", "authors": ["Digital Desk", "Daniel Pierce", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-04", "keywords": ["authorities", "man", "event", "house", "zion", "scene", "shot", "outside", "gun", "violence", "gunmen", "awareness", "killed", "shooting", "responded", "greensboro", "reported", "search"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A man is dead after a shooting in Greensboro, according to police.\nAt about 10:59 a.m., officers responded to a reported shooting on the 1400 block of Brown Boulevard, near the intersection with Joe Louis Avenue.\nA “Youths Against Gun Violence” program will be held at Mount Zion Church of God in Greensboro.\nThe program is described as one “to increase the awareness of gun violence in our city and its impact on families and our communities.\n“Can we just do something to increase the awareness, people’s awareness of this."}, {"url": "https://myfox8.com/news/police-investigating-after-3-people-shot-on-lynhaven-drive-in-greensboro/", "title": "Homicide investigation underway after 1 killed, 2 injured in Greensboro shooting", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-13", "keywords": ["word", "victims", "residence", "investigation", "taken", "videogreensboro", "shooting36072635", "watch", "underway", "homicide", "killed", "shooting", "greensboro", "injured", "victim", "woundsone"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Greensboro police are investigating after a fatal shooting on Thursday night.\nOfficers were called to the 3500 block of Lynhaven Drive at 7:34 p.m.Officers found three victims, two inside a residence and one outside the residence, with gunshot wounds.\nOne victim was pronounced dead at the scene and two were taken to the hospital, one with critical injuries and the other with non-life-threatening injuries.\nThere is no word on what led up to the shooting.\n36.072635 -79.791975"}, {"url": "https://myfox8.com/news/raise-the-age-law-takes-effect-december-1-in-north-carolina/", "title": "Raise the Age law takes effect December 1 in North Carolina", "authors": ["Tess Bargebuhr", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-11-25", "keywords": ["explained", "district", "effect", "individuals", "carolina", "law", "raise", "manager", "frank", "takes", "north", "officers", "age", "juveniles", "facility", "juvenile"], "summary": "Please enable Javascript to watch this videoOn Dec. 1, officers and deputies across North Carolina will be able to charge non-violent offenders age 16 and 17 as juveniles as Raise the Age legislation takes effect.\nDavidson County District Attorney Garry Frank serves as co-chair of the Juvenile Jurisdiction Advisory Committee.\nAs the state prepares for the shift, Frank explained that the committee has been making recommendations for additional funding.\n“One of the most significant things is the extra juvenile justice officers and cars and facilities,” he said.\nFrank said deputies and officers, along with court staff, have been undergoing training to prepare for the change."}, {"url": "https://myfox8.com/news/man-shot-killed-in-greensboro-identified-police-begin-homicide-investigation/", "title": "Man shot, killed in Greensboro identified; police begin homicide investigation", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-15", "keywords": ["man", "investigation", "begin", "shot", "information", "garden", "officers", "homicide", "killed", "shooting", "responded", "greensboro", "young", "street", "identified", "wound"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- The man who was shot and killed in Greensboro Sunday morning has been identified and police are investigating the shooting as a homicide, according to a Greensboro Police Department news release.\nAt 3:39 a.m., officers responded to the 1800 block of Spring Garden Street when they were told about a man lying in the road.\nChaunci Rashan Rutledge, 21, of Greensboro, was found by officers with a gunshot wound, the release says.\nSpring Garden Street was closed between Granite Street and Chapman Street while police investigated.\n\"He had a protector’s heart for his family and was a good spirited person with sort of an old soul."}, {"url": "https://triad-city-beat.com/the-triad-100-the-100-people-places-and-things-that-shaped-the-triad-in-2019/", "title": "The Triad 100: The 100 people, places and things that shaped the Triad in 2019", "authors": [], "date": "2019-12-26", "keywords": ["county", "things", "triad", "black", "shaped", "north", "high", "places", "winstonsalem", "2019", "city", "members", "greensboro", "school", "100"], "summary": "Triad City Beat delved into the case in 2019, although Fairbanks was arrested in early 2018.\nTriad City Beat broke the story, and it commanded the largest audience of any in 2019.\nAll four visited different locations in Greensboro from Bennett College and NC A&T University to Smith High School and Natty Greene’s.\nTriad City Beat wins awardsThe TCB team took home two national Altweekly Awards, awarded at the annual convention in July, both for political writing.\nBlack Panther PartyThe Winston-Salem Black Panther Party’s 50th year celebration in October was a bittersweet affair."}, {"url": "https://myfox8.com/news/motorcyclist-in-critical-condition-after-crash-in-greensboro-police-say/", "title": "Motorcyclist in critical condition after crash in Greensboro, police say", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-29", "keywords": ["unclear", "crash", "motorcyclist", "timeit", "condition", "waiting", "traffic", "videogreensboro", "watch", "car", "say", "greensboro", "critical"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A motorcyclist is in critical condition after a crash in Greensboro Saturday, according to Greensboro police.\nThe crash happened at the intersection of High Point Road and Gate City Boulevard.\nThe crash reportedly involved a car and a motorcycle.\nThe identity of the motorcyclist is not available at this time.\nIt is unclear what time the crash happened."}, {"url": "https://www.globest.com/2019/12/23/highwoods-properties-embarks-on-divestiture-strategy/?slreturn=20200316105732", "title": "Highwoods Properties Embarks on Divestiture Strategy", "authors": ["John Mccurry"], "date": "2019-12-23", "keywords": ["sale", "properties", "strategy", "office", "twobuilding", "square", "embarks", "single", "million", "memphis", "highwoods", "twophase", "divestiture"], "summary": "Photo by ShutterstockMEMPHIS—Raleigh, NC-based Highwoods Properties, a publicly-traded REIT, has embarked on its two-phase plans of selling assets in Greensboro, North Carolina and Memphis with the sale of International Paper IV, a 248,000 square foot, single customer building in Memphis for $76.4 million.\nHighwoods expects to close on the sale of Atrium I and II, a two-building office complex encompassing 84,000 square feet, prior to Dec. 31 for $13.2 million.\nThese office properties, located in Memphis, are a combined 96% occupied and are projected to generate $5.9 million of annual cash and GAAP net operating income in 2020."}, {"url": "https://myfox8.com/news/motorcyclist-identified-after-crash-in-greensboro-leaves-him-in-critical-condition/", "title": "Motorcyclist identified after crash in Greensboro leaves him in critical condition", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-30", "keywords": ["unclear", "crash", "motorcyclist", "leaves", "condition", "time36072635", "videogreensboro", "watch", "car", "say", "greensboro", "identified", "critical"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — Police have identified a motorcyclist, who was left in critical condition after a crash in Greensboro Saturday, according to Greensboro police.\nThe crash happened at the intersection of High Point Road and Gate City Boulevard.\nPolice say 52-year-old Bengy Austin was riding a motorcycle when he and a car collided.\nIt's unclear what caused the crash.\nAustin was still in critical condition Monday morning."}, {"url": "https://myfox8.com/news/homicide-victim-identified-after-1-killed-2-injured-in-greensboro-shooting/", "title": "Homicide victim identified after 1 killed, 2 injured in Greensboro shooting", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-13", "keywords": ["woundslaquita", "victims", "residence", "videogreensboro", "watch", "woman", "homicide", "killed", "say", "shooting", "desiree", "greensboro", "injured", "identified", "victim", "amos"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — A woman was killed and two others were hurt in a shooting Thursday night in Greensboro, according to police.\nPolice say 39-year-old Laquita Terelle Amos, of Greensboro, died.\nInitially, an incident report listed the name of only one victim, 36-year-old Desiree Latrice Amos.\nPolice later said Desiree Amos is the murder victim's sister and was also injured in the shooting.\nPolice say officers have identified all people involved and are not actively looking for a suspect."}, {"url": "https://myfox8.com/news/shots-reportedly-fired-on-moody-road-in-greensboro-police-close-road/", "title": "Deputy shot while serving search warrant on Moody Street in Greensboro; police close road", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-10", "keywords": ["shot", "videogreensboro", "enable", "road", "watch", "closed", "javascript", "warrant", "deputy", "greensboro", "sheriffs", "street", "search", "close", "moody", "area", "warrants", "serving"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — Moody Street was closed after a deputy was shot in the area Tuesday morning, according to the Guilford County Sheriff's Office.\nThe street is closed in the area of McConnell Road.\nDeputies were serving search warrants for criminal activity when a deputy was hit by a bullet.\nThe deputy is receiving treatment, but the sheriff's office could not comment on the deputy's condition.\nPlease enable Javascript to watch this video36.063078 -79.754118"}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/news/2019/12/17/30-years-since-a-white-christmas-at-the-nc-coast", "title": "30 Years Since a White Christmas at the N.C. Coast", "authors": ["Published Am Et Dec."], "date": "2019-12-17", "keywords": ["southeastern", "produced", "30", "snow", "carolina", "storm", "north", "record", "nc", "coast", "mountains", "white", "christmas"], "summary": "NORTH CAROLINA -- If you're dreaming of a white Christmas this year, you will have to travel away from North Carolina to see one.\nThe average chance for a white Christmas in North Carolina outside the mountains is less than 5 percent.\nJust ask anyone that lived in southeastern North Carolina 30 years ago.\nIt was the all-time record snowfall for much of southeastern North Carolina.\nWestern North Carolina has seen a white Christmas more recently than 1989."}, {"url": "https://myfox8.com/news/greensboro-family-seeking-permanent-home-for-christmas-after-crash/", "title": "Greensboro family looking for permanent home for Christmas after crash", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-07", "keywords": ["permanent", "family", "crash", "house", "motel", "launched", "spend", "records", "inside", "car", "greens", "living", "greensboro", "christmas", "looking"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- The Green family has hopped from motel to motel since a car was launched into their living room Sunday.\nThe Green's car was then launched into their living room.\nWhen she got to the house, she saw her family car stuck inside the front part of the house.\nHowever, that happiness turned to stress when her family learned that they would not be able to live there anymore.\nAs for the Christmas miracle of being able to spend the holiday with her kids, she’s forever thankful."}, {"url": "https://greyareanews.com/news/state-nc/greensboro-honda-aircraft-deliveries-china/", "title": "Greensboro, NC Honda Aircraft Company Begins Deliveries of HondaJet Elite to China", "authors": ["About Guest Author Or Contributor", "Guest Or One-Time Reporters", "Release Authors", "Anonymous Article Writers."], "date": "2019-12-12", "keywords": ["china", "general", "elite", "honsan", "honda", "aircraft", "nc", "begins", "jet", "deliveries", "greensboro", "company", "aviation", "hondajet"], "summary": "On December 10, 2019, Honda Aircraft Company announced that it has begun deliveries of the HondaJet Elite to China.\nThe first HondaJet Elite was delivered by Honda Aircraft Company at its world headquarters in Greensboro, North Carolina to its exclusive dealer in China, Honsan General Aviation Co., Ltd.\nSaid Honda Aircraft Company president and CEO Michimasa Fujino:“Delivering the first HondaJet to China is a significant milestone for Honda Aircraft.\nHonda Aircraft Company is a wholly owned subsidiary of American Honda Motor Co., Inc.\nSource: Honda Aircraft Company"}, {"url": "https://myfox8.com/news/man-killed-on-spring-garden-street-in-greensboro-homicide-investigation-underway/", "title": "Man shot, killed on Spring Garden Street in Greensboro; homicide investigation underway", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-07", "keywords": ["man", "spring", "investigation", "shot", "garden", "wall", "videogreensboro", "watch", "underway", "apartment", "homicide", "killed", "javascript", "wound", "greensboro", "street", "enable", "video36062886"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- Police are investigating a homicide that happened in the 2800 block of Spring Garden Street Friday night, according to a Greensboro Police Department news release.\nAldrek Jabreel Strong, 23, of Sedelia, was shot and killed at 2819 Spring Garden St. at around 9:45 p.m.Officers were sent to an apartment where they found him suffering from a gunshot wound.\nHe was found in an apartment building and taken into custody a short time after the shooting.\nWall is charged with first-degree murder and is in the Guilford County jail with no bond.\nPlease enable Javascript to watch this video36.062886 -79.838563"}, {"url": "https://patch.com/north-carolina/greensboro/greensboro-celebrates-season-city-sponsored-holiday-events", "title": "Greensboro Celebrates The Season With City-Sponsored Holiday Events", "authors": [], "date": "2019-11-05", "keywords": ["park", "recreation", "citysponsored", "center", "celebrates", "events", "holiday", "crafts", "library", "parks", "season", "greensboro", "santa"], "summary": "From the City of Greensboro:November 5, 2019Greensboro Celebrates The Season With City-Sponsored Holiday EventsGreensboro offers a wide range of special events and activities this holiday season, including Thanksgiving events, winter festivals, New Year's events for children and adults, musical performances, kids' crafts, and giving opportunities.\nFall Festival at Griffin Recreation Center: November 16, 5-8 pmThis family-friendly event includes music, games, food, and lots of raffle prizes.\n'Tis the Season: Brown Recreation Center, December 7, 2-5 pmA holiday festival for the whole family.\nThe gifts will be distributed to local families in need this holiday season.\nWreaths Across America at Forest Lawn Cemetery: December 14, 11 amVolunteers place wreaths at veterans' graves to show their gratitude and appreciation during the holiday season."}, {"url": "https://myfox8.com/news/woman-in-fiery-greensboro-crash-reunites-with-angels-who-rescued-her/", "title": "Woman in fiery Greensboro crash reunites with ‘angels’ who rescued her", "authors": ["Chris Weaver", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-20", "keywords": ["crash", "rescued", "angels", "remember", "hatcher", "scene", "hospital", "way", "caudle", "woman", "car", "help", "greensboro", "fiery", "reunites", "crutchfield", "face"], "summary": "Dana Caudle and Elizabeth Crutchfield were in the right place at the right time but more importantly, they acted, jumping into the fiery crash scene and pulling Paulette Hatcher from her burning her car.\nCrutchfield, a nurse at Cone Health, usually doesn’t go that way and explained how she ended up at the scene.\n“In all the whole hospital, all the patients, all the nurses, she happened to be the one come met me face to face,” Hatcher said.\nand [Hatcher] said, 'Bryan Boulevard,' and I just leaned over the bed and said, 'Do you remember me?'\nThe family tracked down Caudle, who works as an office manager at Greensboro Physical Therapy and Friday they formed their lifelong friendship."}, {"url": "https://www.bizjournals.com/triad/news/2019/12/20/verizon-launches-5g-service-in-triad-city.html", "title": "", "authors": [], "date": "2019-12-20", "keywords": [], "summary": ""}, {"url": "https://patch.com/north-carolina/greensboro/fall-2019-commencement-unc-greensboro-new-beginning", "title": "Fall 2019 Commencement At UNC Greensboro: 'A New Beginning'", "authors": [], "date": "2019-12-14", "keywords": ["beginning", "alumni", "day", "today", "unc", "2019", "vaughan", "fall", "life", "greensboro", "commencement", "graduates", "degrees", "w"], "summary": "From UNC Greensboro:Posted on December 13, 2019As the fall 2019 UNC Greensboro Spartan graduates turned their tassels in Greensboro Coliseum today, they also turned a new page in their life journeys.\nUNCG conferred approximately 1,490 bachelor's degrees, 338 master's degrees, 126 doctoral degrees, and three specialist in education degrees.\nGreensboro mayor Nancy Vaughan was the Commencement Speaker for the December ceremony.\n(Photography by Martin W. Kane, UNC Greensboro Communications)UNCG graduates turn their tassels at the December Commencement ceremony Friday morning at the Greensboro Coliseum.\n(Photography by Martin W. Kane, UNC Greensboro Communications)Story by Matthew Bryant, University CommunicationsPhotography by Martin W. Kane, University CommunicationsThis press release was produced by UNC Greensboro."}, {"url": "https://myfox8.com/news/greek-company-to-create-new-jobs-in-east-greensboro/", "title": "Greek company to create new jobs in east Greensboro", "authors": ["Danielle Jackson", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-06", "keywords": ["tremendous", "jobs", "sims", "companies", "greek", "universities", "sunlight", "thats", "create", "greensboro", "company", "east"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. — Growth and expansion are happening for east Greensboro.\nA company based out of Greece called Systems Sunlight, a battery-making company, announced its plans to call east Greensboro its home.\nThere are several opportunities both industrial to locate as well as commercial,\" said Max Sims, president of East Greensboro Now.\nEast Greensboro Now focuses on improving economic development in the eastern portion of the city.\n\"Forty-six jobs (for) east Greensboro, that’s tremendous."}, {"url": "https://www.insurancejournal.com/news/southeast/2019/12/06/550599.htm", "title": "Woman Sues North Carolina Nursing School for Harassment in ‘Time’s Up’ Case", "authors": ["Martha Waggoner"], "date": "2019-12-06", "keywords": ["davis", "case", "carolina", "uncg", "state", "nursing", "north", "sues", "woman", "program", "nurse", "times", "school", "raleigh", "harassment", "lawsuit"], "summary": "A woman who says she was kicked out of a North Carolina nursing school a month before graduation in retaliation for accusing a supervisor of sexual harassment is suing in a case supported by the Time’s Up movement legal fund.\nAutumn Davis sued two supervisors at the University of North Carolina Greensboro nursing school in state court, and sued the school, the UNC Board of Governors and the Raleigh School of Nurse Anesthesia in federal court.\nThe nurse anesthesia school is a nonprofit associated with UNCG’s program, the lawsuit says.\nDavis said his harassment grew during each encounter – from dinner invitations to trying to pull her into a room.\nThe UNCG nursing school supervisors named in the state lawsuit – Nancy Shedlick and Linda Stone – didn’t respond to emails."}, {"url": "https://spectrumlocalnews.com/nc/charlotte/news/2019/12/30/coliseum-prepares-for-new-year-s-eve-celebration", "title": "Coliseum Prepares For New Year's Eve Celebration", "authors": ["Published Pm Et Dec."], "date": "2019-12-30", "keywords": ["theyve", "concert", "event", "eve", "unlike", "complex", "prepares", "past", "celebration", "working", "wont", "underwaywe", "coliseum", "greensboro"], "summary": "GREENSBORO, N.C. -- Unlike during the Christmas holiday season, you won't see downtown block parties in Greensboro on New Year's Eve.\nThe biggest event will be at the Greensboro Coliseum Complex, where for the last few years they've focused on large NYE celebrations that take months to plan.\nWe also base that on past history and past relationships.\nWe're working with concert artists, concert promoters, concert managers,\" Complex Deputy Director Scott Johnson said.\nJohnson says they don't feel extra pressure being the main end of year event, but that it is bigger than a normal show."}, {"url": "https://myfox8.com/news/woman-taken-to-hospital-after-stabbing-at-greensboro-applebees/", "title": "Woman taken to hospital after stabbing at Greensboro Applebee’s", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-20", "keywords": ["women", "applebees", "hospital", "taken", "videogreensboro", "watch", "woman", "stabbing", "greensboro", "wendover", "w"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A woman was taken to the hospital after a stabbing at a Greensboro Applebee's on Thursday night.\nThe stabbing was reported around 7:15 p.m. at the Applebee's at 4406 W. Wendover Ave.Greensboro police say two women got into a dispute and one of the women was stabbed.\nThe victim was taken to the hospital with non-life-threatening injuries.\nThe other woman has been taken into custody.\nGreensboro police have not released the name of the suspect or the victim."}, {"url": "https://myfox8.com/news/upcoming-christmas-and-holiday-parades-in-the-piedmont-triad-see-where-your-fox8-talent-will-be/", "title": "Upcoming Christmas and Holiday parades in the Piedmont Triad — see where your FOX8 talent will be!", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-11-12", "keywords": ["trouble", "triad", "pants", "mail", "staying", "holiday", "resident", "talent", "particular", "wdvm", "parades", "wearing", "having", "fox8", "piedmont", "upcoming", "christmas", "maryland"], "summary": "(WDVM) -- People are staying home, and their pants are staying in their closets apparently.\nA police department in Carroll County, Maryland, was having trouble with one resident in particular who apparently has been checking their mail without wearing pants."}, {"url": "https://www.wraltechwire.com/2019/12/09/headliners-part-ii-38-events-across-nc-to-add-to-your-december-calendar/", "title": "Headliners, part II: 38 events across NC to add to your December calendar", "authors": [], "date": "2019-12-09", "keywords": ["business", "event", "launch", "headliners", "events", "north", "38", "networking", "calendar", "add", "nc", "community", "ii", "charlotte", "11", "program", "join"], "summary": "Here’s our exclusive wrapup of upcoming events happening across North Carolina through the end of the year.\nThese columns are an extension of our interactive calendar of tech and startup events.\nIf you’d like to suggest an event to be added to the calendar, feel free to send me an email.\nGraduates of the program may receive a financial award to support their business launch.\nGraduates of the program may receive a financial award to support their business launch."}, {"url": "https://myfox8.com/news/free-valet-parking-in-downtown-greensboro-december-21-and-22/", "title": "Free valet parking in downtown Greensboro December 21 and 22", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-17", "keywords": ["downtown", "restaurants", "visitors", "valet", "local", "parking", "holiday", "22", "supporting", "21", "free", "greensboro", "service", "street"], "summary": "GREENSBORO, N.C. — Downtown Greensboro Incorporated (DGI) will offer free valet parking to downtown visitors Saturday, Dec. 21 and Sunday, Dec. 22, 11 a.m. to 5 p.m. to encourage people to support local shops and restaurants in the waning days of the holiday season.\nThose interested can pull up in front of the Elm Street Center, 203 S. Elm Street, on either day to take advantage of the quick and easy free parking service.\nWhile downtown on Saturday, visitors can also hop aboard a free trolley running downtown from 1 to 5 p.m., as part of a collaboration between Triad Local First and DGI.\n“When you come downtown, you’re not just supporting local business owners, your supporting your neighbors.\nFor additional information on the free valet service and Downtown In December events, visit the website."}, {"url": "https://www.wfmynews2.com/article/news/local/four-2-five-jeopardy-ii-cbs-this-morning-programming-changes-wfmy/83-cdffd7da-ec5b-4dc1-b34a-066731975525", "title": "New show means new program flow on WFMY News 2: Four 2 Five, along with Jeopardy II and other changes", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est December", "Updated"], "date": "2019-12-03", "keywords": ["changes", "500", "pmwfmy", "good", "wfmy", "means", "amcbs", "premiers", "morning", "2019", "flow", "900", "ii", "700", "program", "jeopardy"], "summary": "Along with WFMY News 2's Four 2 Five show a number of programming changes are on the horizon.\nPHOTOS | Four 2 Five Premiere Day Monday, December 3, 2019: Four 2 Five premiers on WFMY News 2.\nMonday, December 3, 2019: Four 2 Five premiers on WFMY News 2.\nMonday, December 3, 2019: Four 2 Five premiers on WFMY News 2.\nDownload the WFMY News 2 iPhone app | Android app | Sign up for the WFMY 'Let's Get 2 It' NewsletterSubscribe: WFMY News 2 on YouTube"}, {"url": "https://myfox8.com/news/driver-taken-to-hospital-after-tractor-trailer-flips-on-interstate-73-near-greensboro/", "title": "Driver taken to hospital after tractor-trailer flips on Interstate-73 near Greensboro", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-26", "keywords": ["highway", "truck", "hospital", "taken", "driver", "patrol", "watch", "flips", "tractortrailer", "nc", "interstate73", "javascript", "greensboro", "enable", "near"], "summary": "Please enable Javascript to watch this videoGUILFORD COUNTY, N.C. -- A driver was taken to the hospital Thursday after a tractor-trailer flipped on Interstate-73 near Greensboro, according to highway patrol officials.\nState highway patrol officials and fire units are on the scene.\nThe driver was taken to Moses Cone Hospital.\nThe crash happened near Interstate-85 near mile marker 95, the NC Department of Transportation says.\nPlease enable Javascript to watch this video36.089987 -79.829674"}, {"url": "https://www.wfmynews2.com/article/news/crime/3-people-shot-in-greensboro/83-4d58ee63-8326-4e60-ba10-ea81349d2411", "title": "Woman killed in Greensboro shooting identified", "authors": ["Author", "Wfmy News Digital Team", "Brian Bennett", "Alma Mccarty", "Published", "Pm Est December", "Updated", "Am Est December"], "date": "2019-12-13", "keywords": ["victims", "wfmy", "woman", "training", "killed", "say", "shooting", "users", "greensboro", "twitter", "tripleshooting", "identified", "tower"], "summary": "GREENSBORO, N.C. — Greensboro Police identified a woman killed in a triple-shooting Thursday night.\nPolice say Laquita Terelle Amos, 39, was shot at a home on Lynhaven Drive.\nTwo other victims were taken to a local hospital - one is in critical condition.\nPolice say they are not actively looking for a suspect and there is no threat to the public.\nDownload the WFMY News 2 App: Apple Users, Android Users"}, {"url": "https://www.wfmynews2.com/article/news/local/school-delays-closings-winter-weather/83-9b927cd8-d714-4247-98b1-46cb8d9b2f46", "title": "LIST | Schools delays, closings for Friday, Dec. 13", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est December", "Updated"], "date": "2019-12-12", "keywords": ["county", "delays", "13", "wfmy", "early", "dec", "freezing", "city", "air", "list", "weather", "closings", "rain", "schools"], "summary": "Schools are already announcing delays for wintry weather for Friday, December 13.\nLatest: School Delays, Closings ListThe following schools are delayed Friday:Guilford County Schools - 2 hoursWinston-Salem Forsyth County Schools - 2 hoursRockingham County Schools - 3 hoursStokes County Schools - 3 hoursCarroll County Schools- 2 hoursCaswell County Schools - 3 hoursDavidson County Schools - 2 hoursLexington City Schools - 2 hoursThomasville City Schools - 2 hoursSurry County Schools - 3 hoursElkin City Schools - 2 hoursMartinsville City Schools - 2 hoursPatrick County Public Schools - 2 hoursAlleghany County Schools - 2 hoursWilkes County Schools - 2 hoursYadkin County Schools - 2 hoursThe following schools are closed Friday:Danville Public SchoolsMake sure you download the WFMY News 2 app for updated radar and to get the latest closings and delays.\nThat is a common setup for us to get freezing rain during the winter months.\nRELATED: Freezing rain could mean glaze of ice for Friday morning commuteWarm air moving in over cold air is a common setup for a freezing rain event.\nMAIN POINTS:Brief period of freezing rain possible Friday AMToo early for any amounts, impacts or details."}, {"url": "https://www.bizjournals.com/triad/news/2019/11/21/greensboro-high-point-each-approve-301-000-in.html", "title": "", "authors": [], "date": "2019-11-21", "keywords": [], "summary": ""}, {"url": "https://myfox8.com/news/multiple-people-shot-in-5-points-area-of-high-point/", "title": "6 people shot in 5 Points area of High Point on Christmas Eve", "authors": ["Digital Desk", "Stephanie Doyle", "Nexstar Media Wire"], "date": "2019-12-24", "keywords": ["victims", "eve", "point", "parking", "taken", "shot", "watch", "high", "javascript", "lot", "shooting", "area", "points", "enable", "christmas", "victim"], "summary": "Please enable Javascript to watch this videoHIGH POINT, N.C. -- High Point police are investigating a shooting involving six victims.\nThe shooting happened around 4:30 p.m. at a parking lot in front of several businesses in the 1200 block of Montlieu Avenue.\nA witness told FOX8 it was a drive-by shooting and 10-15 people were in the parking lot at the time of the shooting.\nHigh Point police said on Tuesday night that all the victims are in stable condition.\nPlease enable Javascript to watch this videoPlease enable Javascript to watch this video35.955692 -80.005318"}, {"url": "https://fox6now.com/2019/12/23/i-was-so-shocked-north-carolina-police-surprised-single-mom-of-5-with-suv-for-christmas/", "title": "‘I was so shocked:’ North Carolina police surprised single mom of 5 with SUV for Christmas", "authors": ["Cnn Wire Service"], "date": "2019-12-23", "keywords": ["youre", "mom", "carolina", "littlejohn", "suv", "north", "single", "officers", "moore", "help", "car", "im", "surprised", "shocked", "work", "christmas"], "summary": "Please enable Javascript to watch this videoGREENSBORO, N.C. -- A single mother of five is having a great Christmas, thanks to officers with the Greensboro Police Department’s District 2.\n“I was so shocked,” said Raven Moore, who was given an SUV from officers Monday, Dec. 23.\n“Now, I'm able to get back and forth to work, get the kids to and from school, and to PTA meetings.”Each Christmas, the officers adopt a family in their district.\n“This is part of policing you probably don't hear about,” Officer Matthew Menshew said.\n“I asked God to bless me with some blessings,” Moore said."}, {"url": "https://patch.com/north-carolina/greensboro/uncg-mens-basketball-versus-nc-state-be-televised-my48", "title": "UNCG Men's Basketball Versus NC State To Be Televised On My48", "authors": [], "date": "2019-12-08", "keywords": ["mens", "visit", "game", "state", "basketball", "my48", "broadcast", "wolfpack", "nc", "unc", "televised", "versus", "greensboro", "15", "athletics", "uncg", "play"], "summary": "From UNC Greensboro Athletics:12-5-2019GREENSBORO, N.C. - UNC Greensboro Athletics has partnered with My48 to broadcast the UNCG Men's Basketball game versus NC State on Sunday, December 15, at 3 p.m.\nThe game will be broadcast locally in the Piedmont Triad.\nScott Pryzwansky will handle the play by play call, joined by Darryl Kosciak providing color commentary.\nIn their last meeting, the Spartans defeated the Wolfpack, 81-76 in Raleigh, during the 2017-18 season.\nThis press release was produced by UNC Greensboro Athletics."}, {"url": "https://patch.com/north-carolina/charlotte/unusual-start-flu-season-5-flu-deaths-reported-nc", "title": "'Unusual' Start To Flu Season: 5 Flu Deaths Reported In NC", "authors": [], "date": "2019-12-17", "keywords": ["start", "carolina", "states", "flu", "unusual", "north", "including", "deaths", "viruses", "season", "nc", "according", "reported", "activity"], "summary": "NORTH CAROLINA — The flu season is off to an \"unusual\" start and government health officials say it has already been blamed for over a thousand deaths, including 10 children.\nIn North Carolina, five flu-related deaths have been reported since the season began Sept. 29, according to state public health officials.\nThe geographic spread of flu activity does not measure the severity of the virus.\nThe CDC's influenza-like-illness (ILI) surveillance measures the level of flu activity within a state.\nNine states, including North Carolina, and the District of Columbia had low activity while 18 states, had minimal activity."}]