[{"url": "https://www.klkntv.com/coronavirus-coverage-and-resources/", "title": "CORONAVIRUS: Coverage and resources", "authors": [], "date": "2020-03-19", "keywords": ["click", "disease", "information", "link", "health", "resources", "coronavirus", "virus", "covid19", "coverage"], "summary": "CORONAVIRUS: Coverage and resourcesWhat you need to know about the coronavirus, from local news coverage to national health information.\nOur team at Channel 8 Eyewitness News wants to keep our viewers informed of accurate information as more cases of novel coronavirus COVID-19 infection are reported locally and across the country.\nBelow we have listed government resources on prevention, along with more general information on how the virus is spread and where it derived from.\nYou can find information from Bryan Health: (click here) and CHI (click here).\nThe virus has been named “SARS-CoV-2” and the disease it causes has been named “coronavirus disease 2019” (abbreviated “COVID-19”)."}, {"url": "https://talksport.com/sport/mma/649046/ufc-schedule-2020-khabib-nurmagomedov-conor-mcgregor-amanda-nunes-justin-gaethje-tony-ferguson/", "title": "UFC schedule 2020: All major upcoming events including postponements due to coronavirus", "authors": ["Marc Williams"], "date": "2020-04-15", "keywords": ["mcgregor", "fights", "dana", "2020", "wwe", "money", "including", "ufc", "events", "whites", "schedule", "coronavirus", "conor", "white", "upcoming", "postponements", "major", "venue"], "summary": "LATEST UFC NEWSBACK ON When will UFC return?\nDana White says UFC APEX could host fights by Mayscary St-Pierre reveals he never enjoyed his time in the octagon against 'psychopaths'out for revenge Dustin Poirier prepared to take extreme measures to get Conor McGregor'Game changing' All you need to know about the venue the UFC will stage fights from in Maythe eagle Khabib next fight: Why did he pull out of UFC 249?\nWhen could he return?\nWho is next for Conor McGregor?\nGaethje, Diaz, Masvidal and Pacquiao in contentionall access Inside Dana White's UFC office - swords, a money gun, gym, bar and a tiger skull'A lovely array' Conor McGregor explains on Instagram how he knocks out so many opponentschaos theory 'I'm here to make money' - Divisive UFC star confirms WWE move in summer 2021"}, {"url": "https://www.wisfarmer.com/story/news/2020/04/14/ag-briefs-online-exam-temp-pesticide-applicator-certification/5122252002/", "title": "Ag briefs: Pesticide applicator exam online", "authors": ["Wisconsin State Farmer", "Published P.M. Ct April"], "date": "2020-04-14", "keywords": ["ag", "company", "cat", "announced", "online", "department", "exam", "food", "applicator", "hemp", "farms", "covid19", "banks", "prairie", "pesticide", "briefs"], "summary": "CLOSEMADISON, WIOnline exam available for temporary pesticide applicator certificationA new online exam is available for individuals to become temporarily certified until Oct. 31 as a commercial pesticide applicator.\nEDWARDSVILLE, ILPrairie Farms milk caps support food banks during COVID-19As America hunkers down during the global COVID-19 pandemic, food banks are struggling to meet increased demands.\nThe Prairie Farms charitable giving program, Our Caps Your Cause, donates thousands of dollars each year to local non-profit organizations.\nPoints for cap codes redeemed for food banks will quadruple through the end of May — this means each cap is worth 20 cents instead of 5 cents.\nTo help offset this disruption to everyday lives, Prairie Farms has launched a webpage that offers a variety of resources including recipes, Chef Rob “how to” cooking tips, coupons, and a video series featuring Prairie Farms dairy farm families."}, {"url": "https://www.klkntv.com/husker-hoops-signs-five-transfers-to-2020-recruiting-class/", "title": "Husker hoops signs five transfers to 2020 recruiting class", "authors": [], "date": "2020-04-15", "keywords": ["transfers", "rebounds", "2020", "hoops", "class", "assists", "nebraska", "steals", "game", "mayen", "king", "webster", "season", "husker", "recruiting", "points", "signs"], "summary": "Husker hoops signs five transfers to 2020 recruiting classAll five players possess Division I experience and have combined for 2,847 points, 807 rebounds, 536 assists and 242 steals during their collegiate careers.\nsports rotator NU basketballFrom: Nebraska AthleticsLINCOLN – University of Nebraska men’s basketball coach Fred Hoiberg unveiled the Huskers spring recruiting class on Wednesday.\nThe five-member class features graduate transfer Kobe Webster, junior college transfers Teddy Allen and Lat Mayen and Division I transfers Kobe King and Trey McGowens.\n“We are excited to bring in this five-man class that brings size, length, athleticism, scoring ability and experience,” Hoiberg said.\nAllen earned first-team all-region accolades, as he averaged 31.4 points, 7.4 rebounds and 3.7 assists per game last season."}, {"url": "https://www.magnoliabannernews.com/news/2020/mar/18/toilet-paper-chronicles-nebraska-rest-stop-robbed-/", "title": "Toilet paper chronicles: Nebraska rest stop robbed, California man sets up street-corner exchange", "authors": ["Associated Press"], "date": "2020-03-18", "keywords": ["exchange", "man", "sets", "told", "rest", "nebraska", "paper", "blue", "rolls", "robbed", "open", "kramer", "coronavirus", "sure", "stop", "toilet", "streetcorner"], "summary": "A notice limiting only 3 packages of toilet paper per customer is displayed on picked bare shelves after shoppers cleaned out the stock of paper and cleaning products at a local grocery store in Burbank, Calif. on Saturday, March 14, 2020.\n(AP Photo/Richard Vogel)There’s been a run on toilet paper as Americans hunker down and isolate themselves at home to avoid the spread of the new coronavirus and the disease it causes, COVID-19.\nShelves are bare of toilet paper in many stores across Nebraska, California, and across the nation.\nSome are staffed and some are not, department spokeswoman Vicki Kramer told the Lincoln Journal Star.\nDrivers honked horns in support and stopped to drop off rolls of toilet paper."}, {"url": "https://www.ketv.com/article/some-grocery-stores-to-create-elderly-hours-for-geriatrics-to-get-supplies-early-before-crowds/31703015", "title": "Some stores creating 'elderly hours' for seniors to get groceries, supplies before crowds", "authors": ["Https", "Www.Facebook.Com", "National Desk Staff"], "date": "2020-03-19", "keywords": ["stores", "supplies", "shelves", "crowds", "elderly", "creating", "hours", "store", "shoppers", "paper", "restock", "hour", "toilet", "groceries", "customers", "seniors"], "summary": "Inside the store, shoppers could be seen lining up at the registers as workers directed traffic and helped hand out some of the most popular items.\nNotably missing, however, was toilet paper, which has mostly been wiped out at stores all across the country.\nNo toilet paper whatsoever in any stores.\nThis stop and shop in Smithtown had plenty of food but no toilet paper.\nAdvertisement Some stores creating 'elderly hours' for seniors to get groceries, supplies before crowds Share Shares Copy Link CopyThis article will be updated as stores announce these policies."}, {"url": "https://www.3newsnow.com/list-of-closings-cancellations-due-to-coronavirus", "title": "List of closings and cancellations due to coronavirus", "authors": [], "date": "2020-03-13", "keywords": ["county", "public", "cancellations", "center", "omaha", "health", "closed", "community", "coronavirus", "list", "church", "closings", "chi", "covid19"], "summary": "Services at the Lincoln-Lancaster County Health Department, 3131 “O” St. will be conducted by appointment only.\n3/29/20Nebraska Brass - Canceled3/27/20Union Omaha Soccer - No game - Subject to changeMercy Me at CHI Health Center - Resscheduled for Sunday, October 4.\nNebraska Games and Parks- Closed public crane viewing blind at North River Wildlife Management Area north of Hershey.\nCHI HealthStarting Monday morning, you will see changes at CHI Health hospitals across Nebraska and southwest Iowa.\nCHI Health will now restrict visitor access, limit some entry points and screen all visitors at its 15 hospitals."}, {"url": "https://www.nytimes.com/2020/03/21/business/coronavirus-masks-hanes-trump.html", "title": "Governments and Companies Race to Make Masks Vital to Virus Fight", "authors": ["Rachel Abrams", "Jessica Silver-Greenberg", "Andrew Jacobs", "Vanessa Friedman", "Michael Rothfeld"], "date": "2020-03-21", "keywords": ["factory", "companies", "surgical", "told", "wuhan", "bowen", "american", "governments", "started", "virus", "vital", "race", "masks", "mr", "company", "fight"], "summary": "Mr. Bowen said he had repeatedly told federal officials that American hospitals would be at the mercy of other countries in a pandemic.\n“Aside from sitting in front of the White House and lighting myself on fire, I feel like I’ve done everything I can,” Mr. Bowen said.\nRecently, Mr. Bowen said, his company has been fielding roughly 100 calls a day from hospitals and others desperate for more masks.\nBut the company sourced the raw materials for the masks from a supplier in Wuhan, China, where the coronavirus outbreak started.\nThe company started selling and shipping masks in mid-March; it is ultimately hoping to produce 300,000 masks and 50,000 gowns a week."}, {"url": "https://hoosierstateofmind.com/2020/04/10/indiana-football-best-games-2019-season-beating-nebraska/", "title": "Indiana Football: Best games of 2019 season, IU beats Nebraska", "authors": ["Adam Childs", "Scott Polacek"], "date": "2020-04-10", "keywords": ["lead", "cornhuskers", "touchdown", "games", "game", "quarter", "nebraska", "beats", "iu", "indiana", "season", "2019", "win", "best", "big", "hoosiers", "football"], "summary": "The Indiana football team went into Nebraska and pulled out a big win to end October.\nThe Hoosiers traveled to Lincoln, Nebraska on October 26th looking to become bowl eligible before the calendar turned to November.\nIndiana needed a prove-it game and while the Cornhuskers weren’t great, it is always tough to win in Lincoln.\nRELATED PRODUCT Tailgate Women's Indiana Hoosiers Colorblock Sweatshirt Campus Red M Buy Now!\nAnytime you can get a win at Nebraska is huge and to get to bowl eligibility before November had IU fans thinking big."}, {"url": "https://www.mlive.com/highschoolsports/2020/04/top-recruits-msu-target-jace-williams-has-game-when-it-comes-to-basketball-but-hes-sticking-with-football.html", "title": "Top recruits: MSU target Jace Williams has game when it comes to basketball, but he’s sticking with football", "authors": ["Steve Kaminski", "Skaminsk Mlive.Com"], "date": "2020-04-13", "keywords": ["target", "sticking", "school", "touchdown", "game", "state", "jace", "hes", "recruits", "catholic", "central", "junior", "rapids", "msu", "williams", "comes", "football"], "summary": "Grand Rapids Catholic Central junior Jace Williams (4) fights to keep the ball during the second half of the game at Grand Rapids Christian High School on Tuesday, Dec. 17, 2019, in Grand Rapids, Mich.Brian Hayes | MLive.comHoop dreamsGrand Rapids Catholic Central basketball coach T.J. Meerman is confident that Jace Williams could play college hoops if that’s what he wanted to do.\nWilliams helped the Cougars win the OK Blue Conference, advance to the Division 2 district tournament finals and finish 19-3.\nBut the 12 schools who offered Williams a football scholarship have no need to worry.\nWilliams will be sticking with football at the next level.\n“It has been fun going around and looking to see where I want to spend the next four years.”Jace Williams takes part in Grand Rapids Catholic Central football practice at Catholic Central Athletic Complex (C.A.T.)"}, {"url": "https://citiesspeak.org/2019/10/25/how-lincoln-nebraska-weathered-the-great-recession/", "title": "How Lincoln, Nebraska Weathered the Great Recession", "authors": [], "date": "2019-10-25", "keywords": ["local", "growth", "taxes", "great", "nebraska", "revenue", "recession", "city", "weathered", "lincoln", "property", "cities"], "summary": "In advance of our annual City Fiscal Conditions report release eventin Washington, D.C. on October 28, this blog takes a look at how Lincoln, Nebraska weathered the recession.\nTen years after the Great Recession, some cities have rebounded, others have not.\nAmid decelerating property, sales and income tax revenue growth, it’s likely that another recession is right around the corner.\nEven throughout the recession, home prices in Lincoln remained steady and began increasing well before other cities in the nation.\nThis enabled the city to maintain its property tax revenue stream during the Great Recession and even generate a general fund surplus (see chart below)."}, {"url": "https://ktiv.com/2019/10/09/suspect-shot-and-killed-at-chick-fil-a-restaurant-in-lincoln-nebraska/", "title": "Suspect shot and killed at Chick-Fil-A restaurant in Lincoln, Nebraska", "authors": ["Dean Welte"], "date": "2019-10-09", "keywords": ["hall", "weapon", "restaurant", "special", "shot", "nebraska", "chickfila", "agent", "died", "department", "killed", "say", "lincoln", "suspect", "cimino"], "summary": "(NBC News) – A Nebraska man was shot dead by a special agent after driving his truck into a Chick-Fil-A restaurant in Lincoln, Nebraska.\nThe release says Special Agent Hall exited his vehicle to investigate and came into contact with Cimino.\nLaw enforcement officials say Hall attempted to create distance between Cimino and himself, but Cimino continued to advance towards him with the weapon.\nThe special agent fired his weapon at the suspect who died from his injuries at the scene,” said Chief Jeff Bliemeister, Lincoln Police Department.\nSpecial Agent Hall is to be interviewed by Lincoln Police Department investigators on Wednesday."}, {"url": "https://gnrcentral.com/2019/10/16/guns-n-roses-lincoln-nebraska-concert-recap-and-videos-oct-15-2019/", "title": "Guns N’ Roses Lincoln, Nebraska Concert Recap and Videos Oct 15, 2019", "authors": ["Lisa Donalds"], "date": "2019-10-16", "keywords": ["videos", "concert", "rock", "n", "2020", "nebraska", "video", "vote", "music", "recap", "views", "2019", "lincoln", "guns", "oct", "roses"], "summary": "Guns N’ Roses Perform in Lincoln, Nebraska Last NightGuns N’ Roses played another show in Lincoln, Nebraska last night and busted out Madagascar for the first time this year.\nThis follows their previous record-breaking feat, when their epic music video for ‘November Rain’ became the first (and only) music video from the 90s to reach 1 billion views back in (appropriately) November of 2018.\nFull list of 2020 nomineesPat BenatarDave Matthews BandDepeche ModeThe Doobie BrothersWhitney HoustonJudas PriestKraftwerkMC5MotörheadNine Inch NailsThe Notorious B.I.G.\nDetroit proto-punks MC5 have been eligible the longest of this shortlist (since 1991), while late hip-hop legend The Notorious B.I.G.\n— frequently cited as one of, if not the, greatest rapper in history — receives a nomination in his first year of eligibility."}, {"url": "https://www.edweek.org/ew/articles/2020/04/14/nebraska-education-department-accused-of-software-pirating_ap.html", "title": "Nebraska Education Department accused of software-pirating", "authors": [], "date": "2020-04-14", "keywords": ["accused", "escholar", "system", "student", "softwarepirating", "state", "nebraska", "education", "companys", "software", "elements", "using", "department"], "summary": "Nebraska Education Department accused of software-piratingLINCOLN, Neb.\n(AP) — A New York-based software company is suing the Nebraska Department of Education for $15 million in federal court, accusing the department of using elements of the company’s copyrighted software in designing its own web-based program to share student and staff data.\nThe state’s education department contracted with eScholar, a company based in White Plains, New York, for student data collection software from 2004 until November 2019.\nThe state now uses a system it designed, but eScholar says that system pirated elements of the company's software, the Lincoln Journal Star reported.\nThe lawsuit accused the department of violating a segment of their contract that forbids the state from using any of the company’s product design elements without written consent."}, {"url": "https://hoosierstateofmind.com/2020/04/10/indiana-football-best-games-2019-season-beating-nebraska/", "title": "Indiana Football: Best games of 2019 season, IU beats Nebraska", "authors": ["Adam Childs", "Scott Polacek"], "date": "2020-04-10", "keywords": ["lead", "cornhuskers", "touchdown", "games", "game", "quarter", "nebraska", "beats", "iu", "indiana", "season", "2019", "win", "best", "big", "hoosiers", "football"], "summary": "The Indiana football team went into Nebraska and pulled out a big win to end October.\nThe Hoosiers traveled to Lincoln, Nebraska on October 26th looking to become bowl eligible before the calendar turned to November.\nIndiana needed a prove-it game and while the Cornhuskers weren’t great, it is always tough to win in Lincoln.\nRELATED PRODUCT Tailgate Women's Indiana Hoosiers Colorblock Sweatshirt Campus Red M Buy Now!\nAnytime you can get a win at Nebraska is huge and to get to bowl eligibility before November had IU fans thinking big."}, {"url": "https://www.mlive.com/highschoolsports/2020/04/top-recruits-msu-target-jace-williams-has-game-when-it-comes-to-basketball-but-hes-sticking-with-football.html", "title": "Top recruits: MSU target Jace Williams has game when it comes to basketball, but he’s sticking with football", "authors": ["Steve Kaminski", "Skaminsk Mlive.Com"], "date": "2020-04-13", "keywords": ["target", "sticking", "school", "touchdown", "game", "state", "jace", "hes", "recruits", "catholic", "central", "junior", "rapids", "msu", "williams", "comes", "football"], "summary": "Grand Rapids Catholic Central junior Jace Williams (4) fights to keep the ball during the second half of the game at Grand Rapids Christian High School on Tuesday, Dec. 17, 2019, in Grand Rapids, Mich.Brian Hayes | MLive.comHoop dreamsGrand Rapids Catholic Central basketball coach T.J. Meerman is confident that Jace Williams could play college hoops if that’s what he wanted to do.\nWilliams helped the Cougars win the OK Blue Conference, advance to the Division 2 district tournament finals and finish 19-3.\nBut the 12 schools who offered Williams a football scholarship have no need to worry.\nWilliams will be sticking with football at the next level.\n“It has been fun going around and looking to see where I want to spend the next four years.”Jace Williams takes part in Grand Rapids Catholic Central football practice at Catholic Central Athletic Complex (C.A.T.)"}, {"url": "https://www.usatoday.com/story/sports/ncaaf/2020/04/07/nebraska-expels-former-football-players-after-sexual-misconduct-violations/2959932001/", "title": "Report: Nebraska expels two former football players after sexual misconduct violations", "authors": ["Scott Gleeson", "Published A.M. Et April"], "date": "2020-04-07", "keywords": ["sexual", "report", "misconduct", "expels", "nebraska", "violations", "legrone", "espn", "assault", "told", "set", "university", "players", "hunt", "schools", "football"], "summary": "Last year a university investigator found LeGrone and Hunt responsible for violating the school's sexual misconduct policy.\nThe two ex-football players were arrested on Dec. 10, 2019 after a reported off-campus sexual assault in Lincoln, Nebraska.\nLeGrone was arrested on suspicion of first-degree sexual assault, and Hunt was charged with aiding and abetting first-degree sexual assault, according to the original Lincoln Police Department report.\nHunt's attorney, Carlos Monzon, told ESPN Monday that Hunt was set to be playing at an unknown university in 2020.\nLeGrone's attorneys, Mallory Hughes and John S. Berry, told ESPN he has been living with family, working out and \"exploring his options.\""}, {"url": "https://kuathletics.com/watch-the-2019-kansas-relays-on-flotrack/", "title": "👟 Watch the 2019 Kansas Relays on FloTrack", "authors": [], "date": "2020-04-15", "keywords": ["park", "kansas", "rock", "chalk", "lawrence", "welcomes", "scheduled", "watch", "2019", "flotrack", "originally", "relays"], "summary": "LAWRENCE, Kan. — With the 2020 Kansas Relays originally scheduled for this week, FloTrack will feature the 2019 Kansas Relays exclusively on FloTrack.com, with exclusive video coverage and highlights available here.\nThe Kansas Relays, which have been run since 1923, were originally scheduled to take place on April 15-18 at Rock Chalk Park in Lawrence, Kansas.\nDue to COVID-19, the Kansas Relays were canceled.\nEach year, the Kansas Relays welcomes some of the top high school, collegiate and professional talent to Rock Chalk Park.\nRe-live last year’s action on FloTrack and by following @KUTrack on social media."}, {"url": "https://talksport.com/sport/mma/649046/ufc-schedule-2020-khabib-nurmagomedov-conor-mcgregor-amanda-nunes-justin-gaethje-tony-ferguson/", "title": "UFC schedule 2020: All major upcoming events including postponements due to coronavirus", "authors": ["Marc Williams"], "date": "2020-04-15", "keywords": ["mcgregor", "fights", "dana", "2020", "wwe", "money", "including", "ufc", "events", "whites", "schedule", "coronavirus", "conor", "white", "upcoming", "postponements", "major", "venue"], "summary": "LATEST UFC NEWSBACK ON When will UFC return?\nDana White says UFC APEX could host fights by Mayscary St-Pierre reveals he never enjoyed his time in the octagon against 'psychopaths'out for revenge Dustin Poirier prepared to take extreme measures to get Conor McGregor'Game changing' All you need to know about the venue the UFC will stage fights from in Maythe eagle Khabib next fight: Why did he pull out of UFC 249?\nWhen could he return?\nWho is next for Conor McGregor?\nGaethje, Diaz, Masvidal and Pacquiao in contentionall access Inside Dana White's UFC office - swords, a money gun, gym, bar and a tiger skull'A lovely array' Conor McGregor explains on Instagram how he knocks out so many opponentschaos theory 'I'm here to make money' - Divisive UFC star confirms WWE move in summer 2021"}, {"url": "https://www.avma.org/javma-news/2020-05-01/guarding-against-outbreak-expecting-its-arrival", "title": "Guarding against an outbreak, expecting its arrival", "authors": [], "date": "2020-05-01", "keywords": ["guarding", "asf", "expecting", "arrival", "ingredients", "swine", "feed", "virus", "farms", "meeting", "outbreak", "johnson", "china", "dr"], "summary": "“I don’t feel comfortable that we’re going to find ASF quickly when it gets into the country,” Dr. Johnson said.\nDr. Johnson noted the virus is spreading in Asia and Europe.\n“When we lose ground to ASF—when we lose a country—we don’t get it back, right?” Dr. Johnson said.\nAmerican farms import millions of kilograms of feed ingredients from countries with circulating animal diseases foreign to the U.S., she said.\n“The feed ingredients, all of them that we tested, actually enhanced viral stability,” she said."}, {"url": "https://www.mlive.com/highschoolsports/2020/04/top-recruits-msu-target-jace-williams-has-game-when-it-comes-to-basketball-but-hes-sticking-with-football.html", "title": "Top recruits: MSU target Jace Williams has game when it comes to basketball, but he’s sticking with football", "authors": ["Steve Kaminski", "Skaminsk Mlive.Com"], "date": "2020-04-13", "keywords": ["target", "sticking", "school", "touchdown", "game", "state", "jace", "hes", "recruits", "catholic", "central", "junior", "rapids", "msu", "williams", "comes", "football"], "summary": "Grand Rapids Catholic Central junior Jace Williams (4) fights to keep the ball during the second half of the game at Grand Rapids Christian High School on Tuesday, Dec. 17, 2019, in Grand Rapids, Mich.Brian Hayes | MLive.comHoop dreamsGrand Rapids Catholic Central basketball coach T.J. Meerman is confident that Jace Williams could play college hoops if that’s what he wanted to do.\nWilliams helped the Cougars win the OK Blue Conference, advance to the Division 2 district tournament finals and finish 19-3.\nBut the 12 schools who offered Williams a football scholarship have no need to worry.\nWilliams will be sticking with football at the next level.\n“It has been fun going around and looking to see where I want to spend the next four years.”Jace Williams takes part in Grand Rapids Catholic Central football practice at Catholic Central Athletic Complex (C.A.T.)"}, {"url": "https://www.breitbart.com/politics/2020/04/14/costco-meatpacking-virus-migrant-labor/", "title": "Costco’s High-Tech Meatpacking Plant Stays Open as Virus Shuts Migrant-Labor Plants", "authors": ["Neil Munro"], "date": "2020-04-14", "keywords": ["plants", "shuts", "technology", "fremont", "costcos", "open", "migrantlabor", "workers", "mayor", "employees", "virus", "hightech", "plant", "stays", "meatpacking", "lincoln", "facility", "poultry"], "summary": "She added the person did not interact with “many employees” their last day at the plant, which was April 8.\nKristi Noem and Sioux Falls Mayor Paul TenHaken are calling on the meat packing plant to shut down for two weeks.\nIn Iowa, Tyson Foods’ pork meatpacking site in Columbus Junction closed after the disease hit 24 of the 1,400 employees.\nIn Fremont, however, Costco’s automated line is putting pressure on other meatpackers to raise their game, Fremont Mayor Scott Getzschman told Breitbart News.\nBut with the rising pay in the Fremont meatpacking jobs, Mayor Getzschman told Breitbart News, the social status of slaughterhouse jobs “has become more acceptable.”"}, {"url": "https://ktiv.com/2019/12/26/fatal-crash-on-i-80-claims-fourth-life/", "title": "4-year-old dies of injuries from Dec. 15 freeway crash", "authors": ["Dean Welte"], "date": "2019-12-26", "keywords": ["crash", "nsp", "injuries", "4yearold", "dies", "nebraska", "omaha", "dec", "freeway", "passed", "trailblazer", "15", "occupants", "westbound", "bernabe", "pascual", "transported"], "summary": "(KTIV) -- A fatal crash that occurred on Sunday, December 15, near Greenwood, Nebraska, has claimed a fourth life.\nThe Nebraska State Patrol says on Wednesday, December 25, 4-year-old Alexis Pascual Bernabe of Lincoln, Nebraska, died as a result of injuries suffered in the crash.\nThe Patrol says the crash happened near Greenwood at mile marker 422 on I-80, about 35 miles southwest of Omaha, Nebraska.\nThe NSP initially reported three occupants of the Trailblazer passed away as a result of the crash.\nBernade Escobar and Pascual Bernabe are parents of the youngest two children."}, {"url": "https://www.ncnewspress.com/news/20191202/lincoln-south-beltway-project-set-to-begin-today", "title": "Lincoln South Beltway project set to begin today", "authors": [], "date": "2019-12-02", "keywords": ["begin", "set", "spring", "today", "project", "topping", "south", "lincoln", "soon", "transportation", "work", "beltway"], "summary": "Preliminary work on the Lincoln South Beltway project will begin soon, according to the Nebraska Department of Transportation (NDOT).\nTree topping within the project limits is anticipated to begin today (Dec. 2) and will be completed by March 30, 2020.\nThe project will be let on December 12, 2019 and construction of the beltway will begin in the spring of 2020.\nMore information about the project is available at https://dot.nebraska.gov/projects/lincoln-south-beltway/."}]