[{"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/03/24/zion-harmon-marshall-county-makes-college-choice/2898927001/", "title": "Four-star 2021 Marshall County guard Zion Harmon picks Western Kentucky", "authors": ["Dominique Yates", "Published P.M. Et March"], "date": "2020-03-24", "keywords": ["zion", "western", "point", "marshall", "fourstar", "kentucky", "support", "picks", "guard", "2021", "county", "lot", "basketball", "class", "harmon"], "summary": "CLOSEAt 2:08 p.m. Tuesday, Marshall County standout Zion Harmon, the state's best basketball player in the Class of 2021, announced his commitment to Western Kentucky University on Tuesday.\nHarmon narrowed his list between Western Kentucky, Kansas, Maryland, Seton Hall, Murray State and Seton Hall before pledging to Rick Stansbury and the Hilltoppers.\n\"I feel comfortable with the coach and the city, and I know so many people at Western Kentucky, also,\" Harmon said about his commitment.\nMore: 'Misunderstood' Zion Harmon faces decision: senior year at Marshall County or college?\n\"(Western Kentucky) has a lot of energy, a lot of support, a lot of tradition in the gym,\" Harmon said."}, {"url": "https://campuslifesecurity.com/articles/2020/04/13/following-2018-shooting-kentucky-school-district-receives-grant-for-security-improvements.aspx", "title": "Following 2018 Shooting, Kentucky School District Receives $620,000 Grant For Security Improvements -- Campus Security & Life Safety", "authors": ["Haley Samsel", "About The Author"], "date": "2020-04-13", "keywords": ["security", "2018", "shooting", "marshall", "received", "high", "kentucky", "life", "school", "grant", "county", "students", "safety", "receives", "improvements", "following"], "summary": "Following 2018 Shooting, Kentucky School District Receives $620,000 Grant For Security ImprovementsMarshall County High School, the site of a shooting that killed two students in 2018, has since received hundreds of thousands in grants for security systems and mental health therapists.\nA Kentucky high school that was the site of a fatal shooting in 2018 will receive more than $620,000 in grant money to install a security camera system and upgrade its facilities, according to state justice and public safety officials.\nThe Jan. 23, 2018 shooting near Benton took the lives of two students and injured 18 others in the school, causing deep wounds within the close-knit community of just over 31,000 people.\nHe added: “We are grateful the Marshall County Board of Education received this critically important grant.\nThe school district has previously received grants to launch its “Marshall Strong Recovery Project” and hire mental health therapists at Marshall County High School, where the shooting took place."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/03/24/kentucky-indiana-high-school-basketball-2019-20-highlights-awards/2875661001/", "title": "The best of the preps: What stood out to us from this high school basketball season", "authors": ["David J. Kim", "Jason Frakes", "Dominique Yates", "Published A.M. Et March"], "date": "2020-03-24", "keywords": ["best", "state", "sacred", "stood", "male", "high", "region", "school", "game", "preps", "basketball", "tournament", "season", "heart"], "summary": "CLOSE The high school basketball season was cut short, but there were still plenty of great moments from this year.\nNonetheless, the 2019-2020 basketball season was yet another thriller, and Courier Journal reporters Jason Frakes, Dominique Yates and David J. Kim have picked the best of the shortened season.\nCLOSE The high school basketball season was cut short, but there were still plenty of great moments from this year.\nThe Seventh Region championship game was, rightfully, very hyped after the two teams split their two regular season game contests.\nBiggest upsetFrakes: It came in the final high school basketball game of the season."}, {"url": "https://www.courier-journal.com/story/news/local/2020/01/09/louisville-and-kentucky-20-people-watch-2020/2636854001/", "title": "Who are the most influential people in Kentucky? Here are 20 to watch in 2020", "authors": ["The Courier Journal", "Published P.M. Et Jan."], "date": "2020-01-09", "keywords": ["important", "watch", "influential", "2020", "president", "senate", "kentucky", "louisville", "say", "20", "im", "watching", "work"], "summary": "Why 2020 is important: Kentucky has the highest rate of child abuse and neglect in the nation.\nWhy 2020 is important: 2020 may be the first year that over 100 scholars graduate with a degree in a single year, Dykstra says.\nWhy 2020 is important: With Gibson at the helm, 2020 will be a new era for the Kentucky Derby Festival.\nWhy 2020 is important: In 2020, MacGregor plans to launch her own website, laramacgregor.com, to share her personal journey of living life over cancer.\nWhy 2020 is important: The 2020 legislative session began Tuesday, and the top item of which will be the passage of the state’s two-year operating budget."}, {"url": "https://arkansasrazorbacks.com/nsd2020-vance-jackson/", "title": "#NSD2020: Vance Jackson", "authors": ["Mike Cawood"], "date": "2020-04-15", "keywords": ["vance", "shooting", "state", "careerhigh", "rebounds", "game", "games", "points", "nsd2020", "versus", "jan", "scored", "jackson"], "summary": "#NSD2020: Vance JacksonVance Jackson6-9, 230, FPasadena, Calif. (Univ.\nof New Mexico / Prolific Prep)Set to graduate from New Mexico in the Spring of 2020 … Played his freshman season at UConn before transferring to New Mexico … Has scored 990 points in three collegiate seasons (92 games with 65 starts), averaging 10.8 ppg for his career … Has averaged 5.4 rebounds with 165 assists while shooting 35.3% from 3-point range (157-444) … Has eight career double-doubles.\nSophomore (2017-18 at New Mexico):Sat out due to NCAA transfer rules.\nHigh School:Consensus Top 60 recruit … Played one season at Prolific Prep (Napa, Calif.) … Averaged 21.7 points, 6.8 rebounds to help Prolific … Posted a 25-7 record and reached the semifinals of the Grind Session National Championships in Lawrence, Kan. … Attended St. John Bosco (Bellflower, Calif.) as a sophomore and junior, averaging 19.4 points, 7.1 rebounds … Captured the Division II State Championship … Began his high school career at La Salle HS in Pasadena … Played AAU ball for Dream Vision, averaging 16.0 points per game and shooting 55.4 percent from three-point range during the Adidas Summer Championships.\nFor more­­ information on Arkansas Men’s Basketball, follow @RazorbackMBB on Twitter."}, {"url": "https://www.usatoday.com/story/news/health/2020/04/07/nurse-says-she-punished-refusing-work-without-n-95-mask/2960519001/", "title": "Nurse says she was suspended after refusing to treat coronavirus patients without a mask", "authors": ["Andrew Wolfson", "Published A.M. Et April"], "date": "2020-04-07", "keywords": ["patients", "nurse", "treat", "mask", "n95", "care", "surgical", "suspended", "coronavirus", "health", "work", "hospital", "refusing"], "summary": "USA TODAYLOUISVILLE, Ky. – A nurse at a hospital in Kentucky said she was suspended for insubordination for refusing to treat COVID-19 patients when the hospital would not supply her with a protective respirator.\nKenyatta Ervin, 49, said she previously had health conditions like pneumonia and asthma and needs the protection of an N95 mask, which have been in short supply.\nShe said in an interview Monday that supervisors would give her only a surgical mask, a loose-fitting disposable device that isn’t sealed around the nose and mouth.\nUntil the change, CDC recommended that health care workers interacting with coronavirus patients or suspected cases wear N95 respirators, along with gowns, gloves and eye protectors.\nShe said the first day, March 26, she was given an N95 mask, but on her second day she received only a surgical mask."}, {"url": "https://www.courier-journal.com/story/news/2020/03/20/coronavirus-pastor-arrested-holding-church-during-spanish-flu/2874182001/", "title": "One pastor was so outraged by church ban during Spanish flu that he went to jail", "authors": ["Jon Hale", "Published A.M. Et March"], "date": "2020-03-20", "keywords": ["pastor", "services", "taylor", "flu", "courier", "church", "reported", "murray", "journal", "went", "outraged", "ban", "jail", "members", "spanish"], "summary": "Harvey Boyce Taylor, the pastor at Murray Baptist Church in Murray, Kentucky, held services in violation of the ban on Jan. 26, 1919.\nTaylor was arrested in his pulpit at the evening service, according to the Jan. 28, 1919 edition of The Courier Journal.\nBuy Photo In 1919, the Courier Journal reported on the saga of Murray Baptist Church pastor Harvey Boyce Taylor's defying the state board of health's ban on public gatherings during the Spanish Flu outbreak.\n(Photo: Courier Journal Archives)The county judge announced afterward he would issue warrants for the arrest of Taylor and 31 others at the service.\nIn its Feb. 19 edition, The Courier Journal reported members of the Murray Baptist Church congregation had settled their fines for violating the ban, but Taylor still refused."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/01/31/black-history-month-2020-events-things-do-louisville-ken-tucky/4551609002/", "title": "Here are 30+ events to help you celebrate Black History Month in Louisville this February", "authors": ["Gege Reed", "Published A.M. Et Jan."], "date": "2020-01-31", "keywords": ["month", "celebrate", "american", "library", "feb", "events", "help", "free", "public", "african", "30", "louisville", "history", "information", "black", "freemore"], "summary": "Courier JournalThis February, there are more than 30 events around Louisville to help you celebrate Black History Month.\nAfrican American Read-InWHAT: In celebration of Black History Month, the Carnegie Center is participating in the national African American Read-In.\nRated: R.WHERE: Louisville Free Public Library, Main Branch, 301 York St.\nWHAT: Test your knowledge of Black HistoryWHERE: Louisville Free Public Library, Newburg Branch, 4800 Exeter Ave.\nWHERE: Louisville Free Public Library, South Central Branch, 7300 Jefferson BlvdWHEN: 6:30-7:30 p.m. Feb. 17COST: FreeMORE INFORMATION: To register, 502-964-3515."}, {"url": "https://www.courier-journal.com/picture-gallery/entertainment/events/kentucky-derby/festival/2020/01/06/kentucky-derby-festival-2020-royal-court-princesses-crowned/2823074001/", "title": "Kentucky Derby Festival 2020: Royal Court, princesses crowned", "authors": [], "date": "2020-01-06", "keywords": ["derby", "2020", "princesses", "court", "kentucky", "royal", "festival", "crowned"], "summary": ""}, {"url": "https://www.courier-journal.com/story/weather/local/severe/2020/01/11/louisville-weather-thousands-without-power-during-windy-saturday/4441789002/", "title": "Amid wind and rain, thousands lose power Saturday in Louisville and Southern Indiana", "authors": ["Billy Kobin", "Published P.M. Et Jan."], "date": "2020-01-11", "keywords": ["wind", "amid", "customers", "thousands", "according", "power", "southern", "kentucky", "louisville", "county", "weather", "lose", "indiana", "rain", "11"], "summary": "CLOSEThousands are without power Saturday in the Louisville area as well as in parts of Southern Indiana and Kentucky, as high winds and a line of thunderstorms moved through the region.\nEarlier in the day, about 780 Fayette County customers and over 1,300 customers in Jessamine County had to deal with outages, accoridng to LG&E's outage map.\nIn Southern Indiana, over 5,700 people were without power in Floyd County just after 12 p.m. Saturday, according to Duke Energy's outage map.\nA severe thunderstorm watch was in effect until 5 p.m. Saturday for the Louisville area as well large swaths of Kentucky and Southern Indiana, according to the National Weather Service.\nGordon said there had been reports of flooding in parts of Southern Indiana west of Louisville, including in Perry, Harrison and Crawford counties."}, {"url": "https://www.courier-journal.com/story/entertainment/events/kentucky-derby/festival/2020/01/06/kentucky-derby-festival-2020-kdf-announces-royal-court/2785747001/", "title": "Beauty, style and grace. Meet the 2020 Kentucky Derby Festival Royal Court", "authors": ["Published A.M. Et Jan."], "date": "2020-01-06", "keywords": ["derby", "university", "style", "2020", "court", "kentucky", "louisville", "royal", "grace", "festival", "meet", "beauty", "scholar", "member"], "summary": "CLOSEWhen the crowns come out, we know the countdown to the 2020 Kentucky Derby Festival has begun.\nOn Monday, the five women selected to serve as Princesses in the 2020 Kentucky Derby Festival Royal Court were introduced in a ceremony at Macy’s in Oxmoor Center.\nThe Royal Court Program is coordinated by The Fillies, Inc., a volunteer group that works closely with the Kentucky Derby Festival.\nThe five women will act as ambassadors for the 2020 Kentucky Derby Festival, attending nearly 70 events over a two-week period.\nYou may like: Kentucky Derby Festival announces new president, CEOThe first Derby Festival Princess was crowned in 1957, the second year of the festival."}, {"url": "https://www.wave3.com/2020/01/09/man-injured-portland-neighborhood-shooting/", "title": "Man injured in Portland neighborhood shooting", "authors": ["Shellie Sylvestri", "Published At Pm"], "date": "2020-01-09", "keywords": ["permanently", "shooting", "report", "pandemic", "months", "million", "close", "injured", "claims", "cnbc", "small", "portland", "neighborhood", "continues", "man"], "summary": "A new report by CNBC claims 7.5 million small businesses will have to close permanently if the pandemic continues through the next few months."}, {"url": "https://www.wave3.com/2020/01/01/lmpd-investigating-shooting-valley-station/", "title": "Man charged in connection to Louisville’s first murder of 2020", "authors": ["Phylicia Ashley", "Published At Pm"], "date": "2020-01-01", "keywords": ["murder", "street", "2020", "person", "questions", "went", "connection", "louisvilles", "charged", "neighbors", "outside", "uncontrollable", "watching", "stomach", "neighbor", "man"], "summary": "Baxter said her neighbor called the police after hearing an altercation at the new neighbor’s house.\nWhen she went outside she got double knots in her stomach after watching people show up to her street with uncontrollable emotions, and as one person begged someone in the back of a police car for answers to their questions."}, {"url": "https://www.courier-journal.com/story/news/local/2020/01/03/louisville-receives-top-score-lgbtq-inclusion-policies-2019/2775600001/", "title": "Louisville scored a 100 for LGBTQ support in 2019. But where can the city improve in 2020?", "authors": ["Savannah Eadens", "Published A.M. Et Jan."], "date": "2020-01-03", "keywords": ["services", "improve", "2020", "received", "support", "city", "youth", "2019", "louisville", "rights", "municipal", "100", "score", "scored", "lgbtq"], "summary": "Courier JournalFor the fifth year in a row, Louisville received a score of \"100\" on the Human Rights Campaign's Municipal Equality Index.\nThe 2019 score of 100 points is a far cry from 2014, when Louisville received 66 out of 100 points.\nThe total score for Louisville stilladded to 100 because some of the lacking areas were considered \"bonus points.\"\nFor example, Louisville did not receive recognition for its support of LGBTQ youth.\nThough there are no specialized city services, Louisville has given grants to nonprofit organizations such as the Louisville Youth Group, which provides a safe space and resources for LGBTQ youth and allies."}, {"url": "https://www.courier-journal.com/story/news/2020/01/27/coronavirus-outbreak-what-you-should-know-kentucky/4586975002/", "title": "Before you buy a mask, here's what you should know about the coronavirus in Kentucky", "authors": ["Emma Austin", "Tessa Duvall", "Published P.M. Et Jan."], "date": "2020-01-27", "keywords": ["heres", "virus", "mask", "symptoms", "know", "kentucky", "china", "coronavirus", "health", "buy", "spreading", "cdc", "contact", "cases"], "summary": "CLOSE With a viral outbreak prompting the WHO to declare a global health emergency, let's take a look at what a coronavirus is.\nCoronavirus tracker: How many coronavirus cases are in Kentucky?\nKentucky coronavirus live updates: Get all the latest news hereHere's what else you should know:How can you protect yourself?\nNovel coronavirus outbreak: How Kentucky is preparing for cases of the illnessICLOSE The coronavirus outbreak has left Wuhan, China nearly empty.\nAlso: Here's what to do if you have coronavirus symptoms in Kentucky or IndianaContributing: Deborah Yetter, Ben Tobin, Tessa Duvall."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/01/24/louisville-shows-january-2020-scotty-mccreery-trampled-turtles/4477722002/", "title": "Louisville shows this week: Scotty McCreery, Trampled By Turtles, Lettuce & more", "authors": ["Gege Reed", "Published A.M. Et Jan."], "date": "2020-01-24", "keywords": ["shows", "w", "start", "music", "lettuce", "week", "concert", "university", "trampled", "hall", "jan", "tickets", "louisville", "mccreery", "scotty", "turtles", "st"], "summary": "7 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Mercury Ballroom, 611 S. Fourth St. Tickets start at $25.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free."}, {"url": "https://wsiltv.com/2020/01/16/body-found-in-ohio-river-identified-as-louisville-ky-man/", "title": "Body found in Ohio River identified as Louisville, Ky. man", "authors": ["News Staff"], "date": "2020-01-16", "keywords": ["mccracken", "body", "missing", "mans", "melton", "louisville", "county", "ohio", "unit", "river", "ky", "office", "identified", "man", "family"], "summary": "MCCRACKEN CO., Ky. (WSIL) -- The body of a man found in the Ohio River in 2018 has been identified as an 84-year-old from Louisville, Kentucky.\nThe body was discovered in the river near the Brookport Bridge on September 18, 2018.\nEfforts by the Kentucky Medical Examiner’s Office, McCracken County Coroner’s Office, “NamUS” Regional Specialist Amy Dobbs, Louisville Metro Homicide/Missing Persons Unit, and McCracken County Sheriff’s Department Detective unit led to the discovery of the man's identity.\n“These are cases that really stay with you,” said Amanda Melton, McCracken County Coroner.\n“I shared with this man’s family that our community had done the very best they possibly could to honor their loved one,” said Melton."}, {"url": "https://www.wlky.com/article/belskis-blog-january-2020-weather-numbers-for-louisville/30738070", "title": "Belski's Blog - January 2020 weather numbers for Louisville", "authors": ["John Belski", "Https", "Www.Facebook.Com Pages John-Belski"], "date": "2020-02-01", "keywords": ["belskis", "degrees", "sunny", "temperature", "trace", "2020", "day", "louisville", "blog", "numbers", "weather", "normal", "winter", "days", "60"], "summary": "It is hard to believe that winter on the meteorological calendar is already two thirds over.What winter?\nIt is hard to believe that winter on the meteorological calendar is already two thirds over.\nWhat winter?\nWe certainly did have not had much of one yet.\nClick HERE for more info."}, {"url": "https://www.courier-journal.com/picture-gallery/sports/preps/kentucky/2020/01/29/louisville-invitational-tournament-2020-bullitt-east-takes-butler/4615218002/", "title": "Louisville Invitational Tournament 2020: Bullitt East takes on Butler", "authors": [], "date": "2020-01-29", "keywords": ["invitational", "butler", "2020", "tournament", "louisville", "bullitt", "east", "takes"], "summary": ""}, {"url": "https://www.courier-journal.com/story/weather/local/2020/01/09/louisville-weather-wet-and-warm-weekend-expected-jan-17-19/4417961002/", "title": "Louisville could see record high temperatures this weekend with 'multiple waves of rain'", "authors": ["Billy Kobin", "Published A.M. Et Jan."], "date": "2020-01-09", "keywords": ["degrees", "multiple", "temperatures", "waves", "high", "according", "night", "louisville", "weather", "service", "weekend", "rain", "record"], "summary": "National Weather Service meteorologist Ron Steve said \"multiple waves of rain\" will come through the Louisville area from midnight Friday through Saturday evening.\nBesides the rain that is likely Friday, thunderstorms are also possible in Louisville after 10 a.m., according to the National Weather Service.\nFriday will otherwise be cloudy, the weather service projects, with high temperatures in the mid-60s and wind gusts as high as 30 mph, so hang on tight to that umbrella.\nThe Jan. 10 record high of 66 degrees in Louisville was set in 1975, but Steve said that record may be broken, as it may reach 67 degrees.\nThe warm temperatures and rain in the Louisville area will continue on Saturday, with a high near 70 degrees."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/01/05/louisville-invitational-tournament-2020-pairings-and-seedings/2819935001/", "title": "Male is top seed in 73rd annual Louisville Invitational after solid showing in New Orleans", "authors": ["Jason Frakes", "Published P.M. Et Jan."], "date": "2020-01-05", "keywords": ["73rd", "invitational", "solid", "orleans", "vs", "beat", "male", "13", "winner", "seed", "louisville", "north", "haworth", "showing", "630", "jan", "lit", "annual"], "summary": "The top-seeded Bulldogs will face 16th-seeded Collegiate at 6:30 p.m. on Monday, Jan. 13, in a first-round game.\nThe LIT will open at Valley High School with first-round games on Jan. 13 and 14.\nQuarterfinals are set for Jan. 15, with semifinals on Jan. 17 and the championship at 7 p.m. on Jan. 18.\nMale has a record 13 LIT championships but hasn’t won the event since 2002, when they beat North Hardin 57-46 in the final.\nBoys Republic Bank Louisville Invitational TournamentAt Valley High SchoolSeeds in parentheses* Monday, Jan. 13 – Doss (15) vs. Seneca (2), 3:30 p.m.; Manual (14) vs."}, {"url": "https://www.courier-journal.com/story/news/politics/2020/01/13/kentucky-politics-listening-sessions-2020-lgbtq-topic-january/4448081002/", "title": "Ready for On Kentucky Politics again? January's listening session is covering LGBTQ issues", "authors": ["Kathryn Gregory", "Published A.M. Et Jan."], "date": "2020-01-13", "keywords": ["politics", "issues", "januarys", "election", "covering", "joe", "free", "courier", "kentucky", "questions", "louisville", "ready", "listening", "sessions", "session", "lgbtq"], "summary": "We want to know what issues are more important to you and your family as you look toward the May primary and the November election.\nWe invite you to be part of six listening sessions held across the Louisville.\nFollowing the success of our On Kentucky Politics with The Courier Journal listening sessions ahead of the 2019 governor's race, we will be adding topic-based themes to our slate of 2020 events, including race, women's issues and more.\nOur first event, which will focus on LGBTQ issues, will be held from 6-7:30 p.m. Tuesday, Jan. 28, at Play Louisville, 1101 E. Washington St. Additional dates and topics of our On Kentucky Politics listening sessions will be announced in the coming weeks.\nTo keep you up to date on all things politics, we've also launched a free On Kentucky Politics newsletter that summarizes everything happening on the political scene in Kentucky each week."}, {"url": "https://www.wave3.com/2020/01/01/he-will-always-love-me-son-homicide-victim-hopeful-answers/", "title": "'He will always love me’: Son of homicide victim hopeful for answers", "authors": ["Maira Ansari", "Published At Pm"], "date": "2020-01-01", "keywords": ["tell", "answers", "wrong", "morris", "lets", "know", "dont", "kentrell", "homicide", "loved", "world", "victim", "son", "hopeful", "love"], "summary": "\"Everything,\" Kentrell Morris Jr. said.\n\"Just that he would never tell me wrong.\nIt's like if I ask for something he would be like ‘let's get it!’ I just loved him.\nI love him.\nI don't know why people like this in the world do this to other people that don't do nothing.\""}, {"url": "https://www.fox19.com/2020/01/30/potential-lawsuits-threaten-millions-kentucky-taxpayer-dollars/", "title": "Potential lawsuits threaten millions of Kentucky taxpayer dollars", "authors": ["Natalia Martinez", "Published At Pm"], "date": "2020-01-30", "keywords": ["millions", "potential", "officer", "dollars", "wrongful", "tiffany", "million", "kentucky", "won", "hume", "lawsuits", "washington", "case", "example", "taxpayer", "threaten", "cases"], "summary": "Then there are cases where judgments have already been made but not paid.\nOne example is the case won by LMPD Officer Jill Hume.\nHume won $1.2 million.\nAnother example is the lawsuit filed by Tiffany Washington for a wrongful arrest.\nThat case also includes an additional nine plaintiffs whose cases haven't started yet."}, {"url": "https://www.courier-journal.com/story/money/companies/2020/01/23/gli-annual-meeting-2020-louisville-community-leaders-gather-kicc/4532168002/", "title": "'Take Louisville from stable to incomparable': Five highlights from GLI's annual meeting", "authors": ["Ben Tobin", "Published P.M. Et Jan."], "date": "2020-01-23", "keywords": ["glis", "incomparable", "president", "gli", "today", "business", "power", "meeting", "timms", "louisville", "leaders", "highlights", "stable", "ceo", "annual", "davasherwisdom"], "summary": "CLOSEUnder the dimmed lights of a dark ballroom in the Kentucky International Convention Center, roughly 1,000 business people and community leaders gathered Thursday for Greater Louisville Inc.'s annual meeting.\nKent Oyler, who served as president and CEO for more than five years, decided to leave to focus on other business interests.\nStrategies for Louisville growthDavasher-Wisdom said Louisville has grown a lot over the past few years — but not as quickly as some peer cities.\nThus, as GLI president and CEO, Davasher-Wisdom said her strategic plan is her top priority to \"take Louisville from stable to incomparable.\"\nThe Jefferson County Public Schools Academies of Louisville, Louisville Muhammad Ali International Airport and the YMCA of Greater Louisville's Republic Bank Foundation YMCA project all received the silver fleur-de-lis awards for achievement and commitment in the Louisville community."}, {"url": "https://www.leoweekly.com/2020/01/kentucky-senate-priorities-purposeful-political/", "title": "Kentucky Senate Priorities: Purposeful or Political?", "authors": ["Danielle Grady"], "date": "2020-01-15", "keywords": ["republicans", "public", "election", "elections", "state", "senate", "kentucky", "voter", "priorities", "purposeful", "bills", "bill", "cross", "political"], "summary": "The priorities, especially the ones regarding immigration and voting, could be seen as wedge issues, those that force the Democrats to pick a side or suffer political consequences.\nSenate Bill 1 would require public employees, including law enforcement officers to use their “best efforts” to support immigration law enforcement.\nAdvertisementSB 2: Voter IDPhoto voter ID bills have become a priority for Republicans across the country in recent years, said Cross.\nIn 2016, a similar bill failed because some conservatives do not want Kentucky’s elections connected to federal elections, Cross said.\nCross said he’s not “really sure” about Senate Bill 5 when it comes to what it would mean for the state."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/01/13/martin-luther-king-day-2020-louisville-events-service-motorcades/4436557002/", "title": "Here are 10 events in Louisville where you can honor MLK's legacy this month", "authors": ["Gege Reed", "Published A.M. Et Jan."], "date": "2020-01-13", "keywords": ["month", "events", "martin", "luther", "mlks", "day", "dr", "louisville", "legacy", "honor", "king", "information", "service", "jan", "jr"], "summary": "Here are a handful of events happening around Louisville that celebrate MILK's legacy:Martin Luther King Jr.\nMartin Luther King Jr. Memorial Motorcade & ServiceWHAT: Speaker: Ray Wallace, Chancellor of Indiana University Southeast.\nPoster and multimedia contest winners, King Scholarship winners and Martin Luther King Freedom & Justice Awards will be presented.\nWHEN: 10 a.m. Monday, Jan. 20MORE INFORMATION: 502-471-2146Martin Luther King Jr. MotorcadeBuy Photo Dr. Martin Luther King in Louisville with his wife, Coretta Scott King and Dr. King's brother A.D. Williams King.\n(Associated Press) (Photo: Anonymous, ASSOCIATED PRESS)Martin Luther King Jr. Day of ServiceWHAT: The Day of Service features a speaker, followed by transportation to service sites."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/01/13/louisville-invitational-tournament-2020-day-one-highlights/4443212002/", "title": "Punches are thrown following Seneca's win over Doss at the Louisville Invitational", "authors": ["David J. Kim", "Published P.M. Et Jan."], "date": "2020-01-13", "keywords": ["senecas", "invitational", "coach", "play", "thrown", "punches", "seneca", "win", "run", "game", "louisville", "going", "points", "lead", "doss", "following", "teams", "team"], "summary": "CLOSEFollowing Seneca’s buzzer beater layup to propel the Redhawks to a 51-49 win over Doss in the first round of the 73rd Republic Bank Louisville Invitational Tournament’s opening game, punches were thrown by both teams.\nAfter the buzzer sounded, Seneca’s Delshawn Simms and Doss’ Tony Moss exchanged words with each other.\nSeneca coach Miquel Coleman and Doss coach Blake Stone were shaking hands and exchanging words with each other when the scuffle happened.\nI don’t want to speculate right now.”Doss ties the game with a three but Seneca quickly scores for a buzzer beater.\nIt is also well-below the team's scoring average of 74.1 points per game, the 10th highest in the state."}, {"url": "https://www.whas11.com/article/weather/storm-team-blog/a-wet-start-to-2020-and-looking-back-at-2019/417-5581079c-a99c-4604-80cb-2bfc4f0b0835", "title": "A Wet Start to 2020, and Looking Back at 2019", "authors": ["Author", "Alden German", "Whas", "Published", "Pm Est January", "Updated"], "date": "2020-04-15", "keywords": ["start", "2020", "region", "snow", "2019", "wet", "temp", "night", "weather", "system", "looking", "possible", "precipitation", "storm", "rain"], "summary": "Do you believe 2020 is the start of the new decade, or 2021?\nLet's talk about our first storm system of 2020 and at the end of the blog review the weather in 2019.\nAs the now-formed storm system moves up the Mississippi River Valley rain will as well.\nThere are indications of another potential storm impact the region with both rain and snow possible.\n2019 WEATHER IN REVIEW: What a year 2019 was for weather in Louisville!"}, {"url": "https://www.theguardian.com/us-news/2020/jan/10/kentucky-republicans-voter-fraud", "title": "Kentucky Republicans push restrictive voting law after landmark Democratic win", "authors": ["Sam Levine"], "date": "2020-01-10", "keywords": ["republicans", "election", "id", "landmark", "state", "vote", "win", "kentucky", "voter", "likely", "democratic", "voting", "push", "law", "restrictive"], "summary": "Last month, Kentucky elected Democratic governor Andy Beshear in a closely watch election – a landmark blue win in a mostly conservative state.\nKentucky already requires voter ID at the polls, but the new policy would take this a step further to require a photo and an expiration date.\nIt appears that Republicans were likely to push the bill regardless of Beshear’s win.\nMichael Adams, the Kentucky secretary of state, had already been campaigning on a photo ID requirement last year.\nHe added that Kentucky already has some of the most restrictive voting laws in the country – a 30-day cutoff for voter registration and no early voting period."}, {"url": "https://www.wave3.com/2020/01/02/first-louisville-babies-born-minutes-away-each-other/", "title": "First Louisville babies of 2020 born 5 minutes away from each other", "authors": ["Phylicia Ashley", "Published April", "At Pm"], "date": "2020-01-02", "keywords": ["package", "unique", "away", "minutes", "used", "2020", "rob", "long", "louisville", "born", "ounces", "babies", "pounds", "sawyer", "newborn", "parents"], "summary": "Sawyer Lee was the first baby born in 2020.\nHe checked in at 8 pounds, 8 ounces and 20.5 inches long at Baptist Health.\nHis parents, Amanda and Rob, have two other children and are used to the newborn experience, but they said Sawyer came with a unique package."}, {"url": "https://www.courier-journal.com/story/weather/local/2019/08/29/farmers-almanac-predictions-winter-2020-kentucky-weather/2129712001/", "title": "It's going to be a wild ride: Farmers’ Almanac predicts a 'Polar Coaster' this winter", "authors": ["Published A.M. Et Aug."], "date": "2019-08-29", "keywords": ["know", "region", "coaster", "snow", "kentucky", "wild", "polar", "winter", "ride", "going", "farmers", "almanac", "weather", "predicts", "geiger"], "summary": "CLOSE Farmers' Almanac predicts a \"polar coaster\" of a winter The News JournalWhat if we take a different approach to the weather this winter?\n\"We're calling this winter a 'Polar Coaster' because of fluctuating warm and cold temperatures and precipitation,\" Peter Geiger, editor of the 200-year-old Farmers’ Almanac publication, told the Courier Journal.\nThe Farmers’ Almanac bases its long-range forecast for the United States \"on a mathematical and astronomical formula developed in 1818.\"\nFarmer's Almanac (Photo: Farmer's Almanac)Be prepared: How to keep your pipes from freezing this winter in KentuckyYou'll need a coat at Kentucky DerbyThis year's winter will cause a slow start to a spring season, according to the Farmers' Almanac.\nWhile the Farmers' Almanac offers little rest for the winter-weary this year, there is a positive spin to this season's outlook."}, {"url": "https://www.courier-journal.com/story/news/politics/2020/01/28/what-lgbtq-issues-louisville-kentucky-residents-have-say-2020-elections/4494048002/", "title": "Conversion therapy, homelessness main topics at first On Kentucky Politics event of 2020", "authors": ["Kathryn Gregory", "Published P.M. Et Jan."], "date": "2020-01-28", "keywords": ["politics", "main", "issues", "courier", "therapy", "2020", "youth", "topics", "kentucky", "journal", "event", "homelessness", "session", "conversion", "lgbtq", "transgender"], "summary": "(Photo: Scott Utterback/Courier Journal)Numerous hot-button issues, including conversion therapy and transgender rights, that are central to proposed legislation this session in Kentucky were discussed at the first On Kentucky Politics with The Courier Journal event of 2020.\nTuesday's event, held at Play Louisville, 1101 E. Washington St., was focused on LGBTQ issues.\nThe proposed \"transgender athlete\" bill, Senate Bill 114, was of particular interest for the audience, with some saying its passage would disenfranchise transgender youth in Kentucky.\nAdditional dates and topics of our On Kentucky Politics listening sessions will be announced in the coming weeks.\nTo keep you up to date on all things politics, we've also launched a free On Kentucky Politics newsletter that summarizes and highlights everything happening on the political scene in Kentucky each week."}, {"url": "https://spectrumnews1.com/ky/lexington/news/2019/09/01/representative-james-tipton-files-bill-to-make-driving-with-a-hand-held-cellphone-illegal-in-2020", "title": "Kentucky could ban driving with a cellphone in hand in 2020", "authors": ["Published Pm Et Aug."], "date": "2019-09-01", "keywords": ["using", "phone", "illegal", "tipton", "state", "2020", "kentucky", "hand", "ban", "driving", "traffic", "law", "cellphone"], "summary": "LOUISVILLE, Ky. – In 2020, driving with a cellphone, or any communication device, in hand could be illegal.\nKentucky’s current law bans drivers from texting, emailing, and instant messaging, but Representative James Tipton says that’s not enough.\nCertain emergency situations are the exception to the rule, such as reporting illegal activity or summoning medical attention.\nSergeant Josh Lawson, Public Affairs Commander for the Kentucky State Police, said using a cellphone while driving can be like drunk driving.\nIf the pre-filed bill becomes a law during the 2020 session, then the Bluegrass State will join 20 other U.S. states, along with Washington D.C., Puerto Rico, Guam and the U.S. Virgin Islands, to make driving with a cellphone in hand illegal."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/01/18/louisville-invitational-tournament-2020-ballard-beats-fern-creek/4460489002/", "title": "Behind MVP Maker Bar, Ballard basketball knocks off Fern Creek for LIT championship", "authors": ["Jason Frakes", "Published P.M. Et Jan."], "date": "2020-01-18", "keywords": ["creek", "mvp", "schooler", "fern", "ballard", "knocks", "championship", "basketball", "bar", "team", "points", "lead", "lit", "maker"], "summary": "So that’s why I’m excited.”Buy Photo Ballard forward Maker Bar prepares to shoot in the champlonshp game of the Boys LIT tournament as Fern Creek center Darrius Washington, left, defends the basket.\n“I’m surprised, but I believe in my team,” Bar said of winning the L.J.\n“Give Fern Creek a lot of credit.\n“Without them, I can’t win (MVP),” Bar said of his teammates.\n“Butch” Charmoli MVP – Maker Bar (Ballard)."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/01/02/monster-jam-louisville-ky-2020-how-get-tickets-pit-passes/2795232001/", "title": "Louisville, start your engines — Monster Jam is returning to Freedom Hall this January", "authors": ["Emma Austin", "Published P.M. Et Jan."], "date": "2020-01-02", "keywords": ["truck", "start", "pit", "jan", "trucks", "hall", "kentucky", "engines", "jam", "passes", "monster", "louisville", "freedom", "returning"], "summary": "CLOSETime for a break from football and basketball — the Monster Jam truck rally is ready to leave other sports in the dust at Freedom Hall this month.\nMonster Jam calls itself \"the most action-packed live event on four wheels\" and includes timed racing, skills challenges, a doughnut competition and freestyle stunts.\nPit passes are also available for $15 and give fans a chance to see the trucks up close, take photos, meet the drivers and get their autographs.\nTickets and pit passes can be purchased online or at the Freedom Hall box office.\nMonster Jam in LouisvilleWhen: Saturday, Jan. 18 at 4:30 p.m. and Sunday, Jan. 19 at 10:30 a.m.Where: Freedom Hall at the Kentucky Exposition Center; 937 Phillips LaneTickets: $16, $22, $27, $32, $37, $42, $48, $53, $58For more information: www.monsterjam.com/en-US."}, {"url": "https://www.bizjournals.com/louisville/news/2020/03/24/covid-19-new-information-on-jefferson-county-case.html", "title": "", "authors": [], "date": "2020-03-24", "keywords": [], "summary": ""}, {"url": "https://www.whas11.com/article/news/local/louisville-mail-carriers-attacked-dogs/417-ff7e9161-ef1e-4f79-9951-c2c7cf119246", "title": "Two Louisville postal workers attacked by dogs in less than a week", "authors": ["Author", "Heather Fountaine", "Whas", "Taylor Weiter", "Published", "Pm Edt April", "Updated", "Am Edt April"], "date": "2020-04-08", "keywords": ["usps", "mail", "week", "attacked", "postal", "carriers", "louisville", "dog", "dogs", "carrier", "service", "workers", "bitten"], "summary": "There have been two dog attacks on Louisville mail carriers this week, U.S.\nA carrier from the Martin Luther King Station was attacked by two dogs during a route Saturday, resulting in serious injuries.\nA second carrier from the Iroquois Station was also attacked and bitten by a dog on Tuesday.\nThe condition of the carrier with serious injuries is currently unknown, though Wright wishes both mail carriers a speedy recovery.\nThe two dogs involved in Saturday's attack will be euthanized after their 14 day quarantine, according to Louisville Metro Animal Services."}, {"url": "https://www.courier-journal.com/story/news/local/2020/03/20/kentucky-coronavirus-louisville-woman-omni-hotel-tests-positive/5068379002/", "title": "Woman who dined at the Omni during Episcopal conference tests positive for the coronavirus", "authors": ["Billy Kobin", "Published P.M. Et March"], "date": "2020-03-20", "keywords": ["virus", "conference", "episcopal", "lozano", "tested", "staff", "dined", "coronavirus", "omni", "louisville", "health", "woman", "covid19", "positive", "tests"], "summary": "Louisville Courier JournalA Louisville woman who was at the Omni Hotel in late February during an Episcopal conference has tested positive for the novel coronavirus.\nAt least six attendees of the Consortium of Endowed Episcopal Parishes conference, which was held Feb. 19-22 at the Omni, have also tested positive for the COVID-19 virus.\nEpiscopal ministers from Washington, D.C., Texas, California, New York and Tennessee all tested positive in March for the virus after returning to their home parishes.\nSeveral of the Episcopal pastors who tested positive for the COVID-19 virus after the Louisville conference have since recovered.\nScott Stuckey, the general manager of the Omni Louisville Hotel, has said in statements that the hotel notified guests who stayed between Feb. 19-27 of several positive COVID-19 tests among CEEP conference attendees."}, {"url": "https://www.whas11.com/article/money/coronavirus-sparks-us-gun-sales-but-not-in-kentucky/417-83580ff8-982e-4864-9caa-21d5056f66af", "title": "Coronavirus sparks US gun sales, but not in Kentucky", "authors": ["Author", "Chris Williams", "Published", "Pm Edt April", "Updated"], "date": "2020-04-07", "keywords": ["month", "state", "saw", "2020", "sparks", "kentucky", "coronavirus", "sales", "nics", "increase", "gun", "nearly", "record"], "summary": "But what the data reveals about Kentucky is being described as “odd” by at least one gun store owner.\nMonth-over-month it was one of the largest percentage increases in the country (month to month increase of 27,924.\nMonth to month increase of 59,935.\nMonth to month increase of 50,930.\nWe contacted the Kentucky State Police to ask if they had any idea as to why the number may be so drastically different than the national totals."}, {"url": "https://www.courier-journal.com/story/news/2020/03/29/kentucky-coronavirus-updates-on-confirmed-cases-social-distancing-violations/2935632001/", "title": "Here's the latest from Sunday on the coronavirus outbreak in Kentucky", "authors": ["Jonathan Bullington", "Published P.M. Et March"], "date": "2020-03-29", "keywords": ["heres", "public", "virus", "tsa", "street", "state", "beshear", "kentucky", "coronavirus", "louisville", "outbreak", "latest", "bill", "cases"], "summary": "Louisville Courier JournalAs confirmed COVID-19 cases continued to rise in Kentucky, state officials issued a stark warning to commonwealth residents: Ignoring social distancing guidelines could cost people their lives.\n“The way to combat it is to stay away from each other.”[This story is being provided for free to our readers during the coronavirus outbreak.\nForty-five new cases of the virus were confirmed early Sunday evening, raising the state’s total to 439.\nAs of 4 p.m. Sunday, there were no new virus-related deaths in Kentucky.\nStack also said he's received reports of churches in Graves County, near the southwestern tip of Kentucky, planning to continue public services."}, {"url": "https://www.episcopalnewsservice.org/2020/04/15/texas-rector-finds-grace-in-his-harrowing-experience-as-an-early-covid-19-case/", "title": "Fort Worth rector finds grace in his harrowing experience as an early COVID-19 case", "authors": ["Egan Millard", "Church Divinity School Of The Pacific", "Bexley Seabury", "Episcopal Church Office Of Public Affairs", "Episcopal Preaching Foundation", "Virginia Theological Seminary", "Church Pension Group", "Church Publishing Incorporated"], "date": "2020-04-15", "keywords": ["virus", "early", "grace", "case", "fever", "fort", "experience", "days", "covid19", "rector", "hospital", "finds", "harrowing", "pace", "tested", "doctor", "worth", "episcopal", "didnt"], "summary": "Just over a week later, he would be hospitalized with the first documented case of COVID-19 in Tarrant County, the third-largest county in Texas.\nThe experience “has been really surreal for me,” Pace told Episcopal News Service.\nAt least eight people who attended that conference, including Pace, later tested positive for COVID-19.\nTim Cole, a Washington, D.C., rector who also attended the CEEP conference, had tested positive for COVID-19.\nJill Walters, is the early childhood and lower school chaplain at All Saints’ Episcopal School, also in Fort Worth."}, {"url": "https://centraljersey.com/2020/04/15/costume-makers-aid-those-in-need-of-face-masks/", "title": "Costume makers aid those in need of face masks", "authors": [], "date": "2020-04-15", "keywords": ["mccarter", "sarah", "romagnoli", "mask", "costume", "theatre", "fabric", "mercer", "masks", "need", "makers", "aid", "face"], "summary": "1 / 3 Face masks made by McCarter Theatre Center Costume Shop first hand Sarah Romagnoli.PHOTO COURTESY OF SARAH ROMAGNOLI 2 / 3 Designer face masks by Sarah Romagnoli.\nPHOTO COURTESY OF SARAH ROMAGNOLI 3 / 3 McCarter Theatre Center Costume Shop member's face masks created for the Mercer Mask Project.PHOTO COURTESY OF MCCARTER THEATRE ❮ ❯× 1 / 3 Face masks made by McCarter Theatre Center Costume Shop first hand Sarah Romagnoli.PHOTO COURTESY OF SARAH ROMAGNOLI 2 / 3 Designer face masks by Sarah Romagnoli.\nPHOTO COURTESY OF SARAH ROMAGNOLI 3 / 3 McCarter Theatre Center Costume Shop member's face masks created for the Mercer Mask Project.PHOTO COURTESY OF MCCARTER THEATRE ❮ ❯Members of the McCarter Theatre Center Costume Shop are still utilizing their skills, as the group creates face masks for those on the frontline of the coronavirus pandemic.\nI started making masks from it and have given them to doctors who have asked me for masks,” Romagnoli said.\nThe masks are provided free of charge and the group has delivered more than 2,000 masks, according to Mercer Mask Project organizers."}, {"url": "https://www.naplesnews.com/story/sports/high-school/2020/04/15/national-signing-day-2020-collier-county-notebook/2991692001/", "title": "Signing Day notebook: Seacrest's Fischer, CSN's Otto, FBA's Casey go Division I", "authors": ["Adam Fisher", "Published P.M. Et April"], "date": "2020-04-15", "keywords": ["seacrests", "fischer", "university", "csns", "football", "signing", "day", "college", "school", "signed", "fbas", "otto", "division", "notebook", "play", "casey", "team"], "summary": "From his home, Fischer signed a national letter of intent Wednesday to play soccer at Bellarmine, a Division I school in Louisville, Kentucky.\nHe becomes the fifth member of his family to play Division I sports following his sisters and parents.\nAfter just two seasons of high school football, Otto will continue at a Division I program.\nHe joined the Seahawks football team in 2018 as a junior, and punting soon became his obsession.\nFrom the Golden Eagles football team, receiver Paul St. Louis is headed to MidAmerica Nazarene, an NAIA program in Olathe, Kansas."}, {"url": "https://www.courier-journal.com/story/life/food/2020/04/15/louisville-beer-go-11-breweries-offering-curbside-carryout/5134171002/", "title": "Bottoms up! Here's how to order curbside to-go beer from 10+ Louisville area breweries", "authors": ["Dahlia Ghabour", "Published A.M. Et April"], "date": "2020-04-15", "keywords": ["heres", "bottoms", "including", "brewing", "brewery", "order", "beer", "area", "offering", "special", "louisville", "curbside", "craft", "breweries", "beers", "information", "togo"], "summary": "3rd Turn is also offering special release beers.\nThe brewery is also offering special craft beers, including a Kumquat IPA, a sweet-tart citrus fruit beer blended with citrus-forward hops, being released April 16.\n(Photo: Falls City Beer)WHAT: Falls City Brewing is offering numerous craft beers to-go from its Liberty Street location, including six-packs, growlers, crowlers and bombers (22-ounce bottles).\nYou'll find classics like Hipster Repellent IPA and the Classic Pilsner, plus special beers like the Rope-a-Dope Variant, brewed with coffee, cocoa nibs, vanilla and lactose.\nPlus you can order any of Monnik's craft beers to go."}, {"url": "https://www.courier-journal.com/story/life/food/2020/04/15/how-coronavirus-has-impacted-louisvilles-craft-breweries/5126222002/", "title": "Is the keg almost tapped? How the coronavirus has impacted Louisville's craft breweries", "authors": ["Dahlia Ghabour", "Published A.M. Et April"], "date": "2020-04-15", "keywords": ["grain", "know", "beer", "brewers", "coronavirus", "tapped", "louisville", "craft", "louisvilles", "keg", "breweries", "sales", "going", "employees", "gravely", "impacted"], "summary": "CLOSELouisville breweries don't know if the keg is almost tapped as the coronavirus pandemic continues to wreak havoc on their small businesses.\nAlmost immediately, those ripples hit breweries: closing Louisville's bars and restaurants meant Louisville's breweries took an immediate 50% hit with the loss of on-premise sales.\nMost Louisville breweries are seeing between a 60% and 75% dive in business — if not more — numbers that line up with those reported by a recent Brewers Association survey.\n\"Even the big breweries count on selling pints on-site, we make a way higher margin on taproom stuff,\" Gravely said.\nI don't know,\" Gravely said."}, {"url": "https://www.bizjournals.com/louisville/news/2020/04/15/retail-sales-plummet-in-marchas-full-effect-of.html", "title": "", "authors": [], "date": "2020-04-15", "keywords": [], "summary": ""}, {"url": "https://www.wave3.com/2020/04/11/sturgill-simpson-tests-positive-covid-/", "title": "Sturgill Simpson tests positive for COVID-19", "authors": ["Wkyt News Staff", "Published At Pm"], "date": "2020-04-11", "keywords": ["western", "tour", "touring", "late", "post", "simpson", "weeks", "covid19", "positive", "united", "sturgill", "tests", "rest", "states"], "summary": "In an Instagram post, Simpson said he was on tour in Western Europe for two weeks in late January and early February.\nHe was also touring in the United States until March 10th.\nHe says the rest of the tour was canceled and he came home on March 12th."}, {"url": "https://www.wholehogsports.com/news/2020/apr/05/king-briles-has-until-derby-day-evaluate-qbs/", "title": "King: Briles has until Derby Day to evaluate QBs", "authors": [], "date": "2020-04-05", "keywords": ["evaluate", "derby", "times", "vs", "day", "sort", "kentucky", "arkansas", "points", "king", "qbs", "races", "asmussen", "briles"], "summary": "LITTLE ROCK — Pairing Arkansas offensive coordinator Kendal Briles with thoroughbred trainer Steve Asmussen is not as far-fetched as it sounds.\nSpecifically, Briles must evaluate four quarterbacks before the scheduled season opener vs. Nevada, while Asmussen has at least five 3-year-olds for owners thinking Kentucky Derby, moved from the first Saturday in May to the first Saturday in September because of the Coronavirus pandemic.\nOn the job for only a few months, Briles has never seen his candidates compete in person.\n26, 10 points, Basin and Gold StreetSilver Prospector, Shoplifted and Gold Street racked up points winning stakes races.\nAsmussen’s assignment is to qualify as many horses as possible for the Kentucky Derby, prepare them to the hilt and let them sort things out on the track."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/01/31/black-history-month-2020-events-things-do-louisville-ken-tucky/4551609002/", "title": "Here are 30+ events to help you celebrate Black History Month in Louisville this February", "authors": ["Gege Reed", "Published A.M. Et Jan."], "date": "2020-01-31", "keywords": ["month", "celebrate", "american", "library", "feb", "events", "help", "free", "public", "african", "30", "louisville", "history", "information", "black", "freemore"], "summary": "Courier JournalThis February, there are more than 30 events around Louisville to help you celebrate Black History Month.\nAfrican American Read-InWHAT: In celebration of Black History Month, the Carnegie Center is participating in the national African American Read-In.\nRated: R.WHERE: Louisville Free Public Library, Main Branch, 301 York St.\nWHAT: Test your knowledge of Black HistoryWHERE: Louisville Free Public Library, Newburg Branch, 4800 Exeter Ave.\nWHERE: Louisville Free Public Library, South Central Branch, 7300 Jefferson BlvdWHEN: 6:30-7:30 p.m. Feb. 17COST: FreeMORE INFORMATION: To register, 502-964-3515."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/02/07/louisville-shows-february-2020-miss-saigon-brantley-gilbert/4610359002/", "title": "Louisville shows this week: 'Miss Saigon,' Brantley Gilbert, 'Giselle' and more", "authors": ["Gege Reed", "Published A.M. Et Feb."], "date": "2020-02-07", "keywords": ["shows", "w", "s", "fourth", "st", "miss", "start", "feb", "week", "730", "hall", "tickets", "louisville", "giselle", "gilbert", "brantley", "saigon"], "summary": "8 p.m., Mercury Ballroom, 611 S. Fourth St. Tickets start at $35.\n8 p.m., Mercury Ballroom, 611 S. Fourth St. Tickets start at $25.\n8 p.m., Mercury Ballroom, 611 S. Fourth St. Tickets start at $17; $75 Matt Stell pre-show experience.\n8 p.m., Louisville Palace, 625 S. Fourth St. Tickets start at $55.\n3:30 p.m., Calvary Episcopal Church, 821 S. Fourth St. Lecture by Dr. John Hale followed by vesper service featuring J. S. Bach."}, {"url": "https://www.forbes.com/sites/chaddscott/2020/02/05/ups-helps-bring-picasso-to-kmac-museum-in-louisville-kentucky/", "title": "UPS Helps Bring Picasso To KMAC Museum In Louisville, Kentucky", "authors": ["Chadd Scott", "I Still Remember Visiting The Prado Museum In Madrid. What I Knew About Art Prior To That Trip Would Comfortably Fit On The End Of A Paint Brush. My Life Would Be Changed", "I Still Remember Visiting The Prado Museum In Madrid. What I Knew About Art Prior To That Trip Would Comfortably Fit On The End Of A Paint Brush. My Life Would Be Changed That Day A Tour Guide Who Took The Time To Explain The Greatness Of The Paintings I Was Looking At With Incredible Passion", "Patience. It Remains My Single Favorite Travel Experience.", "In The Many Years Since Then I Have Continued To Travel While Educating Myself On The Art World. That S What I M Hoping To Provide For You Here", "A Greater Appreciation", "Understanding Of Art", "Where To Find It.", "After Having Written About College Football For Years", "A Book On Business Innovation"], "date": "2020-02-05", "keywords": ["kmac", "helps", "ups", "picassos", "milliken", "bring", "kentucky", "louisville", "picasso", "museum", "able", "antibes", "work"], "summary": "If you’re the KMAC Museum in Louisville, Kentucky, “brown” can bring Pablo Picasso from the shores of the Mediterranean Sea to the banks of the Ohio River.\nMilliken met Musée Picasso Antibes Director Jean-Louis Andral during a museum leadership event in Los Angeles in 2016.\n“Jean-Louis was thinking about new places that would appreciate Picasso’s work, but places that might not have the access,” Milliken said.\nMPA 1946.2.4 Musée Picasso, Antibes.\nMPA 1949.4.38 Musée Picasso, Antibes."}, {"url": "https://arkansasrazorbacks.com/nsd2020-vance-jackson/", "title": "#NSD2020: Vance Jackson", "authors": ["Mike Cawood"], "date": "2020-04-15", "keywords": ["vance", "shooting", "state", "careerhigh", "rebounds", "game", "games", "points", "nsd2020", "versus", "jan", "scored", "jackson"], "summary": "#NSD2020: Vance JacksonVance Jackson6-9, 230, FPasadena, Calif. (Univ.\nof New Mexico / Prolific Prep)Set to graduate from New Mexico in the Spring of 2020 … Played his freshman season at UConn before transferring to New Mexico … Has scored 990 points in three collegiate seasons (92 games with 65 starts), averaging 10.8 ppg for his career … Has averaged 5.4 rebounds with 165 assists while shooting 35.3% from 3-point range (157-444) … Has eight career double-doubles.\nSophomore (2017-18 at New Mexico):Sat out due to NCAA transfer rules.\nHigh School:Consensus Top 60 recruit … Played one season at Prolific Prep (Napa, Calif.) … Averaged 21.7 points, 6.8 rebounds to help Prolific … Posted a 25-7 record and reached the semifinals of the Grind Session National Championships in Lawrence, Kan. … Attended St. John Bosco (Bellflower, Calif.) as a sophomore and junior, averaging 19.4 points, 7.1 rebounds … Captured the Division II State Championship … Began his high school career at La Salle HS in Pasadena … Played AAU ball for Dream Vision, averaging 16.0 points per game and shooting 55.4 percent from three-point range during the Adidas Summer Championships.\nFor more­­ information on Arkansas Men’s Basketball, follow @RazorbackMBB on Twitter."}, {"url": "https://www.leoweekly.com/2020/04/invitation-time-can-explore-forests/", "title": "An invitation for this time: We can explore the forests of ourselves", "authors": ["Sean Patrick Hill"], "date": "2020-04-15", "keywords": ["creek", "closed", "forest", "state", "day", "explore", "nature", "parks", "walk", "days", "invitation", "park", "forests"], "summary": "I drove south to the Knobs State Forest, a place I had not been before but had wanted to explore.\nAs I sat still, I began to see birds flitting high in the trees, undisturbed, I imagined, by my presence.\nI envisioned the walk this way: I’d found myself, the heart of the forest mirroring the core of my being.\nTo date, most state parks are limited to hiking between 7 a.m. and 7 p.m., and Cumberland Gap National Historic Park is completely closed to the public.\nIn this time, we can accept the invitation to be with ourselves, for we are as much nature as these birds, these trees, this air."}, {"url": "https://www.wave3.com/2020/02/19/lmpd-investigating-shooting-bardstown-road/", "title": "LMPD investigating shooting on Bardstown Road", "authors": ["Sarah Jackson", "Published At Pm"], "date": "2020-02-19", "keywords": ["lmpd", "taken", "shooting", "bardstown", "university", "spokesman", "mitchell", "victim", "louisville", "injuries", "victims", "road", "lifethreatening", "investigating"], "summary": "The victim was taken to University of Louisville Hospital.\nLMPD spokesman Dwight Mitchell said the victim’s injuries did not appear to be life-threatening."}, {"url": "https://www.courier-journal.com/story/entertainment/theater/2020/02/23/kentucky-shakespeare-2020-season-includes-shakespeare-love/4753671002/", "title": "Free 2020 Kentucky Shakespeare Festival features 'Shakespeare in Love,' Henry V' and more", "authors": ["Kathryn Gregory", "Published A.M. Et Feb."], "date": "2020-02-23", "keywords": ["wallace", "free", "2020", "v", "stage", "kentucky", "shakespeare", "features", "louisville", "festival", "production", "season", "henry", "love"], "summary": "CLOSEThe 2020 Kentucky Shakespeare Festival will include \"Shakespeare in Love,\" \"Henry V,\" and \"The Merry Wives of Windsor.\"\n(Photo: Courtesy of Kentucky Shakespeare)The Kentucky Shakespeare Festival doesn't look 60 years old.\nThe 2020 Kentucky Shakespeare Festival will include \"The Merry Wives of Windsor.\"\nThe 2020 Kentucky Shakespeare Festival will include\"Shakespeare in Love.\"\n2020 Kentucky Shakespeare FestivalThe 2020 Kentucky Shakespeare Festival takes place at the C. Douglas Ramey Amphitheater in Old Louisville’s Central Park, 1340 S Fourth St., from May 27 to Aug. 9."}, {"url": "https://www.courier-journal.com/story/entertainment/dining/restaurant/2020/02/24/where-find-best-lent-2020-fish-fry-louisville-kentucky/4810673002/", "title": "It's fried fish season! Here are 35+ Louisville places to get your fill during Lent 2020", "authors": ["Gege Reed", "Published A.M. Et Feb."], "date": "2020-02-24", "keywords": ["fridays", "feb", "28", "2020", "fried", "louisville", "35", "dinein", "cheese", "season", "lent", "fish", "places", "sides", "baked", "shrimp"], "summary": "CLOSE The Courier Journal's semi-professional fish fry taste team scoured Louisville for the best Lent fried fish in 2019.\n3/8/2019 Courier JournalIt's time for Lent — which means it's everyone's favorite fried fish season in Louisville.\nFried fish, sides and dessert.\nBuy Photo Fried fish sandwich and crinkly fries from Hill Street Fish Fry.\nFried fish, fish sliders, shrimp boats, sides and desserts."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/01/31/louisville-shows-february-2020-beach-boys-rodney-carrington/4542413002/", "title": "Louisville shows this week: The Beach Boys, Rodney Carrington, Louisville Orchestra & more", "authors": ["Gege Reed", "Published A.M. Et Jan."], "date": "2020-01-31", "keywords": ["shows", "rodney", "w", "feb", "start", "music", "week", "beach", "carrington", "hall", "kentucky", "concert", "tickets", "louisville", "orchestra", "boys", "st"], "summary": "7:30 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $37.\n3 p.m., Stem Concert Hall, Ogle Cultural & Community Center, 4201 Grant Line Road, New Albany.\nLouisville Orchestra, Louisville Youth Orchestra.\n8 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $15.\n8 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $25.50."}, {"url": "https://www.whas11.com/article/news/local/louisville-lego-convention-2020/417-c3f5c35f-4f77-4ec0-8975-9bcc957f0be5", "title": "Kentucky’s only LEGO convention is returning to Louisville in 2020", "authors": ["Author", "Courtney Hayden", "Published", "Am Edt October", "Updated"], "date": "2019-10-23", "keywords": ["available", "fourth", "2020", "beights", "kentucky", "kentuckys", "louisville", "event", "lego", "fan", "convention", "returning"], "summary": "It’s time to unleash your inner child – the LEGO convention is coming back to Louisville!\nThe BrickUniverse LEGO Fan Convention is returning to the Bluegrass state for the fourth time on February 1 and February 2.\nThe event sold out last year, so the 2020 convention will take place in an even larger exhibit hall at the Kentucky International Convention Center.\n“We are so excited to be returning to Louisville, Kentucky for our fourth year,” said Gresyon Beights.\nBeights started the LEGO Fan Convention when he was only 14 years old in 2015."}, {"url": "https://www.courier-journal.com/story/news/traffic/2020/02/14/louisville-flood-warning-river-road-closed-ohio-river-rises/4759049002/", "title": "River Road in downtown Louisville is closed as the Ohio River rises", "authors": ["Billy Kobin", "Published A.M. Et Feb."], "date": "2020-02-14", "keywords": ["downtown", "closed", "street", "water", "according", "rises", "weekend", "louisville", "ohio", "river", "feet", "road", "flood"], "summary": "Louisville Courier JournalDue to flooding in the Ohio River, the span on River Road between Third and Sixth streets has been barricaded and closed as of Friday afternoon.\nEarlier in the day Friday, River Road from Fourth to Seventh streets in downtown Louisville were closed because of the minor flooding.\nWater from the Ohio River started to flow onto River Road about 6 a.m. Friday, and chilly early-morning temperatures in the teens caused some icy patches to form on the road, authorities say.\nRiver Road is closed from Fourth to Seventh streest in downtown Louisville Friday, Feb. 14, 2020, due to the Ohio River rising and water flowing over and freezing in the road.\nThe Eifler Beach and Juniper Beach areas are also cut off, and right turns onto River Road from the Interstate 64 ramp are prohibited."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2020/02/06/pnc-broadway-louisville-miss-saigon-february-2020/4595554002/", "title": "Broadway's 'Miss Saigon' lands in Louisville this month. Here's what to know", "authors": ["Published A.M. Et Feb."], "date": "2020-02-06", "keywords": ["month", "heres", "american", "miss", "know", "matthew", "kentucky", "center", "broadways", "louisville", "lands", "kim", "production", "saigon", "broadway"], "summary": "\"That makes it incredibly special to me, and it will always be my favorite.”Perhaps you've seen the show before like Porter or you're new to the classic tale of \"Miss Saigon.\"\n\"Miss Saigon\" is based on an operaAnthony Festa as Chris and Emily Bautista as Kim in the North American Tour of \"Miss Saigon\" singing \"Last Night of the World.\"\nAll the straw hats worn in \"Miss Saigon\" are from Vietnam or Thailand.\n\"Miss Saigon\" features adult content\"Miss Saigon\" is heading to the Kentucky Center during the 2019-20 PNC Broadway in Louisville series.\n\"Miss Saigon\" is one of the largest tours on the road\"Miss Saigon\" is heading to the Kentucky Center during the 2019-20 PNC Broadway in Louisville series."}, {"url": "https://www.wave3.com/2020/02/05/lmpd-investigating-after-person-shot-cane-run-rd/", "title": "LMPD investigating after person shot on Cane Run Rd.", "authors": ["Brett Martin", "Published At Pm", "Published Am At Am"], "date": "2020-02-05", "keywords": ["arrived", "lmpd", "shot", "driven", "run", "person", "determined", "cane", "werent", "able", "victim", "hospital", "rd", "investigating"], "summary": "Police weren’t able to find a victim when they arrived.\nThey determined the person had driven themselves to the hospital."}, {"url": "https://kycir.org/2020/02/25/louisville-changes-public-nuisance-enforcement-after-kycir-investigation/", "title": "Louisville Changes Public Nuisance Enforcement After KyCIR Investigation - Kentucky Center for Investigative Reporting", "authors": ["Jacob Ryan", "More Jacob"], "date": "2020-02-25", "keywords": ["public", "metro", "enforcement", "kycir", "ordinance", "reporting", "investigation", "kentucky", "changes", "property", "owners", "louisville", "letters", "victims", "nuisance", "investigative"], "summary": "Property owners and their tenants face steep fines if they’re considered a public nuisance, and some landlords evicted tenants in response to nuisance violation letters from the city.\nCouncil members expanded the city’s public nuisance ordinance in recent years to include a broad list of qualifying crimes that include drug offenses, assaults and theft.\nLast week, city attorneys finalized a revised notice letter that will be sent to owners of properties deemed a public nuisance.\nThe Louisville Metro Police Department has made no changes related to the public nuisance enforcement, according to Jessie Halladay, department spokesperson.\nHe said the issues uncovered by KyCIR surrounding public nuisance enforcement warrant a full review of the ordinance."}, {"url": "https://www.wave3.com/2020/02/26/man-charged-with-attempted-murder-buechel-shooting/", "title": "Man charged with attempted murder in Buechel shooting", "authors": ["Charles Gazaway", "Published At Pm"], "date": "2020-02-26", "keywords": ["turned", "murder", "buechel", "shooting", "times", "started", "attempted", "separating", "went", "charged", "warrant", "things", "victim", "man", "perry", "physical"], "summary": "An arrest warrant issued for Perry says he and the victim were in the 4300 block of Fegenbush Lane on Feb. 19 when they started arguing before things turned physical.\nAfter engaging each other and separating several times, the men went out to the parking lot."}, {"url": "https://www.courier-journal.com/story/life/food/2020/02/07/national-pizza-day-2020-deals-discounts-louisville-kentucky/4690967002/", "title": "Where to get pizza deals for National Pizza Day in Louisville", "authors": ["Emma Austin", "Published P.M. Et Feb."], "date": "2020-02-07", "keywords": ["toppings", "large", "near", "day", "louisville", "deals", "store", "click", "twotopping", "youre", "pizza", "national"], "summary": "CLOSEBuy Photo National Pizza Day is Sunday, Feb. 9.\n(Photo: Matt Stone/Courier Journal)Sunday is National Pizza Day, and there's only one way to celebrate (hint: If you're not eating pizza, you're doing it wrong).\nLOCATIONS: 4600 Shelbyville Road, 13317 Shelbyville Road, 4118 Summit Plaza DriveDanny Mac'sDEAL: Get a 12-inch, two-topping pizza for $10.\nOur top reviewed restaurantsDerby City PizzaDEAL: Get a large, two-topping pizza for $10.99.\nPizza HutDEAL: Order online for delivery or carryout for a $10 meat lovers large pizza."}, {"url": "https://www.wave3.com/2020/02/08/pedestrian-killed-louisville-hit-run/", "title": "UPDATE: Coroner identifies pedestrian killed in Louisville hit and run", "authors": ["Shellie Sylvestri", "Published At Pm", "Published Am At Am"], "date": "2020-02-08", "keywords": ["update", "hit", "morning", "identifies", "run", "pedestrian", "louisville", "injuries", "manner", "wight", "richard", "trauma", "pronounced", "zirimwabagabo", "coroner", "killed", "stated"], "summary": "Richard Zirimwabagabo, 43, of Louisville was pronounced dead Saturday morning at 12:02 a.m. due to blunt force trauma injuries, according to Deputy Coroner Anthony Wight.\nThe manner of death was stated as an accident."}, {"url": "https://www.wave3.com/2020/04/14/justice-department-takes-churchs-side-st-amendment-suit/", "title": "Justice Department takes church’s side in 1st Amendment suit", "authors": ["Colleen Long", "Michael Balsamo", "Emily Wagster Pettus", "Published At Pm"], "date": "2020-04-14", "keywords": ["department", "virus", "justice", "churchs", "suit", "worship", "spread", "remains", "statewide", "1st", "try", "tate", "simmons", "stayathome", "amendment", "save", "takes"], "summary": "Greenville Mayor Errick D. Simmons, a Democrat, said Monday that no one will have to pay the fines, but the ban on such gatherings remains in place to try to save lives as the highly contagious virus continues to spread.\nHe also called on Republican Gov.\nTate Reeves to issue clear statewide guidance on whether people are allowed to congregate for worship during the governor’s statewide stay-at-home order that remains in effect until April 20."}, {"url": "https://www.courier-journal.com/story/life/home-garden/home-of-the-week/2020/02/13/louisville-houses-fox-run-place-find-high-tech-custom-home/2858496001/", "title": "This custom-built, high-tech contemporary home in Louisville's Fox Run is a modern marvel", "authors": ["Lennie Omalza", "Special To Courier Journal", "Published A.M. Et Feb."], "date": "2020-02-13", "keywords": ["modern", "jasmine", "custombuilt", "space", "contemporary", "run", "leblanc", "louisville", "leblancs", "louisvilles", "room", "fox", "house", "troy", "hightech", "marvel", "lighting", "family"], "summary": "CLOSETroy and Jasmine LeBlanc had been looking for a house around Louisville when they came across a Mediterranean-style abode they just loved.\nTroy and Jasmine considered a few builders before deciding on the team at Eldridge Company, who seemed to best understand the contemporary design the couple desired for their modern, custom-built home.\nAfter all, Jasmine finally got the Juliet balcony she’s always wanted, and the custom-built home inspires memories of her childhood.\nnuts & boltsOwners: Troy and Jasmine LeBlanc, who are self-employed.\nHome: This is a 5-bed, 5-bath, 5,269-square foot, contemporary-style home that was built in 2019 in the Fox Run subdivision."}, {"url": "https://www.leoweekly.com/2020/02/5-things-louisville-weekend-2-21/", "title": "5 Things To Do In Louisville This Weekend (2/21)", "authors": ["Danielle Grady"], "date": "2020-02-05", "keywords": ["feb", "music", "videos", "day", "video", "parkland", "cat", "louisville", "drum", "percussion", "things", "weekend", "221", "margarita"], "summary": "Shed that guilt and go watch cat videos for a good cause — helping cats.\nThe Social Purpose Corporation created this 75-minute video of the best cat videos, including unique submissions that haven’t already spread around the internet, as well as some of the classics.\nTen percent of the ticket sales will be donated to Alley Cat Advocates, the Kentucky Humane Society and Lucky Cat Café & Lounge.\nMargarita Day PartyCopper & Kings DistilleryNo cover | 8-11 p.m.Mercifully, Margarita Day falls on a weekend this year.\nThis program, presented by the Drum Corp showcases “the pilgrimage of percussion from Parkland to present day” with performances by the Pipe Drummers, the Spirit of the Drum Drum Line, The Percussion Ensemble and more."}, {"url": "https://www.wave3.com/2019/10/27/lego-convention-returns-louisville-february/", "title": "LEGO convention returns to Louisville in February", "authors": ["Dustin Vogt", "Published April", "At Pm"], "date": "2019-10-27", "keywords": ["website", "available", "returns", "15", "tickets", "brickuniverse", "louisville", "event", "lego", "convention", "purchase", "online"], "summary": "Tickets for the event are $15, and are available for purchase online now at the BrickUniverse website."}, {"url": "https://www.wave3.com/2020/03/02/police-discuss-arrests-men-louisville-human-trafficking-sting/", "title": "Police discuss arrests of 7 men in Louisville human trafficking sting", "authors": ["Dustin Vogt", "Maira Ansari", "Published At Pm"], "date": "2020-03-02", "keywords": ["sting", "taken", "undercover", "prepared", "human", "person", "discuss", "operations", "louisville", "think", "say", "trafficking", "plan", "pedigo", "mind", "men", "arrests"], "summary": "Police say they did three undercover operations like this last year, this year they plan to do the same.\n“If this causes one person to change his mind for the fear of being arrested and taken into custody, I think that is great,” Det.\nPedigo said.\n“Also, I would say be prepared to see more of these in the future.”"}, {"url": "https://www.courier-journal.com/story/news/local/2020/02/26/louisville-employees-to-be-moved-out-fiscal-court-building-downtown/4811422002/", "title": "Louisville city employees will finally be moved out of this crumbling downtown building", "authors": ["Darcy Costello", "Ben Tobin", "Published P.M. Et Feb."], "date": "2020-02-26", "keywords": ["buildings", "metro", "downtown", "crumbling", "court", "city", "building", "maintenance", "louisville", "finally", "local", "fiscal", "employees", "moved"], "summary": "CLOSEScaffolding has covered the downtown Fiscal Court Building in recent months.\nDuncan confirmed Thursday that the Fiscal Court Building would be demolished and said it was likely the LMPD headquarters would as well, but that it may be put up for development.\nCouncil President David James, D-6th, said he would also prefer the city own and operate buildings for its employees.\nFor all but one of the recommendations, the mayor's office said in the audit that Louisville Metro Government will \"accept the risk associated with this issue.\"\nA frustrated Tony Lindauer, the former property valuation administrator, moved his employees out of the Fiscal Court Building in 2015."}, {"url": "https://www.courier-journal.com/story/news/2020/03/18/coronavirus-kentucky-what-know-latest-information/2863348001/", "title": "Coronavirus in Kentucky: Louisville mayor's wife tests positive as cases keep climbing", "authors": ["Tessa Duvall", "Published P.M. Et March"], "date": "2020-03-18", "keywords": ["closed", "climbing", "courier", "cabinet", "tested", "mayors", "wife", "kentucky", "coronavirus", "louisville", "offices", "positive", "tests", "announced", "cases"], "summary": "Louisville Courier JournalLouisville Mayor Greg Fischer's wife joined the steadily growing list of Kentuckians who have tested positive for COVID-19, as the state reported its largest single-day increase of confirmed cases so far.\nAndy Beshear announced nine new coronavirus cases Wednesday evening, bringing the total to 35, with patients living in 11 counties.\nAcross the country, there are at least 7,700 confirmed cases total in all 50 states, with 118 deaths, including one in Kentucky announced Monday.\nEmail her at kadams@courier-journal.com Louisville Courier JournalGE reducing shifts, suspending some operationsGeneral Electric has said normal operations at its Louisville Appliance Park will end after second shift on Thursday.\nThe cabinet also announced that all circuit court clerk offices, Kentucky licensing regional field offices, cabinet one-stop shops, and cabinet district highway, administrative, maintenance and equipment offices are also closed."}, {"url": "https://spectrumnews1.com/ky/lexington/news/2020/03/19/drive-thurs-save-the-day-for-kentucky-businesses-", "title": "Drive-Thru Saves The Day for Kentucky Businesses", "authors": ["Published Pm Et Mar."], "date": "2020-03-19", "keywords": ["businesses", "let", "thing", "stay", "saidand", "optimistic", "day", "win", "kentucky", "support", "say", "going", "saves", "drivethru", "johnson"], "summary": "LOUISVILLE, Ky. — They say when one door closes, another opens.\nIt's taking the form of a drive-thru window at WW.\nTheir philosophy was simple, roll with it and figure it out as they went.\nAnd they even created a buzz on social media for the restaurant which has been in business for 36 years.\nWe think this is great and we support local and small businesses so we are here and thank you all,”Area Director John King said."}, {"url": "https://www.nytimes.com/2020/03/31/business/development-louisville-kentucky-coronavirus.html", "title": "Unease at Kentucky Project Mirrors Construction Industry’s Fears", "authors": ["Keith Schneider"], "date": "2020-03-31", "keywords": ["mr", "mirrors", "fears", "shut", "mixeduse", "projects", "project", "kentucky", "million", "set", "construction", "holland", "traffic", "portland", "industrys", "square", "unease"], "summary": "The favorable lease that Farm to Fork’s owner, Sherry Hurley, negotiated with Mr. Holland gives her the right to buy the building for $225,000, terms she is determined to meet.\n“I am committed to weathering the Covid-19 storm.”New projects Mr. Holland planned for later this year are unsettled.\nOne of them, the largest and most expensive he has undertaken, is a $17 million mixed-use renovation of three 19th-century wood and brick warehouses overlooking a riverfront park.\n“This has always been challenging,” Mr. Holland said.\n“Nothing about what’s happening now makes it easier.”One hopeful note is that construction on existing projects has not shut down."}, {"url": "https://www.bizjournals.com/louisville/news/2020/03/27/louisville-based-nonprofit-centerstone-won-t-be.html", "title": "", "authors": [], "date": "2020-03-27", "keywords": [], "summary": ""}, {"url": "https://www.wave3.com/2020/03/24/all-lanes-back-open-i-n-crittenden-drive/", "title": "All lanes back open on I-65 N at Crittenden Drive", "authors": ["Shellie Sylvestri", "Published March", "At Pm", "At Am", "Published February"], "date": "2020-03-24", "keywords": ["scene", "left", "n", "lanes", "watterson", "north", "drive", "expressway", "traffic", "open", "shut", "i65", "trimarc", "crittenden"], "summary": "Traffic appears to backed up to the Watterson Expressway.\nTrimarc says the left 3 lanes on I-65 North have been shut down while crews clear the scene."}, {"url": "https://www.courier-journal.com/story/entertainment/dining/restaurant/2020/03/18/louisville-workers-reeling-after-coronavirus-restaurant-shutdown/5067275002/", "title": "4 cents in the bank: Louisville restaurant workers are reeling from coronavirus closures", "authors": ["Dahlia Ghabour", "Published A.M. Et March"], "date": "2020-03-18", "keywords": ["cents", "help", "closures", "restaurant", "restaurants", "coronavirus", "reeling", "louisville", "bank", "food", "employees", "service", "workers", "industry", "employee"], "summary": "Email her at kadams@courier-journal.com Louisville Courier JournalTroll Pub bartender Dionna Warfield-King had 4 cents in her bank account after paying rent.\nThere are more than 200,000 restaurant and food service jobs in Kentucky, according to 2018 data from the National Restaurant Association.\nIn the service industry, many employees live paycheck to paycheck and depend on tips and consistent hours to make their rent.\n\"At the end of the day, the service industry was something you could always go to,\" she said.\nIn the unprecedented times for restaurants, some restaurant groups and owners have been getting creative with ways to help employees."}, {"url": "https://www.courier-journal.com/story/entertainment/dining/restaurant/2020/03/18/coronavirus-louisville-where-order-takeout-delivery/5067080002/", "title": "Hungry for takeout? Here are Louisville restaurants to support during coronavirus outbreak", "authors": ["Dahlia Ghabour", "Published P.M. Et March"], "date": "2020-03-18", "keywords": ["available", "delivery", "order", "takeout", "support", "restaurants", "coronavirus", "louisville", "curbside", "hungry", "outbreak", "carryout", "st", "11"], "summary": "For many Kentuckiana restaurants, takeout and delivery has become the only way those in the foodservice industry can survive.\nMore: How you can help save Louisville businesses and restaurants during the coronavirus outbreakThe situation for locally-owned restaurants is dire.\n812-949-2334Butchertown Grocery Bakery, 743 E. Main St., Louisville: Takeout, curbside and delivery from 11 a.m. to 8 p.m.\nButchertown Grocery, 1076 E. Washington St., Louisville: Takeout, curbside and delivery from 11 a.m. to 8 p.m.\nCouvillion, 1318 McHenry St., Louisville: Curbside pickup Wednesday through Sunday 4 p.m. to 9 p.m.610 Magnolia, 610 Magnolia Ave., Louisville."}, {"url": "https://www.whas11.com/article/news/local/lmpd-national-guard-to-be-stationed-outside-louisville-hospitals/417-7ddc8705-5b35-49d7-8791-31926bacde33", "title": "LMPD, National Guard stationed outside Louisville hospitals during coronavirus outbreak", "authors": ["Author", "Taylor Weiter", "Published", "Am Edt March", "Updated", "Pm Edt March"], "date": "2020-03-25", "keywords": ["lmpd", "stationed", "enforcement", "state", "support", "kentucky", "hospitals", "guard", "louisville", "coronavirus", "local", "outside", "outbreak", "national", "law"], "summary": "LOUISVILLE, Ky. — Starting at March 25, Louisville Metro Police and other local law enforcement officers will be stationed outside hospitals in Jefferson County.\nAndy Beshear asked local law enforcement and the National Guard in the state to have a presence at hospitals across the state, said Jean Porter, director of communications for Mayor Greg Fischer.\n26th, these Guardsmen will report to several of the local hospitals throughout the Louisville region to provide that support.\n“The Kentucky National Guard is accustomed to working with the law enforcement agencies in our state,” said Brig.\n“Our Soldiers and Airmen of the Kentucky National Guard are eager to serve our community, and the citizens of Kentucky during this trying time."}, {"url": "https://www.courier-journal.com/story/news/politics/metro-government/2020/03/19/coronavirus-louisville-dr-sarah-moyer-fighting-pandemic-city/5003136002/", "title": "Dr. Sarah Moyer, Louisville's health chief, is leading city's battle against coronavirus", "authors": ["Darcy Costello", "Published A.M. Et March"], "date": "2020-03-19", "keywords": ["public", "sarah", "battle", "director", "state", "spread", "dr", "kentucky", "health", "coronavirus", "citys", "chief", "louisvilles", "louisville", "outbreak", "leading", "moyer", "program"], "summary": "Louisville Courier JournalBefore pursuing a medical degree and later becoming Louisville's health director, Dr. Sarah Moyer was a physics major.\n\"In these settings, like what's happening now, quick movement is essential to being successful,\" said Craig Blakely, dean of the University of Louisville's school of public health, who praised Moyer's ability to adapt to fluid public health situations.\nBuy Photo Dr. Sarah Moyer, chief health strategist and director at Louisville Metro Public Health and Wellness, speaks about the coronavirus situation at a press conference with Louisville Mayor Greg Fischer, right, on Thursday, Feb. 26, 2020.\nAnd, importantly for the city, she has a background in both clinical training and public health studies.\nLouisville's public health agency eliminated seven full-time positions in the last budget, along with one seasonal position and made reductions in contracted services."}, {"url": "https://www.thenewsjournal.net/legal-notices-for-3-25-20/", "title": "The News Journal Legal Notices for 3-25-20 – The News Journal", "authors": ["Jennifer Benfield", "About The Author"], "date": "2020-03-24", "keywords": ["expect", "legal", "using", "customers", "2020", "kwhmonth", "kentucky", "notices", "journal", "commission", "monthly", "increase", "service", "32520"], "summary": "RS, RTOD, and VFD customers using 1,139 kWh/month could expect a monthly increase of $0.05 up to $2.46.\nLE customers using 3,573 kWh/month could expect a monthly increase of $0.10 up to $5.12.\nTE customers using 171 kWh/month could expect a monthly increase of $0.01 up to $0.39.\nGS customers using 1,717 kWh/month could expect a monthly increase of $0.11 up to $5.59.\nPS-Secondary customers using 33,725 kWh/month could expect a monthly increase of $1.45 up to $77.01."}, {"url": "https://www.courier-journal.com/story/news/2020/03/18/coronavirus-kentucky-u-l-president-neeli-bendapudi-tests-negative/5057250002/", "title": "University of Louisville president Neeli Bendapudi tests negative for the coronavirus", "authors": ["Joe Sonka", "Ben Tobin", "Published A.M. Et March"], "date": "2020-03-18", "keywords": ["spring", "university", "neeli", "courier", "president", "tested", "kentucky", "coronavirus", "louisville", "l", "bendapudi", "negative", "tests", "yarmuth", "speed"], "summary": "CLOSE With a viral outbreak prompting the WHO to declare a global health emergency, let's take a look at what a coronavirus is.\nLouisville Courier JournalUniversity of Louisville president Neeli Bendapudi has tested negative for the coronavirus, the school's spokesman confirmed Wednesday.\nKentucky coronavirus live updates: Get the latest informationCoronavirus tracker: How many coronavirus cases are in Kentucky?\nBeshear said Sunday that he recently tested negative for COVID-19, and Fischer and Yarmuth both said Monday they tested negative.\nU of L said the spring commencement ceremony is also postponed, though spring degrees will still be conferred on May 9."}, {"url": "https://www.courier-journal.com/story/news/local/2020/03/18/coronavirus-louisville-city-get-emergency-funding-pandemic/2872888001/", "title": "Louisville announces $1,000 emergency coronavirus funding to help families, organizations", "authors": ["Sarah Ladd", "Published P.M. Et March"], "date": "2020-03-18", "keywords": ["community", "foundation", "help", "today", "emergency", "support", "1000", "coronavirus", "local", "louisville", "covid19", "families", "funding", "announces", "organizations", "fund"], "summary": "Louisville Courier JournalLouisville will get emergency financial assistance to help with the fallout from the coronavirus, Mayor Greg Fischer's office announced on Wednesday.\nEligible households and community organizations could get $1,000 to help cover unexpected rental, childcare, transportation, food, utility and pharmaceutical expenses, Fischer's office said in a statement.\nThe money will come from a newly-established fund, One Louisville: COVID-19 Response Fund, which was the result of a city, Community Foundation of Louisville and Metro United Way partnership.\nTo do so, contact the Community Foundation of Louisville by calling 502-585-4649 or visiting cflouisville.org.\nUPSThe James Graham Brown Foundation gifted $1 millionThe Community Foundation of LouisvilleDonations can be made at: bit.ly/3aeYN0w."}, {"url": "https://www.courier-journal.com/story/life/food/2020/03/16/coronavirus-lee-initiative-launces-restaurant-workers-relief-program/5063621002/", "title": "Food service worker? This relief program to provide to-go dinners amid coronavirus outbreak", "authors": ["Dahlia Ghabour", "Published P.M. Et March"], "date": "2020-03-16", "keywords": ["provide", "relief", "magnolia", "restaurant", "restaurants", "support", "coronavirus", "togo", "lee", "supplies", "dinners", "food", "outbreak", "workers", "service", "worker", "program"], "summary": "Andy Beshear announced March 16 that all Kentucky restaurants were required to close their dining rooms, thousands of restaurant workers suddenly found themselves out of work.\n\"For the past decade, we have relied on the stellar hospitality and positive PR, now restaurant workers need your help more than ever.\n\"All donations received by the LEE Initiative in March and April will go directly to the restaurant worker's relief efforts.\"\nSupport strong journalism by subscribing today: courier-journal.com/subscribeRestaurant Workers Relief ProgramWHAT: Dinners and supplies provided to service industry workers.\nWHEN: Seven nights a week from 5-8:30 p.m. unless otherwise notifiedHOW YOU CAN HELP: To support this program, donate at LEEInitiative.org."}, {"url": "https://www.bizjournals.com/louisville/news/2020/03/17/churchill-downs-cetalks-strategy-behind-kentucky.html", "title": "", "authors": [], "date": "2020-03-17", "keywords": [], "summary": ""}, {"url": "https://wfpl.org/courts-may-be-closed-but-some-evictions-are-still-proceeding/", "title": "Update: Sheriff Stops Enforcing Evictions In Louisville", "authors": ["Jacob Ryan"], "date": "2020-03-16", "keywords": ["update", "yates", "eviction", "week", "court", "evictions", "sheriff", "louisville", "set", "enforcing", "jefferson", "residents", "stops", "orders", "cases"], "summary": "3/17/20 update: The Jefferson County Sheriff has stopped executing eviction orders.\n3/16/20 original story: The Jefferson County Sheriff will continue to execute eviction orders, even as the COVID-19 pandemic spreads and sparks cancellations and closures across the state.\nOn Monday the sheriff’s department had 14 eviction orders scheduled, according to Lt. Col. Carl Yates, the department’s public information officer.\nOngoing eviction cases are to be continued for a later date, according to the order.\nFor some residents set to be evicted, a crowded homeless shelter may be the only option."}, {"url": "https://www.courier-journal.com/story/news/local/2020/03/21/coronavirus-kentucky-women-sewing-masks-childrens-hosptital/2890903001/", "title": "Stitch fix: Women are sewing masks for the coronavirus cause", "authors": ["Grace Schneider", "Published P.M. Et March"], "date": "2020-03-21", "keywords": ["tyler", "protection", "sewing", "scott", "women", "utterbackcourier", "sew", "coronavirus", "masks", "fix", "norton", "stitch", "cause", "hospital", "face"], "summary": "She and neighbor April Matney, both 37, are now leading a drive via Facebook to sew masks for Norton Children's Hospital.\n(Photo: Scott Utterback/Courier Journal)Several people have offered to help or at least to try a test run.\nKentucky coronavirus live updates: Get the latest information hereKentucky coronavirus map: How many coronavirus cases are in Kentucky?\nThe friends are making the masks for Norton Hospital due to a shortage during the coronavirus.\nSurgical face masks can block the respiratory droplets of coughing or sneezing patients — the principal way the virus is spread."}, {"url": "https://www.courier-journal.com/story/entertainment/dining/restaurant/2020/04/15/louisville-restaurant-recipes-doc-crows-lillys-bistro-jack-frys/2982302001/", "title": "Miss your favorite dishes? Recreate these appetizers from some 'temporarily closed' spots", "authors": ["Kathryn Gregory", "Published A.M. Et April"], "date": "2020-04-15", "keywords": ["closed", "miss", "pepper", "restaurants", "coconut", "cheese", "louisville", "appetizers", "teaspoon", "apple", "recreate", "spots", "favorite", "tablespoon", "temporarily", "cup", "red", "dishes"], "summary": "CLOSE Chefs from Lee’s Louisville restaurants have been cooking hot meals at 610 Magnolia’s commissary for service industry workers who've lost their jobs.\nLouisville Courier JournalWe're now a month into a world where you can't just walk into a restaurant and order your favorite dish.\nWe've tracked more than 50 locally-owned restaurants in Louisville that are temporarily closed during the coronavirus pandemic.\nTry these dessert recipes from three 'temporarily closed' Louisville restaurantsDoc Crow's Southern Smokehouse & Raw Bar: Pimento beer cheese127 W Main St., 502-587-1626, doccrows.com.\nIn a bowl, combine the crab, avocado, lime juice, mint, cilantro and red pepper."}, {"url": "https://www.wave3.com/2020/03/21/yall-im-dying-mom-shares-sons-hilarious-note-her-homeschooling-skills/", "title": "‘Y’all I’m dying!!!’: Mom shares son’s hilarious note on her homeschooling skills", "authors": ["Shellie Sylvestri", "Published At Pm"], "date": "2020-03-21", "keywords": ["took", "moms", "stuff", "sons", "good", "note", "going", "stressed", "hilarious", "homeschooling", "shares", "yall", "really", "mom", "dying", "im", "skills", "getting", "telling"], "summary": "It is not going good.\nMy mom’s getting stressed out.\nMy mom is really getting confused.\nWe took a break so my mom can figure this stuff out.\nAnd I’m telling you, it is not going good.\""}, {"url": "https://spectrumnews1.com/ky/lexington/news/2020/03/12/coronavirus-update-ky", "title": "Coronavirus Update for Kentucky", "authors": ["Published Am Et Mar."], "date": "2020-03-12", "keywords": ["update", "kentucky", "coronavirus", "school", "louisville", "county", "schools", "students", "covid19", "elem", "announced", "lane"], "summary": "Governor Beshear recommends all Kentucky schools stop in-person classes for the next 2 weeks beginning Monday due to COVID-19 concerns.\n4:57 pm Kentucky Derby FestivalThe Kentucky Derby Festival is postponing events scheduled through April 5.\n2:38 pm Kentucky School UpdatesRobertson County - schools starting Spring Break earlyRowan County - schools remaining open, but monitoringScott County - schools remaining open, but monitoringShelby County - schools may go to NTI (non-traditional instruction) but no decision yetTaylor County - all after school activities closing due to weather.\n2:26 pm Kentucky Supreme CourtThe Kentucky Supreme Court will hear arguments in a civil cases March 18 through March 20.\n1:27 pm Boyle County SchoolsBoyle County schools are closing for the next four weeks, March 16 through April 10."}, {"url": "https://www.nytimes.com/2020/03/24/technology/virus-facebook-usage-traffic.html", "title": "Facebook Is ‘Just Trying to Keep the Lights On’ as Traffic Soars in Pandemic", "authors": ["Mike Isaac", "Sheera Frenkel"], "date": "2020-03-24", "keywords": ["users", "virus", "stay", "pandemic", "lights", "coronavirus", "soars", "calls", "facebook", "trying", "zuckerberg", "traffic", "employees", "facebooks"], "summary": "In many countries, messaging on Instagram and Facebook soared by over 50 percent, while group calls in Italy jumped by more than 1,000 percent.\n“We’re just trying to keep the lights on over here,” Mark Zuckerberg, Facebook’s chief executive, said in an interview last week.\nAs airlines, hotels, restaurants and other companies struggle to stay afloat during the pandemic, Facebook is also laboring to cope with the fallout.\nThe company is also trying to keep its users’ data secure while employees who sift through posts to moderate content do so from home.\nAt the same time, Facebook has added to its workload by promising to do more to limit virus misinformation."}, {"url": "https://www.nytimes.com/2020/03/16/world/live-coronavirus-news-updates.html", "title": "Gatherings Should Be Limited to 10 People, Trump Says", "authors": [], "date": "2020-03-16", "keywords": ["limited", "dont", "theres", "felt", "tested", "told", "test", "going", "coming", "gatherings", "theyre", "tests", "trump"], "summary": "And I was just coughing a ton.” “I had a headache and felt feverish.” “It felt like I had a bowling ball on my chest.\nis refusing to test me.” “I traced back, you know, my wife, she works at Amazon.\nNot up.” “Anybody that needs a test, gets a test.\nAnd the tests are beautiful.” “We have a president saying anyone who wants tests can get a test.\nAnd I called a hospital, and they told me that they don’t have the test either.” “I just felt like I was getting the run-around."}, {"url": "https://www.theinteriorjournal.com/2020/04/14/harold-tilden-carrier-89/", "title": "Harold Tilden Carrier, 89 - The Interior Journal", "authors": [], "date": "2020-04-14", "keywords": ["services", "tilden", "spurlin", "burial", "harold", "stanford", "89", "journal", "funeral", "danville", "carrier", "interior", "ky", "family"], "summary": "Harold Tilden Carrier1930-2020Harold Tilden Carrier, 89, of Stanford, KY passed away on Wednesday, March 18, 2020 at Danville Health and Rehabilitation.\nBorn on May 31, 1930 in McKinney, KY to the late Manford Tilden Carrier and Stella Smith Carrier Sandidge.\nSurvivors include his wife, Mary Elizabeth Salyers Carrier of Stanford, KY; sons, Craig Kent Carrier (Terena Isaacs-Carrier) of Stanford, KY and Kevin Gene Carrier (Sarah) of Stanford, KY; one brother, Billy Carrier (Nita); sisters, Alfreda Carrier Jenkins and Mae Carrier Harris (Ray); step-brother, Bobby Sandridge; step-sister, Louise Chandler (David); sister-in-law, Lois Carrier; four grandchildren, Kristen Walton, Kenton Carrier, Karson Carrier and Caleb Carrier; step-granddaughter, Jae Cox and several nieces and nephews.\nPallbearers are Lynn Young, Clayton Walls, Danny Renner, Bud Griffith, Kenton Carrier, Karson Carrier and Caleb Carrier.\nBox , Stanford, KY 40484Heritage Hospice of Danville, KY, 120 Enterprise Dr., Danville, KY 40484Alzheimer’s Association, Greater KY and Southern IN, 6100 Dutchmans Ln, Ste 401, Louisville, KY 40205"}, {"url": "https://seniorhousingnews.com/2020/04/09/covid-19-news-bulletin-cases-appear-in-other-kirkland-communities-stocks-plummet/", "title": "Covid-19 News Bulletin: Assisted Living Covid-19 Cases Exceed 700; Occupancy Dipped Slightly Before Pandemic Struck", "authors": [], "date": "2020-04-09", "keywords": ["living", "slightly", "struck", "dipped", "pandemic", "care", "bulletin", "health", "company", "communities", "exceed", "providers", "residents", "covid19", "housing", "senior", "occupancy", "cases"], "summary": "The first $30 billion is being disbursed this week, and senior living providers are not receiving any of that money.\n“We really want to parallel what we did with self-storage 15 years ago … acquire them, understand them, brand them.”As of October, SSSHT had acquired four senior living properties, operated by Integral Senior Living (ISL) and MBK Senior Living.\nMany of the nation’s largest senior living providers — including Atria Senior Living, Sunrise Senior Living and Five Star Senior Living — are now responding to positive diagnoses of Covid-19 either among residents, staff or both.\nForty-three percent of respondents said their perspective of senior living has been negatively affected by this situation, but 14% said that they now have a more positive opinion of senior living than previously.\nAtlas Senior Living To Begin Testing in CommunitiesAtlas Senior Living might be the first senior living provider in the U.S. to offer its own Covid-19 testing to residents."}, {"url": "https://www.nytimes.com/2020/03/24/dining/restaurants-closing-workers-coronavirus.html", "title": "Restaurant Workers Get a Final Paycheck and a Meal From Their Peers", "authors": ["Kim Severson"], "date": "2020-03-24", "keywords": ["mr", "peers", "unemployment", "grinsteadmayle", "450", "meal", "restaurant", "anchorage", "final", "plan", "payment", "flores", "going", "car", "workers", "paycheck"], "summary": "Once the government website stops crashing, Mr. Grinstead-Mayle hopes to submit an application for unemployment benefits.\n“It’s going to be dicey,” Mr. Grinstead-Mayle said.\n“It was wild,” Mr. Flores said.\nHe called the bank, which allowed him to delay the car payment.\nMr. Flores teared up as he described the gift."}, {"url": "https://spectrumnews1.com/ky/lexington/news/2020/03/13/live-kentucky-coronavirus-update", "title": "Live Coronavirus Updates in Kentucky", "authors": ["Published Am Et Mar."], "date": "2020-03-13", "keywords": ["live", "public", "community", "updates", "kentucky", "center", "coronavirus", "health", "county", "information", "announced", "meals"], "summary": "9:30 am School Closing UpdateLyon County Public Schools are closed until Monday, March 30.\nThose that drive to the center, meals will be prepared and available with a time designated for pickup of those meals.\n3:15 pm Montgomery County Health Department Reports New PatientsThe Montgomery County Health Department is reporting one of its residents has tested postive for COVID-19.\nBe wary of emails from con artists pretending to be the Centers for Disease Control or other public health organizations.\n· Consult the Kentucky Department for Public Health and the Centers for Disease Control and Prevention for reliable information and updates about the coronavirus."}, {"url": "https://www.louisville.com/content/louisvilles-2020-guide-camps-activities-and-classes-advertising-section", "title": "Louisville's 2020 Guide to Camps, Activities and Classes — Advertising Section", "authors": [], "date": "2020-03-05", "keywords": ["guide", "activities", "summer", "public", "learning", "j", "week", "camps", "2020", "advertising", "camp", "day", "louisvilles", "grades", "weekly", "classes"], "summary": "KENTUCKY HUMANE SOCIETYkyhumane.org/camp1000 Lyndon LaneCarrie Burns, 515-3134Lifelong Friends CampWhat: Children love the Kentucky Humane Society’s animal-focused summer camps!\nDates: June 8-July 31; Half day camps can be combined with a morning or afternoon camp to make a full day of camp with supervised lunchtime.\nAges: 4-18Cost: Over 40 half or full day camp combinations.\nYour child will learn, make friends and build confidence at YMCA Summer Camp.\nDates: June 1-August 7Ages: Kids entering K-8th gradesCost: Half-day weekly camp (7:30 a.m.-noon or 1 p.m.-5:30 p.m.): $249; Full day weekly camp (7:30 a.m.-5:30 p.m.): $399; Weekly satellite camp (9 a.m.-4 p.m.): $279This Advertising Section originally appeared in the March 2020 issue."}, {"url": "https://wfpl.org/louisvilles-2020-galaxycon-cancelled/", "title": "Louisville's 2020 GalaxyCon Cancelled", "authors": ["Kyeland Jackson"], "date": "2020-03-11", "keywords": ["officials", "cancelled", "martin", "2020", "galaxycon", "kicc", "post", "louisvilles", "statement", "convention", "dates", "return", "offered"], "summary": "GalaxyCon Louisville is cancelled for 2020, with no assurances that it could return the following year.\n“We always have to attract a large number of people from out of town.\n“We offered multi-year agreements in an alternative month and offered a one year agreement to make 2020 GalaxyCon a reality,” Cox said in the statement.\n“This was an event we enjoyed hosting and we are equally disappointed that we couldn’t come to an agreement on dates of the event.”Cox said convention officials hope the convention reconsiders KICC and returns to Louisville.\nMartin’s post ended stating the convention may return, “if economic conditions change in the coming years.”"}, {"url": "https://www.usatoday.com/story/news/nation/2020/03/18/lgbtq-coronavirus-community-vulnerable-covid-19-pandemic/2863813001/", "title": "LGBTQ community may be 'particularly vulnerable' to coronavirus pandemic. Here's why.", "authors": ["Savannah Eadens", "Published A.M. Et March"], "date": "2020-03-18", "keywords": ["heres", "community", "pandemic", "vulnerable", "care", "nass", "coronavirus", "health", "louisville", "need", "covid19", "particularly", "lgbtq"], "summary": "CLOSE President Donald Trump declared a national emergency to fight the coronavirus pandemic.\nHigher rates of HIV and cancer in the LGBTQ community means that a greater number of people may have compromised immune systems, which leaves them more vulnerable to COVID-19 infections.\n\"HIV/AIDS devastated the LGBTQ community ... unhindered because of the government's intentional inaction as disrespect for LGBTQ people in our community.\nBruce Kleinschmidt is a local lawyer and a member of the LGBTQ community in Louisville, Ky. on Mar.\nFor Hartman and others, there's a sense of resilience in the LGBTQ community."}, {"url": "https://www.courier-journal.com/story/news/2020/03/14/coronavirus-kentucky-louisville-stores-stripped-bare/5050153002/", "title": "'Worse than Black Friday': Louisville stores flooded by shoppers panicked over coronavirus", "authors": ["Ben Tobin", "Published P.M. Et March"], "date": "2020-03-14", "keywords": ["shoppers", "tobin", "worse", "bardstown", "costco", "paper", "panicked", "toilet", "coronavirus", "tobinben", "louisville", "store", "road", "14", "black", "flooded", "stores"], "summary": "The coronavirus has turned Louisville shoppers into scavengers, cleaning out aisles of toilet paper, hand sanitizers, frozen meals and other items suddenly deemed indispensable.\nMore than 100 people are filing into the Costco off of Bardstown Road to shop for supplies and groceries amid the coronavirus outbreak.\n“We do not have any toilet paper or hand sanitizer,” an employee announced as the doors opened.\nHannah Price, a student at Bellarmine University shopping at Target, said the mass buying of toilet paper is \"silly.\"\n\"I've seen people post things on Facebook where people have carts stacked up with toilet paper and bottled water.\""}, {"url": "https://www.wave3.com/2020/03/12/list-cancellations-due-covid-concerns/", "title": "LIST: Cancellations due to COVID-19 concerns", "authors": ["Sarah Jackson", "Brett Martin", "Published At Pm"], "date": "2020-03-12", "keywords": ["spring", "cancellations", "events", "remainder", "academic", "big", "competitions", "tournament", "concerns", "covid19", "list", "scheduled", "teams", "canceled"], "summary": "Big Ten Tournament - All events related to the big ten have also been canceled.\nall IU-affiliated conference and non-conference athletic competitions for the remainder of the 2019-20 academic year, including spring sports that compete beyond the academic year, are canceled.\nThis includes both regularly scheduled events as well as all postseason competitions, and applies to both teams and individuals."}, {"url": "https://www.whas11.com/article/news/local/samtec-roborumble-regional-robotic-tournament-kentuckyderbyfestival/417-e0380680-fd22-4a19-b82d-6c7f292de1d3", "title": "The robotics tournament returns to the 2020 Kentucky Derby Festival", "authors": ["Author", "Bethanni Williams", "Published", "Am Est March", "Updated"], "date": "2020-03-05", "keywords": ["program", "derby", "returns", "roborumble", "robotics", "competition", "2020", "robot", "kentucky", "mobile", "tournament", "robotic", "festival", "students", "teams", "maker"], "summary": "The Samtec RoboRumble Regional Robotic Tournament is returning at the 2020 Kentucky Derby Festival.\nThe robotic tournament challenges students and teams to design, build and compete with robots.\nThe mobile maker space brings education to life by using lasers, 3D-printers, CNC equipment, and more.\nThe Maker Mobile exposes traditional maker equipment to kids of all ages to inspire creativity and future innovators.\nTeams are given multiple tasks at the competition, they have two hours to build or program their robot to complete those tasks."}, {"url": "https://www.whas11.com/article/news/local/actress-jennifer-garner-visits-kentucky-praises-childhood-education/417-c0773bc9-4dcc-4a60-a559-70877e5268f4", "title": "Actress Jennifer Garner visits Kentucky, praises childhood education", "authors": ["Author", "Megan Short", "Cj Daniels", "Published", "Pm Est March", "Updated"], "date": "2020-03-03", "keywords": ["mark", "served", "garner", "shriver", "state", "rally", "senate", "universal", "praises", "visits", "kentucky", "jennifer", "organization", "education", "actress", "ky", "save", "childhood"], "summary": "LOUISVILLE, Ky. — Frankfort got a taste of Hollywood on Monday as actress Jennifer Garner addressed lawmakers at the State Capitol.\nShe spoke with the Senate about the success of the organization, Save the Children.\nGarner was joined by politician Mark Shriver, another representative of Save the Children.\nKentucky State Senators welcome actress Jennifer Garner and Mark Kennedy Shriver, President of Save The Children Action Network, to the floor of the Senate Chambers at the Capitol building in Frankfort, Ky., Wednesday, March 2, 2020.\n(AP Photo/Bryan Woolston)APRELATED: Louisville student donates hundreds of books to local schoolsRELATED: Ky. Commissioner of Education wants state-funded full-day kindergartenRELATED: Kentucky families and lawmakers rally for universal pre-k educationRELATED: Kentucky lawmaker to hold rally for universal pre-kindergarten"}, {"url": "https://www.courier-journal.com/story/life/wellness/health/2020/03/03/coronavirus-what-know-covid-19-kentucky/4939264002/", "title": "Live coronavirus updates: Kentucky is up to 2,291 confirmed cases, 122 total deaths", "authors": ["Louisville Courier Journal", "Published P.M. Et March"], "date": "2020-03-03", "keywords": ["total", "live", "read", "state", "updates", "beshear", "kentucky", "coronavirus", "deaths", "122", "confirmed", "county", "louisville", "covid19", "2291", "cases"], "summary": "CLOSELOUISVILLE, Ky. — Kentucky is up to 2,291 confirmed cases of COVID-19, Kentucky Gov.\nThat total includes 88 new cases along with seven new deaths, increasing the death toll to 122.\nThe partnership is between the state, Louisville Metro Government, Christina Lee Brown Environmental Institute and the University of Louisville.\nCOVID-19 deaths for Louisville African Americans dramatically increaseAfrican Americans now make up more than one-third of COVID-19 deaths in Louisville, according to data released by Fischer on Wednesday.\nThe donations to Feeding Kentucky, Glean Kentucky and Kentucky Hunters for the Hungry are part of Agriculture Commissioner Ryan Quarles' Kentucky Hunger Initiative."}, {"url": "https://www.whas11.com/article/news/crime/officer-involved-shooting-springfield-drive/417-108daa08-f4b0-4b52-ae8b-decd2c8b47f9", "title": "Man charged with attempted murder after detective injured trying to execute search warrant, one woman killed", "authors": ["Author", "Bethanni Williams", "Courtney Hayden", "Jackelyn Jorgensen", "Published", "Am Edt March", "Updated"], "date": "2020-03-13", "keywords": ["sgt", "woman", "killed", "shooting", "walker", "detective", "execute", "hankison", "murder", "mattingly", "det", "injured", "trying", "victim", "man", "detectives", "apartment", "warrant", "search"], "summary": "A detective was injured and one woman was killed in the shooting.\nRELATED: Family says victim of officer-involved shooting was accomplished EMTAfter repeatedly knocking and announcing their presence detectives utilized a ram to enter the apartment.\nJonathan Mattingly, Det.\nMattingly, Hankison, CosgroveLMPDSgt.\nWalker is being charged with the attempted murder of a police officer."}, {"url": "https://www.usatoday.com/story/news/health/2020/03/16/coronavirus-live-updates-us-death-toll-rises-cases-testing/5053816002/", "title": "Coronavirus live updates: Restrictions could last months; Canada closes border; McDonald's closes dining rooms", "authors": ["John Bacon", "Jorge L. Ortiz", "Published A.M. Et March"], "date": "2020-03-16", "keywords": ["live", "officials", "virus", "rooms", "coronavirus", "closes", "closed", "months", "updates", "dining", "tested", "canada", "york", "health", "mcdonalds", "positive", "restrictions", "announced", "states"], "summary": "There were slivers of light in the darkness – U.S. health officials on Sunday pledged to ramp up testing efforts by the tens of thousands.\nLast week, fellow actors Tom Hanks and Rita Wilson revealed they have tested positive as well.\nOn Sunday, TSA said two officers in Florida had tested positive, one at Orlando International Airport and the other at Fort Lauderdale-Hollywood International Airport.\nLast week, three TSA officers at Norman Mineta San Jose International Airport tested positive, followed by a fourth one.\nPublic health officials say it will take a year to 18 months to fully validate any potential vaccine."}, {"url": "https://www.bizjournals.com/louisville/news/2020/03/10/longtime-louisville-architect-dies.html", "title": "", "authors": [], "date": "2020-03-10", "keywords": [], "summary": ""}, {"url": "https://www.courier-journal.com/story/weather/local/severe/2020/03/12/louisville-weather-tornadoes-hail-could-hit-region-march-12/5030045002/", "title": "Louisville under flash flood watch until early Friday as severe weather hits Kentucky", "authors": ["Billy Kobin", "Published A.M. Et March"], "date": "2020-03-12", "keywords": ["watch", "early", "according", "kentucky", "nws", "louisville", "severe", "weather", "flash", "warnings", "afternoon", "service", "rain", "flood", "hits"], "summary": "WochitThe Louisville area is under a flash flood warning until 2 a.m. Friday, according to the National Weather Service.\nA flash flood watch was issued for portions of Southern Indiana and Central Kentucky starting at 5 p.m. Thursday, according to the NWS.\n#KYwx#INwxpic.twitter.com/Vq7uGIr9KQ — NWS Louisville (@NWSLouisville) March 12, 2020The NWS has also issued a tornado watch for a large swath of Western Kentucky along with several counties south of Louisville, including Grayson, Hardin and Hart counties.\nAbout 5:30 p.m., the weather service announced that there are tornado warnings in Anneta, Lindseyville and Bee Spring, Kentucky.\nTemperatures will be in the 50s, with some sun and no rain on Friday, according to the weather service."}, {"url": "https://www.courier-journal.com/story/news/2020/02/12/kentucky-hemp-day-reckoning-has-arrived-and-its-not-pretty/4694036002/", "title": "Kentucky hemp's painful correction: Some big players sink, smaller ones hang on", "authors": ["Grace Schneider", "Published A.M. Et Feb."], "date": "2020-02-12", "keywords": ["hemp", "paid", "farmers", "players", "crop", "taylor", "correction", "hang", "cbd", "sell", "smaller", "kentucky", "sink", "hemps", "big", "ones", "painful", "industry", "company"], "summary": "Amid news of two high-profile bankruptcies in Kentucky hemp, Clinton County grower Bobby Huff issued a public service announcement to those tempted by the lure of green riches.\nThat came just a month after William \"Trey\" Riddle, the founder of Louisville-based hemp fiber company Sunstrand, petitioned for Chapter 7 bankruptcy.\nKentucky farmers have been forced to destroy their crops after their plants tested \"too hot\" and over the limit.\nIf he doesn't renew his grower's license for 2020, he's not allowed to sell the crop he's now got in storage.\nIf you’re serious about getting farmers paid, you cannot take away the ability to sell and store product,\" he said."}, {"url": "https://www.whas11.com/article/news/local/louisville-fish-fries-that-have-been-canceled/417-416fdce6-162d-4430-b636-98fd23672f62", "title": "LIST | Louisville fish fries that have been canceled, or include drive-thru or carry-out options", "authors": ["Author", "Taylor Weiter", "Published", "Pm Edt March", "Updated"], "date": "2020-03-13", "keywords": ["parishes", "lady", "martin", "louisville", "fries", "options", "fish", "fry", "drivethru", "email", "list", "include", "canceled", "carryout"], "summary": "LOUISVILLE, Ky. — As more events get canceled due to coronavirus concerns, some Louisville parishes have canceled fish fries for Friday, March 13.\nThe following fish fries are canceled as reported by The Record newspaper:St. BernadetteSt. James (Louisville)Holy SpiritHoly TrinitySt. Stephen MartyrThese parishes have fish fries that include drive-thru or carry-out options:St. LawrenceSt. Albert the GreatMary Queen of PeaceSt. Aloysius Pewee ValleySt. MichaelAscensionGuardian AngelsMost Blessed SacramentSt. AthanasiusHoly FamilyOur Lady of LourdesOur Lady of Mt.\nMake it easy to keep up-to-date with more stories like this.\nEmail assign@whas11.com, visit our Facebook page or Twitter feed.\nRELATED: LIST | The best places to get good fish sandwiches in LouisvilleRELATED: Fish Fry Fridays heat up with the first Friday of Lent"}, {"url": "https://www.courier-journal.com/story/news/local/2020/03/07/louisville-triple-crown-running-results-chick-fil-5-k/4990328002/", "title": "Triple Crown of Running is back! Here are results from the Chick-fil-A 5K Fitness Classic", "authors": ["Billy Kobin", "Published P.M. Et March"], "date": "2020-03-07", "keywords": ["resident", "fitness", "classic", "prospect", "5k", "musk", "series", "male", "kentucky", "louisville", "triple", "results", "ky", "running", "chickfila", "crown"], "summary": "CLOSEThe 2020 iteration of the Louisville Triple Crown of Running series kicked off on Saturday with the inaugural Chick-fil-A 5K Fitness Classic.\nUnder new leadership this year, the 35-year-old racing series saw some fast times and good turnout in its opening event Saturday, with the 5K course taking runners around the downtown area.\nIn the female division, Flannery Musk took first, with the Louisville resident finishing in 17:07.\nA Louisville resident also finished first in the male division and first overall, with Logan Barrett running the route in 14:48.\nThe series concludes with the Allstate Hot Chocolate 15K/5K on April 4."}, {"url": "https://cdllife.com/2020/one-of-the-nations-largest-trucking-shows-cancelled-for-coronavirus/", "title": "One of the nation’s largest trucking shows cancelled for Coronavirus", "authors": [], "date": "2020-03-12", "keywords": ["shows", "cancelled", "free", "largest", "spread", "kentucky", "trucking", "coronavirus", "mats", "event", "attendees", "confirmed", "place", "nations", "organizers"], "summary": "Just hours after assuring attendees that the 2020 Mid-America Trucking Show (MATS) would go on as planned, event organizers have confirmed that the show is canceled.\nThe MATS trucking show was scheduled to take place at the Kentucky Expo Center in Louisville, Kentucky, from March 26 — 28, 2020.\nOn March 11, MATS organizers were still optimistic that the event would take place in spite of the virus.\nThey issued a press release assuring attendees that MATS was not cancelled and that 850 exhibitors and 50,000 attendees were confirmed.\nThe World Health Organization has declared Coronavirus a pandemic and more than 1,290 cases have been reported in the United States."}, {"url": "https://slate.com/news-and-politics/2020/04/trump-bench-justin-walker.amp", "title": "The Trump Bench: Justin Walker jabs “nonbelievers” in bizarre decision.", "authors": [], "date": "2020-04-13", "keywords": ["district", "services", "fischer", "justin", "judges", "court", "decision", "bizarre", "walker", "jabs", "bench", "nonbelievers", "easter", "religious", "trump"], "summary": "Welcome to the Trump Bench, a series where Slate analyzes a Trump judge’s recent work.\nAt an unusually rapid clip, Donald Trump has so far successfully appointed two Supreme Court justices, 51 appeals court judges, and 138 district court judges during his presidency.\nTrump judges tend to be different than appointees by past presidents of both parties.\nThe Judge: Justin R. Walker of the U.S. District Court for the Western District of Kentucky.\nThe Record: Aside from Saturday’s decision, Walker has issued no notable rulings in his few months on the bench."}, {"url": "https://www.denverpost.com/2020/04/12/broncos-insider-von-miller-dj/", "title": "Broncos Insider: Von Miller using offseason down time to work on his DJing", "authors": ["Kyle Newman", "Joe Nguyen", "Kyle Newman Is A Sportswriter For The Denver Post", "A Position He S Held Since He Is A Beat Reporter Covering The Colorado Rockies", "Denver Broncos In Addition To Covering Other Professional", "College", "High School Athletics Around The State. He Is A Member Of The Bbwaa", "Online Sports Producer", "Main Daytime Sports Producer For The Denver Post. Previously He Was The Online Prep Sports Editor. Prior To That", "He Covered Adams County"], "date": "2020-04-12", "keywords": ["using", "denver", "miller", "read", "super", "insider", "djing", "broncos", "board", "nfl", "von", "draft", "offseason", "work", "tackle"], "summary": "Self-described “unicorn.”And here’s one more persona of the Broncos’ star you may not have heard about: Von Miller, disc jockey.\n+ Broncos Draft Board: Analysts see “endless” upside for USC tackle Austin Jackson, who spent last offseason donating bone marrow.\n+ Broncos Draft Board: Henry Ruggs III could be best match of need and fit with 15th pick.\n+ Broncos Draft Board: Baylor wideout Denzel Mims’ speed, contested catch ability projects as a first-round pick.\n+ Broncos’ Von Miller calls All-Decade team honor “incredible.”+ Kiszla vs. O’Halloran: Will 9-7 record qualify the Broncos for an expanded NFL playoff field?"}, {"url": "https://www.whas11.com/article/news/local/louisville-events-october-4-5-6/417-849ad361-17eb-4470-8727-7ee66137a725", "title": "Louisville events this weekend: October 4-6", "authors": ["Author", "Courtney Hayden", "Published", "Am Edt October", "Updated"], "date": "2019-10-04", "keywords": ["events", "halloween", "kingdom", "kentucky", "military", "louisville", "46", "zoo", "parade", "pmwhere", "information", "weekend"], "summary": "LOUISVILLE, Ky. — October has arrived and with the new month comes cooler weather (finally!\n), all things pumpkin spice, and a weekend full of fun events.\nWhether you're looking for spooky thrills, family-friendly fun, or just an excuse to get outside, you'll find something to do this weekend in Louisville!\nHalloween EventsHighlands Halloween Parade & FestivalThe annual Halloween Parade in the Highlands will kick off for its 17th year on Saturday at the intersection of Baxter and Broadway.\nCost: Entry is freeMore information: Halloween Parade & Festival websiteLouisville ZooLouisville Zoo Halloween Party\"The World's Largest Halloween Party\" is back at the Louisville Zoo!"}, {"url": "https://www.courier-journal.com/story/weather/2019/10/01/louisville-weather-hottest-october-day-since-records-began/3832990002/", "title": "Louisville sees hottest October day since National Weather Service started keeping records", "authors": ["Lucas Aulbach", "Published P.M. Et Oct."], "date": "2019-10-01", "keywords": ["degrees", "started", "records", "hottest", "heat", "crow", "sees", "temperature", "day", "week", "louisville", "humidity", "weather", "looking", "national", "service", "keeping"], "summary": "That's the hottest temperature Louisville has seen in October since the NWS started keeping records in 1871.\nThe hottest October day ever previously came in 2007, when the temperature hit 93 degrees on Oct. 7 and 8.\nThe previous hottest first day of October, meanwhile, was 100 years ago, when we hit 91 degrees on Oct. 1, 1919.\nNational Weather Service Louisville correspondent Mike Crow said we could break more records Wednesday, with highs in the mid to upper 90s.\n\"It looks like Friday and into the weekend we’ll get some relief from the heat,\" Crow said."}, {"url": "https://kiss951.com/2020/04/14/kenya-moore-reveals-her-husband-had-a-change-of-heart/", "title": "Kenya Moore Reveals Her Husband Had a Change of Heart", "authors": ["Glennisha Morgan"], "date": "2020-04-14", "keywords": ["relationship", "change", "husband", "asked", "daly", "marc", "reveals", "moore", "yes", "cohen", "kenya", "work", "heart", "wants"], "summary": "Kenya Moore recently appeared on an episode of Watch What Happens Live with Andy Cohen alongside her Real Housewives of Atlanta co-star Eva Marcille, and during the segment, she revealed that her previously estranged husband, Marc Daly had a “change of heart.”Andy Cohen asked Kenya Moore if she and Marc Daly were currently quarantined together.\n“Do you still have Marc’s clothes in the closet?” Cohen asked.\nHe wants to be a better person.” Cohen then asked Kenya Moore if she also wants to be better.\nCohen had also asked Moore if she still hadn’t met Marc Daly’s parents.\nAre Kenya Moore & Marc Daly Quarantining Together?"}, {"url": "https://www.wlky.com/article/top-10-things-to-do-in-louisville-this-weekend-oct-11-13/29436938", "title": "Top 10 things to do in Louisville this weekend: Oct. 11-13", "authors": ["Julie Dolan", "Https", "Www.Facebook.Com Juliedolannews", "Anchor Reporter"], "date": "2019-10-11", "keywords": ["race", "beer", "scavenger", "oct", "1113", "tickets", "wine", "louisville", "event", "samples", "food", "things", "weekend"], "summary": "Advertisement Top 10 things to do in Louisville this weekend: Oct. 11-13 Share Shares Copy Link CopyAre you looking for some weekend plans?\nWine on the River Wine lovers can experience wine samples from around the world while enjoying the waterfront view at the Big Four Lawn.\nJack-O-Lantern SpectacularIt’s opening weekend for one of the most anticipated Halloween events in Louisville.\nSt. Matthews Beer & Food FestivalEnjoy local food trucks, beer samples and live music in the heart of St. Matthews.\n25th Annual Belknap Fall FestivalThis two-day event highlights beer, food, music and artists in the Highlands."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2019/10/25/kentucky-high-school-football-scores-friday-october-25/2459137001/", "title": "Kentucky high school football scores from Friday, October 25", "authors": ["Associated Press", "Published P.M. Et Oct."], "date": "2019-10-25", "keywords": ["link", "rival", "high", "25", "kentucky", "feed", "school", "day", "knocks", "scores", "facebook", "eminenceposteda", "football", "posted"], "summary": "Kentucky Country Day football knocks out Class A rival EminencePosted!\nA link has been posted to your Facebook feed."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2019/10/18/kentucky-high-school-football-scores-friday-october-18/4026487002/", "title": "Kentucky high school football scores from Friday, Oct.18", "authors": ["Associated Press", "Published P.M. Et Oct."], "date": "2019-10-18", "keywords": ["winpost", "creek", "fern", "male", "high", "kentucky", "battles", "school", "scores", "facebook", "oct18", "search", "football", "900th", "program"], "summary": "Male football battles Fern Creek in search of its 900th program winPost to Facebook"}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/10/18/louisville-shows-concerts-music-october-2019-celine-dion-jb-smoove/3921791002/", "title": "Louisville shows this week: Celine Dion, Vince Gill, JB Smoove & more", "authors": ["Gege Reed", "Published A.M. Et Oct."], "date": "2019-10-18", "keywords": ["shows", "jb", "w", "music", "university", "start", "week", "vince", "free", "hall", "dion", "tickets", "school", "louisville", "gill", "celine", "smoove", "st"], "summary": "7:30 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free."}, {"url": "https://www.courier-journal.com/story/sports/2019/10/11/ironman-triathlon-louisville-2019-what-know-course/3854142002/", "title": "Here's your complete guide to the 2019 Ironman Triathalon in Louisville", "authors": ["Caleb Wiegandt", "Published A.M. Et Oct."], "date": "2019-10-11", "keywords": ["ironman", "heres", "guide", "complete", "main", "street", "triathalon", "run", "course", "witherspoon", "2019", "louisville", "river", "avenue", "road"], "summary": "The 2019 Ironman Louisville Triathlon will be held this Sunday throughout the Metro Louisville and Oldham County area with a new spin on some of the challenging courses they have to offer.\nHere's everything you need to know about the 2019 Ironman Triathalon:What is the Ironman Triathalon?\nRelated: Toxic algae could force Ironman to cancel swimming portionWhere is the 2019 Ironman Triathalon?\nThe Ironman Louisville course takes place in various parts of the Louisville area, including Waterfront Park, Oldham and Henry counties and the city of La Grange.\nAccording to the Ironman website, \"the three-loop (26.2-mile) run course stays along the Ohio River on the Louisville Loop and Greenways while passing through four Louisville parks."}, {"url": "https://wfpl.org/election-2019-your-guide-to-the-candidates-for-kentucky-governor-2/", "title": "Election 2019: Your Guide To The Candidates For Kentucky Governor", "authors": ["Ryland Barton"], "date": "2019-10-28", "keywords": ["guide", "right", "election", "state", "thats", "money", "comments", "governor", "kentucky", "oct", "health", "candidates", "2019", "states"], "summary": "Bevin was inaugurated in 2015 after defeating then-Kentucky Attorney General Jack Conway by 9 points, becoming only the third Republican governor of Kentucky since World War II.\nHere is where the candidates stand on some of the most important issues facing Kentucky.\nUnder this governor, a 13 year-old raped by a member of her own family and impregnated would have no options.\nThat’s why I’m fighting both this governor and the federal government who are absolutely trying to tear away coverage for preexisting conditions.\nI’m going to protect your preexisting condition coverage.”Beshear made these comments during a debate on WLKY on Oct 26, 2019."}, {"url": "https://www.courier-journal.com/story/entertainment/music/2019/06/04/wu-tang-clan-coming-louisville-october-25th-anniversary-tour/1340523001/", "title": "Wu-Tang Clan brings the ruckus to Louisville this October", "authors": ["Lucas Aulbach", "Published P.M. Et June"], "date": "2019-06-04", "keywords": ["wutang", "today", "support", "kentucky", "hall", "tickets", "louisville", "paristown", "ruckus", "clan", "venue", "brings"], "summary": "Famed New York rap group the Wu-Tang Clan is performing in Louisville in October at Paristown Hall in Paristown Pointe.\nThe Louisville Wu-Tang performance is part of the group's \"36 Chambers Anniversary Tour,\" a reference to the group's iconic November 1993 debut album \"Enter the Wu-Tang: 36 Chambers.\"\nThe nine-man hip hop group has been back in the spotlight recently thanks in part to a four-part Showtime documentary series chronicling its rise to fame, titled \"Wu-Tang Clan: Of Mics and Men.\"\nMore headlines: Kentucky State Fair free 2019 concert lineup releasedThe Wu-Tang Clan performed in Louisville in January 2011 at the Expo Five venue, though pivotal member The RZA was not in attendance.\nBuy Photo The Wu-Tang Clan performs in Louisville at the Expo Five in January 2011."}, {"url": "https://www.courier-journal.com/story/weather/local/winter/2019/10/31/louisville-weather-derby-city-has-first-snowfall-halloween-2019/4115572002/", "title": "It's official: Louisville has its first snowfall of the season, meteorologist says", "authors": ["Ben Tobin", "Published P.M. Et Oct."], "date": "2019-10-31", "keywords": ["season", "national", "trace", "schoettmer", "snow", "louisville", "weather", "meteorologist", "snowfall", "official", "recorded", "service"], "summary": "CLOSEIn what might be the spookiest news of Halloween, snow touched the ground in Louisville on Thursday mid-afternoon.\nYou're reading that correctly: The Derby City area has recorded snowfall before November.\nShortly after 3 p.m., a trace of snow — or less than one-tenth of an inch — was recorded at Louisville Muhammad Ali International Airport, according to National Weather Service meteorologist Brian Schoettmer.\nFlakes fell between 8 p.m. and 9 p.m. Thursday evening and just after midnight Friday morning, National Weather Service meteorologist Ron Steve said.\nIt turns out that snow in Louisville in October isn't incredibly rare."}, {"url": "https://www.wave3.com/2019/10/19/police-investigating-shooting-near-southside-neighborhood/", "title": "UPDATE: Coroner reveals identity of victim in Beechmont neighborhood shooting", "authors": ["Dustin Vogt", "Published At Pm"], "date": "2019-10-19", "keywords": ["update", "shooting", "beechmont", "scheler", "place", "think", "safe", "thought", "suspects", "identity", "reveals", "outside", "uneasy", "victim", "neighborhood", "makes", "coroner", "walking"], "summary": "“It makes you feel uneasy when you think you live in a safe place,” Scheler said.\n“I never thought anything about walking outside after dark.”There are no suspects currently in custody."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/29/louisville-trick-treating-heavy-rain-forecast-halloween/2495052001/", "title": "There's a freeze warning tonight in Louisville. Will there still be trick-or-treating?", "authors": ["Emma Austin", "Published P.M. Et Oct."], "date": "2019-10-29", "keywords": ["wind", "warning", "freeze", "halloween", "tonight", "high", "theres", "oct", "louisville", "trickortreating", "neighborhoods", "weather", "service", "rain"], "summary": "The National Weather Service predicts a 100% chance of rain in Louisville on Thursday and a high near 53 degrees, with wind gusts as high as 32 mph.\nThe temperature could drop to around 29 degrees, with wind gusts between 30 and 40 mph, the weather service said.\nThe freeze warning, according to the National Weather Service, will impact Louisville and all of Central Kentucky along with parts of Southern Indiana.\nExpect widespread frost overnight and temperatures bottoming out in the 25 degree though 30 degree range Friday morning, the weather service said.\nLast year, several Louisville neighborhoods moved their trick-or-treating night to Oct. 30 because of the forecast, but so far this year it appears most neighborhoods are sticking with Halloween."}, {"url": "https://www.whas11.com/article/news/local/bowmanfest-celebrates-history-of-louisvilles-bowman-field/417-55dbfd2f-dc7e-441a-bcd6-8bd1ec71565d", "title": "BowmanFest celebrates history of Louisville's Bowman Field", "authors": ["Author", "Brooke Hasch", "Published", "Am Edt October", "Updated", "Pm Edt October"], "date": "2019-10-04", "keywords": ["gates", "bowmanfest", "free", "military", "louisville", "close", "louisvilles", "bowman", "children", "history", "field", "celebrates", "younger"], "summary": "LOUISVILLE, Ky. — Once one of the busiest airports in the world, Bowman Field would see thousands of visitors in a day.\nNow, though, it is much more difficult to get inside the gates of Bowman Field.\nTo bring back the excitement the airport once felt and let younger generations get the chance to be up close and personal with its planes, Bowman Field created BowmanFest.\nThere will also be Boomin' on Bowman After-Party, a free concert Saturday night.\nTickets for BowmanFest are $10 for adults, $5 for children, and free for active military, veterans and children under 5."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/10/ironman-louisville-2019-downtown-road-closures-no-parking-areas/3928169002/", "title": "Here are the downtown road closures for Sunday's Ironman Louisville", "authors": ["Billy Kobin", "Published A.M. Et Oct."], "date": "2019-10-10", "keywords": ["ironman", "downtown", "main", "street", "closures", "edith", "witherspoon", "brownsboro", "louisville", "ali", "sundays", "river", "avenue", "road", "lane"], "summary": "CLOSEThe 2019 Ironman Louisville will bring some pretty good athletes to town this weekend, and it also means several downtown streets will be closed.\nClosures begin Sunday morning and go through early Monday.\nHere's the list of road closures and no parking zones, according to Louisville Downtown Partnership:The 2019 Ironman Louisville triathlon competition takes place Sunday, Oct. 13, 2019.\nSeveral downtown road closures will be in effect.\nTo view those closures, go to ironman.com."}, {"url": "https://www.whas11.com/article/life/animals/louisville-zoo-worlds-largest-halloween-party-starts-oct-3/417-8254ddb7-5292-473c-a057-7f9f5ad893ec", "title": "Louisville Zoo's 'World's Largest Halloween Party' starts Oct. 3", "authors": ["Author", "Taylor Weiter", "Published", "Am Edt October", "Updated"], "date": "2019-10-03", "keywords": ["starts", "worlds", "weekends", "halloween", "largest", "zoos", "oct", "party", "tickets", "visitors", "louisville", "zoo", "visit", "purchase"], "summary": "The Louisville Zoo transforms into a child's fantasy for the \"World's Largest Halloween Party\" Oct. 3.\nChildren with allergies can also visit during the zoo's allergy-free night Thursday, Oct. 17.\nLouisville Zoo members can purchase tickets online in advance for $2 the first two weekends, and $6 for the remaining weekends.\nNon-members can purchase tickets at select Meijer locations for $8.50 any night of the party.\nRELATED: Louisville Zoo launches new preschool programRELATED: Butterflies n’ Blooms culminates with Flutter Fest and release of 1,000 monarch butterflies►Make it easy to keep up-to-date with more stories like this."}, {"url": "https://www.courier-journal.com/story/news/local/2019/08/26/what-to-know-andrea-michelle-knabel-missing-louisville-mom-investigation/2118878001/", "title": "Have you seen Andrea Knabel? What to know about the missing Louisville mom's case", "authors": ["Lucas Aulbach", "Published A.M. Et Aug."], "date": "2019-08-26", "keywords": ["knabel", "investigators", "continue", "know", "missing", "andrea", "finding", "louisville", "washington", "case", "moms", "search", "seen"], "summary": "CLOSEAndrea Knabel, a Louisville mother of two, went missing in August and hasn't been seen since.\nPolice and investigators have also searched Louisville and surrounding areas for Knabel, Washington said.\nInvestigators are offering a $1,000 reward for information that leads to Knabel's whereabouts, according to the Finding Andrea page.\nWho is Andrea Knabel?\nAndrea Knabel (Photo: \"Finding Andrea\" Facebook page)Andrea Michelle Knabel, 37, lives in Louisville and is a single mother of two children."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/10/25/trick-treating-louisville-2019-halloween-hours-neighborhoods/4081840002/", "title": "Halloween 2019 trick-or-treat hours in Louisville and Southern Indiana", "authors": ["Emma Austin", "Published A.M. Et Oct."], "date": "2019-10-25", "keywords": ["trickortreat", "halloween", "free", "costume", "southern", "oct", "68", "2019", "louisville", "zoo", "trickortreating", "31", "candy", "indiana", "hours"], "summary": "Here's a list of Louisville neighborhoods' trick-or-treat dates and hours, when applicable, for Halloween and other area events this week to get you in the spirit of the holiday.\nWhere: Louisville Zoo, 1100 Trevilian WayWhen: Thursday-Sunday.\nWhere: Louisville Free Public Library, Western Branch, 604 S. 10th St.\n: The best neighborhoods for Halloween trick-or-treating in LouisvilleTrick or Treat at NortheastSpooktacular Halloween evening full of treats, fun, and maybe a few tricks.\nWhere: Louisville Free Public Library, Northeast Branch, 15 Bellevoir CircleWhen: 6-8 p.m. Wednesday, Oct. 30Track or TreatWhere: Iroquois High School, 4615 Taylor Blvd."}, {"url": "https://www.courier-journal.com/story/entertainment/2019/10/10/metallica-concerts-2020-louisville-charlotte-daytona-columbus-sacramento/3934087002/", "title": "Metallica only playing five locations in North America in 2020: Here they are", "authors": ["Nick Hollkamp", "Published P.M. Et Oct."], "date": "2019-10-10", "keywords": ["wimmer", "festivals", "2020", "playing", "kentucky", "metallica", "location", "locations", "north", "charlotte", "speedway", "danny", "daytona", "band", "america"], "summary": "CLOSEThe road won't be Metallica's bride next year.\nThe band, known for classics such as \"Enter Sandman\" and \"Wherever I May Roam,\" is only playing at five locations in North America in 2020.\n\"I can’t wait to bring the biggest band in the world to the biggest rock festivals in America,” founder Danny Wimmer said.\n“Metallica paved this road that we travel.\nRelated: Louder Than Life goes 'Hardwired' with major metal headliner for 2020Fall music guide: Backstreet Boys, Lizzo and The ChainsmokersRead or Share this story: https://www.courier-journal.com/story/entertainment/2019/10/10/metallica-concerts-2020-louisville-charlotte-daytona-columbus-sacramento/3934087002/"}, {"url": "https://www.louisville.com/content/caufields-novelty-bat-downtown-louisville", "title": "What Will Become of the Caufield’s Bat?", "authors": [], "date": "2019-10-07", "keywords": ["outline", "bat", "caufield", "wings", "steel", "louisville", "version", "paint", "nearly", "caufields"], "summary": "It’s the other big bat on Main Street: the Caufield’s Bat.\nThe bat started as a steel cross in the vast Caufield’s warehouse.\nCaufield got the idea after the Louisville Slugger Museum debuted its behemoth baseball bat in 1996.\n(This four-foot version currently hangs in Caufield’s home garage.)\nWe’ve already had people asking about it.”This originally appeared in the October 2019 issue of Louisville Magazine under the headline “The Caufield's Bat.” To subscribe to Louisville Magazine, click here."}, {"url": "https://www.wave3.com/2019/10/15/flu-impacting-patients-kentucky-indiana/", "title": "Flu impacting patients in Kentucky and Indiana", "authors": ["Greg Phelps", "Published At Pm"], "date": "2019-10-15", "keywords": ["public", "department", "patients", "flu", "oldham", "impacting", "kentucky", "health", "county", "jefferson", "reported", "spencer", "indiana"], "summary": "The Kentucky Department of Public Health says from September 29 to October 5 nine flu cases were reported in Jefferson County, four in Oldham County, three in Bullitt County and one in Spencer County."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/09/24/halloween-events-louisville-2019-jack-o-lantern-spectacular-parade/2417677001/", "title": "From pumpkins to parades, don't miss these 15+ Halloween events in Louisville", "authors": ["Kathryn Gregory", "Gege Reed", "Published A.M. Et Sept."], "date": "2019-09-24", "keywords": ["miss", "pumpkins", "halloween", "events", "free", "costume", "dont", "oct", "ages", "tickets", "louisville", "zoo", "parades", "information", "15", "stwhen"], "summary": "Here's a chronological list of Halloween events taking place in Louisville that will surely put you in a spooky mood.\nWHERE: Louisville Zoo, 1100 Trevilian WayWHEN: Thursdays-Sundays beginning Oct. 3 through Oct. 27.\nMORE INFORMATION: Information and reservations: 502-689-5117; louisvilleghostwalks.com, or email LouGhstWalks@aol.com.\nWHERE: Louisville Free Public Library, Western Branch, 604 S. 10th St.\nWHERE: Louisville Free Public Library, Main Branch, 301 York St."}, {"url": "https://www.wave3.com/2019/10/25/rain-impacting-several-halloween-events-saturday/", "title": "Rain impacting several Halloween events Saturday", "authors": ["Published At Pm"], "date": "2019-10-25", "keywords": ["mainia", "main", "events", "halloween", "thats", "street", "impacting", "indoors", "spooky", "moved", "train", "rain", "la"], "summary": "In La Grange, most of Halloween MAINia!\nThe costume contest has been canceled but the booths, spooky train, activities and candy have all been moved indoors.\nThat’s Saturday from 11 a.m. to 3 p.m. on Main Street."}, {"url": "https://www.wave3.com/2019/10/30/trick-or-treat-times-your-community/", "title": "Trick-or-Treat Times in your community", "authors": ["Published At Pm"], "date": "2019-10-30", "keywords": ["community", "times", "trickortreat", "unlike", "ky", "moved", "louisville", "trickortreating", "weather", "leaders", "wave", "rain", "keeping"], "summary": "LOUISVILLE, Ky. (WAVE) - With rain expected early in the day on Halloween, many community leaders are keeping a close eye on the forecast.\nBut unlike in 2018, no cities in WAVE Country have moved trick-or-treating because of the weather."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2019/10/11/kentucky-high-school-football-scores-friday-october-11/3943222002/", "title": "Kentucky high school football scores from Friday, October 11", "authors": ["Associated Press", "Published P.M. Et Oct."], "date": "2019-10-11", "keywords": ["courier", "high", "seventh", "kentucky", "school", "won", "shutting", "scores", "louisville", "journal", "game", "football", "bulldogs", "doss", "row", "11"], "summary": "The Bulldogs won their seventh game in a row on Friday, shutting out Doss 49-0.\nLouisville Courier Journal"}, {"url": "https://wtkr.com/2019/10/27/uva-football-suffers-close-loss-to-louisville-28-21/", "title": "UVA football suffers close loss to Louisville, 28-21", "authors": [], "date": "2019-10-27", "keywords": ["loss", "second", "2821", "seconds", "close", "louisville", "uva", "suffers", "touchdowns", "football", "taulapapa", "lead", "half", "perkins", "rushing"], "summary": "LOUISVILLE, Ky. (VirginiaSports.com) – The Virginia Cavaliers (5-3, 3-2 ACC) fell late to the Louisville Cardinals (5-3, 3-2 ACC) on Saturday, 28-21, at Cardinal Stadium.\nBryce Perkins found Tavares Kelly on a four-yard scoring strike with 21 seconds left to make it 28-21.\nVirginia used two Wayne Taulapapa rushing touchdowns in the first half to take a 14-7 lead into the intermission.\nUVA marched 60 yards on seven plays during its first possession of the game to take an early 7-0 lead.\nLouisville scored 21-unanswered points to start the second half thanks to two rushing touchdowns by Javian Hawkins."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/10/04/louisville-concerts-shows-music-october-phil-collins-lyle-lovett/3773476002/", "title": "Louisville shows this week: Phil Collins, Lyle Lovett, Little Feat & more", "authors": ["Gege Reed", "Published A.M. Et Oct."], "date": "2019-10-04", "keywords": ["shows", "w", "lyle", "little", "lovett", "start", "feat", "music", "week", "theatre", "oct", "center", "tickets", "phil", "louisville", "collins", "st", "5025847777"], "summary": "8 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $26.\nWEDNESDAY, OCT. 9Phil Collins is coming to the KFC Yum Center Oct 9, 2019 (Photo: Don Arnold, WireImage)Phil Collins Still Not Dead Yet, Live!\n8 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $25.\n7:30 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $40.\n8 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $25."}, {"url": "https://www.whas11.com/article/news/local/louisville-celebrates-indigenous-peoples-day/417-5d85a2ed-a3c8-459d-acc5-aa16cd76f5f3", "title": "Louisville celebrating 'Indigenous Peoples' Day' with free family event on October 14", "authors": ["Author", "Courtney Hayden", "Published", "Am Edt October", "Updated"], "date": "2019-10-11", "keywords": ["peoples", "american", "live", "free", "indigenous", "day", "celebrating", "louisville", "event", "holiday", "native", "family", "celebration", "14"], "summary": "LOUISVILLE, Ky. — The city of Louisville is hosting a free family celebration on October 14 to commemorate Indigenous Peoples' Day.\nThe event will take place at Fourth Street Live on Monday, October 14 from 6 p.m. to 9 p.m.\nThe celebration will feature a variety of speakers and live Native American music.\nNotable performers include Grammy winner Bill Miller, Native American flutist Fred Keams and his band Nizhoni Sky, and recording artist Sarah Elizabeth Burkey.\nIndigenous Peoples' Day is a holiday that honors Native American history and culture on Columbus Day."}, {"url": "https://www.wave3.com/2019/10/29/police-investigating-shooting-southwest-jefferson-county/", "title": "Police investigating shooting in southwest Jefferson County", "authors": ["Dustin Vogt", "Published At Pm"], "date": "2019-10-29", "keywords": ["permanently", "shooting", "report", "pandemic", "southwest", "months", "million", "close", "county", "claims", "jefferson", "cnbc", "small", "continues", "investigating"], "summary": "A new report by CNBC claims 7.5 million small businesses will have to close permanently if the pandemic continues through the next few months."}, {"url": "https://www.wave3.com/2019/10/13/lmpd-investigating-two-shootings-west-end/", "title": "LMPD investigating two shootings in West End", "authors": ["Dustin Vogt", "Published At Pm"], "date": "2019-10-13", "keywords": ["lmpd", "wounds", "west", "university", "shot", "near", "male", "muhammad", "gunshot", "end", "reports", "officers", "shootings", "hospital", "investigating"], "summary": "At 11:49 a.m., officers were dispatched to University Hospital where a 32-year-old male arrived with gunshot wounds.\nThe male reports that he was allegedly shot at while driving near 26th and Muhammad Ali."}, {"url": "https://www.leoweekly.com/2019/10/2019-readers-choice-awards/", "title": "The Winners Of The 2019 Readers' Choice Awards", "authors": ["Leo Weekly"], "date": "2019-10-20", "keywords": ["winners", "awards", "choice", "restaurant", "kentucky", "2019", "local", "place", "louisville", "bar", "restaurant1", "store1", "shop1", "wine", "readers"], "summary": "LEO’s 2019 Readers’ Choice Awards leaned heavy on the usual gems, go-tos and glitterati that make this town so faab-you-lous.\nThere was turnover for Best Cocktail, as Hell or High Water, Alex&nder at Copper & Kings and Commonwealth Tap battled it out.\nMatt Anthony’s Record ShopBest Local Wine Shop1.\n(Tie) Instagrammers of Louisville Ky, The Kentucky GentBest Local Blog1.\n(Tie) JCP Eats, The Kentucky Gent, The Bar BelleBest Local Podcast1."}, {"url": "https://www.whas11.com/article/news/local/ironman-louisville-cancels-swim-portion/417-9275b93d-8026-4c9c-b72d-05608818c61a", "title": "Ironman Louisville cancels swimming portion to due dangerous algae blooms in Ohio River", "authors": ["Author", "Bethanni Williams", "Published", "Am Edt October", "Updated", "Pm Edt October"], "date": "2019-10-11", "keywords": ["ironman", "officials", "swimming", "portion", "blooms", "kentucky", "dangerous", "louisville", "event", "ohio", "algae", "river", "water", "cancels"], "summary": "LOUISVILLE, Ky. — (WHAS11)-The Ironman triathlon will be missing a primary piece when it kicks off on Sunday after Ironman and city officials decided to cancel the swimming portion of the event.\nThe Kentucky Division of Water and the Kentucky Department of Public Health issued a recreational public health advisory concerning the elevated harmful algal bloom (HAB) that are present in the Ohio River.\nThe HAB advisory indicated that algal toxins had been found at various locations along the river and that swimming, wading, and other water activities were not recommended in those areas.\nFollowing the result of tests that were performed this week, Ironman and local city officials have determined that in the interest of athlete safety, it is necessary to cancel the swim portion of 2019 Ironman Louisville triathlon.\nRELATED: Harmful blooms from blue-green algae found in Ohio River, officials sayRELATED: Blue-green algae found in several Indiana lakes, pet owners warned to keep dogs outMake it easy to keep up-to-date with more stories like this."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/10/09/louisvilles-international-film-festival-2019-movies-dates-tickets/3907506002/", "title": "From 'Frasier' to JLaw, here's what to know about Louisville's International Film Festival", "authors": ["Published A.M. Et Oct."], "date": "2019-10-09", "keywords": ["international", "heres", "q", "muhammad", "know", "kentucky", "louisville", "louisvilles", "ali", "festival", "room", "science", "jlaw", "center10", "frasier", "film"], "summary": "You'll find writers who worked on shows like \"Frasier\" and the movie \"Father of the Bride II\" alongside up-and-coming directors at Louisville's International Film Festival this week.\nFounded by Louisville native and prolific actor Conrad Bachmann, whose impressive career spans film, theatre and television, the long-running film festival supports film education in Louisville.\nTickets for Louisville's International Festival of Film are on sale now and can be purchased at louisvillefilmfestival.org or by calling 502-540-5324.\n\"Little Apollo\" will screen Saturday at 12:17 p.m. at the Kentucky Science Center.\n5:48 p.m.: SnapshotsRoom #3 / Kentucky Science Center10 a.m.: “No News”11:12 a.m.: Who Won11:26 a.m.: G-3285111:32a.m."}, {"url": "https://www.courier-journal.com/story/weather/2019/09/30/louisville-weather-forecast-why-so-hot-september-october/3817639002/", "title": "Why has it been so hot lately? Part of the answer is under your feet", "authors": ["Lucas Aulbach", "Published A.M. Et Sept."], "date": "2019-09-30", "keywords": ["degrees", "heat", "temperatures", "high", "day", "webb", "louisville", "going", "lately", "hot", "feet", "record", "answer"], "summary": "Expect hot, hot weather in Louisville for the first week of October.\nWebb said the answer is in the sky — and in the ground.\n\"The dryness that we’ve seen in September, generally the drier your soils are, the drier and harder that ground, the easier it is to see those high temperatures,\" Webb said.\nBy mid-afternoon Monday the temperature in Louisville should break the previous record high of 94 degrees, with a high of 98 expected.\n\"Thursday is kind of a transition day,\" Webb said."}, {"url": "https://www.wave3.com/2019/10/03/tests-ongoing-ohio-river-ironman-louisville-looms/", "title": "Tests ongoing in Ohio River as Ironman Louisville looms", "authors": ["Connie Leonard", "Published April", "At Pm"], "date": "2019-10-03", "keywords": ["ironman", "expected", "temperature", "rain", "swim", "hope", "louisville", "repeat", "ohio", "river", "history", "looms", "forecast", "tests", "scare", "ongoing"], "summary": "Now, with a drop in temperature expected in the next few days, and some rain also in the forecast, the hope is that the Ironman swim history will repeat itself.\nAbramson said the algae scare didn’t bother him then, and he doesn’t believe it will keep any athletes away now."}, {"url": "https://www.wave3.com/2019/10/27/lego-convention-returns-louisville-february/", "title": "LEGO convention returns to Louisville in February", "authors": ["Dustin Vogt", "Published April", "At Pm"], "date": "2019-10-27", "keywords": ["website", "available", "returns", "15", "tickets", "brickuniverse", "louisville", "event", "lego", "convention", "purchase", "online"], "summary": "Tickets for the event are $15, and are available for purchase online now at the BrickUniverse website."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/15/louisville-urban-bourbon-half-marathon-2019-road-closures/3987434002/", "title": "Here are the Louisville road closures for Saturday's Urban Bourbon Half Marathon", "authors": ["Sarah Ladd", "Published P.M. Et Oct."], "date": "2019-10-15", "keywords": ["marathon", "half", "street", "closures", "saturdays", "sixth", "liberty", "witherspoon", "fifth", "louisville", "bourbon", "ali", "streets", "avenue", "road", "urban", "730830"], "summary": "CLOSEUrban Bourbon Half Marathon (Photo: Louisville Sports Commission)Ahead of Saturday's Urban Bourbon Half Marathon, the Louisville Sports Commission has announced the road closures to keep in mind.\nUrban Bourbon, presented by Jim Beam, is set for Saturday at 8 a.m., starting on Jefferson Street between Fifth and Sixth streets.\nThe half marathon will finish on Liberty Street between Fifth and Sixth streets, and awards will be presented at Fourth Street Live at 10 a.m.\nHere are the road closures for Saturday.\nTimes are estimated, and streets could reopen sooner than expected."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/01/louisville-police-child-attacked-dog-newburg-neighborhood/3828448002/", "title": "Louisville boy mauled to death by dogs has been identified", "authors": ["Billy Kobin", "Published A.M. Et Oct."], "date": "2019-10-01", "keywords": ["services", "metro", "mckinley", "animal", "attacked", "mauled", "mitchell", "louisville", "dogs", "death", "boy", "identified", "killed", "family"], "summary": "CLOSEBuy Photo A 3-year-old boy was killed Tuesday after being attacked by two dogs at a family home in Louisville's Newburg neighborhood.\nOnce in the backyard, Thornton was attacked by the two dogs, McKinley said.\nThe dogs were taken away by Louisville Metro Animal Services, Mitchell said.\nLMPD spokesperson Dwight Mitchell says a 3-year-old boy was attacked and killed by two dogs owned by his family.\nThis case will also be turned over to Metro Animal Services for their review and any potential animal related charges.\""}, {"url": "https://www.courier-journal.com/story/entertainment/2019/06/24/kentucky-kingdom-theme-park-brings-back-halloscream-october-2019/1546842001/", "title": "Don't freak out, but 'Halloscream' is coming back to Kentucky Kingdom this October", "authors": ["Lucas Aulbach", "Published P.M. Et June"], "date": "2019-06-24", "keywords": ["events", "kingdom", "today", "dont", "halloscream", "kentucky", "theme", "support", "hart", "coming", "park", "subscriber", "freak"], "summary": "A holiday classic is coming back to Louisville's Kentucky Kingdom theme park this fall.\nKentucky Kingdom will host \"Halloscream\" events on weekend nights this October, the theme park announced Monday.\nAs Kentucky Kingdom celebrates its 30th anniversary this year, Park President and CEO Ed Hart said 2019 felt like the right time to bring back the Halloween-themed event.\n\"Since reopening Kentucky Kingdom in 2014, we've had many, many requests for the return of Halloscream,\" Hart said in a statement.\nRead also: Accident on water ride at Kentucky Kingdom sends one person to hospitalMore: They were giving away free Kentucky Kingdom passes."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/19/andrea-knabel-reward-increases-missing-louisville-kentucky-moms-case/4020725002/", "title": "As reward goes up in Andrea Knabel case, new details shed more light on her disappearance", "authors": ["Billy Kobin", "Published A.M. Et Oct."], "date": "2019-10-19", "keywords": ["knabel", "investigators", "leonard", "reward", "disappearance", "andrea", "light", "goes", "shed", "missing", "knabels", "louisville", "mike", "aug", "case", "seen", "road", "details"], "summary": "\"I'm ready to do anything if we need to do more,\" Mike Knabel told The Courier Journal on Friday.\nMike Knabel said his ex-wife — Andrea's mother — was not at her home at the time, as it was under renovation.\nSarah Knabel and Bates were staying at the property to help renovate it, Mike Knabel said.\nBut Mike Knabel said Smith is a \"very caring, thoughtful, helpful person who is doing everything she can\" to help find his daughter.\n\"She's asked for nothing from the family, and I know of no other motive she might have,\" Mike Knabel said, regarding Smith."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/09/27/louisville-concerts-shows-events-music-october-lizzo-lewis-black/2366091001/", "title": "Louisville shows this week: Lizzo, Lewis Black, 'Dear Evan Hansen' and more", "authors": ["Gege Reed", "Published A.M. Et Sept."], "date": "2019-09-27", "keywords": ["shows", "w", "start", "university", "music", "week", "hall", "oct", "tickets", "school", "louisville", "hansen", "lewis", "evan", "lizzo", "black", "st", "dear"], "summary": "2 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n3 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n9 p.m., Mercury Ballroom, 611 S. 4th St. Tickets start at $25; $99 meet and greet package.\nYou may like: Your fall 2019 Louisville music guideSupport local journalism Support stories like this one by becoming a subscriber today!"}, {"url": "https://www.louisville.com/content/mocktail-project-founder-jesse-hawkins-mocktober", "title": "Mocktober Is Upon Us", "authors": [], "date": "2019-10-23", "keywords": ["mocktail", "sober", "drinking", "hawkins", "project", "kentucky", "local", "louisville", "mocktails", "drink", "mocktober"], "summary": "Mocktober, inspired by the Sober October social media movement (and Dry January and Dry July), is the organization’s annual mocktail festival (this year from Oct. 14 to 20), a week of events and special alcohol-free menus at participating Louisville bars.\nThat mocktail won both the 2019 Mocktail Project “A Drink For You” competition in March and the “best mocktail ever” designation in Hawkins’ memory.\nDuring Mocktober, $1 for every drink posted with #shareamocktail was donated by the Kentucky Distillers’ Association to the Mocktail Project, money that subsequently funds Hawkins’ Sober Voyager Foundation and its support of local recovery efforts at the Morton Center, the Healing Place and the Isaiah House.\n“It’s nobody’s business why you choose not to (drink),” Hawkins says.\nBesides advocating for permanent mocktail programs at local watering holes, the Mocktail Project also travels to local and national events."}, {"url": "https://www.wlky.com/article/meet-the-2019-wlky-bell-award-recipients/28940427", "title": "Meet the 2019 WLKY Bell Award recipients", "authors": [], "date": "2019-10-14", "keywords": ["spirit", "awards", "foundation", "recipients", "2019", "louisville", "wlky", "award", "volunteer", "bell", "meet", "ms", "volunteers", "foster"], "summary": "Advertisement Meet the 2019 WLKY Bell Award recipients Share Shares Copy Link CopyThe WLKY Spirit of Louisville Foundation announces 10 recipients of the 2019 WLKY Bell Awards and 2 recipients of the WLKY Bell Awards Youth Service Honor.\nThe Bell Awards program recognizes individuals who have demonstrated the true “spirit of Louisville” through selfless volunteer efforts and seeks to inspire all residents to engage in community service.\nMadison also hosts a weekly radio show on WLOU and has organized read-ins at Newburg Library.The 2019 WLKY Bell Awards, presented by the Republic Bank Foundation, will be held at the Omni Commonwealth Ballroom on Thursday, October 3rd at 6 pm.\nA special one-hour telecast of The WLKY Bell Awards will air on WLKY Saturday, October 12thfrom 8:00-9:00 pm.Celebrating its 42nd year, the WLKY Spirit of Louisville Foundation was formed to oversee the annual Bell Awards program.\nThe 2019 Executive Committee of the Spirit of Louisville Foundation are Vicky Weber/Civic Volunteer, Sharon Meade/Brown Forman, Trish Osborn/Central Bank Jill Bell/Passport Health, and Glenn Haygood/WLKY-TV."}, {"url": "https://www.ewg.org/news-and-analysis/2019/10/10-toxic-forever-chemicals-found-louisville-ky-tap-water", "title": "10 Toxic ‘Forever Chemicals’ Found in Louisville, Ky., Tap Water", "authors": [], "date": "2019-10-10", "keywords": ["toxic", "pfas", "tap", "chemicals", "kentucky", "sample", "genx", "louisville", "pfoa", "ky", "water", "forever", "ppt"], "summary": "A sample of residential tap water in Louisville, Ky, contained 10 different compounds in the family of toxic fluorinated chemicals known as PFAS, according to laboratory tests commissioned by the Environmental Working Group.\nThe sample, taken in July from a home served by the Louisville Water Company, was tested by an accredited independent laboratory for 30 different PFAS chemicals.\nThe combined total for all PFAS tested in the Louisville sample was 45.2 ppt.\nExpert studies say that PFAS exposure in drinking water should be limited to just 1 part per trillion, or ppt.\nThe highest level of any single PFAS detected in the EWG sample collected in Louisville was 22 ppt of a compound known as GenX."}, {"url": "https://www.bizjournals.com/louisville/news/2019/10/01/unlocked-these-are-louisvilles-50-fastest-growing.html", "title": "", "authors": [], "date": "2019-10-01", "keywords": [], "summary": ""}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/09/30/st-james-court-art-fair-louisville-vendors-map-hours-parking/2430956001/", "title": "Everything you need to know about Louisville's 2019 St. James Court Art Show", "authors": ["Published A.M. Et Sept."], "date": "2019-09-30", "keywords": ["james", "park", "art", "street", "know", "magnolia", "court", "hill", "2019", "louisvilles", "need", "avenue", "st", "held"], "summary": "The 63rd annual St. James Court Art Show will be held Friday through Sunday in the idyllic St. James Court neighborhood in Old Louisville.\nHere's everything you need to know before you head to the St. James Court Art Show this weekend:When is the St. James Court Art Show?\nThe St. James Court Art Show is held Friday and Saturday from 10 a.m. to 6 p.m. and Sunday from 10 a.m. to 5 p.m.Where is the St. James Court Art Show located?\nThe annual event is held in St. James Court in the Old Louisville neighborhood, but if you need an exact address for your GPS, punch in 1402 St. James Court.\nSt. James Art Show 2019 Offical Poster \"Saturday Morning Coffee at 1418 St. James Court.\""}, {"url": "https://www.wave3.com/2019/10/26/victims-shot-separate-incidents-just-minutes-blocks-apart/", "title": "3 victims shot in separate incidents just minutes, blocks apart", "authors": ["Published At Pm"], "date": "2019-10-26", "keywords": ["happened", "parkway", "lmpd", "minutes", "shot", "shooting", "near", "apart", "wilson", "victims", "incidents", "separate", "officers", "man", "crossfire", "blocks"], "summary": "The first shooting happened at about 3:30 p.m. on Algonquin Parkway, near Wilson Avenue.\nLMPD officers said they believe the man shot there was caught in the crossfire of a shooting he had nothing to do with."}, {"url": "https://www.nytimes.com/2019/12/17/business/louisville-redevelopment.html", "title": "Louisville Development Reflects City’s Struggles With Growth", "authors": ["Kevin Williams"], "date": "2019-12-17", "keywords": ["mr", "cogan", "park", "university", "struggles", "largest", "city", "kentucky", "louisville", "development", "parks", "growth", "citys", "reflects", "states"], "summary": "With a population of 615,366, Louisville is Kentucky’s largest city and the host to marquee events like the Kentucky Derby and the Breeders’ Cup.\nCollege basketball, and the state’s University of Louisville vs. University of Kentucky rivalry, adds to the energy.\n“Louisville tends to be 15 to 20 years behind other peer cities,” said Kevin D. Cogan, whose Jefferson Development Group would build One Park.\nThose days are mostly past, but Louisville has never really caught up, Mr. Cogan said.\nOne Park’s proximity to one of them, Cherokee Park, is a selling point, Mr. Cogan said."}, {"url": "https://www.courier-journal.com/story/life/food/2020/01/23/steak-bourbon-louisville-opentables-top-20-new-restaurants/4552379002/", "title": "This El Taco Luchador founders' spot made OpenTable's top new restaurants list", "authors": ["Emma Austin", "Published P.M. Et Jan."], "date": "2020-01-23", "keywords": ["founders", "customer", "spot", "group", "opentables", "restaurant", "restaurants", "opentable", "louisville", "bourbon", "food", "el", "luchador", "list", "service", "steak", "hospitality", "taco"], "summary": "CLOSEA Louisville restaurant that debuted in 2019 is gaining national attention after it made OpenTable's list of 20 \"best new restaurants\" for the year.\n\"Steakhouses are really popular, and we wanted to do something different,\" Olé Hospitality Group co-founder Chef Fernando Martinez told The Courier Journal.\nAside from customer service and food quality, Martinez said he believes pricing has a lot to do with Steak & Bourbon's popularity.\nRead our critic's review: Steak & Bourbon provides best value steak in LouisvilleBuy Photo Steak & Bourbon restaurant.\nSeñora Arepa will open right behind La Bodeguita de Mima late this summer, the restaurant group said."}, {"url": "https://www.wave3.com/2019/10/15/louisville-drivers-rank-second-best-country/", "title": "Louisville drivers rank second for best in country", "authors": ["Sydney Harbin", "Published At Pm"], "date": "2019-10-15", "keywords": ["using", "running", "best", "drivers", "second", "speeding", "country", "tickets", "rank", "louisville", "traffic", "reported", "safety", "national", "red", "ranked"], "summary": "The National Highway Traffic Safety Administration reported October and November as the most dangerous months to drive in.\nCities were ranked based on four factors; accidents, speeding tickets, DUIs and other citations (running a red light, using a cellphone while driving, etc.)"}, {"url": "https://www.wave3.com/2019/10/19/police-arrest-woman-klondike-neighborhood-homicide/", "title": "Police arrest woman in Klondike neighborhood homicide", "authors": ["Maira Ansari", "Published At Pm"], "date": "2019-10-19", "keywords": ["learning", "week", "release", "louisville", "homicide", "klondike", "occurred", "louisvilles", "woman", "ky", "wave", "neighborhood", "man", "arrest"], "summary": "LOUISVILLE, Ky. (WAVE) - One week after a Louisville man was found dead inside his home in Louisville’s Klondike neighborhood, an arrest has been made in the case.\nPolice didn’t release many details when it initially occurred, but now we’re learning more about what happened."}, {"url": "https://www.lanereport.com/117619/2019/10/12-of-louisvilles-regional-economy-to-be-focus-of-upcoming-national-manufacturing-month-events/", "title": "12% of Louisville's regional economy to be focus of upcoming National Manufacturing Month events - Lane Report", "authors": ["Matt Wickstrom"], "date": "2019-10-12", "keywords": ["month", "upcoming", "companies", "report", "events", "career", "training", "oct", "local", "manufacturing", "louisville", "louisvilles", "mayor", "students", "focus", "regional", "national", "lane"], "summary": "LOUISVILLE, Ky. — During the month of October, Louisville Mayor Greg Fischer will join local leaders, business owners, and workforce development providers to celebrate National Manufacturing Month.\nThe manufacturing sector employs more than 80,000 workers regionally, working at approximately 1,400 manufacturing companies.\nKentuckianaWorks is currently offering several free training courses designed to quickly prepare people for good jobs with local manufacturing companies.\nThey include:The Manufacturing Training and Employment Connection (M-TEC), an intensive, 3-week program where participants can earn multiple training certificates valued by manufacturing companies.\nKentuckianaWorks will close out Manufacturing Month with a job fair from 11 a.m. to 3 p.m. on Tuesday, Oct. 29, at Kentucky Manufacturing Career Center, 160 Rochester Drive."}, {"url": "https://www.enterprisenews.com/photogallery/WL/20200318/NEWS/317009989/PH/1", "title": "Photos: PHOTOS: Fans show their love for Tom Brady over 20 years", "authors": [], "date": "2020-03-18", "keywords": ["photos", "right", "delivery", "fans", "tom", "thats", "access", "print", "brady", "choose", "plan", "20", "digital", "love"], "summary": "Choose the plan that’s right for you.\nDigital access or digital and print delivery."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/03/drought-to-impact-louisville-trees-fall-color-season/3828332002/", "title": "Drought will put a damper on the colors of the leaves in Louisville this fall, experts say", "authors": ["Lucas Aulbach", "Published A.M. Et Oct."], "date": "2019-10-03", "keywords": ["experts", "trees", "temperatures", "water", "color", "high", "damper", "louisville", "stephens", "say", "leaves", "colors", "drought", "drop", "fall"], "summary": "Soon, local experts say — but enjoy it while it lasts, because those leaves will likely fall in a hurry.\nThey'll drop their leaves before those leaves lose chlorophyll, which give them their green color.\nBuy Photo High temperatures this season may mean a loss of spectacular fall foliage color.\nBuy Photo High temperatures this season may mean a loss of spectacular fall foliage color.\n\"And I’m not saying we won’t see any fall color this year, but the drought has affected the leaves in the trees.\""}, {"url": "https://www.ncronline.org/news/justice/louisville-catholics-declare-their-parish-sanctuary-all", "title": "Louisville Catholics declare their parish a 'Sanctuary for All'", "authors": ["Dec", "Nov", "Oct", "Apr", "Jul", "May"], "date": "2020-01-09", "keywords": ["sanctuary", "william", "declare", "horvath", "barillas", "louisville", "immigration", "statement", "parish", "catholics", "st", "work", "trump"], "summary": "(CNS/The Record/Jessica Able)Louisville, Ky. — St. William Catholic Community here has declared itself a \"Sanctuary for All.\"\nBurke has been a priest for 47 years, with 18 years at St. William.\nKarina Barillas, also a member of St. William, is the executive director of La Casita Center, an organization devoted to Louisville's Latino community.\nSt. William is part of the Interfaith Coalition for Immigrant Justice.\nThrough the coalition, St. William pays for the salaries of two community liaisons."}, {"url": "https://www.courier-journal.com/story/news/local/2019/10/25/louisville-weather-rainfall-record-could-broken/2453736001/", "title": "Get ready, Louisville football fans: Saturday's rainfall could break 100-year-old record", "authors": ["Cameron Teague Robinson", "Ben Tobin", "Published P.M. Et Oct."], "date": "2019-10-25", "keywords": ["expected", "rainfall", "fans", "saturdays", "area", "100yearold", "oct", "webb", "game", "louisville", "ready", "inches", "football", "26", "break", "rain", "record"], "summary": "CLOSE Expect rainfall in Louisville for Saturday, Oct. 26, 2019.\nLouisville Courier JournalIf you plan to go outside Saturday, say to the University of Louisville or the University of Kentucky football games, you should probably think about some rain gear.\nThis precipitation is expected to break a record for the date — the most rainfall the Louisville area had previously experienced on any Oct. 26 was 1.2 inches in 1919, according to Webb.\nThe rainfall was expected to start Friday evening and pick up Saturday morning, Webb said.\nIt will be tough to beat the rain record for Lexington on the date of Oct. 26, which is 1.92 inches set in 1920."}, {"url": "https://www.courier-journal.com/story/news/politics/2020/03/25/kentucky-gov-andy-beshear-takes-rapid-evolution-fight-pandemic/2901910001/", "title": "Gov. Beshear has been in office for 3 months. Handling a pandemic wasn't on the calendar", "authors": ["Morgan Watkins", "Published A.M. Et March"], "date": "2020-03-25", "keywords": ["public", "gov", "wasnt", "months", "pandemic", "calendar", "state", "governor", "beshear", "kentucky", "andy", "coronavirus", "press", "know", "office", "hes", "handling"], "summary": "Andy Beshear said doctors and nurses treating patients amid the PPE shortage are heroes, and they are showing \"once-in-a-generation courage.\"\nAndy Beshear said Sunday as he began another of his daily, widely viewed press conferences about the coronavirus situation.\n\"I know Andy Beshear the man more than I know Andy Beshear the governor.\n\"And Andy Beshear the man is trying to do right by the people that he is the governor of.\"\nAndy Beshear followed in his father's footsteps in 2015, when he was elected attorney general."}, {"url": "https://www.courier-journal.com/picture-gallery/weather/local/2019/11/12/snow-louisville-weather-louisville/2571621001/", "title": "Kentucky weather: Snow dusts Louisville", "authors": [], "date": "2019-11-12", "keywords": ["kentucky", "snow", "louisville", "dusts", "weather"], "summary": ""}, {"url": "https://www.wlky.com/article/november-2019-election-results-kentucky-indiana-vote-beshear-bevin-race-governor-race/29668181", "title": "November 2019 election results: Kentucky, Indiana", "authors": ["Wlky Digital Team", "Https", "Www.Facebook.Com"], "date": "2019-11-06", "keywords": ["votes", "rick", "election", "victory", "race", "governor", "tonight", "kentucky", "2019", "speech", "versus", "results", "indiana", "vicki"], "summary": "November 2019 election results: Kentucky, Indiana ELECTION DAY 2019 Share Shares Copy Link CopyHide Transcript Show TranscriptCOMES DOWN TO THE FINAL VOTES.\nVICKI: UPSETS AND SURPRISES TONIGHT, AS THE KENTUCKY GOVERNOR RACE GOES DOWN TO THE WIRE.\nVICKI: WE’LL START WITH DENI KAMPER WHO IS AT TONIGHT’S DEMOCRATIC HEADQUARTERS, WHERE ANDY BESHEAR JUST GAVE HIS VICTORY SPEECH TO SUPPORTERS.\nHE THANKED SEVERAL GROUPS DURING THE VICTORY SPEECH, BUT MOST NOTABLY WAS PUBLIC SCHOOL TEACHERS.\nI THINK WE SHOWED THIS COUNTRY THAT IN KENTUCKY, WE CAN DISAGREE WITH EACH OTHER WHILE STILL RESPECTING ONE ANOTHER."}, {"url": "https://kiss951.com/2020/04/14/kenya-moore-reveals-her-husband-had-a-change-of-heart/", "title": "Kenya Moore Reveals Her Husband Had a Change of Heart", "authors": ["Glennisha Morgan"], "date": "2020-04-14", "keywords": ["relationship", "change", "husband", "asked", "daly", "marc", "reveals", "moore", "yes", "cohen", "kenya", "work", "heart", "wants"], "summary": "Kenya Moore recently appeared on an episode of Watch What Happens Live with Andy Cohen alongside her Real Housewives of Atlanta co-star Eva Marcille, and during the segment, she revealed that her previously estranged husband, Marc Daly had a “change of heart.”Andy Cohen asked Kenya Moore if she and Marc Daly were currently quarantined together.\n“Do you still have Marc’s clothes in the closet?” Cohen asked.\nHe wants to be a better person.” Cohen then asked Kenya Moore if she also wants to be better.\nCohen had also asked Moore if she still hadn’t met Marc Daly’s parents.\nAre Kenya Moore & Marc Daly Quarantining Together?"}, {"url": "https://wfpl.org/hey-kentucky-voters-heres-your-comprehensive-2019-voter-guide/", "title": "Hey Kentucky Voters! Here's Your Comprehensive 2019 Voter Guide", "authors": [], "date": "2019-11-04", "keywords": ["heres", "guide", "election", "state", "voters", "voter", "kentucky", "2019", "county", "jefferson", "office", "running", "republican", "hey", "comprehensive"], "summary": "The BallotThis year’s ballot is pretty straightforward — at least for most people in Jefferson County.\nIf you live in Southwest Jefferson County, you’ll also be able to vote for a school board member.\nRelated Story Election 2019: Your Guide To The Candidates For Kentucky GovernorSecretary of StateKentuckians will elect the state’s next chief elections officer.\nRelated Story Election 2019: Your Guide To The Kentucky State Auditor CandidatesState TreasurerKentucky’s treasurer is responsible for making sure the state’s spending is legal and constitutional.\nRelated Story Election 2019: Your Guide To The JCPS School Board CandidatesFor much more coverage about this year’s races and the candidates, click here."}, {"url": "https://www.courier-journal.com/story/news/local/2019/11/11/louisville-weather-bitter-cold-and-icy-patches-expected-tuesday/2564642001/", "title": "Get ready, Louisville: Here's what to know about Monday's snow and Tuesday's cold weather", "authors": ["Sarah Ladd", "Published P.M. Et Nov."], "date": "2019-11-11", "keywords": ["heres", "degrees", "expected", "temperatures", "know", "cold", "today", "roads", "snow", "louisville", "ready", "set", "weather", "mondays", "service", "tuesdays"], "summary": "The National Weather Service in Louisville reported early Tuesday that the region received between 1 and 1 1/2 inches of snow overnight.\nThe high temperature Tuesday is expected to be around 28 degrees and the low around 19, according to the National Weather Service.\nThe lowest high temperature recorded on Nov. 12 in Louisville is 32 degrees in 1932, and the record low is 17 degrees, set in 1995.\nAcross the nation, more than 300 daily records could fall through Thursday, the weather service said.\nMeteorologist Ron Steve with the National Weather Service in Louisville said the worst of the fall would be over during the late hours on Monday, ending just after midnight."}, {"url": "https://www.courier-journal.com/story/weather/local/winter/2019/11/12/louisville-weather-cold-temperature-tuesday-night-might-break-record/2573098001/", "title": "Louisville's low temperature Tuesday night will flirt with decades-old record", "authors": ["Sarah Ladd", "Ben Tobin", "Published A.M. Et Nov."], "date": "2019-11-12", "keywords": ["degrees", "sunny", "temperature", "cold", "snow", "night", "louisville", "louisvilles", "flirt", "weather", "low", "jarvis", "decadesold", "record"], "summary": "Courier JournalIn case you missed it: Snow flakes fell Monday night, and it was brutally cold Tuesday.\nThe low temperature for Tuesday night at Louisville Muhammad Ali International Airport is forecast to be 18 degrees, according to Louisville National Weather Service meteorologist Mark Jarvis.\nThat will approach a 33-year-old record — the lowest temperature on Nov. 12 ever was 16 degrees in 1986.\nThe cold will persist into Wednesday morning, as wind chill will make it feel like the temperature is in the low teens.\nWednesday night will be cloudy with a low of 26."}, {"url": "https://www.whas11.com/article/news/local/louisville-week-of-valor-2019/417-8ff724a2-8b6e-4f43-adcf-f8dcc603a214", "title": "List of events for Week of Valor 2019", "authors": ["Author", "Courtney Hayden", "Published", "Am Edt November", "Updated"], "date": "2019-11-01", "keywords": ["information", "events", "free", "week", "veterans", "502", "valor", "2019", "event", "military", "location", "cost", "info", "list", "program"], "summary": "Cost : Free: Free Event Info : Over 100 pencil sketches done by 94-year-old WWII Veteran Robert Enders will be on display.\nCost : Free: Free Event Info : Team RWB Louisville will gather to clean up trash and debris along the side of the road.\nCost : Free: Free Event Info : Team RWB is hosting a beginner-friendly yoga class led by Laura Johnson at Infinite Bliss Yoga.\nCost : Free: Free Event Info : The 9th Annual Veterans Parade is the official Veterans Day event for Louisville.\nCost : Free: Free Event Info : Waving the Flags showcase is a multi-service event to celebrate and promote patriotism in the community."}, {"url": "https://www.courier-journal.com/story/weather/local/2019/11/30/louisville-weather-november-rain-total-doubled-snow-may-next/4340180002/", "title": "Louisville's November rain total is doubled thanks to Saturday, and snow may be next", "authors": ["Billy Kobin", "Published P.M. Et Nov."], "date": "2019-11-30", "keywords": ["total", "schoettmer", "received", "according", "southern", "snow", "louisville", "louisvilles", "weather", "inches", "doubled", "rain", "flood", "thanks"], "summary": "For some context, Schoettmer said the Louisville area had received roughly 2.63 inches during the month of November until Saturday, below the average November total of 3.46 inches.\nAreas in nearby Meade and Breckenridge counties have already received 3 inches of rain Saturday, while other parts of the commonwealth have received between 1.5 and 2.5 inches, Schoettmer added.\nA brief break Sunday morning, then rain, possible snow, late Sunday into Monday.\nBut Schoettmer added that some snow showers could also begin Sunday night into Monday morning.\nA high near 50 degrees and low around 36 on Sunday is currently projected for the Louisville area, according to the weather service."}, {"url": "https://www.courier-journal.com/story/news/politics/2019/11/06/kentucky-governors-election-race-recount-look-what-happens-now/4172935002/", "title": "No Bevin-Beshear recount? These are the possible next steps under Kentucky election law", "authors": ["Joe Sonka", "Published A.M. Et Nov."], "date": "2019-11-06", "keywords": ["election", "state", "race", "governor", "bevin", "kentucky", "told", "possible", "general", "law", "recount", "steps", "bevinbeshear"], "summary": "Will there be a recanvass, recount of Kentucky governor's race votes?\n[Stay up-to-date on Kentucky election news and sign up for our mobile app here.]\nThere is no provision for an automatic recount under Kentucky law, as a candidate must file a petition with the Franklin Circuit Court within 10 days of the election.\nBut in gubernatorial elections, state law does not allow candidates to ask for a recount, Grimes told The Courier Journal in an interview on Wednesday.\nCLOSE Matt Bevin told Republicans that he was not conceding to Andy Beshear Louisville Courier JournalWhen will the new Kentucky governor be sworn into office?"}, {"url": "https://www.courier-journal.com/story/news/politics/elections/2019/09/10/kentucky-elections-voter-registration-where-to-vote-when-is-election-day/1793309001/", "title": "From who is running to where to vote: Your guide to the 2019 Kentucky general elections", "authors": ["Shannon Hall", "Published A.M. Et Sept."], "date": "2019-09-10", "keywords": ["guide", "polls", "election", "elections", "vote", "courier", "today", "support", "kentucky", "sample", "2019", "questions", "need", "youre", "running", "general"], "summary": "2019 Kentucky general election: Who will be on the ballot?\nPlus check out a printable sample ballotWhen is the 2019 general election?\nIf you have questions about whether you're registered or where you're supposed to vote, contact your county clerk.\nIf you have any questions about voting, please contact the Kentucky State Board of Elections at 502-573-7100.\nCan I see a Kentucky sample ballot?"}, {"url": "https://www.courier-journal.com/story/news/2020/04/07/reports-grammy-winning-singer-john-prine-dead-covid-19/1985093001/", "title": "John Prine, a 2-time Grammy winner who was 'Pure Kentucky,' dies of COVID-19", "authors": ["Andrew Wolfson", "Published P.M. Et April"], "date": "2020-04-07", "keywords": ["records", "album", "songs", "song", "kentucky", "prine", "winner", "grammy", "wrote", "john", "dies", "boy", "covid19", "2time", "heart", "pure", "told"], "summary": "In late March, the family announced that Prine had been hospitalized with symptoms of COVID-19 and had been intubated.\nAfter a four-year hiatus from recording, he rebounded in 1992 with “The Missing Years,” on his own label, Oh Boy Records.\nJohn Prine, 2016 (Photo: Oh Boy Records)He told Doyle in 2017 that he was a chronic loafer: “I look busy for a living,” he said.\nCLOSE Legendary folk singer John Prine, who often spoke fondly of his roots in Kentucky, has died after a battle with COVID-19.\nWochitIn July 2019, the Prine family and Oh Boy Records announced he was canceling his summer tour because doctors advised he was at an elevated risk of stroke."}, {"url": "https://www.wave3.com/2019/11/28/schedule-light-up-louisville-announced/", "title": "Schedule for Light Up Louisville 2019 announced", "authors": ["Shellie Sylvestri", "Published At Pm"], "date": "2019-11-28", "keywords": ["light", "schedule", "2019", "louisville", "set", "place", "jefferson", "ky", "wave", "square", "nov", "announced"], "summary": "LOUISVILLE, Ky. (WAVE) - Light Up Louisville is set to be held in Jefferson Square on Nov. 29, and the schedule of events is in place for a festive holiday celebration."}, {"url": "https://www.louisville.com/content/super-kids-2019-louisville-magazine", "title": "Meet the 2019 Super Kids of Louisville", "authors": [], "date": "2019-11-18", "keywords": ["really", "started", "right", "music", "super", "dont", "lot", "school", "2019", "louisville", "think", "im", "things", "meet", "kids"], "summary": "A lot of people don’t think of athletes as singers, but singing actually is a very athletic endeavor.\nI don’t think I see myself as specifically working in politics.\nI don’t think of a job as a final solution.\n“Right now some fries sound really good.”------------------------Clay Cook photographed this year’s class of Super Kids.\n“When I think ‘super kids,’ my head goes to Marvel movies and DC Comics, with dramatic light."}, {"url": "https://www.nytimes.com/interactive/2019/11/05/us/elections/results-kentucky-governor-general-election.html", "title": "2019 Kentucky Governor General Election Results", "authors": ["The New York Times"], "date": "2019-11-05", "keywords": ["mr", "votes", "election", "victory", "president", "governor", "beshear", "kentucky", "2019", "walkout", "governors", "unpopular", "results", "general", "bevin"], "summary": "See all Kentucky results ›Kentucky Gov.\nMatt Bevin conceded to Attorney General Andy Beshear after a recanvass of votes confirmed Mr. Beshear’s victory in the 2019 governor’s election.\nRead moreThe governor's race in Kentucky had been cast as a showdown between an unpopular governor and an unpopular party.\nMr. Bevin had focused his campaign on his alignment with President Trump and his opposition to impeachment, with the president holding a rally on Monday in Lexington to reciprocate the support.\nMr. Beshear has been buoyed by the governor's diminished popularity — Mr. Bevin is among the least popular governors in the country."}, {"url": "https://www.whas11.com/gallery/news/local/photos-2019-kentucky-general-election-day/417-5b662d95-300f-4453-8eed-9a50db5d5eb5", "title": "Photos: 2019 Kentucky General Election Day", "authors": [], "date": "2019-11-05", "keywords": ["photos", "election", "day", "kentucky", "wife", "2019", "louisville", "worker", "poll", "phototimothy", "matt", "republican", "general", "nov", "bevin", "states"], "summary": "Kentucky Governor and Republican gubernatorial candidate Matt Bevin, center, and his wife Glenna Bevin are directed by a poll worker where they are to go to get their ballots for the state's general election in Louisville, Ky., Tuesday, Nov. 5, 2019.\n(AP Photo/Timothy D. Easley)"}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/14/lights-under-louisville-2019-dates-prices-tickets/4180526002/", "title": "Christmas is almost here! Here's your ultimate holiday guide to Lights Under Louisville", "authors": ["Kathryn Gregory", "Published A.M. Et Nov."], "date": "2019-11-14", "keywords": ["heres", "guide", "lights", "christmas", "ultimate", "vehicle", "passes", "louisville", "holiday", "standard", "need", "pass", "nov", "ticket"], "summary": "Each year the Louisville Mega Cavern,1841 Taylor Ave., is transformed into the Lights Under Louisville holiday light spectacular for the holiday season that features more than 3 million lights.\nHere's everything you need to know about the 2019 Lights Under Louisville:What is Lights Under Louisville?\nLights Under Louisville is an underground Christmas light show in Louisville.\nLights Under Louisville is held at the Louisville Mega Cavern, 1841 Taylor Ave., off Poplar Level Road in Louisville.\nFrom Scrooge to a disgruntled elf: Christmas has arrived at Actors TheatreWhen is Lights Under Louisville?"}, {"url": "https://www.courier-journal.com/story/weather/local/winter/2019/12/01/louisville-weather-snowfall-expected-sunday-night-and-monday-morning/4346515002/", "title": "Snow expected Sunday night into Monday morning in Louisville", "authors": ["Sarah Ladd", "Published P.M. Et Dec."], "date": "2019-12-01", "keywords": ["expected", "gonna", "morning", "slowly", "schoettmer", "roads", "snow", "vehicle", "night", "louisville", "half"], "summary": "CLOSEWhen Santa came to Kentucky Friday night for Light up Louisville, he casually predicted the city might get some magic white stuff soon.\nBrian Schoettmer, a meteorologist with the Louisville National Weather Service, is predicting snow for Sunday night into Monday morning, though he doesn't expect more than a half inch accumulation.\nSnow will start mingling in with rain Sunday evening, said Schoettmer, between 7 p.m. and midnight.\nThen, pure snow will fall during the night.\nDrive slowly and adjust your speed down to account for lower traction when driving on snow or ice."}, {"url": "https://www.courier-journal.com/story/weather/local/winter/2019/11/11/louisville-school-closings-delays-snow-cancel-jcps-classes/2566803001/", "title": "JCPS is in session Tuesday as snow, winter weather hits the Louisville area", "authors": ["Billy Kobin", "Ben Tobin", "Olivia Krauth", "Published P.M. Et Nov."], "date": "2019-11-11", "keywords": ["degrees", "12", "temperatures", "area", "cold", "high", "kentucky", "snow", "jcps", "louisville", "weather", "winter", "schools", "session", "hits"], "summary": "CLOSERoughly an inch of snow was expected in the Louisville area Monday night into Tuesday morning, raising a question in parents' and students' minds: Will schools be delayed or closed?\nDespite the winterlike weather, Jefferson County Public Schools announced just after 4:30 a.m. Tuesday that all district schools \"are open and operating on a regular schedule.\"\nMost parts of Louisville and Central Kentucky received between 1 and 1 1/2 inches of snow overnight, according to the National Weather Service.\nRecord cold daytime high temperatures today in the mid 20s - nearly 35 degrees below normal!\n#KYwx#INwxpic.twitter.com/dcedCuBmHj — NWS Louisville (@NWSLouisville) November 12, 2019Winter weather: Louisville's cold snap worries city, homeless advocatesWhat to know: Snow will hit Louisville sooner than expectedRead or Share this story: https://www.courier-journal.com/story/weather/local/winter/2019/11/11/louisville-school-closings-delays-snow-cancel-jcps-classes/2566803001/"}, {"url": "https://www.alternet.org/2020/04/mitch-mcconnells-substantial-statewide-ad-buy-proves-he-fear-democratic-challenger-amy-mcgrath-and-for-good-reason-analysis/", "title": "Mitch McConnell’s ‘substantial’ statewide ad buy proves he fears Democratic challenger Amy McGrath — and for good reason: analysis", "authors": ["Alex Henderson"], "date": "2020-04-15", "keywords": ["coronavirus", "good", "care", "million", "statewide", "proves", "fears", "mcgrath", "mitch", "kentucky", "reason", "mcconnell", "ad", "taking", "state", "substantial", "health", "democratic", "mcconnells"], "summary": "In Kentucky, Democratic senatorial candidate Amy McGrath has been waging an aggressive campaign against Senate Majority Leader Mitch McConnell, who is seeking reelection.\nAnd by defending his record on health care and coronavirus in the ad, McConnell is, in effect, acknowledging one of his vulnerabilities.\nAccess to health care is critical for maintaining healthy families and a healthy workforce.\nI’m fighting to ensure health care protections and federal funding continue and are not repealed.\nThis was money FOR Kentucky health departments.https://t.co/NK2kEavb1u — Amy McGrath (@AmyMcGrathKY) April 15, 20202."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/08/louisville-shows-week-november-2019-slayer-wilco-goo-goo-dolls/2455271001/", "title": "Louisville shows this week: Slayer, Wilco, Elvis Costello and more", "authors": ["Gege Reed", "Published A.M. Et Nov."], "date": "2019-11-08", "keywords": ["shows", "w", "s", "music", "university", "start", "week", "concert", "hall", "tickets", "wilco", "louisville", "costello", "slayer", "elvis", "st"], "summary": "2 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/22/louisville-shows-week-november-2019-jack-harlow-santaland-diaries/4189489002/", "title": "Louisville shows this week: Jack Harlow, 'The Santaland Diaries,' and more", "authors": ["Gege Reed", "Published A.M. Et Nov."], "date": "2019-11-22", "keywords": ["shows", "w", "s", "harlow", "start", "music", "diaries", "week", "university", "concert", "hall", "tickets", "louisville", "santaland", "jack", "st"], "summary": "3 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. $40, $35 seniors, $5 students.\n7 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7:30 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free."}, {"url": "https://www.rollcall.com/2020/04/14/cities-back-democrats-virus-aid-formula-amid-small-business-stalemate/", "title": "Cities back Democrats’ virus aid formula amid small-business stalemate", "authors": [], "date": "2020-04-14", "keywords": ["amid", "democrats", "governments", "virus", "package", "direct", "state", "smallbusiness", "billion", "city", "mayors", "local", "stalemate", "aid", "formula", "offered", "cities"], "summary": "Mayors of small and midsize cities, arguing they were shortchanged in last month’s coronavirus relief package, are pushing tweaks to that program as well as a huge new cash infusion.\nThat $2.3 trillion measure included $150 billion for state and local governments.\nBut the package offered no direct funding to cities with under 500,000 residents.\nWith city budgets now facing cuts from the economic shutdown, the National League of Cities and the U.S. Conference of Mayors called for $250 billion in fresh federal aid for municipal governments of all sizes.\n“Congress has offered no direct support for cities like ours,” said Bryan Barnett, the Republican mayor of Rochester Hills, Michigan, a city of about 75,000 in the Detroit metro area."}, {"url": "https://www.cnbc.com/2019/11/14/bevin-concedes-after-recanvass-in-kentucky-governors-race.html", "title": "Bevin concedes after recanvass in Kentucky governor's race", "authors": ["Jane C. Timm"], "date": "2019-11-14", "keywords": ["votes", "election", "vote", "race", "concedes", "recanvass", "beshear", "kentucky", "week", "transition", "governors", "results", "bevin"], "summary": "Matt Bevin conceded the governor's race Thursday after a recanvass of last week's gubernatorial election results.\nThe vote tally will change after the recanvass due to absentee ballots, Bevin said, but acknowledged it would not be enough to change the results of the race.\nBevin called for the recanvass last week, saying there were \"irregularities\" in the election.\n\"It's time to move forward with a smooth transition,\" Beshear told reporters last week.\nThe Kentucky Constitution requires governors be sworn into office on the fifth Tuesday after an election; this year, that's Dec. 10."}, {"url": "https://www.courier-journal.com/story/money/louisville-city-living/2019/11/05/kentucky-election-louisville-voters-honor-suffragists/4121838002/", "title": "Louisville voters are leaving their 'I Voted Today' wristbands at suffragists' graves", "authors": ["Maggie Menderski", "Published P.M. Et Nov."], "date": "2019-11-05", "keywords": ["voted", "women", "grave", "voters", "today", "association", "lot", "graves", "president", "leaving", "kentucky", "suffragists", "louisville", "womens", "vote", "rights", "wristbands"], "summary": "Today in Louisville, the only cuffing women get at the polls are with one of those “I Voted Today” wristbands.\nCo-founder of the Kentucky Equal Rights Association, the Louisville Equal Rights Association, and the Louisville Women’s Club.\nA prominent member of the Louisville Women’s Club.\nPublic figure who spoke on behalf of Louisville women.\nCo-founder and longtime president of the Baptist Women’s Education Convention and the Kentucky Association of Colored Women’s Clubs."}, {"url": "https://wfpl.org/heres-your-comprehensive-2019-voter-guide/", "title": "Here's Your Comprehensive 2019 Voter Guide", "authors": [], "date": "2019-10-28", "keywords": ["guide", "heres", "election", "state", "voter", "kentucky", "2019", "county", "jefferson", "office", "running", "republican", "comprehensive"], "summary": "The BallotThis year’s ballot is pretty straightforward — at least for most people in Jefferson County.\nIf you live in Southwest Jefferson County, you’ll also be able to vote for a school board member.\nRelated Story Election 2019: Your Guide To The Candidates For Kentucky GovernorSecretary of StateKentuckians will elect the state’s next chief elections officer.\nRelated Story Election 2019: Your Guide To The Kentucky State Auditor CandidatesState TreasurerKentucky’s treasurer is responsible for making sure the state’s spending is legal and constitutional.\nRelated Story Election 2019: Your Guide To The JCPS School Board CandidatesFor much more coverage about this year’s races and the candidates, click here."}, {"url": "https://voice-tribune.com/_/life-style-2/the-speed-art-museum-november-2019-calendar/", "title": "The Speed Art Museum November 2019 Calendar", "authors": [], "date": "2019-11-01", "keywords": ["600", "exhibition", "art", "calendar", "pmnovember", "kentucky", "2019", "louisville", "museum", "presents", "speed", "film"], "summary": "Art LabNovember 10 at 1:00 pm – 4:00 pmVisit Art Lab and put your creativity to the test.\nThe Speed Art Museum and the Filson Historical Society present Hidden Histories of Kentucky Art with Mack Cox: Tracking New England Footprints in Kentucky FurnitureNovember 10 at 2:00 pm – 3:30 pmHidden Histories: Kentucky Art with Mack Cox Tracking New England Footprints in Kentucky Furniture The third in a lectures series from historian and Kentucky antiques collector Mack Cox.\nSpeed Cinema Presents: Louisville Film Society Short Film SlamNovember 14 at 7:00 pm – 8:30 pmLouisville Film Society Short Film Slam Various directors Co-presented by the Louisville Film Society, local filmmakers will present several short works of fifteen minutes or less followed by questions and comments from the audience.\nEach After Hours event comes alive with an eclectic mix of music, performances, cash bar + food available by Wiltshire at the Speed, and of course art!\nMuseum ClosedNovember 28 at 10:00 am – 5:00 pmThe Museum will be closed for the Thanksgiving Holiday and will reopen on Friday, November 29."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/10/25/louisville-shows-october-november-2019-chris-stapleton-lion-king/3998380002/", "title": "Louisville shows this week: 'Lion King,' Chris Stapleton, Atreyu & more", "authors": ["Gege Reed", "Published A.M. Et Oct."], "date": "2019-10-25", "keywords": ["shows", "w", "stapleton", "start", "university", "music", "week", "atreyu", "concert", "hall", "ave", "tickets", "lion", "louisville", "king", "chris", "st"], "summary": "6:30 p.m., Mercury Ballroom, 611 S. Fourth St. Tickets start at $32.\n3 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. $15, $5 students.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n3 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free."}, {"url": "https://www.wave3.com/2019/11/27/police-investigating-fatal-shooting-louisvilles-russell-neighborhood/", "title": "Police investigating fatal shooting in Louisville’s Shawnee neighborhood", "authors": ["Dustin Vogt", "Published At Pm"], "date": "2019-11-27", "keywords": ["scene", "shawnee", "shooting", "sustained", "second", "smiley", "fatal", "louisvilles", "river", "unit", "victim", "neighborhood", "spokesperson", "thirties", "investigating"], "summary": "According to LMPD spokesperson Alicia Smiley, calls came in around 7:00 p.m. to the 3800 block of River Park Drive on reports of a fatal shooting.\nSecond division officers and the Homicide Unit arrived on scene, finding a male victim in his thirties that had died from injuries sustained from the shooting."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2019/11/08/kentucky-high-school-football-scores-friday-november-8/2533329001/", "title": "Kentucky high school football scores from Friday, November 8", "authors": ["Associated Press", "Published P.M. Et Nov."], "date": "2019-11-08", "keywords": ["unlimited", "access", "today", "high", "support", "kentucky", "school", "local", "journalismsupport", "scores", "digital", "football", "subscriber"], "summary": "Support local journalismSupport stories like this one by becoming a subscriber today!\nGet unlimited digital access here!"}, {"url": "https://www.wholehogsports.com/news/2020/apr/15/ua-hoops-set-to-add-to-the-mix-20200415/", "title": "UA hoops set to add to the mix", "authors": [], "date": "2020-04-15", "keywords": ["sign", "hoops", "state", "shooting", "guard", "set", "mix", "add", "ua", "tate", "points", "season", "hogs", "arkansas", "averaged"], "summary": "The Hogs are expected to sign graduate transfers forward Vance Jackson and guard Jalen Tate today.\nHe averaged 13.9 points, 5.4 rebounds and 3.6 assists as a redshirt junior and was the Horizon League Defensive Player of the Year.\nTwo of Arkansas' high school commitments, center Jaylin Williams and shooting guard Moses Moody plan to sign but have yet to set a date.\nHe averaged 11.6 points while shooting 60.1% from the field, 46.9% from three-point range and 82.1 % from the free-throw line this season.\n10 shooting guard and No."}, {"url": "https://www.courier-journal.com/story/sports/college/louisville/2020/04/09/university-louisville-athletics-budget-cuts-coronavirus-response/5122535002/", "title": "Louisville coaches, athletics staff will take 10% pay cuts amid coronavirus pandemic", "authors": ["Tim Sullivan", "Published P.M. Et April"], "date": "2020-04-09", "keywords": ["amid", "university", "pandemic", "pay", "cuts", "staff", "million", "coronavirus", "athletic", "louisville", "coaches", "l", "ncaa", "tyra", "football", "athletics", "salary"], "summary": "Louisville Courier JournalWith revenues in decline and uncertainty on the rise, Vince Tyra confronts the coronavirus with a tightened belt and a slashed salary.\nMore: University of Louisville to furlough employees, cut pay due to coronavirus pandemicKentucky coronavirus map: How many cases are in Kentucky?\nYet the threat of a delayed or diminished football season has prompted preemptive retrenchment across college athletics.\nLast week, Iowa State University announced $3 million in salary cuts in its athletic department and another $1 million in suspended bonuses.\nTyra said the salary cuts he sought were accepted “100%” on a voluntary basis."}, {"url": "https://www.courier-journal.com/story/news/politics/elections/kentucky/2019/10/23/who-are-the-2019-candidates-kentucky-election/3995904002/", "title": "Who's running in the 2019 Kentucky general election? Plus a printable sample ballot", "authors": ["Shannon Hall", "Published P.M. Et Oct."], "date": "2019-10-23", "keywords": ["heres", "election", "state", "printable", "vote", "kentucky", "sample", "whos", "2019", "candidates", "kentuckys", "plus", "ballot", "running", "general", "bevin"], "summary": "Louisville Courier JournalStory Highlights For more election coverage go to courierjournal.com/elections2019Election Day is Nov. 5Only six races will be on all Kentucky voters' ballots on Nov. 5.\nPlus check out our Q&As with all the candidates and see where they stand on certain issues.\nHere's how we got hereGreg Stumbo, DemocratDaniel Cameron, RepublicanAttorney general candidates: Here are Kentucky's 2019 general election candidatesDiscover the stories that matter most to you.\nThis is a sample ballot from Jefferson County, but most ballots will look similar.\nSample Ballots by Courier Journal on ScribdShannon Hall is a digital producer with the Courier Journal."}, {"url": "https://theintercept.com/2019/11/06/election-results-virginia-kentucky-abortion/", "title": "The GOP’s Fearmongering Over Abortion Flopped in Kentucky and Virginia", "authors": [], "date": "2019-11-06", "keywords": ["virginia", "democrats", "fearmongering", "gops", "groups", "bevin", "kentucky", "abortion", "beshear", "rights", "planned", "list", "flopped"], "summary": "On Tuesday night in Kentucky and Virginia, abortion was a losing issue for Republicans.\nIn Kentucky, where just one abortion clinic remains, Attorney General Andy Beshear ousted Republican Gov.\nMatt Bevin, despite anti-abortion groups massively outspending reproductive rights groups when it came to messaging on abortion.\nBloomberg Law also claimed that abortion rights groups outspent the anti-abortion side in Virginia.\nVoters, therefore, heard far more about how Democrats are baby killers — and that Beshear is “Abortion Andy” — than they heard in defense of Democrats on abortion."}, {"url": "https://www.courier-journal.com/story/news/2019/11/07/lmpd-responds-reported-shooting-kroger-portland/2524578001/", "title": "LMPD chief says man fired at officers at Portland Kroger and was killed at the scene", "authors": ["Sarah Ladd", "Published P.M. Et Nov."], "date": "2019-11-07", "keywords": ["scene", "kroger", "lmpd", "killed", "shooting", "today", "chief", "fired", "store", "outside", "portland", "officers", "inside", "man", "allegedly"], "summary": "The incident comes a little more than a year after a man allegedly shot and killed two African American shoppers at a Kroger store in Jeffersontown in what many say was a hate crime.\nJeffersontown Kroger shooting: What's changed one year laterOfficers killed the man as they returned fire, he said, adding that there were no reports of other injuries.\nConrad said there were officers nearby who were able to respond quickly to the calls of gunfire inside the store.\nJabani Bennett, a teacher,said she was inside the store when she saw a man’s red flip flops on the ground.\nThe Portland neighborhood Kroger is still closed Friday following last night’s incident that ended when Louisville police officers say they fatally shot an armed man outside the entrance."}, {"url": "https://www.courier-journal.com/picture-gallery/entertainment/2019/11/19/americas-got-talent-hosts-open-auditions-louisville/4242993002/", "title": "America's Got Talent hosts open auditions in Louisville", "authors": [], "date": "2019-11-19", "keywords": ["auditions", "louisville", "talent", "hosts", "open", "americas"], "summary": ""}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2019/11/29/kentucky-high-school-football-state-finals-2019-times-matchups-set/4296414002/", "title": "Schedules and matchups set for Kentucky high school football state championship games", "authors": ["Jason Frakes", "Published P.M. Et Nov."], "date": "2019-11-29", "keywords": ["matchups", "6a", "trinity", "vs", "state", "pmclass", "high", "schedules", "kentucky", "140", "school", "male", "set", "games", "championship", "dec", "football"], "summary": "CLOSEHere are the pairings for the Kentucky state football finals to be played at the University of Kentucky’s Kroger Field.\nFriday, Dec. 6Class A - Paintsville (11-3) vs. Pikeville (13-0), 2 p.m.Class 3A - Bell County (14-0) vs. Belfry (10-3), 7 p.m.Saturday, Dec. 7Class 2A - Mayfield (13-1) vs. Somerset (13-1), 1 p.m.Class 4A - Boyle County (14-0) vs. Johnson Central (14-0), 4:30 p.m.Class 5A - Covington Catholic (14-0) vs. Frederick Douglass (14-0), 8 p.m.Sunday, Dec. 8Class 6A - Trinity (12-2) vs.\nMale (14-0), 2 p.m.More: Bross carries the load for Male in Class 6A semifinal victory over Tates CreekAlso: Trinity rolls past North Hardin, gets rematch with Male in Class 6A state finalRead this: Kentucky high school football scores for Friday, Nov. 29Jason Frakes: 502-582-4046; jfrakes@courier-journal.com; Twitter: @kyhighs.\nSupport strong local journalism by subscribing today: www.courier-journal.com/jasonf."}, {"url": "https://www.whas11.com/article/news/local/veterans-day-deals-kentucky-indiana/417-647d11e2-817c-461f-8051-40c539fddb98", "title": "Veterans Day 2019 freebies, deals in Kentucky and Indiana", "authors": ["Author", "Courtney Hayden", "Wthr Staff", "Published", "Am Est November", "Updated"], "date": "2019-11-11", "keywords": ["score", "freebies", "salute", "day", "veterans", "kentucky", "unless", "notedmilitary", "2019", "deals", "promotions", "shown", "indiana", "receive", "places", "nov"], "summary": "LOUISVILLE, Ky. — We salute you, veterans, and so do these businesses!\nHere's a list of places active military members and veterans can score deals and discounts on Monday, Nov. 11 in honor of Veterans Day (unless otherwise noted):Military IDs must be shown at all businesses to receive promotions."}, {"url": "https://www.courier-journal.com/story/life/events/2020/03/10/galaxycon-louisville-comic-convention-not-returning-2020/5009568002/", "title": "GalaxyCon is not returning to Louisville in 2020, founders announce", "authors": ["Emma Austin", "Published A.M. Et March"], "date": "2020-03-10", "keywords": ["founders", "2020", "town", "galaxycon", "center", "kentucky", "louisville", "announce", "event", "convention", "hosting", "dates", "returning"], "summary": "CLOSEThe comic convention that drew thousands to Louisville last summer announced it won't be returning to the city in 2020.\nGalaxyCon owners posted on their website this week the Kentucky International Convention Center \"has made it nearly impossible to return.\"\n\"We offered multi-year agreements in an alternative month and offered a one year agreement to make 2020 GalaxyCon a reality.\nGalaxyCon has posted 2020 dates for Richmond, Virginia; Minneapolis; and Raleigh, North Carolina.\nLouisville Tourism predicted that last year's GalaxyCon event would generate about $738,000 in economic impact."}, {"url": "https://www.courier-journal.com/story/entertainment/2019/11/11/veterans-day-2019-why-always-november-11-open-closed/2561510001/", "title": "Veterans Day 2019: What is open and closed on Nov. 11?", "authors": ["Ryan W. Miller", "Published A.M. Et Nov."], "date": "2019-11-11", "keywords": ["stores", "remain", "closed", "day", "veterans", "2019", "open", "service", "nov", "armistice", "11"], "summary": "CLOSE Discover the origins of Armistice Day, now Veterans Day, from Smithsonian National Museum of American History curator Frank Blazich.\nThe federal holiday is celebrated every year on Nov. 11, regardless of the day of the week it falls on.\nFirst recognized as Armistice Day in 1919, Veterans Day marks the date when Germany and the allies signed a 1918 agreement to cease World War I hostilities.\nIn 1938, Congress passed a law to mark Nov. 11 as a legal holiday.\nHere's what's open and what's closed this Veterans Day:Banks: Many banks, including Federal Reserve Banks, Bank of America and Wells Fargo, will be closed."}, {"url": "https://www.wave3.com/2019/11/16/championship-rodeo-returns-louisville-freedom-hall/", "title": "Championship Rodeo returns to Louisville at Freedom Hall", "authors": ["Dustin Vogt", "Published April", "At Pm"], "date": "2019-11-16", "keywords": ["returns", "rodeo", "competing", "hall", "cowboys", "prizes", "louisville", "championship", "north", "pro", "regional", "cowgirls", "finals", "title", "freedom"], "summary": "Cowboys and cowgirls from across North America will be competing in the circuit finals of the Pro Rodeo Cowboys Association for more than $80,000 in prizes and the title of Regional Champion."}, {"url": "https://www.courier-journal.com/story/news/crime/2019/11/15/louisville-native-ex-nba-nc-state-player-anthony-grundy-dies-altercation/4200741002/", "title": "Louisville native and ex-NBA player Anthony Grundy dies in stabbing, police say", "authors": ["Billy Kobin", "Published P.M. Et Nov."], "date": "2019-11-15", "keywords": ["player", "exnba", "colovos", "state", "high", "career", "grundy", "school", "louisville", "basketball", "say", "stabbing", "dies", "anthony", "native", "nc"], "summary": "Related: LMPD investigating death on Muhammad Ali Boulevard after \"altercation\"Anthony Grundy, basketball, 1979-2019.\nArchie Miller, the head men's basketball coach at Indiana University, was teammates with Grundy at NC State.\n\"Fly high, Grundy,\" tweeted Kevin Keatts, head men's basketball coach at NC State.\nRest In Peace to NC State legend Anthony Grundy.\n1997 Kentucky All-Star Anthony Grundy passed away this evening."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/15/louisville-shows-week-november-2019-alice-cooper-elvis-costello/2506735001/", "title": "Louisville shows this week: Alice Cooper, Elvis Costello, 'A Christmas Carol' & more", "authors": ["Gege Reed", "Published A.M. Et Nov."], "date": "2019-11-15", "keywords": ["shows", "w", "music", "university", "start", "week", "free", "carol", "hall", "christmas", "tickets", "school", "louisville", "brandeis", "costello", "cooper", "alice", "elvis"], "summary": "2 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7:30 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n7 p.m., Bird Recital Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n8 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. Free.\n3 p.m., Comstock Concert Hall, University Louisville School of Music, 105 W. Brandeis Ave. $40, $35 seniors, $5 students."}, {"url": "https://www.courier-journal.com/story/news/local/2019/11/05/louisville-polling-location-bowen-elementary-school-lockdown/4167230002/", "title": "Polling place at Louisville elementary school will be open longer after lockdown", "authors": ["Billy Kobin", "Published P.M. Et Nov."], "date": "2019-11-05", "keywords": ["lockdown", "ruoff", "elementary", "polling", "school", "place", "louisville", "location", "county", "jefferson", "open", "office", "longer", "ghibaudy"], "summary": "CLOSEA Jefferson County polling location at Bowen Elementary School in Lyndon is back open following a lockdown Tuesday afternoon that was prompted due to reports of an armed person in the area.\nLouisville Metro Police Department spokeswoman Elizabeth Ruoff said the polling location was placed on lockdown \"as a safety precaution\" due to the \"recovery of an occupied stolen vehicle in the vicinity.\"\nAn investigation is ongoing and \"is not connected to the polling location,\" Ruoff said.\nDue to the earlier lockdown, Jefferson County Clerk's Office spokesman Nore Ghibaudy said the Bowen Elementary School polling location will stay open 45 minutes longer, so voters have until 6:45 p.m. to cast their ballots.\nJefferson County Public Schools are not in session Tuesday due to Election Day."}, {"url": "https://www.courier-journal.com/story/entertainment/music/2019/11/03/chris-stapleton-all-american-road-show-tour-louisville-concert-review/4113111002/", "title": "Kentucky native Chris Stapleton is a soulful powerhouse at sold-out Louisville show", "authors": ["Kathryn Gregory", "Published A.M. Et Nov."], "date": "2019-11-03", "keywords": ["whiskey", "stapleton", "right", "hit", "soldout", "way", "songs", "country", "chris", "kentucky", "song", "crowd", "louisville", "powerhouse", "soulful", "native", "love"], "summary": "At least that's what Grammy Award-winning singer-songwriter Chris Stapleton told the sold-out crowd at the downtown Louisville arena as they belted out lyric after lyric along to some of his biggest hits.\nA Kentucky native, Stapleton wrapped up the All American Road Show Tour in his home state and did not disappoint.\nDuring his more than two-hour set, Stapleton played 20-plus songs, each a hit in its own way that had the crowd on their feet cheering.\nThe entire crowd — the whole stadium — was alive with song, singing the song back to Stapleton word for word.\nOpening acts Kendell Marvel and the Brothers Osborne set the stage for Stapleton with their outlaw country and rock music."}, {"url": "https://www.wave3.com/2019/10/11/report-president-trump-vice-president-pence-visit-kentucky-before-november-election/", "title": "Report: President Trump, Vice President Pence to visit Kentucky before November election", "authors": ["Makayla Ballman", "Published At Pm"], "date": "2019-10-11", "keywords": ["pence", "election", "report", "wrong", "vs", "president", "vice", "kentucky", "support", "andy", "theres", "tried", "families", "visit", "working", "work", "bevin", "trump"], "summary": "“This race is about right vs. wrong — and there’s nothing that will make Kentuckians forget how Matt Bevin’s attacked public education, tried to illegally cut pensions, and insulted teachers.\nUnder Bevin, too many families across Kentucky are making less every year, and Bevin is still refusing to support protections for people with pre-existing health conditions.\nWorking families are ready for a governor who will be in their corner and Andy Beshear has proven he’ll work with anyone to get the job done.\nThat’s why Andy is gaining support from across party lines, including the endorsement of a sitting Republican State Senator and the Fraternal Order of Police.”"}, {"url": "https://www.louisville.com/content/21-questions-matt-gibson-kentucky-derby-festival", "title": "21Qs with Kentucky Derby Festival CEO Matt Gibson", "authors": [], "date": "2019-12-03", "keywords": ["gibson", "derby", "times", "thing", "sharks", "21qs", "kentucky", "louisville", "try", "saving", "festival", "matt", "youve", "things", "putting", "work", "ceo"], "summary": "Matthew Gibson, 46, is the new president and CEO of the Kentucky Derby Festival.\nShe taught my brothers, sister, cousins and me the value of hard work.”Besides your current job, what’s the best job you’ve had?\nWe put on 70-plus KDF events, so I can work on any number of projects in a day.”Favorite possession?\n“I have no idea what I did before I had kids, but whatever it was, it wasn’t important.\nI try to never, ever say that things are bad — it could always get worse.”Favorite movie scene?"}, {"url": "https://www.bizjournals.com/louisville/news/2019/09/26/announcing-these-are-the-most-admired-ceos-in-the.html", "title": "", "authors": [], "date": "2019-09-26", "keywords": [], "summary": ""}, {"url": "https://www.lex18.com/media/v/content/ed4d5f2212b544b7a598bc203e50b668", "title": "Kentucky officials announce lane closures for bridge repairs", "authors": [], "date": "2019-11-04", "keywords": ["officials", "transportation", "closures", "interstate", "kentucky", "lanes", "louisville", "announce", "say", "repairs", "bridge", "statement", "nov", "work", "lane"], "summary": "LOUISVILLE, Ky. (AP) — Kentucky transportation officials say lane closures are planned on an Ohio River Bridge that connects Louisville to southern Indiana so that expansion joint repairs can be made.\nThe Kentucky Transportation Department says in a statement that lane closures on the Interstate 65 Kennedy Bridge will begin this week.\nThe statement says the right three lanes of Interstate 65 South will close at midnight on Nov. 8 and reopen at 5 a.m. on Nov. 27.\nOfficials say motorists should watch for work zone signs and slower traffic.\nThe work is being done to provide a smoother ride for vehicles traveling over the span."}, {"url": "https://www.courier-journal.com/story/life/shopping/2019/11/30/small-business-saturday-2019-louisville-shoppers-support-local-stores/4242572002/", "title": "The rain didn't keep Louisville shoppers from supporting Small Business Saturday", "authors": ["Billy Kobin", "Published P.M. Et Nov."], "date": "2019-11-30", "keywords": ["shoppers", "art", "west", "space", "business", "didnt", "local", "louisville", "creations", "paintings", "small", "neighborhood", "rain", "supporting"], "summary": "CLOSEThe rain may have been unrelenting, but that didn't keep Louisville shoppers from supporting local stores around the city during Small Business Saturday.\nSmall Business Saturday events were happening all over Louisville, including in the Russell neighborhood at Chef Space, 1812 W. Muhammad Ali Blvd.\n\"It's always meaningful for us as a small, local business,\" Frisz said.\n(Photo: Billy Kobin/Courier Journal)Perhaps ironically, a rather large business (American Express) started Small Business Saturday in 2010 as way to get more customers through doors of small businesses.\nAn average of 67 cents per every dollar spent at a small business stays in the local community, according to the Small Business Economic Impact Study from American Express."}, {"url": "https://wfpl.org/hey-kentucky-voters-heres-your-comprehensive-2019-primary-election-guide/", "title": "Hey Kentucky Voters! Here's Your Comprehensive 2019 Primary Guide", "authors": [], "date": "2019-05-16", "keywords": ["heres", "guide", "gov", "worked", "state", "voters", "republican", "primary", "kentucky", "2019", "county", "running", "general", "hes", "hey", "comprehensive"], "summary": "Only people registered as either Republicans or Democrats are eligible to cast a ballot; Independents can’t vote in Kentucky partisan primary elections.\nHe’s running as a progressive: he wants Kentucky to invest in renewable energy, decriminalize possession of small amounts of marijuana and he supports abortion rights.\nRelated Story Kentucky Primary 2019: Rocky Adkins Tries To Revive Rural DemocratsAndy Beshear is currently Kentucky’s Attorney General, and in that position has sued Gov.\nRelated Story Kentucky Primary 2019: William Woods Hopes For New Direction Of GOPMatt Bevin is running for a second term as Kentucky’s governor.\nRelated Story Kentucky Primary 2019: Matt Bevin Touts Record Despite UnpopularityCourtesy LRC Public InformationRobert Goforth is a pharmacist from East Bernstadt in eastern Kentucky, and a state Representative."}, {"url": "https://www.courier-journal.com/story/news/politics/2019/11/05/kentucky-election-results-2019-cameron-wins-attorney-general-race/4155926002/", "title": "Daniel Cameron wins Kentucky attorney general race in historic victory", "authors": ["Joe Sonka", "Published P.M. Et Nov."], "date": "2019-11-05", "keywords": ["victory", "daniel", "historic", "race", "win", "kentucky", "support", "attorney", "wins", "office", "republican", "cameron", "general"], "summary": "CLOSE Newly elected Kentucky attorney general, Daniel Cameron, spoke after his victory was announced and gave thanks and discussed the campaign and new role.\nLouisville Courier JournalRepublican Daniel Cameron was elected Kentucky's next attorney general Tuesday —the first African American to ever win a race for the office and the first Republican to do so in over 70 years.\nThe Republican will replace Democrat Andy Beshear as attorney general, who finished his race for governor with 5,000 more votes than incumbent Matt Bevin.\nBuy Photo Republican Daniel Cameron defeated Democrat Greg Stumbo for the office of Kentucky's attorney general on Tuesday night.\nBevin doesn't concedeOnce sworn into office, Cameron will become just the second African American to ever hold a statewide elected office in Kentucky."}, {"url": "https://www.courier-journal.com/story/news/politics/ky-governor/2019/11/26/kentucky-inauguration-2019-beshear-releases-schedule-swearing-in/4307878002/", "title": "Andy Beshear announces 2019 Inauguration Day schedule. Here's what you can participate in", "authors": ["Billy Kobin", "Published P.M. Et Nov."], "date": "2019-11-26", "keywords": ["heres", "inaugural", "public", "events", "capitol", "state", "day", "schedule", "beshear", "andy", "inauguration", "2019", "kentucky", "open", "announces", "grand", "participate"], "summary": "\"In the spirit of the inaugural theme, all inaugural events will be free and open to the public, including two inaugural balls on Capitol grounds,\" Britainy Beshear said.\n\"This is a special day for all of Kentucky, and we look forward to welcoming everyone to Frankfort for the celebration.\"\nImmediately following Swearing-in Ceremony, State Capitol Open HouseKentuckians are welcome to tour the “people’s house” and enjoy the decorations prior to the evening’s celebrations.\nBeshear invites Kentuckians to celebrate on Capitol grounds in two side-by-side inaugural balls adjacent to the Capitol.\nThe parties will be catered by Kentucky State Parks and will serve some of the commonwealth’s favorite foods."}, {"url": "https://www.rsl.com/post/2019/11/17/real-monarchs-win-usl-championship-title", "title": "Real Monarchs Win USL Championship Title", "authors": [], "date": "2019-11-17", "keywords": ["usl", "erik", "win", "city", "holt", "powder", "championship", "louisville", "real", "noah", "plewa", "title", "minute", "monarchs"], "summary": "LOUISVILLE, Kentucky (Sunday, November 17, 2019) – Real Monarchs SLC went on the road to secure a third-consecutive comeback win in the USL Championship Playoffs, topping the two-time defending champions, Louisville City FC, 3-1 to win the USL Championship title in front of a sold out crown of 7,025 at Lynn Stadium on the University of Louisville campus.\nLouisville held nearly 65% of the first-half possession and outshot the Monarchs 6-5, but the Monarchs finished the half with five unanswered shots from the 25th minute on.\nBoth teams had chances to add to the scoreboard over the final 24 minutes, but Ochoa came up big to keep the two-goal advantage as the Monarchs sealed victory and the USL Championship title.\n- The Monarchs win in the final ended Louisville City FC’s run of two-consecutive USL titles.\n- The Monarchs played with seven players on loan from Real Salt Lake – GK David Ochoa, GK Andrew Putna, DF Erik Holt, MF Justin Portillo, MF Luke Mulholland, FW Tate Schmitt and FW Luis Arriaga."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2019/11/22/kentucky-high-school-football-playoff-scores-friday-nov-22/4272106002/", "title": "Kentucky high school football playoff scores from Friday, Nov. 22", "authors": ["Associated Press", "Published P.M. Et Nov."], "date": "2019-11-22", "keywords": ["22", "unlimited", "access", "today", "high", "support", "kentucky", "playoff", "school", "local", "journalismsupport", "scores", "digital", "football", "nov", "subscriber"], "summary": "Support local journalismSupport stories like this one by becoming a subscriber today!\nGet unlimited digital access here!"}, {"url": "https://www.wave3.com/2019/11/29/irish-dance-teachers-association-mid-america-holds-regionals-louisville/", "title": "Irish Dance Teachers Association of Mid-America holds regionals in Louisville", "authors": ["Makayla Ballman", "Published At Pm"], "date": "2019-11-29", "keywords": ["regionals", "report", "permanently", "pandemic", "months", "association", "million", "teachers", "close", "louisville", "claims", "irish", "cnbc", "small", "dance", "holds", "midamerica", "continues"], "summary": "A new report by CNBC claims 7.5 million small businesses will have to close permanently if the pandemic continues through the next few months."}, {"url": "https://www.courier-journal.com/story/life/shopping/2019/11/29/black-friday-2019-louisville-kentucky/4241842002/", "title": "Louisville shoppers rise early for Black Friday, but Thanksgiving steals some crowds", "authors": ["Billy Kobin", "Published A.M. Et Nov."], "date": "2019-11-29", "keywords": ["thanksgiving", "shoppers", "stores", "best", "early", "oxmoor", "rise", "kobin", "louisville", "store", "buy", "29", "black", "crowds", "billy", "steals"], "summary": "\"I guess Thanksgiving is the time to shop now,\" an employee at the Best Buy store across Shelbyville Road from Mall St. Matthews said Friday morning.\nNicole Liberto was among the dedicated group waiting outside Best Buy, with many shoppers bundled up with jackets and blankets to fight the early morning chill.\nLooking at a Best Buy ad that highlighted the various deals, Liberto quipped, \"I've got to plan my attack.\"\npic.twitter.com/SLGwRGk794 — Billy Kobin (@Billy_Kobin) November 29, 2019Honestly, watching the employee set up the Apple store before it opens is pretty captivating.\npic.twitter.com/IWJhiRxkVC — Billy Kobin (@Billy_Kobin) November 29, 2019Read or Share this story: https://www.courier-journal.com/story/life/shopping/2019/11/29/black-friday-2019-louisville-kentucky/4241842002/"}, {"url": "https://www.courier-journal.com/story/news/politics/elections/kentucky/2019/11/07/kentucky-governors-race-county-maps-show-how-beshear-beat-bevin/2506489001/", "title": "Why did Kentucky Governor Matt Bevin lose to Andy Beshear? These 6 maps tell the story", "authors": ["Mike Trautmann", "Olivia Krauth", "Published A.M. Et Nov."], "date": "2019-11-07", "keywords": ["election", "maps", "courier", "red", "counties", "governor", "beshear", "kentucky", "andy", "governors", "matt", "lose", "general", "bevin", "tell", "trump"], "summary": "Here are six maps that illustrate how Beshear turned just enough red counties to blue to swing the outcome in his favor.\nAlso: Kentucky's governor election had the state's highest voter turnout since 1995Buy Photo County-by-county results for the 2015 Kentucky governors race.\nBuy Photo Jefferson County precinct results for the 2019 Kentucky governor's race.\nBeshear also was able to flip several key counties, including two traditionally red Northern Kentucky counties — Kenton and Campbell.\nBuy Photo Northern Kentucky counties flipped for Andy Beshear in the 2019 governor's race."}, {"url": "https://www.courier-journal.com/story/life/shopping/2019/11/26/shop-local-louisville-deals-small-business-saturday-cyber-monday/4256286002/", "title": "Shop local Louisville deals: Small Business Saturday, Museum Store Sunday and Cyber Monday", "authors": ["Published P.M. Et Nov."], "date": "2019-11-26", "keywords": ["shop", "business", "local", "store", "louisville", "deals", "cyber", "museum", "gift", "small", "holiday", "shopping"], "summary": "Small Business Saturday, Nov. 30, Museum Store Sunday, Dec. 1. and Cyber Monday on Dec. 2 can mean gifts not just for local shoppers but for local store owners, too.\nWhile plenty of local shops offer discounted pricing, traditionally Small Business Saturday is sprinkled with local store owners offering additional incentives to shop local, like refreshments while you shop, a free gift with your purchase and even giveaways.\nThe Louisville Independent Business Alliance has two special events on Small Business Saturday aimed at promoting local shopping during the holidays.\nLIBA's Small Business Saturday South Louisville Celebration takes place at Colonel Gardens, 818 W. Kenwood Dr., from 4-6 p.m. LIBA's Small Business Saturday West Louisville Celebration takes place at 1812 W. Muhammad Ali Blvd.\nCustomers will also earn $5 in Eyedia bucks for every $50 you spend in the shop on Small Business Saturday."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/10/25/trick-treating-louisville-2019-halloween-hours-neighborhoods/4081840002/", "title": "Halloween 2019 trick-or-treat hours in Louisville and Southern Indiana", "authors": ["Emma Austin", "Published A.M. Et Oct."], "date": "2019-10-25", "keywords": ["trickortreat", "halloween", "free", "costume", "southern", "oct", "68", "2019", "louisville", "zoo", "trickortreating", "31", "candy", "indiana", "hours"], "summary": "Here's a list of Louisville neighborhoods' trick-or-treat dates and hours, when applicable, for Halloween and other area events this week to get you in the spirit of the holiday.\nWhere: Louisville Zoo, 1100 Trevilian WayWhen: Thursday-Sunday.\nWhere: Louisville Free Public Library, Western Branch, 604 S. 10th St.\n: The best neighborhoods for Halloween trick-or-treating in LouisvilleTrick or Treat at NortheastSpooktacular Halloween evening full of treats, fun, and maybe a few tricks.\nWhere: Louisville Free Public Library, Northeast Branch, 15 Bellevoir CircleWhen: 6-8 p.m. Wednesday, Oct. 30Track or TreatWhere: Iroquois High School, 4615 Taylor Blvd."}, {"url": "https://www.wave3.com/2019/12/13/arrest-made-november-shooting-that-injured-wyandotte-neighborhood/", "title": "Arrest made in November shooting that injured 1 in Wyandotte neighborhood", "authors": ["Makayla Ballman", "Published At Pm"], "date": "2019-12-13", "keywords": ["verbal", "shooting", "report", "wyandotte", "restaurant", "injured", "greenwells", "told", "mother", "kill", "mothers", "victim", "neighborhood", "greenwell", "arrest"], "summary": "According to the arrest report, the victim and Greenwell’s mother got into a verbal argument at a restaurant.\nOnce Greenwell arrived at the restaurant, Greenwell’s mother’s boyfriend told him “you got to finish him off.\nYou have to kill him.\""}, {"url": "https://www.wave3.com/2019/11/19/americas-got-talent-holding-auditions-louisville-tuesday/", "title": "‘America’s Got Talent’ holding auditions in Louisville Tuesday", "authors": ["Sarah Jackson", "Published At Pm"], "date": "2019-11-19", "keywords": ["unique", "welcome", "auditions", "thats", "holding", "truly", "louisville", "talent", "vast", "undeniable", "unbelievable", "agt", "uncovered", "americas"], "summary": "“I continue to be amazed each and every season at the enormous amount of unbelievable and truly unique talent that’s uncovered on the AGT stage,” AGT executive producer Sam Donnelly said.\n“AGT is the nation’s preeminent source for discovering talent.\nThe show has changed an insurmountable number of lives and has built flourishing careers for artists across a vast array of talents.\nWe welcome anyone out there with an undeniable ability to entertain to audition for the show.”"}, {"url": "https://www.wcpo.com/news/coronavirus/live-beshear-giving-update-on-covid-19-in-kentucky", "title": "Kentucky still 20,000 behind in unemployment payments under COVID-19", "authors": [], "date": "2020-04-09", "keywords": ["20000", "virus", "unemployment", "symptoms", "beshear", "kentucky", "coronavirus", "health", "deaths", "payments", "covid19", "workers", "cdc", "cases"], "summary": "In other announcements:Watch the briefing in the player below:Beshear reported six new confirmed COVID-19 deaths (none in Northern Kentucky) and 134 new cases (two in Kenton County).\nBeshear also issued an executive order expanding temporary total disability payments to more front-line workers in the COVID-19 crisis.\nFind more coronavirus/COVID-19 hotlines and resources below:OhioDepartment of Health COVID-19 hotline: 833-4-ASK-ODHSee ODH’s COVID-19 resources here .\nWhat is coronavirus, COVID-19?\nConfirmed cases of COVID-19 have ranged from mild symptoms to severe illness and death, according to the CDC."}, {"url": "https://www.wcpo.com/news/coronavirus/cincinnati-airport-gets-43m-in-federal-aid-but-allegiant-leaves-flyers-in-lurch", "title": "Cincinnati airport gets $43M in federal aid but Allegiant leaves flyers in lurch", "authors": [], "date": "2020-04-15", "keywords": ["symptoms", "airport", "lurch", "airlines", "million", "covid19", "flyers", "43m", "cvg", "cincinnati", "allegiant", "coronavirus", "leaves", "aid", "federal", "service", "cdc", "gets"], "summary": "Contacted by WCPO 9, neither Allegiant nor CVG would release which flights or how many Allegiant is cutting here.\nAllegiant and other discount airlines revived passenger service at CVG after Delta pulled its hub.\nThe announcements by McConnell and Allegiant came on the same day that the federal government agreed to $25 billion in aid for the airline industry.\nWhat is coronavirus, COVID-19?\nThe CDC said symptoms could appear in as few as two days or as long as 14 days after exposure."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/03/24/kentucky-indiana-high-school-basketball-2019-20-highlights-awards/2875661001/", "title": "The best of the preps: What stood out to us from this high school basketball season", "authors": ["David J. Kim", "Jason Frakes", "Dominique Yates", "Published A.M. Et March"], "date": "2020-03-24", "keywords": ["best", "state", "sacred", "stood", "male", "high", "region", "school", "game", "preps", "basketball", "tournament", "season", "heart"], "summary": "CLOSE The high school basketball season was cut short, but there were still plenty of great moments from this year.\nNonetheless, the 2019-2020 basketball season was yet another thriller, and Courier Journal reporters Jason Frakes, Dominique Yates and David J. Kim have picked the best of the shortened season.\nCLOSE The high school basketball season was cut short, but there were still plenty of great moments from this year.\nThe Seventh Region championship game was, rightfully, very hyped after the two teams split their two regular season game contests.\nBiggest upsetFrakes: It came in the final high school basketball game of the season."}, {"url": "http://www.bipps.org/more-on-question-stifling-with-the-reconstituted-ky-board-of-education/", "title": "More on question-stifling with the reconstituted KY Board of Education", "authors": [], "date": "2020-04-15", "keywords": ["chair", "reconstituted", "questionstifling", "presentation", "meeting", "questions", "board", "jcps", "school", "education", "ky", "old", "pollio", "members"], "summary": "But, Karem wouldn’t allow it, and none of his board members protested being muzzled, either.\nWhen I wrote the first blog, my impression was that the old board would not have operated this way.\nSo, how did things run under the old board?\nThe first question came from old board member Milton Seymore at about 52 minutes into the meeting.\nIt was an astonishing admission of serious bias that has existed in JCPS school assignments for a long time."}, {"url": "https://www.whas11.com/article/news/crime/man-arrested-for-deadly-shooting-in-december-2019/417-7d183db3-c6ec-413b-9131-02274daaf9ba", "title": "Man arrested for deadly shooting in December 2019", "authors": ["Author", "Jackelyn Jorgensen", "Published", "Pm Est February", "Updated"], "date": "2020-02-13", "keywords": ["shooting", "shot", "whas11commake", "twitter", "deadly", "2019", "arrested", "louisville", "whas11", "visit", "woman", "usershave", "man", "uptodate"], "summary": "LOUISVILLE, Ky. — Louisville Metro Police made an arrested in a deadly shooting which happened in December 2019.\nOn February 12, police arrested Jaylin Bell, 24, in the death of Kayla Hunter-Purcell, 21.\nHunter-Purcell was shot on December 6, 2019 in the 100 block of East Caldwell St. She was transported to the hospital where she was pronounced dead.\nPREVIOUS | Coroner identifies woman fatally shot in Old LouisvilleMore from WHAS11.com:►Make it easy to keep up-to-date with more stories like this.\nEmail assign@whas11.com, visit our Facebook page or Twitter feed."}, {"url": "https://www.denverpost.com/2020/04/12/broncos-insider-von-miller-dj/", "title": "Broncos Insider: Von Miller using offseason down time to work on his DJing", "authors": ["Kyle Newman", "Joe Nguyen", "Kyle Newman Is A Sportswriter For The Denver Post", "A Position He S Held Since He Is A Beat Reporter Covering The Colorado Rockies", "Denver Broncos In Addition To Covering Other Professional", "College", "High School Athletics Around The State. He Is A Member Of The Bbwaa", "Online Sports Producer", "Main Daytime Sports Producer For The Denver Post. Previously He Was The Online Prep Sports Editor. Prior To That", "He Covered Adams County"], "date": "2020-04-12", "keywords": ["using", "denver", "miller", "read", "super", "insider", "djing", "broncos", "board", "nfl", "von", "draft", "offseason", "work", "tackle"], "summary": "Self-described “unicorn.”And here’s one more persona of the Broncos’ star you may not have heard about: Von Miller, disc jockey.\n+ Broncos Draft Board: Analysts see “endless” upside for USC tackle Austin Jackson, who spent last offseason donating bone marrow.\n+ Broncos Draft Board: Henry Ruggs III could be best match of need and fit with 15th pick.\n+ Broncos Draft Board: Baylor wideout Denzel Mims’ speed, contested catch ability projects as a first-round pick.\n+ Broncos’ Von Miller calls All-Decade team honor “incredible.”+ Kiszla vs. O’Halloran: Will 9-7 record qualify the Broncos for an expanded NFL playoff field?"}, {"url": "https://kiss951.com/2020/04/14/kenya-moore-reveals-her-husband-had-a-change-of-heart/", "title": "Kenya Moore Reveals Her Husband Had a Change of Heart", "authors": ["Glennisha Morgan"], "date": "2020-04-14", "keywords": ["relationship", "change", "husband", "asked", "daly", "marc", "reveals", "moore", "yes", "cohen", "kenya", "work", "heart", "wants"], "summary": "Kenya Moore recently appeared on an episode of Watch What Happens Live with Andy Cohen alongside her Real Housewives of Atlanta co-star Eva Marcille, and during the segment, she revealed that her previously estranged husband, Marc Daly had a “change of heart.”Andy Cohen asked Kenya Moore if she and Marc Daly were currently quarantined together.\n“Do you still have Marc’s clothes in the closet?” Cohen asked.\nHe wants to be a better person.” Cohen then asked Kenya Moore if she also wants to be better.\nCohen had also asked Moore if she still hadn’t met Marc Daly’s parents.\nAre Kenya Moore & Marc Daly Quarantining Together?"}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/29/louisville-shows-this-week-december-2019-the-bands-visit/4253651002/", "title": "Louisville shows this week: 'The Band's Visit,' Josh Abbott, Handel's 'Messiah' & more", "authors": ["Gege Reed", "Published A.M. Et Nov."], "date": "2019-11-29", "keywords": ["shows", "bands", "s", "730", "w", "start", "week", "christmas", "tickets", "louisville", "dec", "visit", "handels", "messiah", "josh", "st", "5025847777", "abbott"], "summary": "CLOSEHere are all the shows and concerts taking place in Louisville Dec. 1-8:SUNDAY, DEC. 1Straight No Chaser (Photo: Courtesy of By Jimmy Fontaine)Straight No Chaser: The Open Bar Tour.\n7 p.m., Whitney Hall, Kentucky Center, 501 W. Main St. Tickets start at $24.50.\nChamber Winds Louisville& Louisville Winds.\n8 p.m., Bomhard Theater, Kentucky Center for the Arts, 501 W. Main St. Tickets start at $25.\n“Nutcracker in a Nutshell.” Presented by Magic Inc. 2 p.m., Louisville Palace, 625 S. Fourth St. Tickets start at $20."}, {"url": "https://www.courier-journal.com/story/sports/college/kentucky/2019/12/28/kentucky-louisville-basketball-cats-win-second-ot-game-series/4409427002/", "title": "Nick Richards steps up to lead Kentucky basketball to overtime win over Louisville", "authors": ["Jon Hale", "Published P.M. Et Dec."], "date": "2019-12-28", "keywords": ["stretch", "really", "nick", "win", "overtime", "kentucky", "richards", "game", "louisville", "basketball", "foul", "lead", "points", "nwora", "steps"], "summary": "Louisville Courier JournalLEXINGTON – The split second between hitting the floor and the official's call might have been the most nerve-wracking moment of the day for Nick Richards in Kentucky's 78-70 overtime win over rival Louisville.\nShould the official rule the play a blocking foul instead of a charge, Richards would have fouled out of the game.\nInstead, Richards stayed in the game, eventually scoring seven consecutive points after Louisville had taken a lead in overtime to finish the victory with 13 points, 10 rebounds and 11 fouls drawn.\nLouisville jumped out to an early 6-2 lead but did not score for the next six minutes as Kentucky clawed ahead with seven straight points.\nAlso: Dueling recruiting strategies on display as Kentucky-Louisville rivalry hits next stageWithout Richards' performance down the stretch, Kentucky might not have been able to make Louisville pay for those misses."}, {"url": "https://www.courier-journal.com/story/news/local/2019/11/13/community-service-louisville-kentucky-ways-volunteer/4176672002/", "title": "How and where to volunteer in Louisville during the holiday season", "authors": ["Emma Austin", "Published P.M. Et Nov."], "date": "2019-11-13", "keywords": ["experts", "volunteer", "help", "louisville", "holiday", "needs", "food", "need", "season", "needed", "st", "volunteers"], "summary": "From delivering meals to spending time with a senior, Louisville nonprofits need volunteers during the holiday season and beyond to help with day-to-day operations.\nVolunteers need a valid driver's license and a vehicle, or they can borrow a vehicle from Kentucky Harvest.\nVolunteers need to bring an ID to Hotel Louisville at 120 W. Broadway anytime after 4:30 a.m. on Christmas.\nAssistant Executive Director Marla Wilson said the center needs volunteers who can help with landscaping and wiring electricity in the greenhouse.\nThe Salvation ArmyVolunteer with The Salvation Army as a Bell Ringer at one of its 90 locations in the Louisville area."}, {"url": "https://www.wave3.com/2019/12/31/louisville-woman-arrested-connection-shooting-russell-neighborhood/", "title": "Louisville woman arrested in connection to shooting in Russell neighborhood", "authors": ["Dustin Vogt", "Published At Pm"], "date": "2019-12-31", "keywords": ["transported", "suffering", "wounds", "non", "shooting", "russell", "university", "street", "male", "arrested", "louisville", "connection", "woman", "officers", "victim", "neighborhood", "lifethreatening"], "summary": "According to an arrest citation, officers were flagged down by a victim at around 1:56 p.m. on the intersection of 22nd Street and Broadway.\nOne male was suffering from gunshot wounds to both ankles.\nHe was transported to University Hospital with non life-threatening injuries."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/22/christmas-things-to-do-louisville-2019-lights-shopping-sales-kid-friendly-events/4215275002/", "title": "Sales, events for kids and pretty lights! 9 must-do holiday things in Louisville", "authors": ["Gege Reed", "Published A.M. Et Nov."], "date": "2019-11-22", "keywords": ["events", "pretty", "lights", "christmas", "mustdo", "louisville", "holiday", "dec", "winter", "23", "sales", "house", "things", "information", "nov", "kids", "11"], "summary": "MORE INFORMATION:Christmas Express: 30-minute day time tour through the light show, then on to Winter Wonderland, Nov. 16 through Dec. 23.\n30-minute day time tour through the light show, then on to Winter Wonderland, Nov. 16 through Dec. 23.\nBreakfast with Santa: breakfast, then on to the Christmas Express, followed by a magical journey to the Winter Wonderland, Nov. 23 through Dec. 23.\nChristmas events for families in LouisvilleFête De Noël (Festival of Christmas): Winter Holiday Festival and Ice SkatingBuy Photo The ice skating rink is one of the draws at “Holiday Square\" in downtown Louisville.\n(Photo: By Frankie Steele/Special to CJ)WHAT: Features the Holiday Laser Dome, holiday movie nights, Stoneware & Company ornament decorating, and much more."}, {"url": "https://www.louisville.com/content/howell-dawdy-reviews-2019", "title": "Howell Dawdy Reviews 2019", "authors": [], "date": "2019-12-19", "keywords": ["right", "dawdy", "yeargotta", "smell", "big", "2019", "louisville", "think", "finally", "howell", "great", "reviews", "traffic"], "summary": "Musician Howell Dawdy facetiously reviews 2019.\nI think the traffic situation is finally sorted out.\n“This one’s easy: 2019 in Louisville would have to be the pleasant shade of cafeteria-butter-pad yellow we just painted the Clark Memorial Bridge.”If 2019 had a smell, what would it smell like?\n“Stuber.”This originally appeared in the December 2019 issue of Louisville Magazine under the headline “Old Acquaintance Be Forgot.” To subscribe to Louisville Magazine, click here.\nIllustration by Shae Goodlett, shaedraws.comCover photo: Howell Dawdy // Facebook"}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/12/10/christmas-2019-where-see-santa-claus-louisville/2618598001/", "title": "Santa Claus is coming to town: 19+ places to see St. Nick in the Louisville area", "authors": ["Caleb Wiegandt", "Published A.M. Et Dec."], "date": "2019-12-10", "keywords": ["free", "area", "nick", "town", "christmas", "meet", "louisville", "dec", "holiday", "19", "santa", "claus", "pmcost", "coming", "information", "st", "places", "14"], "summary": "Below, in date order, are more than a dozen places to meet Santa Claus and his entourage this holiday season around Louisville.\nWHERE: St. Paul’s Episcopal Church, 4700 Lowe RoadWHEN: Dec. 14, 9-11:30 a.m.\nWHERE: All Feeders Supply storesWHEN: Dec. 14 and 15 from 11 a.m. to 3 p.m.\nWHERE: Louisville Zoo, 1100 Trevilian WayWHEN: Dec. 14 and 15, 10 a.m., noon and 2 p.m.\nMORE INFORMATION: shopjefferson-mall.comChristmas beers: Try these seasonal craft brews on tap around LouisvillePhotos with Santa, Oxmoor CenterWHAT: Photos with Santa, meet and greetWHERE: Oxmoor Center."}, {"url": "https://www.wave3.com/2019/12/23/several-rounds-fired-into-kayrouz-caf-st-matthews-restaurant-closed/", "title": "Several rounds fired into Kayrouz Café in St. Matthews, restaurant closed", "authors": ["Sarah Jackson", "Nick Picht", "Published At Pm"], "date": "2019-12-23", "keywords": ["shows", "officials", "closed", "report", "worked", "kayrouz", "restaurant", "shots", "matthews", "fired", "café", "trying", "say", "knebel", "st", "rounds", "arrest"], "summary": "Louisville Metro Police officials say Bradley Knebel, 35, fired nine shots into the restaurant around 2:00 a.m. Saturday.\nAccording to the arrest report, one of the shots almost hit an employee trying to clean the restaurant.\nThe arrest report also shows Knebel had an ex-girlfriend who worked at Kayrouz."}, {"url": "https://www.wave3.com/2019/12/04/winter-woods-spectacular-iroquois-park-promises-magical-drive-through-experience/", "title": "Winter Woods Spectacular at Iroquois Park promises a magical, drive-through experience", "authors": ["Phylicia Ashley", "Published April", "At Pm"], "date": "2019-12-04", "keywords": ["woods", "representatives", "iroquois", "trees", "promise", "magical", "experience", "spectacular", "promises", "drivethrough", "winter", "trail", "stained", "path", "park", "walking"], "summary": "Iroquois Park representatives promise the path brings the same magical experience as the park’s Jack O Lantern Spectacular.\nThere are 500 live cut trees and 150 stained glass panels on display on the trail.\nHowever, rather than walking through the woods, guests drive through the experience."}, {"url": "https://www.denverpost.com/2019/12/15/kylee-shook-louisville-kentucky-womens-basketball/", "title": "Kylee Shook leads No. 7 Louisville women’s basketball over No. 14 Kentucky", "authors": ["Gary B. Graves"], "date": "2019-12-15", "keywords": ["shook", "kylee", "fourth", "shooting", "second", "wildcats", "rebounds", "leads", "kentucky", "cardinals", "louisville", "basketball", "womens", "final", "points", "14"], "summary": "Shook scored five consecutive points to put Louisville ahead, and the Cardinals withstood a late charge by 14 Kentucky for a hard-fought 67-66 victory on Sunday at Rupp Arena.\nShook answered that and a second jumper by Howard with a mid-range shot and a 3 for a three-point edge.\nTo go 4-0 against our rival is great,” said Shook, who went 3 of 5 from behind the arc after entering shooting 3 of 14 overall.\nKentucky may not make a big drop in the poll but missed a chance to move closer to the top 10.\nBIG PICTURELouisville: The Cardinals could have faded in the third but steadily fought back to lead and then limit Kentucky in the fourth."}, {"url": "https://www.courier-journal.com/story/news/local/2020/01/09/louisville-and-kentucky-20-people-watch-2020/2636854001/", "title": "Who are the most influential people in Kentucky? Here are 20 to watch in 2020", "authors": ["The Courier Journal", "Published P.M. Et Jan."], "date": "2020-01-09", "keywords": ["important", "watch", "influential", "2020", "president", "senate", "kentucky", "louisville", "say", "20", "im", "watching", "work"], "summary": "Why 2020 is important: Kentucky has the highest rate of child abuse and neglect in the nation.\nWhy 2020 is important: 2020 may be the first year that over 100 scholars graduate with a degree in a single year, Dykstra says.\nWhy 2020 is important: With Gibson at the helm, 2020 will be a new era for the Kentucky Derby Festival.\nWhy 2020 is important: In 2020, MacGregor plans to launch her own website, laramacgregor.com, to share her personal journey of living life over cancer.\nWhy 2020 is important: The 2020 legislative session began Tuesday, and the top item of which will be the passage of the state’s two-year operating budget."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.courier-journal.com/story/weather/local/2019/12/26/louisville-weather-breaks-126-year-record-high-during-christmas/2748334001/", "title": "A Christmas miracle! Louisville breaks 126-year record high during the holiday", "authors": ["Ben Tobin", "Published A.M. Et Dec."], "date": "2019-12-26", "keywords": ["126year", "breaks", "cold", "high", "paoli", "christmas", "operations", "louisville", "holiday", "set", "weather", "peaks", "air", "miracle", "record"], "summary": "CLOSE Louisville weather sets a Christmas Day record for warmth.\nWochitIn a true Christmas miracle, Louisville's weather set a record for having the hottest Dec. 25 on date.\nAt 2:11 p.m. on Wednesday, the Derby City had a record high of 69 degrees — breaking the previous record of 68 degrees from 1893.\nAt 2:11 PM, a new record high of 69° was set at Louisville 🌡️😎 This beats the previous record of 68° set in 1893.\npic.twitter.com/WuHSDtqIAq — Paoli Peaks (@paoli_peaks) December 25, 2019Good news may be on the way for Paoli Peaks."}, {"url": "https://www.wave3.com/2019/12/02/man-murdered-outside-louisville-business-near-thanksgiving-just-like-his-sister-years-earlier/", "title": "Man murdered outside Louisville business near Thanksgiving just like his sister years earlier", "authors": ["Connie Leonard", "Published At Pm"], "date": "2019-12-02", "keywords": ["thanksgiving", "having", "near", "tried", "tell", "turned", "thats", "business", "outside", "thinking", "way", "saw", "murdered", "earlier", "man", "help", "seizure", "louisville", "sister"], "summary": "He continued, “We were thinking he was having a seizure, we tried to help him in any way we can and I tell everyone call 911, then we turned him over and that’s when we saw blood coming out his back.”"}, {"url": "https://kycir.org/2019/12/13/louisville-mayor-greg-fischer-confident-in-lmpd-rape-investigations/", "title": "Louisville Mayor Greg Fischer ‘Confident’ In LMPD Rape Investigations - Kentucky Center for Investigative Reporting", "authors": ["Eleanor Klibanoff", "More Eleanor"], "date": "2019-12-13", "keywords": ["lmpd", "fischer", "reporting", "investigation", "kentucky", "investigations", "rape", "louisville", "mayor", "greg", "victims", "case", "officers", "prosecutors", "arrest", "investigative", "cases"], "summary": "Several state and local elected officials raised concerns about Louisville’s handling of rape cases in the wake of an investigation published by the Kentucky Center for Investigative Reporting last week.\nBut Mayor Greg Fischer said he is confident that the Louisville Metro Police Department “places a priority on getting justice” for rape victims.\nProsecutors declined more than 40 percent of all rape cases, which police then cleared by exception.\nIn 2017, LMPD cleared nearly half of all rape cases by exception, mostly because the prosecutor declined to take the case.\n“That’s just a no-brainer.”Six LMPD officers responded to Sainato’s hotel room after she reported she’d been raped."}, {"url": "https://www.wave3.com/2019/12/11/man-accused-shooting-victim-leg/", "title": "Man accused of shooting victim in leg", "authors": ["Sarah Jackson", "Published At Pm"], "date": "2019-12-11", "keywords": ["took", "suspect", "shooting", "slip", "shot", "patkovic", "shots", "vehicle", "went", "told", "accused", "victim", "man", "leg"], "summary": "The suspect was identified as Jasmin Patkovic, 19.\nPolice went to Patkovic’s home and took him into custody.\nAccording to an arrest slip, Patkovic told police he fired multiple shots at the vehicle the victim and his brother were in, then left came back and shot at the vehicle again, this time hitting the victim."}, {"url": "https://wfpl.org/homicides-and-shootings-are-up-in-louisville-but-officials-say-coordinated-efforts-are-working/", "title": "Homicides Are Up In Louisville, But Officials Say Efforts Are Working", "authors": ["Lisa Gillespie"], "date": "2019-12-20", "keywords": ["officials", "indictments", "enforcement", "mental", "homicides", "health", "efforts", "louisville", "coleman", "say", "working", "shootings", "federal", "law", "firearms"], "summary": "Law enforcement officials say there were more homicides and more shootings in 2019 compared to 2018 in Louisville.\nBut U.S. Attorney for the Western District of Kentucky Russell Coleman said there would have been more homicides if federal law enforcement, hadn’t been involved.\nAttorneys and federal law enforcement to coordinate better with local law enforcement to reduce gun violence and enforce federal firearms laws across the country.\nColeman said this is an improvement and the result of more coordination between federal and local law enforcement.\n“No one up here would argue that we’re going to arrest our way out of 93 homicides, and almost 300 shootings,” Coleman said."}, {"url": "https://www.wave3.com/2019/11/23/rare-picasso-artwork-arrives-louisville/", "title": "Rare Picasso artwork arrives in Louisville", "authors": ["Maira Ansari", "Published At Pm", "Published Am At Am"], "date": "2019-11-23", "keywords": ["works", "running", "pablo", "musée", "paper", "louisville", "artwork", "picasso", "arrives", "outside", "seen", "rare", "antibes"], "summary": "‘Picasso: From Antibes to Louisville’​, running from December 14, 2019 through March 22, 2020, will bring together approximately 50 ceramics and works on paper created by Pablo Picasso between 1931 and 1956.\nThese works are part of the collection of the Musée Picasso in Antibes, France.\nThe exhibition is one that has never before been seen outside of Europe."}, {"url": "https://www.whas11.com/article/news/local/lmpd-88-homicides-so-far-in-2019/417-0e18b888-b2c5-4238-bd7e-ab051b3006c6", "title": "LMPD: 88 homicides so far in 2019", "authors": ["Author", "Conner Farrell", "Whas", "Megan Short", "Published", "Pm Est December", "Updated"], "date": "2019-12-03", "keywords": ["far", "lmpd", "homicides", "2019", "younger", "louisville", "whas11", "visit", "victims", "usershave", "88", "whats", "cases"], "summary": "LOUISVILLE, Ky. — New numbers from Louisville Metro Police are shedding light on what's been a deadly year in the city.\nThe department says they've investigated 88 homicides so far in 2019.\nThis time last year, there were 71 homicides total.\nOf those 88 investigations, 45 are still considered open.\nThere's also several cases involving younger people, 15 of the victims were 18 years old or younger and in four of the cases, juveniles were charged."}, {"url": "https://www.courier-journal.com/story/entertainment/events/things-to-do/2019/11/14/lights-under-louisville-2019-dates-prices-tickets/4180526002/", "title": "Christmas is almost here! Here's your ultimate holiday guide to Lights Under Louisville", "authors": ["Kathryn Gregory", "Published A.M. Et Nov."], "date": "2019-11-14", "keywords": ["heres", "guide", "lights", "christmas", "ultimate", "vehicle", "passes", "louisville", "holiday", "standard", "need", "pass", "nov", "ticket"], "summary": "Each year the Louisville Mega Cavern,1841 Taylor Ave., is transformed into the Lights Under Louisville holiday light spectacular for the holiday season that features more than 3 million lights.\nHere's everything you need to know about the 2019 Lights Under Louisville:What is Lights Under Louisville?\nLights Under Louisville is an underground Christmas light show in Louisville.\nLights Under Louisville is held at the Louisville Mega Cavern, 1841 Taylor Ave., off Poplar Level Road in Louisville.\nFrom Scrooge to a disgruntled elf: Christmas has arrived at Actors TheatreWhen is Lights Under Louisville?"}, {"url": "https://kycir.org/2019/12/05/prosecution-declined/", "title": "Prosecution Declined - Kentucky Center for Investigative Reporting", "authors": [], "date": "2019-12-05", "keywords": ["lmpd", "reporting", "declined", "prosecution", "kentucky", "center", "prosecutor", "rape", "told", "louisville", "lynch", "sainato", "case", "victim", "investigative", "cases"], "summary": "LMPD closes nearly half of all rape cases by exception and arrests fewer suspects than the national average.\nIn 2017, more than 40 percent of all LMPD rape cases were cleared by exception because a prosecutor declined to take the case.\nLexington police’s arrest rate in rape cases is comparable to Louisville’s: both are below the national average.\nPolice bring some cases, including rape cases, to his office to screen before an arrest is made.\nThe rape cases Gray’s office chooses to prosecute tend to meet certain stereotypes of sexual assault."}, {"url": "https://www.wave3.com/2019/12/08/louisville-family-named-special-olympics-kentucky-family-year/", "title": "Louisville family named 2019 Special Olympics Kentucky Family of the Year", "authors": ["Dustin Vogt", "Published At Pm", "Published Am At Am"], "date": "2019-12-08", "keywords": ["ups", "summer", "plunge", "numerous", "state", "special", "named", "kentucky", "wife", "2019", "louisville", "volunteered", "pull", "polar", "plane", "olympics", "family"], "summary": "Along with his wife Ginny and their two kids, 12-year-old Braden and 10-year-old Braxton, have volunteered at numerous events including the Polar Plunge, UPS Plane Pull, and the State Summer Games among others."}, {"url": "https://www.courier-journal.com/story/sports/college/louisville/2019/09/10/louisville-kentucky-basketball-game-2019-tipoff-time-set-rivalry/2277607001/", "title": "Ready for rivalry weekend already? Tipoff time is set for Louisville vs. Kentucky", "authors": ["Danielle Lerner", "Published P.M. Et Sept."], "date": "2019-09-10", "keywords": ["rivalry", "louisvillekentucky", "rupp", "conference", "vs", "tipoff", "kentucky", "game", "usual", "set", "ready", "louisville", "basketball", "scores", "southeastern", "weekend", "scheduled", "team"], "summary": "CLOSEFans attending this year’s Louisville-Kentucky rivalry basketball game in Lexington will be able to make dinner reservations afterward.\nTipoff at Rupp Arena is scheduled for 3:45 p.m. Saturday, Dec. 28, Louisville announced Tuesday.\nAs per usual, the Cards-Cats matchup is the last nonconference game for each team before conference play begins.\nDates for 2019-20 Atlantic Coast Conference and Southeastern Conference games have yet to be released.\nCheck it out: See the scores of every Louisville-Kentucky basketball game in history"}, {"url": "https://www.courier-journal.com/story/weather/local/winter/2019/11/12/louisville-weather-cold-temperature-tuesday-night-might-break-record/2573098001/", "title": "Louisville's low temperature Tuesday night will flirt with decades-old record", "authors": ["Sarah Ladd", "Ben Tobin", "Published A.M. Et Nov."], "date": "2019-11-12", "keywords": ["degrees", "sunny", "temperature", "cold", "snow", "night", "louisville", "louisvilles", "flirt", "weather", "low", "jarvis", "decadesold", "record"], "summary": "Courier JournalIn case you missed it: Snow flakes fell Monday night, and it was brutally cold Tuesday.\nThe low temperature for Tuesday night at Louisville Muhammad Ali International Airport is forecast to be 18 degrees, according to Louisville National Weather Service meteorologist Mark Jarvis.\nThat will approach a 33-year-old record — the lowest temperature on Nov. 12 ever was 16 degrees in 1986.\nThe cold will persist into Wednesday morning, as wind chill will make it feel like the temperature is in the low teens.\nWednesday night will be cloudy with a low of 26."}, {"url": "https://www.whas11.com/article/news/local/activate-games-live-action-gaming/417-6be4737e-69ef-4970-84d7-a0f5979df5c1", "title": "The nation's first live-action gaming experience to open in Louisville", "authors": ["Author", "Bethanni Williams", "Published", "Pm Est December", "Updated"], "date": "2019-12-03", "keywords": ["gaming", "liveaction", "physical", "activate", "experience", "louisville", "games", "players", "nations", "open", "play", "active"], "summary": "LOUISVILLE, Ky. — Louisville is getting it's first live-action gaming experience.\nThe partnership with Lexington-based Breakout Games, Activate Games offers guests an active gaming experience located in a vibrant and high-tech 12,000 square-foot space off Hurstbourne Parkway in Louisville.\n“As Kentucky natives engaged in the experiential entertainment industry, we’re thrilled to bring Activate Games to Louisville for the community to enjoy,” said Bryce Anderson, co-owner of Activate Games America.\nOnce inside, guests receive an electronic wristband that tracks high scores and progress, making Activate Games suitable for intense competition or a low-pressure gaming experience.\nThose looking to be the first to experience Activate Games can now book online at www.activate.games."}, {"url": "https://kycir.org/2019/12/18/public-nuisance-ordinance-louisville/", "title": "For Louisville Offenders And Victims Alike, A New Label: ‘Public Nuisance’ - Kentucky Center for Investigative Reporting", "authors": ["Jacob Ryan", "More Jacob"], "date": "2019-12-18", "keywords": ["public", "ordinance", "enforcement", "code", "lmpd", "reporting", "offenders", "kentucky", "center", "label", "property", "louisville", "victims", "letter", "nuisance", "violation", "investigative", "cases"], "summary": "While some nuisance cases involve stereotypical drug houses where drugs are manufactured or sold in high quantities, many stem from simple possession of drugs, paraphernalia or low-level trafficking offenses, a KyCIR review of nearly three years worth of nuisance cases shows.\nJerimy Austin, the city’s code enforcement supervisor, estimates at least half of all nuisance cases result in an eviction.\nMegan Hatch, an associate professor at Cleveland State University’s department of urban studies, researches nuisance ordinances, and she reviewed Louisville’s public nuisance ordinance at KyCIR’s request.\nAfter receiving the notice of the public nuisance, Thornton contacted the tenant — the arrested woman’s mother — to find out what happened.\nThree weeks later, city officials sent his landlord a public nuisance violation notice."}, {"url": "https://www.whas11.com/article/weather/storm-team-blog/a-wet-start-to-2020-and-looking-back-at-2019/417-5581079c-a99c-4604-80cb-2bfc4f0b0835", "title": "A Wet Start to 2020, and Looking Back at 2019", "authors": ["Author", "Alden German", "Whas", "Published", "Pm Est January", "Updated"], "date": "2020-04-15", "keywords": ["start", "2020", "region", "snow", "2019", "wet", "temp", "night", "weather", "system", "looking", "possible", "precipitation", "storm", "rain"], "summary": "Do you believe 2020 is the start of the new decade, or 2021?\nLet's talk about our first storm system of 2020 and at the end of the blog review the weather in 2019.\nAs the now-formed storm system moves up the Mississippi River Valley rain will as well.\nThere are indications of another potential storm impact the region with both rain and snow possible.\n2019 WEATHER IN REVIEW: What a year 2019 was for weather in Louisville!"}, {"url": "https://www.courier-journal.com/story/news/local/2019/11/10/louisville-weather-snow-expected-monday-night-record-cold-tuesday/2533948001/", "title": "Snow will hit Louisville sooner than expected. Here's what to expect Monday night", "authors": ["Sarah Ladd", "Ben Tobin", "Published P.M. Et Nov."], "date": "2019-11-10", "keywords": ["expect", "heres", "expected", "hit", "degrees", "slowly", "rain", "high", "roads", "snow", "night", "louisville", "weather", "sooner", "record"], "summary": "CLOSEStart stocking up on the hot chocolate, Louisville, and pull out the blankets stuffed in the back of your closet.\nIt began raining in Louisville Monday afternoon, and it will be followed soon by snow and record cold Tuesday.\nThe Louisville National Weather Service has issued a winter weather advisory for several areas in Kentucky, including Jefferson County, to go in effect Monday evening.\nThere is a 100% chance of rain and snow, according to the service.\nThe frigid temperatures Tuesday following Monday's rain and snow could possibly freeze roads and prove hazardous, the weather service says."}, {"url": "https://www.wave3.com/2019/12/14/cdc-says-flu-now-widespread-kentucky-indiana/", "title": "CDC says flu now widespread in Kentucky and Indiana", "authors": ["Maira Ansari", "Published At Pm"], "date": "2019-12-14", "keywords": ["flu", "report", "reporting", "kentucky", "pediatric", "latest", "widespread", "reported", "indiana", "cdc", "states"], "summary": "The flu is now widespread in Kentucky and Indiana.\nAccording to the latest flu report from the CDC, 23 states are reporting widespread activity.\nTen pediatric deaths have been reported so far across the country."}, {"url": "https://www.lanereport.com/118391/2019/10/43rd-old-louisville-holiday-home-tour-will-be-dec-7-8/", "title": "43rd Old Louisville Holiday Home Tour will be Dec. 7-8 - Lane Report", "authors": ["Jonathan Miller"], "date": "2019-10-04", "keywords": ["report", "tour", "43rd", "historic", "victorian", "serves", "visitors", "louisville", "holiday", "dec", "tea", "old", "neighborhood", "78", "lane"], "summary": "LOUISVILLE, Ky. — Returning on the first full weekend in December, the Old Louisville Holiday Home Tour gives visitors a rare glimpse inside several beautiful Victorian-era private residences and historic buildings dressed in their holiday finery.\nThe tour is set to showcase the rich and diverse history of Historic Old Louisville during the Yuletide season.\nThe 43rd annual Old Louisville Holiday Home Tour will take place Saturday, Dec. 7 and Sunday, Dec. 8 from noon to 6 p.m. Each year it attracts thousands of visitors to Old Louisville to experience “One of the Great Places in America,” as named by the American Planning Association.\n”For 43 years, Old Louisville has opened its doors during the holiday season with a festive and welcoming spirit,” said Susan Coleman Layman, Old Louisville Holiday Home Tour chair.\nThe Old Louisville Holiday Home Tour serves as the primary fundraiser for the Old Louisville Neighborhood Council, which preserves, protects and promotes the history and culture of Old Louisville."}, {"url": "https://www.freep.com/story/sports/college/university-michigan/wolverines/2019/12/04/michigan-basketball-score-louisville/2604579001/", "title": "How Michigan basketball's explosive offense was solved by Louisville", "authors": ["Orion Sang", "Published A.M. Et Dec."], "date": "2019-12-04", "keywords": ["basketballs", "cardinals", "explosive", "center", "offense", "game", "louisville", "michigans", "mack", "michigan", "wolverines", "solved", "simpson", "howard"], "summary": "Howard's surroundings were different Tuesday night, when he lost his first game as Michigan basketball's coach.\nHe said the Wolverines proved they were a top defensive teams after holding Louisville's explosive offense to a sub-standard performance.\nDec 3, 2019; Louisville, KY, USA; Louisville Cardinals guard Darius Perry (2) defends against Michigan Wolverines guard Zavier Simpson (3) during the second half at KFC Yum!\nAfter the game, Mack said Louisville noticed Michigan's drop coverage change in response to the pick-and-pop.\nRead more on the Michigan Wolverines and sign up for our Wolverines newsletter."}, {"url": "https://www.wave3.com/2019/12/01/man-shot-killed-dixie-highway-algonquin/", "title": "Man shot and killed on Dixie Highway in Algonquin", "authors": ["Published At Pm"], "date": "2019-12-01", "keywords": ["related", "highway", "killed", "shot", "student", "wku", "seven", "louisville", "algonquin", "outside", "dixie", "wave", "victim", "man", "williamson"], "summary": "Community activist Christopher 2X confirmed to WAVE 3 News that the victim is related to Cheryl Williamson, the WKU student who was shot and killed outside the Gillespie in downtown Louisville on November 25, 2012.\nSeven years later, no arrests have been made in the case."}, {"url": "https://www.lex18.com/news/1-dead-4-hurt-after-crash-in-louisville", "title": "1 dead, 4 hurt after crash in Louisville", "authors": [], "date": "2019-12-01", "keywords": ["taken", "west", "street", "hurt", "chrysler", "streeta", "crash", "vehicle", "louisville", "seat", "dead", "witnessesif"], "summary": "LOUISVILLE, Ky. (LEX 18) — One person has died and four have been injured following a crash on West Main Street in Louisville on Friday.\nThe crash happened shortly after 10 p.m., when police said a speeding Ford Mustang crashed into a Chrysler 200 at the intersection of 25th Street.\nA passenger in the back seat of the Chrysler was pronounced dead at the hospital.\nLouisville police are asking for information about the crash from possible witnesses.\nIf you saw this crash or know more details about the incident, call the Louisville Metro Police Department at (502) 574-7060."}, {"url": "https://www.courier-journal.com/story/weather/local/2019/12/29/louisville-weather-rainfall-record-december-29-could-broken/2769524001/", "title": "Sunday's rainfall could break a more than 100-year-old record in Louisville", "authors": ["Ben Tobin", "Published P.M. Et Dec."], "date": "2019-12-29", "keywords": ["rainfall", "area", "today", "100yearold", "according", "louisville", "29", "weather", "inches", "sundays", "afternoon", "break", "rain", "record"], "summary": "CLOSE Louisville received 1.93 inches of rain on Dec. 29, 1910.\nToday, Louisville might get more than two inches of rain.\nThe Louisville area is on pace to receive more than two inches of rain by the end of Sunday, according to the Louisville National Weather Service, which has placed the Derby City under a flood watch.\nThat total would break a record — the most rainfall the Louisville area had previously experienced on any Dec. 29 was 1.93 inches in 1910, according to National Weather Service meteorologist Mark Jarvis.\nAs of early Sunday afternoon, the Louisville area had received roughly an inch of rain, Jarvis said."}, {"url": "https://www.courier-journal.com/story/life/food/2019/11/25/butchertown-louisville-soon-home-vibes-restaurant-ultra-lounge/4300299002/", "title": "A new restaurant and music lounge inspired by 'great vibes' is coming to Butchertown", "authors": ["Dahlia Ghabour", "Published P.M. Et Nov."], "date": "2019-11-25", "keywords": ["lounge", "butchertown", "music", "week", "white", "restaurant", "louisville", "vibes", "great", "evans", "open", "coming", "inspired"], "summary": "CLOSEVibes Restaurant and Ultra Lounge will open by the end of December 2019 in Louisville's Butchertown.\n(Photo: Courtesy of Allen Evans)A Louisville native is opening a restaurant and music lounge in Butchertown, inspired by \"great vibes\" in lounges in Manhattan.\nBy the end of December, Vibes Restaurant & Ultra Lounge will open in Butchertown at 1346 River Road, in what used to be a restaurant called Relish.\nOwner Allen Evans said that Louisville is \"highly underrated\" in terms of entertainment and he wanted to fill a need.\nMore news: This Butchertown pub is shutting down after 2 yearsThe focus is on the music and keeping it fresh: One week Vibes might feature reggae, with Cuban music the next week and Asian techno the week after that."}, {"url": "https://www.lex18.com/media/v/content/ed0fd9a77c924daf94a4e82e0b489241", "title": "Secretary of State Pompeo visits University of Louisville", "authors": [], "date": "2019-12-02", "keywords": ["secretary", "university", "state", "visiting", "venezuelans", "universitys", "visits", "pompeo", "urging", "louisville", "mcconnell", "latin", "turn", "trump"], "summary": "LOUISVILLE, Ky. (AP) — U.S. Secretary of State Mike Pompeo says some Latin American nations are taking a “sharp turn toward democracy, capitalism and good government” in an address at the University of Louisville.\nPompeo was visiting Monday ahead of a trip to London for a NATO summit with President Trump.\nPompeo was invited to speak by Senate Majority Leader Mitch McConnell as part of the university’s McConnell Center lecture series.\nPompeo mentioned a Kentucky connection, saying he was stationed at Fort Knox while serving in the military.\nHe spoke briefly and answered a few questions posed by McConnell."}, {"url": "https://www.wlky.com/article/belskis-blog-warmest-christmas-days-ever-in-louisville/30318938", "title": "Belski's Blog - Warmest Christmas Days ever in Louisville", "authors": ["John Belski", "Https", "Www.Facebook.Com Pages John-Belski"], "date": "2019-12-24", "keywords": ["belskis", "degrees", "week", "high", "day", "christmas", "louisville", "blog", "warm", "days", "warmest", "low", "60s"], "summary": "The morning low was a balmy 57.1982: 66 degrees.... this was the last time the temperature was in the 60's on Christmas Day in Louisville.\nHere is a list of the warmest Christmas Days ever in Louisville.\n1893: The warmest Christmas Day ever with a high of 68 degrees.\n1982: 66 degrees.... this was the last time the temperature was in the 60's on Christmas Day in Louisville.\n1983: The year after the last 60's for Louisville... the Christmas low was -7 and the high was 8 degrees."}, {"url": "https://www.sidestagemagazine.com/hometown-rising-country-music-bourbon-festival-returns-september-12-13-2020-to-louisville-ky-for-2nd-annual-event/", "title": "Hometown Rising Country Music & Bourbon Festival Returns September 12 & 13, 2020 to Louisville, KY for 2nd Annual Event", "authors": ["About Side Stage Magazine", "Side Stage Magazine", "Providing You All The Latest In Music News", "Reviews"], "date": "2019-12-19", "keywords": ["wimmer", "rising", "returns", "music", "country", "experience", "louisville", "hometown", "event", "bourbon", "festival", "danny", "ky", "trifesta"], "summary": "“Hometown Rising was our first venture into country music, and we could not be more thrilled with how 2019 went.\nThe lineup for Hometown Rising will be announced in February, with early bird passes for Hometown Rising, along with the return of the Trifesta pass, both on sale in late January.\nLocal news station WHAS 11 said of Hometown Rising, “[Danny Wimmer Presents]…hit the right note.\nDWP events include Aftershock Festival, Bourbon & Beyond, Epicenter Festival, Hometown Rising, Louder Than Life, Sonic Temple Art + Music Festival, and Welcome To Rockville.\nFor more information on Hometown Rising, please visit:2019 Festival Recap VideoWebsite: HometownRising.comFacebook: @HometownRisingInstagram: @HometownRisingTwitter: @HometownRisingHashtag: #HometownRising"}, {"url": "https://www.courier-journal.com/picture-gallery/sports/preps/kentucky/2019/12/08/trinity-male-kentucky-high-school-football-championship-photos-6-a-game/4374492002/", "title": "Kentucky high school football championship: Photos from 6A game", "authors": [], "date": "2019-12-08", "keywords": ["photos", "6a", "high", "kentucky", "game", "school", "championship", "football"], "summary": ""}, {"url": "https://www.courier-journal.com/story/entertainment/arts/2019/12/23/everything-you-need-know-kmac-picasso-exhibit-louisville/4404142002/", "title": "More than 50 works by Picasso never seen in America now on display at Louisville's KMAC", "authors": ["Kathryn Gregory", "Published A.M. Et Dec."], "date": "2019-12-23", "keywords": ["works", "kmac", "picassos", "main", "art", "milliken", "display", "louisvilles", "picasso", "museum", "outside", "seen", "50", "exhibit", "america"], "summary": "CLOSEMore than 50 works by Pablo Picasso never seen outside of Europe are now on display at KMAC in downtown Louisville.\nSponsored by UPS, \"Picasso: From Antibes to Louisville\" brings together 52 ceramics and works on paper created by Picasso between 1931 and 1956.\nKMAC is spread over three levels, with the Picasso exhibit on the second floor.\nDec. 20, 2019 (Photo: Scott Utterback/Courier Journal )KMAC Museum is the contemporary art museum in downtown Louisville's Museum Row and its goal is to educate and inspire while promoting a better understanding of art through exhibitions, education and collections.\nIt's that mission that makes the Picasso exhibit at KMAC so vital, Milliken said."}, {"url": "https://www.courier-journal.com/story/sports/preps/kentucky/2020/03/02/what-know-about-sixth-seventh-eighth-region-boys-basketball-tourneys/4921144002/", "title": "Everything to know about the Sixth, Seventh and Eighth Region boys basketball tournaments", "authors": ["Jason Frakes", "Published A.M. Et March"], "date": "2020-03-02", "keywords": ["tournaments", "vs", "know", "sixth", "male", "region", "seventh", "oldham", "winner", "bullitt", "basketball", "county", "ppg", "south", "eighth", "boys", "rpg"], "summary": "Seth Johnson (South Oldham) 72.\nTop scoring defense: Oldham County, 55.8 ppg.\nPrevious quarterfinal meetings: Host Woodford County beat Oldham County 71-66 on Dec. 21.\nJason Frakes’ pick: Oldham County.\nNotes: South Oldham once again leads the state in 3-pointers made (330) and attempted (791) this season, good for a 41.7% clip from behind the arc."}, {"url": "https://www.courier-journal.com/story/weather/local/2019/08/29/farmers-almanac-predictions-winter-2020-kentucky-weather/2129712001/", "title": "It's going to be a wild ride: Farmers’ Almanac predicts a 'Polar Coaster' this winter", "authors": ["Published A.M. Et Aug."], "date": "2019-08-29", "keywords": ["know", "region", "coaster", "snow", "kentucky", "wild", "polar", "winter", "ride", "going", "farmers", "almanac", "weather", "predicts", "geiger"], "summary": "CLOSE Farmers' Almanac predicts a \"polar coaster\" of a winter The News JournalWhat if we take a different approach to the weather this winter?\n\"We're calling this winter a 'Polar Coaster' because of fluctuating warm and cold temperatures and precipitation,\" Peter Geiger, editor of the 200-year-old Farmers’ Almanac publication, told the Courier Journal.\nThe Farmers’ Almanac bases its long-range forecast for the United States \"on a mathematical and astronomical formula developed in 1818.\"\nFarmer's Almanac (Photo: Farmer's Almanac)Be prepared: How to keep your pipes from freezing this winter in KentuckyYou'll need a coat at Kentucky DerbyThis year's winter will cause a slow start to a spring season, according to the Farmers' Almanac.\nWhile the Farmers' Almanac offers little rest for the winter-weary this year, there is a positive spin to this season's outlook."}, {"url": "https://www.wave3.com/2019/12/10/people-shot-shawnee-neighborhood/", "title": "2 people shot in Shawnee neighborhood", "authors": ["Shellie Sylvestri", "Published At Pm"], "date": "2019-12-10", "keywords": ["scene", "shawnee", "render", "taken", "shot", "university", "metro", "spokesman", "lmpd", "mitchell", "louisville", "victims", "neighborhood"], "summary": "LMPD spokesman Dwight Mitchell confirms Louisville Metro EMS and the Louisville Fire Department were called to the scene to render aid to the victims; they were both taken to University hospital in critical condition."}]