[{"url": "https://www.channel3000.com/best-of-madison-2020-winners/", "title": "Best of Madison 2020 Winners", "authors": ["Posted", "Updated"], "date": "2020-03-19", "keywords": ["pet", "2020", "singer", "vino", "credit", "band", "auto", "bar", "best", "brewing", "madison", "winners"], "summary": "In honor of reaching a new decade, this year’s Best of Madison celebrates the connections between the rip-roaring 1920s and today, the new golden age.\nBest of Madison showcases the best of the best in the city.\nBest of Madison 2020 was presented by The Ho-Chunk Nation and Ho-Chunk Gaming-Wisconsin.\nBe a part of the nomination and voting process for next year’s Best of Madison readers poll.\nWe will be taking nominations for the 2021 Best of Madison from Aug. 1-31 at madisonmagazine.com."}, {"url": "https://www.channel3000.com/fbi-seeking-assistance-finding-serial-armed-robbery-suspects-in-madison/", "title": "FBI seeking assistance finding serial armed robbery suspects in Madison", "authors": ["Posted", "Updated"], "date": "2020-03-24", "keywords": ["station", "white", "finding", "suspects", "serial", "assistance", "black", "robberies", "2019", "seeking", "armed", "wore", "fbi", "robbery", "madison", "gas"], "summary": "MADISON, Wis. — The FBI Milwaukee Division is looking for the public’s help in identifying serial armed robbery suspects responsible for robberies of multiple gas stations and one hotel.\nAccording to a release, there were four robberies between Nov. 28, 2019 and Jan. 7, 2020 in the Madison area.\nAn incident report from Madison police said the two men stole $240 at the BP gas station before running away.\nThe second individual wore all black clothing, black tennis shoes, blue/gray nitrile coated gloves and a white or black balaclava style mask.\nThe FBI is offering a $5,000 reward for information leading to the arrest of the suspects."}, {"url": "https://www.sciencedaily.com/releases/2020/04/200414173712.htm", "title": "Why the solar wind is hotter than expected", "authors": [], "date": "2020-04-20", "keywords": ["wind", "particles", "expected", "electrons", "boldyrev", "plasma", "temperature", "magnetic", "escape", "field", "hotter", "solar"], "summary": "Their findings suggest ways to study solar wind phenomena in research labs and learn about solar wind properties in other star systems.\nBecause of this charge, solar plasma is influenced by magnetic fields that extend into space, generated underneath the solar surface.\nadvertisementAround the time scientists discovered solar wind, plasma fusion researchers were thinking of ways to confine plasma.\nThe accuracy with which mirror machine theory predicts solar wind temperature opens the door for using them to study solar wind in laboratory settings.\n\"Maybe we'll even find some interesting phenomena in those experiments that space scientists will then try to look for in the solar wind,\" Boldyrev says."}, {"url": "https://isthmus.com/news/cover-story/madison-creatives-reveal-big-dreams-for-city-in-2020/", "title": "2020 vision - Isthmus", "authors": ["Gwendolyn Rice", "Kristie Schilling", "Jonathan Rubin", "Tiago Ribeiro", "Susan Sheldon"], "date": "2020-01-02", "keywords": ["theatre", "2020", "arts", "expand", "community", "artists", "art", "vision", "isthmus", "im", "theater", "madison", "work"], "summary": "We are a community theater after all, and I want the shows I work on to be as part of the community as I can.\n× Expand Tim Sauers by Anya KubilusTim Sauers, vice president of programming and community engagement, Overture Center: The Madison arts community is eager to experience quality performing and visual arts.\nThree topics are on my mind as we head into 2020 — diversity, pay, and gentrification — and where all three intertwine.\nThough I’m starting by focusing on the hyperlocal, when you think of theater-making in 2020, look around our actual community.\n× Expand Jonathan Solari by Dannika RynesJonathan Solari, chief executive officer, Madison Ballet: At Madison Ballet, 2020 and beyond are exciting because of the breadth of collaborative possibilities."}, {"url": "https://gopsusports.com/news/2020/4/15/wrestling-every-journey-worth-taking-begins-with-one-small-step.aspx", "title": "Every Journey Worth Taking Begins with One Small Step", "authors": [], "date": "2020-04-15", "keywords": ["step", "wrestling", "ncaa", "small", "state", "went", "sandersons", "worth", "sanderson", "journey", "begins", "penn", "win", "season", "big", "taking"], "summary": "Retrospectacle…\"Every journey worth taking begins with one small step…\"It's simple to say it but putting the words into action can be daunting…unless everything comes together.\nPenn State had gone 8-12-2 the year before.\nPenn State downed the Illini 24-11 and went on to go 5-3 in Sanderson's first full Big Ten dual season.\nIn his first season wrestling for Sanderson, Molinaro led Penn State in wins going 33-7.\n31.-- Penn State went 13-6-1 in dual meets, much improved from the prior year's 8-12-2, and a strong finish to return to the Top 10 (No."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "games", "won", "virtually", "participate", "touches", "packers", "matt", "wants", "invites", "nfl", "draft", "versatility", "temple"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Temple interior offensive lineman Matt Hennessy:What he can do– Stands almost 6-4 but is a little lean and has short arms.\nCould use extra mass, especially if he wants to have center-guard versatility– Started 35 games at center the..."}, {"url": "https://newspress.com/santa-barbaras-deacon-hill-named-to-polynesian-bowl/", "title": "Santa Barbara’s Deacon Hill named to Polynesian Bowl", "authors": ["Mitchell White"], "date": "2020-04-16", "keywords": ["think", "game", "hill", "polynesian", "bowl", "final", "season", "barbaras", "named", "deacon", "santa", "work", "barbara", "wisconsin", "play"], "summary": "Santa Barbara quarterback Deacon Hill throws the ball in the first quarter during a 34-0 shutdown over Santa Ynez at Dos Pueblos High School on Friday, October 11, 2019.\nAfter showcasing his talents throughout Southern California during his junior campaign, Santa Barbara High quarterback Deacon Hill will look to wow spectators in Honolulu.\nHe was notified of the selection last week and the college sports site 247sports.com made the official announcement with an article on the Santa Barbara standout.\nHe led Santa Barbara to the CIF-SS Div.\n“The final play of my junior year, the final play of that game and the final play for those seniors in their last game."}, {"url": "https://spectrumnews1.com/wi/madison/ap-top-news/2020/04/16/leading-in-pandemic-becomes-part-of-audition-for-bidens-vp", "title": "Leading in pandemic becomes part of audition for Biden's VP", "authors": ["Published Am Et Apr."], "date": "2020-04-16", "keywords": ["pandemic", "leading", "campaign", "shes", "running", "audition", "bidens", "vp", "biden", "black", "presidential", "woman", "coronavirus", "sen"], "summary": "As Biden begins the process of choosing a running mate, responding to the COVID-19 pandemic has become an unexpected part of the audition.\nRallies and fundraisers — where potential vice presidential candidates might essentially audition for the position — are barely happening.\n2 who can project confidence to voters that they can manage a pandemic,” said Adrienne Elrod, a Democratic strategist who was a senior adviser to Hillary Clinton's 2016 presidential campaign.\nA Harris adviser said the senator, the lone Democratic black woman in the Senate, is using her platform to highlight the racial disparities of the pandemic.\nShe’s already shown an ability to handle criticism from Trump, whose leadership during the pandemic she has criticized."}, {"url": "https://www.channel3000.com/50-things-to-do-in-madison-this-january/", "title": "50 things to do in Madison this January", "authors": ["Posted", "Updated"], "date": "2020-01-01", "keywords": ["wisconsin", "theatre", "things", "center", "music", "50", "fest", "jan", "overture", "majestic", "perform", "madison"], "summary": "50 things to do in Madison this JanuaryRing in the new year with music and danceDana Munro by Dana MunroThe Madison Symphony Orchestra performs John Williams’ score to Harry Potter and the Chamber of Secrets live in concert on June 16-17.\nStraight off its Off-Broadway success, this John Gray book turned play comes to the Overture Center for the Arts stage.\nShe takes us through the ecosystems below the surface at “National Geographic Live: Designed by Nature” at Overture Center for the Arts.\nJan. 14MusicTwenty-one-time Grammy nominated bluegrass artist Dwight Yoakam brings a little bit of country soul to Overture Center.\nKids of all ages are welcome to the spectacle at Overture Center."}, {"url": "https://www.nbc26.com/news/local-news/video-madison-rooftop-cameras-capture-another-meteor", "title": "VIDEO: Madison rooftop cameras capture another meteor", "authors": [], "date": "2020-01-08", "keywords": ["visible", "meteor", "video", "cameras", "west", "typo", "wis", "capture", "according", "rooftop", "youtube", "captured", "madison"], "summary": "Rooftop cameras in Madison, Wis. have captured yet another meteor soaring through the nighttime sky.\nThe meteor was seen falling in the skies west of Madison on Tuesday, according to the AOSSRooftopCameras Youtube channel.\nThis is not the first time these cameras have captured such a sight.\nIn November , another meteor was spotted on the north-facing cameras.\nThis time of year is known for the Quadrantids, which have the potential to be the best meteor shower of the year, according to the American Meteor Society."}, {"url": "https://isthmus.com/events/Dane-County-Farmers-Market-winter-garver/", "title": "POSTPONED: Dane County Farmers' Market", "authors": [], "date": "2019-10-24", "keywords": ["market", "farmers", "county", "dane", "winter", "products", "postponed", "options", "members", "late", "stay"], "summary": "× Expand The Dane County Farmers' Market continues during the winter at Madison Senior Center.\nA message from DCFM: The Dane County Farmers' Market Late Winter Market is closed until further notice.\nTo facilitate our patrons connecting with our members, we have assembled an up-to-date list of our Late Winter Market vendors and the alternative purchasing options they are making available to the community.\nThe Late Winter Market runs each Saturday from the new year until the beginning of the outdoor season.\nYou will still find many of your favorite Dane County Farmers’ Market members, as well as a full array of fruits and vegetables, cheeses, hyper-local meats, honey, bakery items, and many specialty items."}, {"url": "https://wkow.com/2020/01/11/madison-declares-snow-emergency/", "title": "Madison declares snow emergency", "authors": [], "date": "2020-01-11", "keywords": ["snow", "alternate", "parking", "evening", "declares", "residents", "700", "street", "madison", "emergency", "vehicles"], "summary": "MADISON (WKOW) -- The City of Madison has declared a snow emergency on Saturday.\nAccording to the city of Madison, alternate side parking restrictions will be in effect tonight starting at 1:00 a.m. and will remain in effect until at least 7:00 a.m. on Monday.\nAnyone who parks their vehicles in the Snow Emergency Zone overnight must abide by alternate side parking rules during the declared emergency.\nThose who do not follow the alternate side parking rules may be ticketed and towed.\nMadison residents can get additional snow emergency, plowing, and general winter information at www.cityofmadison.com/winter."}, {"url": "https://isthmus.com/opinion/opinion/democratic-permanent-progressive-field-program-is-working-on-it/", "title": "Will it be a Democratic 2020? - Isthmus", "authors": ["Ruth Conniff", "Dianne Carey", "David Blaska", "Greg Conniff"], "date": "2020-01-02", "keywords": ["2020", "national", "myers", "democratic", "voters", "state", "purge", "way", "supreme", "voter", "isthmus", "court", "wisconsin"], "summary": "The closer we get to the 2020 election, the more attention Wisconsin is going to get.\nThe Democratic Convention in Milwaukee will pack hotels all the way up I-94 into Madison.\nThe lawsuit brought by the Wisconsin Institute for Law & Liberty will be appealed, but the Wisconsin Supreme Court, the likely final destination, is not exactly a friendly forum for democracy lately.\nThe Milwaukee Journal Sentinel did report on Dec. 23 that Kelly has decided he would recuse himself if the Supreme Court decides to hear the voter purge case.\nBut there is still the problem of the Ozaukee court decision mandating the voter purge, not to mention gerrymandering."}, {"url": "https://wkow.com/2020/01/08/watch-meteor-streaks-across-the-sky-above-madison/", "title": "WATCH: Meteor streaks across the sky above Madison", "authors": [], "date": "2020-01-08", "keywords": ["meteor", "southern", "uw", "sky", "west", "sciences", "watch", "wkow", "overnight", "view", "rooftop", "streaks", "madison", "skies", "wisconsin"], "summary": "MADISON (WKOW) -- A meteor flashed across the skies of southern Wisconsin overnight, and the image was captured by a UW Department of Atmospheric an Oceanic Sciences camera.\nThis view is from the west facing rooftop camera on the AOSS building on campus."}, {"url": "https://isthmus.com/events/inside-out-madison-ballet/", "title": "Inside Out", "authors": [], "date": "2019-10-17", "keywords": ["works", "seasons", "dancers", "ballet", "inside", "ballets", "performed", "music", "choreographed", "madison"], "summary": "× Expand Becky McKenzie Madison Ballet dancers Jacob Ashley and Annika Reikersdorfer.\npress release: On the heels of this season’s spectacular and beloved production of The Nutcracker, the Madison Ballet is poised to present, Inside Out, a selection of new works performed at the Bartell Theater’s Drury Stage.\nInside Out features the work of some of Madison’s most talented choreographers, providing the opportunity for audiences to experience new works in an intimate setting.\nIt is the result of Madison Ballet’s continuing commitment to producing and supporting the creation of new choreography by innovative artists.\nTickets to Inside Out can be purchased online at madisonballet.org/tickets or by calling the Overture Center Box Office at (608) 258-4141."}, {"url": "https://wkow.com/2020/01/24/law-enforcement-mourns-loss-of-madison-police-detective/", "title": "Law enforcement mourns loss of Madison police detective", "authors": [], "date": "2020-01-24", "keywords": ["ryanryan", "loss", "detective", "law", "officer", "posts", "wkow", "passed", "online", "mourns", "twitter", "sheriffs", "enforcement", "visitation", "madison"], "summary": "MADISON (WKOW) -- Local law enforcement is mourning the loss a fellow officer with the Madison Police Department.\nIn Facebook and Twitter posts, the Dane County Sheriff's Office and Madison Police Department are honoring Detective Nicholas Ryan.\nRyan passed away Wednesday, according to an online obituary.\nNo information on the cause of death is currently available.\nA visitation will be held at Gunderson East Funeral and Cremation Care, 5203 Monona Drive, Madison, from 3 p.m. until 8 p.m. on Sunday, Jan. 26, 2020."}, {"url": "https://wkow.com/2020/01/27/expect-minor-delays-downtown-ahead-of-vps-visit-to-madison/", "title": "Expect minor delays downtown ahead of VP’s visit to Madison", "authors": ["Emilee Fannon"], "date": "2020-01-27", "keywords": ["downtown", "expect", "delays", "event", "visit", "ahead", "vice", "theyll", "size", "road", "vps", "x", "occur", "minor", "madison", "capitol"], "summary": "MADISON (WKOW) -- If you work or live downtown, expect brief road closures on Tuesday ahead of Vice President's visit to the capitol, according to Capitol Police.\nWisconsin Capitol Police are teaming up with local law enforcement to ensure Vice President Mike Pence’s trip to Madison runs smoothly.\nThey expect some road closures to occur around 11:15-11:30 a.m. prior to Pence's arrival at the statehouse.\nPence is expected to speak at an event celebrating Wisconsin’s school choice program.\nIt's anticipated more than 700 supporters will attend and if disturbances occur, Capitol police said they’ll be prepared."}, {"url": "https://wkow.com/2020/01/18/police-investigating-shots-fired-in-madison-saturday/", "title": "UPDATE: Man murdered in Madison apartment Saturday", "authors": [], "date": "2020-01-18", "keywords": ["theyre", "man", "murdered", "wkowcom", "wkow", "apartment", "mckenna", "say", "neeley", "heard", "area", "update", "madison"], "summary": "UPDATE (WKOW) -- Police say they're investigating a man's death after a shooting in Madison Saturday.\nMadison police say the man was shot inside an apartment on McKenna Boulevard.\nMarcus Neeley was home when multiple shots went off in the apartment building next to him.\nMPD is asking those in the community who might have information regarding this case to contact Madison Area Crime Stoppers at (608) 266-6014.\nMADISON (WKOW) -- Police say they found evidence that gunshots were fired on the south side of Madison on Saturday afternoon."}, {"url": "https://isthmus.com/events/madison-roller-derby-jan-18/", "title": "Madison Roller Derby", "authors": [], "date": "2020-01-06", "keywords": ["game", "track", "ticket", "teams", "team", "win", "roller", "skaters", "madison", "derby"], "summary": "× Expand The Mad Calves Junior Roller Derby teampress release: Madison Roller Derby is excited to kick off its 16th season with a double header on Saturday, January 18, 2020, at the Alliant Energy Center's Coliseum.\nThe first home team game of the night will feature the skate crime syndicate of the Reservoir Dolls going up against the wily Vaudeville Vixens.\nDuring half-time, Madison Roller Derby is thrilled to present an exhibition of the next generation of derby athletes: The Mad Calves Junior Roller Derby Team!\nDoors open at 5:00 p.m. and the first game begins at 6:00 p.m.Tickets are $12 in advance if bought at one of our ticket outlets in Madison: Willy St.\nThese skaters are there to win and come ready to compete at a high level of action."}, {"url": "https://wkow.com/2020/01/21/vp-pence-to-visit-madison-next-week/", "title": "VP Pence to visit Madison next week", "authors": ["Dan Plutchak"], "date": "2020-01-21", "keywords": ["pence", "student", "visit", "vice", "vp", "mike", "wkow", "week", "president", "weekmore", "school", "madison", "wisconsin", "choice"], "summary": "VICE PRESIDENT MIKE PENCE TO ATTEND THE WISCONSIN SCHOOL CHOICE STUDENT SHOWCASEMADISON (WKOW) -- Vice President Mike Pence will travel to Madison on Tuesday, Jan. 28 to deliver remarks at the Wisconsin School Choice Student Showcase.\nThe event organized by Hispanics for School Choice in celebration of National School Choice Week.\nMore details are coming, according to a news release from the vice president's office."}, {"url": "https://wkow.com/2020/01/09/public-health-officials-seek-information-about-dog-after-attack-in-madison/", "title": "Public health officials seek information about dog after attack in Madison", "authors": [], "date": "2020-01-09", "keywords": ["dog", "streetthe", "teen", "walking", "officials", "information", "release", "health", "wkow", "sidewalka", "attack", "white", "seek", "public", "madison"], "summary": "MADISON (WKOW) -- Public Health- Madison and Dane County is looking for information about a dog that bit a teen while she was walking on a Madison sidewalk.\nA news release said a 13-year-old girl was bitten on Jan. 3 at about 2 p.m. in the area of Ohio Avenue and LaFollette Street.\nThe dog was described as a medium-sized, white dog that got away from its owner.\nIf you have information regarding this incident you are asked to call (608) 255-2345."}, {"url": "https://isthmus.com/events/catvideofest/", "title": "CatVideoFest", "authors": [], "date": "2020-02-27", "keywords": ["videos", "cats", "local", "tickets", "yearly", "cat", "welfare", "unique", "watch", "catvideofest", "best"], "summary": "press release: Come see this yearly celebration of all things feline at your local Marcus Cinema!\n10% of the net profits will go back to Madison Cat Project and you get to watch a bunch of cat videos.\nGet your tickets for this Sunday, March 1st at 4pm!\nCatVideoFest is a compilation reel of the latest and best cat videos culled from countless hours of unique submissions and sourced animations, music videos, and, of course, classic internet powerhouses.\nCatVideoFest is a joyous communal experience, only available in theaters, and raises money for cats in need through partnerships with local cat charities, animal welfare organizations, and shelters to best serve cats in the area."}, {"url": "https://isthmus.com/events/winter-now-summer-later/", "title": "Winter Now Summer Later", "authors": [], "date": "2019-12-19", "keywords": ["winter", "family", "monona", "expo", "later", "summer", "activities", "outdoor", "information", "library", "public"], "summary": "press release: Winter is just settling in, but in Wisconsin summer is always just around the corner.\nAnd there’s no time like the present to start planning for those exquisite months that we all cherish so much.\nMonona Public Library will host the “Winter Now, Summer Later” Outdoor Activities Expo on Saturday, Jan. 4, from 1 to 4 p.m.. “Beat the frigid January temperatures by making plans for your summer,” said Monona Library Director Ryan Claringbole.\n“The Monona Public Library is excited to host \"Winter Now, Summer Later\" an Outdoor Activities Expo featuring local businesses, experts, and non-profits in the area.”Travel from booth-to-booth, collecting information and library books regarding ways to bring your family together for a thrilling, adventurous, and memorable summer.\nSponsors for the Jan. 4 Outdoor Activities Expo include;Rutabaga Paddlesports,Aldo Leopold Nature Center,Lussier Family Heritage Center & Dane County Parks,Naturing in Madison,Olbrich Botanical Gardens, andFriends of Monona Public Library."}, {"url": "https://isthmus.com/events/mead-metal-fest/", "title": "Mead & Metal Fest", "authors": [], "date": "2019-11-12", "keywords": ["mead", "youre", "metal", "set", "viking", "cowboy", "fest", "band", "borisov", "trident", "lords"], "summary": "Start the new year off right with Bos Meadery’s seventh annual celebration of its locally made mead complemented by Madison’s best hard rock and metal acts.\nThis year’s lineup features Sabotage, Cowboy Amazing, The Garza, and the self-proclaimed “most metal band on Earth,” Lords of the Trident.\nThere’s also a costume contest with prizes awarded for the best metal and Viking ensembles and “brutal” poetry readings between sets.\npress release: The lineup is set for this year’s Mead & Metal Fest, the first cool festival of the new year, being held Saturday, January 4, 2020, from 6-11p at our Mead Hall in downtown Madison!\nAs always, Metal and Viking costumes are appreciated and encouraged!"}, {"url": "https://wkow.com/2020/01/20/weekend-homicide-victim-in-madison-identified/", "title": "Weekend homicide victim in Madison identified", "authors": [], "date": "2020-01-20", "keywords": ["county", "weekend", "died", "office", "homicide", "medical", "mckenna", "shooting", "examiners", "identified", "madison", "victim", "stidhum"], "summary": "MADISON (WKOW) -- The man killed Saturday in a shooting in Madison has been identified as a 20-year-old from Chicago.\nAntonio R. Stidhum, 20, of Chicago died in the shooting about 2:30 p.m. Saturday in the 1900 block of McKenna Boulevard.\nDane County Medical Examiner’s Office has identified him following an autopsy SundayStidhum died in the shooting about 2:30 p.m. Saturday in the 1900 block of McKenna Boulevard.\nPreliminary results from that autopsy confirm that Stidhum died from homicidal firearm violence.\nThis death remains under investigation by the City of Madison Police Department and the Dane County Medical Examiner’s Office."}, {"url": "https://isthmus.com/news/news/madison-east-teacher-pleads-not-guilty/", "title": "Madison East teacher pleads not guilty", "authors": ["Dylan Brogan"], "date": "2020-01-30", "keywords": ["jan", "30", "kruchten", "cameras", "minneapolis", "bugni", "students", "pleads", "teacher", "school", "east", "guilty", "madison", "oppeneer"], "summary": "× Expand David Michael MillerAround 30 East High School students filled the small hearing room at the federal courthouse in Madison on Jan. 30.\nDavid Kruchten, an East teacher who wore a green T-shirt and sweatpants, was escorted in by U.S.\nKruchten, a business education teacher at East, was arrested the morning of Jan. 30.\nThe indictment, also released Jan. 30, does not include the December dates when students found the cameras in Minneapolis.\nAssistant U.S. Attorney Elizabeth Altman brought up the December trip to Minneapolis by East students when arguing that Kruchten should remain in custody."}, {"url": "https://isthmus.com/news/news/the-last-night-of-the-dangle/", "title": "The Dangle's Last Night", "authors": ["Rod Clark"], "date": "2020-01-16", "keywords": ["visions", "dance", "lights", "dangles", "red", "night", "bar", "patrons", "number", "stage", "dancer"], "summary": "× Expand Brent Nicastro Before Visions there was The Dangle, at 119 E. Main St.[We rebooted this 1982 story from our archives to accompany our Jan. 16 cover story on what could be the last night for Visions Night Club.]\nThat's the motto emblazoned on the red satin matchbooks soon to be souvenirs of The Dangle's last days.\nWaiting patrons joke nervously under the bright lights, some turning up their collars or cheating away from the cameras.\nShe'll dance at Visions, she says, and in January she's going down to dance in Fort Lauderdale and New Orleans.\nTheir other night spot, Visions, will stay open until 1986."}, {"url": "https://wkow.com/2020/01/12/winter-storm-warnings-in-effect-this-weekend/", "title": "Light snow into Monday morning", "authors": ["John Zeigler"], "date": "2020-01-12", "keywords": ["little", "upper", "snow", "tonighttonightlight", "temperatures", "wkow", "morning", "spread", "light", "wi", "near"], "summary": "MADISON (WKOW) - Another round of light snow is expected tonight.\nTonightLight Snow will continue to spread into Southern WI as an upper level low moves through.\nWith temperatures in the 20s most of this will be light and fluffy.\nAccumulations will range from 1-3 inches for most.\nA little lower amounts near Janseville and maybe a little higher near the Dells."}, {"url": "https://wkow.com/2020/02/09/a-look-at-snowfall-totals-and-averages/", "title": "A look at snowfall totals and averages", "authors": ["Katherine Noel"], "date": "2020-02-09", "keywords": ["upper", "inches", "snowfall", "snow", "tonight", "viewing", "totals", "wkow", "look", "fall", "averages", "values", "skies", "wisconsin"], "summary": "MADISON (WKOW) - In SE Wisconsin, anywhere from 3 to 6 inches of snow is expected to fall by tonight.\nHighest snowfall is across central Wisconsin, where 7 to 10 inches of snow is possible.\nAlthough, snow will continue to fall in parts of our viewing area until tonight.\nThis will change the snow report values listed above.\nMONDAYMostly sunny skies, with highs in the upper 30's."}, {"url": "https://finance.yahoo.com/news/ratelinx-named-march-2020-gartner-152432943.html", "title": "RateLinx Named in the March 2020 Gartner Midmarket Context: Magic Quadrant for Transportation Management Systems", "authors": [], "date": "2020-04-16", "keywords": ["market", "quadrant", "supply", "tms", "ratelinx", "logistics", "research", "midmarket", "magic", "management", "systems", "context", "named", "transportation", "visibility", "gartner"], "summary": "Industry-leading logistics data platform named againMADISON, Wis., April 16, 2020 (GLOBE NEWSWIRE) -- Gartner, the world’s leading research and advisory company, recently named RateLinx’s ShipLinx TMS in their latest Midmarket Context: Magic Quadrant for Transportation Management Systems again.\nRateLinx was named in this Magic Quadrant Perspective as one of 11 notable vendors.\nWe are proud to help organizations reduce costs within the entire logistics cycle.”RateLinx was previously named in the February 2020 Gartner Market Guides for Real-Time Visibility Providers and the December 2019 Gartner Market Guide for Freight Audit and Payment Providers.\nGartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact.\nThe RateLinx ecosystem is designed to reduce logistics costs and optimize operations, providing companies with shipment management, supply chain visibility, and financial settlement solutions."}, {"url": "https://wkow.com/2020/04/15/air-force-officially-awards-f-35s-to-truax-field-in-madison/", "title": "Air Force officially awards F-35s to Truax Field in Madison", "authors": ["Dan Plutchak"], "date": "2020-04-15", "keywords": ["officially", "supporters", "wing", "force", "jets", "truax", "awards", "air", "fighter", "field", "wisconsins", "madison", "f35s"], "summary": "WASHINGTON (WKOW) -- After a lengthy review and public clashes between opponents and supporters, the U.S. Air Force has formally announced that the F-35 fighter will be based at Truax Field in Madison.\n“Today's news ensures Wisconsin’s 115th Fighter Wing, based at Truax Field in Madison, will now receive a critical upgrade with the F-35 replacing the aging F-16 fighter jets currently in service,\" Johnson said.\nIn February, the Air Force released its final report on the environmental impact of the plans, keeping Madison at the top of the list for a new site.\nThe 187th Fighter Wing at Dannelly Field in Montgomery, Alabama was the other unit to receive the F-35s.\nThe Air Force said the jets will replace older F-16 aircraft and will allow the Air Force to meet other requirements for readiness and training."}, {"url": "https://www.nytimes.com/interactive/2020/04/07/us/elections/results-wisconsin-president-democrat-primary-election.html", "title": "Wisconsin Election Results: Live Presidential Primary 2020", "authors": [], "date": "2020-04-07", "keywords": ["support", "2020", "level", "primary", "presidential", "candidates", "election", "results", "live", "polls", "according", "different", "wisconsin"], "summary": "Here is the level of support for candidates, according to different polls."}, {"url": "https://www.theguardian.com/us-news/2020/apr/03/wisconsin-election-coronavirus-pandemic", "title": "'Over our heads in chaos': Wisconsin on edge of election fiasco amid pandemic", "authors": ["Sam Levine"], "date": "2020-04-03", "keywords": ["pandemic", "wisconsin", "voting", "officials", "chaos", "state", "voters", "amid", "workers", "election", "edge", "fiasco", "ballot", "absentee", "heads", "mailin"], "summary": "Evers is pushing to convert to an mail-in election ending on 26 May.\nBut there is still deep concern that confusion and rules around mail-in voting will leave many unable to participate.\nGinter is a plaintiff in one of several federal lawsuits challenging restrictions around Wisconsin absentee ballots.\nConley also blocked election officials from releasing election results until the later date.\nThe change will probably allow thousands of Wisconsin voters to have their votes counted."}, {"url": "https://www.motherjones.com/politics/2020/04/voter-purges-wisconsin-republican-election/", "title": "Republicans Are Trying to Kick Thousands of Voters Off the Rolls During a Pandemic", "authors": ["Ari Berman", "Becky Z. Dernbach", "Kara Voght", "Aj Vicens", "Delilah Friedler", "Dan Spinelli", "Inae Oh", "David Corn", "Laura Thompson", "Nathalie Baptiste"], "date": "2020-04-14", "keywords": ["registration", "pandemic", "voting", "trying", "state", "voters", "states", "kick", "purge", "rolls", "vote", "election", "republicans", "voter", "thousands"], "summary": "Roll ReversalsBetween 2016 and 2018, more than 17 million names were taken off voter rolls nationwide.\nWisconsin: 14% of voters removed, 2016-18In 2017, Wisconsin officials mailed postcards to 340,000 registered voters thought to have moved, informing them that they would be removed from voter rolls if they did not respond.\nOklahoma: 11.7% of voters removed, 2016-18Oklahoma’s “use-it-or-lose-it” voter registration law means voters are purged if they don’t vote for several election cycles and don’t respond to a mailing.\nFrom 2016 to 2018, 17 million Americans—8 percent of the nation’s electorate—were taken off the voting rolls, according to the Brennan Center for Justice.\nLast year, Judicial Watch reached a settlement with California to reassess 1.5 million names on the voter rolls in Los Angeles County."}, {"url": "https://www.arkansasonline.com/news/2020/apr/16/explosion-damages-paper-mill-in-maine-g/", "title": "The nation in brief", "authors": ["Compiled Democrat-Gazette Staff Wire Reports"], "date": "2020-04-16", "keywords": ["maine", "explosion", "ardoin", "voting", "brief", "state", "jets", "force", "air", "republicans", "nation", "republican"], "summary": "The blast rocked the Androscoggin Mill in Jay, in central Maine, around noon, state police spokesman Steve McCausland said.\nThe jets will replace older F-16 aircraft and will allow the Air Force to meet other requirements for readiness and training, the Air Force said in a statement.\nThe Air Force said in a preliminary report that noise from the F-35s could make more than 1,000 homes \"incompatible for residential use.\"\nWhile Madison's City Council passed a resolution opposing the jets, the Greater Madison Chamber of Commerce is a vocal supporter.\nSecretary of State Kyle Ardoin ran into a wall of opposition from his fellow Republicans -- including objections from the state Republican Party -- for his proposal."}, {"url": "https://wausaupilotandreview.com/2020/03/22/the-scientific-serendipity-of-wisconsins-first-novel-coronavirus-case/", "title": "The scientific serendipity of Wisconsin’s first novel coronavirus case", "authors": [], "date": "2020-03-22", "keywords": ["specimen", "lab", "specimens", "labs", "case", "disease", "state", "researchers", "research", "sarscov2", "coronavirus", "novel", "scientific", "serendipity", "virus", "wisconsins"], "summary": "The first confirmed case of COVID-19 on American soil was identified in Washington state on Jan. 21, 2020.\nGiven the urgency of uncovering as much as can be learned about the virus and the disease it causes, infectious disease researchers in Madison snapped into action immediately.\n“We’d like to know why these sort of events happen,” said Friedrich in a Feb. 13 interview on PBS Wisconsin’s Here & Now.\nAs the disease continues to spread, the Kawaoka lab is taking special precautions with the SARS-CoV-2 virus.\nThe Scientific Serendipity Of Wisconsin’s First Novel Coronavirus Case was originally published on WisContext which produced the article in a partnership between Wisconsin Public Radio and PBS Wisconsin."}, {"url": "https://abc7chicago.com/coronavirus-wisconsin-cases-update-covid-19/6102926/", "title": "Coronavirus cases update: Wisconsin COVID-19 death toll at 170 in 3,555 cases", "authors": [], "date": "2020-04-14", "keywords": ["order", "3555", "cases", "state", "health", "spread", "evers", "170", "department", "coronavirus", "update", "toll", "death", "covid19", "wisconsin"], "summary": "SYMPTOMSFeverCoughShortness of breathRELATED STORIES AND RESOURCES:As the number of novel coronavirus cases increases across the U.S. and around the world, the number of confirmed COVID-19 cases in Wisconsin has reached 3,555, with 170 deaths in the state.Gov.\nWisconsin has a total of 3,555 positive coronavirus cases and 170 deaths.Wisconsin has a total of 3,341 positive coronavirus cases and 144 deaths.According to the Wisconsin Department of Health Services website, the state has a total of 3,068 positive coronavirus cases and 128 deaths.\nThe website also stated that 904 of their cases were currently hospitalized at a 29% rate.The number of coronavirus cases in Wisconsin has reached 2,885, with 111 deaths, state health officials announced Thursday.Gov.\nHealth officials did not release any information at this time about the latest death, but the website indicated an additional death in Milwaukee County, where they believe they have community spread cases of the virus.\nEvers order child care settings not to operate with more than 10 staff present at a time and many not operate with more than 50 children present at a time."}, {"url": "https://heavy.com/news/2020/04/khari-sanford/", "title": "Khari Sanford: 5 Fast Facts You Need to Know", "authors": ["Jessica Mcbride"], "date": "2020-04-03", "keywords": ["family", "madison", "wrote", "need", "facts", "health", "fast", "potter", "medical", "facebook", "beth", "sanford", "carre", "khari", "know"], "summary": "On Facebook, Sanford, 18, shared a brazen photo showing him holding a gun and made comments about policing the police.\nThe Potter/Carre daughter wrote comments on Facebook that indicate she had been in a relationship with Sanford.\nShe was also a physician with the University of Wisconsin-Madison Access Wingra Family Medical Center since September 1999.\n“In my time at Wingra Family Medical Center I had the pleasure of working with Dr. Beth Potter,” wrote one.\nCarre wrote on LinkedIn that he received a bachelor of arts degree in International Relations from Knox College and a doctorate of Philosophy Ph.D. in European history."}, {"url": "https://isthmus.com/news/cover-story/wisconsin-s-choice-between-jill-karofsky-and-daniel-kelly-will-shape-its-future/", "title": "Supreme decision - Isthmus", "authors": ["Bill Lueders", "Josh K"], "date": "2020-03-25", "keywords": ["going", "justice", "law", "decision", "state", "supreme", "karofsky", "election", "isthmus", "kelly", "court", "wisconsin"], "summary": "The state Supreme Court race presents Wisconsin with a dramatic choice, especially given that Kelly, who was appointed to the bench in 2016 by Gov.\nEach of the last four conservative contenders for state Supreme Court, Kelly included, has been tied to extreme words and deeds.\nBut now that WILL has asked the Supreme Court for a final ruling, Kelly has said he would “rethink” his decision not to participate after this election is over.\nIn the nine contested state Supreme Court races since 2007, outside interests spent about $25 million, compared to $18 million by the candidates’ campaigns.\nRecusalKarofsky says Wisconsin has “one of the weakest recusal rules in the country” and would like the state Supreme Court to adopt tougher ones, especially when substantial donors are litigants."}, {"url": "https://merrillfotonews.com/2020/04/15/dwd-releases-recent-unemployment-claim-figures/", "title": "DWD releases recent Unemployment claim figures", "authors": ["More Author"], "date": "2020-04-15", "keywords": ["dwd", "2020", "weekly", "unemployment", "ui", "releases", "claims", "claim", "figures", "applications", "total", "measures", "recent", "benefits"], "summary": "Between March 15 and April 6, 2020, the total number of new applications submitted for unemployment benefits was 313,068, with weekly claims reaching 589,616.\nThe total amount in unemployment benefits distributed equaled $68,759,104.\nBy comparison, during the same period in 2019, the total number of new applications paled in comparison, 17,748, with weekly claims of 155,148.\nThe total amount of unemployment benefits during this period was $39,597,111.\nDWD Staffing Measures:• Over 150 unemployment Insurance Division’s (UI) employees are working overtime."}, {"url": "https://isthmus.com/events/cave-after-dark-feb-15/", "title": "Cave After Dark", "authors": [], "date": "2020-01-08", "keywords": ["visitor", "tickets", "experience", "special", "center", "events", "inside", "hours", "cave", "older", "dark"], "summary": "press release: Surprise your special someone with tickets to this one-of-a-kind Valentine’s experience for couples.\nEach event includes a unique at-your-own-pace after hours cave experience and theme-related reception in our Visitor Center with cash bar.\nSpace is limited and these events sell out, so reservations are required.\n$80 per couple (must be 21 or older).\nTickets are not refundable."}, {"url": "https://isthmus.com/events/camp-bingo-feb-23/", "title": "Camp Bingo", "authors": [], "date": "2019-12-16", "keywords": ["event", "camp", "game", "ball", "wont", "bingoeach", "win", "bingo", "caller", "wisconsin", "wiscs"], "summary": "Join us in 2020 for one of Madison's best-loved events—Camp Bingo!\nJanuary 26: Pajama Party Bingo with ball caller Aaron Rogers from Mix 105.1!\nFebruary 23: Bingo at the Prom with ball caller Michael Bruno from WISC’s “Backstage with Bruno”!\nMarch 22: Pop Princesses Bingo with a celebrity ball caller to be named!\nCamp Bingo is a fundraiser for the AIDS Resource Center of Wisconsin."}, {"url": "https://wkow.com/2020/02/26/wisconsin-coronavirus-patient-remains-in-isolation/", "title": "UPDATE: Wisconsin’s lone coronavirus patient released from isolation", "authors": [], "date": "2020-02-26", "keywords": ["wisconsin", "patient", "negative", "person", "health", "tested", "illness", "lone", "coronavirus", "according", "update", "released", "isolation", "wisconsins"], "summary": "UPDATE (WKOW) -- Wisconsin's only person to have been diagnosed with COVID 19, the illness caused by coronavirus, has been released from isolation, according to state health officials.\nThe patient is feeling well and has now tested negative for the virus twice, which means they can leave isolation and resume normal activities, according to health officials.\n***************************MADISON (WKOW) -- The Wisconsin Department of Health Services says the patient with the only confirmed case of coronavirus in the state remains in isolation.\n\"The patient is still in isolation and we have a protocol that we're following, with CDC's guidance, for how we can determine if a patient is released.\nFifteen tested negative for coronavirus and one case is pending."}, {"url": "https://isthmus.com/events/uw-dance-department-faculty-2020/", "title": "UW Dance Department", "authors": [], "date": "2020-01-27", "keywords": ["concert", "dance", "university", "uw", "york", "walker", "professor", "faculty", "opera", "department", "curran", "work"], "summary": "× Expand Travis MageeUW-Madison’s dance department presents its annual faculty concert, featuring excerpts from guest artist Seán Curran’s “Social Discourse.” Acclaimed choreographer Curran, a Bessie award-winning dancer who performed with Bill T. Jones/Arnie Zane Dance Company and was an original NYC cast member of STOMP!, is chair of the dance department at New York University.\nThe faculty concert always provides a satisfying sampling of the creativity of faculty members and the talent of the department’s students.\npress release: The University of Wisconsin-Madison Dance Department presents Faculty Concert 2020 February 6-8 and 13-15, 2020, at the Margaret H’Doubler Performance Space, Lathrop Hall, 1050 University Avenue.\nA graduate and faculty member of New York University's Tisch School of the Arts, Curran is currently an Arts Professor and Chair of the Department of Dance.\nHe has over 25 years of teaching experience in modern technique, improvisation, body percussion and composition as a visiting artist at the American Dance Festival, Harvard Summer Dance Center, Bates Dance Festival, Boston's Conservatory of Music, and countless U.S. university dance departments and private studios."}, {"url": "https://www.channel3000.com/my-vote-wisconsin-website-experiencing-technical-issues/", "title": "‘My Vote Wisconsin’ website experiencing technical issues", "authors": ["Posted", "Updated"], "date": "2020-02-18", "keywords": ["problem", "experiencing", "issues", "vote", "polling", "elections", "technical", "website", "place", "madison", "wisconsin", "know"], "summary": "‘My Vote Wisconsin’ website experiencing technical issuesStephanie Fryer by Stephanie FryerFile photoMADISON, Wis. — A state resource website on elections is experiencing technical issues on Election Day.\nThe “My Vote Wisconsin” website posted it is experiencing issues with its addressing services.\nThis problem also affects polling place and sample ballot look-ups on the site.\nThe website is run by the Wisconsin Elections Commission.\nPeople aren't able to see what polling place to go to or what's on their ballot on the #MyVoteWisconsin website."}, {"url": "https://isthmus.com/events/mockingbird/", "title": "Mockingbird", "authors": [], "date": "2019-08-29", "keywords": ["production", "mockingbird", "spectrum", "world", "ctm", "autism", "young", "theater", "caitlin", "overture", "madison"], "summary": "press release: Children’s Theater of Madison presents the young adult drama, Mockingbird, February 22 thru March 1 in The Playhouse at Overture Center.\nYoung Caitlin has always relied on her older brother Devon to help her make sense of the world.\n“Mockingbird is my favorite kind of story: one with a lot of heart, a bit of humor, timely subject matter, and a unique point of view,” says director Erica Berman.\nMattie has a lot in common with her character: both are 11 years old, and both are on the autism spectrum.\nIn 2010, Mockingbird received the National Book Award for Young People’s Literature and in 2011, the Golden Kite Award for Fiction."}, {"url": "https://isthmus.com/events/coffee-fest/", "title": "Coffee Fest", "authors": [], "date": "2020-01-03", "keywords": ["coffee", "tea", "local", "ultimate", "ticket", "win", "fest", "lexus", "channel", "madison", "tvw"], "summary": "press release: Join Dane Buy Local for the second annual Coffee Fest.\n8-10:30am, February 12, 2020, Lexus of MadisonSOMETHING LOCAL IN EVERY CUPFeaturing local roasters, bakeries, chocolatiers, Coffee Fest brings together all of your Madison favorites for the ultimate café experience!\nFill your cup with something local and enjoy a break with friends.\nEach ticket includes a coffee mug and samples of coffee, tea, baked goods, and chocolates from our exhibitors, as well as chances to win give aways and drawings.\nPresented by EZ Office ProductsEvent Sponsor - Lexus of MadisonMedia Sponsors - Channel 3000, Channel 3, Madison Magazine, TVW"}, {"url": "https://patch.com/wisconsin/milwaukee/wisconsin-spring-primary-2020-3-running-supreme-court-seat", "title": "Wisconsin Spring Primary 2020: 3 Running For Supreme Court Seat", "authors": [], "date": "2020-02-14", "keywords": ["running", "2020", "justice", "spring", "seat", "law", "primary", "judges", "cases", "supreme", "justices", "narrow", "kelly", "court", "wisconsin"], "summary": "Voters in Wisconsin will have their chance to narrow the field of three Wisconsin Supreme Court justice candidates from three to two in advance of the April 7 general election.\nWisconsin Supreme Court Justice Daniel Kelly is looking to retain his seat on the state's highest court, and faces two challengers this spring during the Feb. 18 primary.\nKelly was appointed to the Wisconsin Supreme Court by former Gov.\nThe Wisconsin Supreme Court has seven justices, and conservatives have a 5-2 advantage in the court.\nThe work of the Wisconsin Supreme Court extends far beyond the criminal law."}, {"url": "https://isthmus.com/events/gg-magree/", "title": "GG Magree", "authors": [], "date": "2019-12-09", "keywords": ["wanna", "gg", "sneaks", "provides", "vocals", "tracks", "magree", "synth", "result", "thematic", "valleys", "sound"], "summary": "Breaking the mold of EDM DJs, this Australian artist does not just produce epic future bass grooves but also provides vocals on her own tracks.\nThe result is a thematic cohesion between the sound and the lyrics, making the valleys lower and the peaks even higher.\nOn tracks like “I Wanna Lose You,” she also sneaks CHRVCHES-esque synth pop into the mix."}, {"url": "https://www.channel3000.com/editorial-how-to-familiarize-yourself-with-wisconsin-spring-primary-candidates/", "title": "Editorial: How to familiarize yourself with Wisconsin Spring Primary candidates", "authors": ["Posted", "Updated"], "date": "2020-02-16", "keywords": ["familiarize", "site", "leagues", "spring", "primary", "voters", "candidates", "vote", "supreme", "editorial", "elections", "school", "wisconsin"], "summary": "Editorial: How to familiarize yourself with Wisconsin Spring Primary candidatesNeil Heinen by Neil HeinenMADISON, Wis. — Spring elections typically have lesser turnouts than Fall elections and that’s especially true in presidential election years.\nSo you can image projected turnout for a Spring primary.\nWe also hope you’ll take some time this weekend to familiarize yourself with the candidates.\nIn addition to Supreme Court and Madison School District Middleton voters will find information on their Mayor primary.\nYou can find additional election resources on the League’s VOTE411.org site, and on the politics page on Channel3000.com."}, {"url": "https://gopsusports.com/news/2020/4/15/wrestling-every-journey-worth-taking-begins-with-one-small-step.aspx", "title": "Every Journey Worth Taking Begins with One Small Step", "authors": [], "date": "2020-04-15", "keywords": ["step", "wrestling", "ncaa", "small", "state", "went", "sandersons", "worth", "sanderson", "journey", "begins", "penn", "win", "season", "big", "taking"], "summary": "Retrospectacle…\"Every journey worth taking begins with one small step…\"It's simple to say it but putting the words into action can be daunting…unless everything comes together.\nPenn State had gone 8-12-2 the year before.\nPenn State downed the Illini 24-11 and went on to go 5-3 in Sanderson's first full Big Ten dual season.\nIn his first season wrestling for Sanderson, Molinaro led Penn State in wins going 33-7.\n31.-- Penn State went 13-6-1 in dual meets, much improved from the prior year's 8-12-2, and a strong finish to return to the Top 10 (No."}, {"url": "https://isthmus.com/events/adult-swim-feb-7/", "title": "Adult Swim", "authors": [], "date": "2020-01-13", "keywords": ["winter", "tshirt", "museum", "showdance", "adult", "days", "shakespearepaint", "shirt", "studioscreenprint", "incandescent", "swim", "dark"], "summary": "press release: Shake off the dark days of winter with an incandescent museum party!\nFeatured activities:Shake off the dark days of winter with an incandescent museum party!\nPop-up Performance by Madison ShakespearePaint glow-in-the-dark murals in the black-lit Art StudioScreenprint your own black light t-shirt (BYO shirt) or posterEnjoy a phosphorescent cocktailMake LED fashion accessoriesPut on a shadow puppet showDance to our DJ’s gleaming beatsSpecial Add-On Activities:"}, {"url": "https://isthmus.com/events/disney-on-ice-dream-big/", "title": "Disney on Ice: Dream Big", "authors": [], "date": "2020-01-06", "keywords": ["skating", "heroes", "disney", "ice", "presents", "open", "allowed", "kingdom", "dream", "oct", "big"], "summary": "× Expand Feld Entertainmentpress release: Thursday, February 6, and Friday, February 7, at 7PM; Saturday, February 8 at 11AM, 3PM, and 7PM; Sunday, February 9 at 1PM and 5PMCourage leads the way for Disney’s most adventurous heroes when Disney On Ice presents Dream Big comes to Madison, Wis., Thursday, Feb. 6, to Sunday, Feb. 9.\nJoin the wayfinder Moana and the greatest demigod that ever lived, Maui, on an action-packed voyage to restore the stolen heart of Te Fiti.\nExplore the Land of the Dead as Miguel from Disney•Pixar’s Coco brings the festivities of Dia de los Muertos to the ice.\nDream Big captures all the magic and adventure of Disney’s immortal tales through cutting edge figure skating, glamourous costumes and stunning set designs.\nHigh-flying jumps, breathtaking skating and lovable Disney friends make Disney On Ice presents Dream Big an experience families will never forget!"}, {"url": "https://isthmus.com/events/collections-connections-reception/", "title": "Collections & Connections: 150 Years of the Wisconsin Academy", "authors": [], "date": "2020-01-21", "keywords": ["history", "clowes", "connections", "arts", "academys", "collections", "sense", "sciences", "academy", "jody", "150", "wisconsin"], "summary": "× Expand Andy KraushaarCoincident to white settlement of Wisconsin was the growth of the field of natural history, encompassing fledgling branches of science.\nOur Wisconsin Academy of Sciences, Arts & Letters recalls its founding 150 years ago by reuniting its early artifacts in Collections & Connections, free and open to the public.\nThe Feb. 20 reception includes refreshments and a panel discussion of specimen-collecting in the 19th-century, with historians Sarah Anne Carter and Lynn Nyhart, as well as co-curators Martha Glowacki and Jody Clowes.\nReception: 2/20/2020 5pm-7:30pmIn celebration of its 150th anniversary, the Wisconsin Academy of Sciences, Arts & Letters hosts an exhibition that recreates the natural history and archaeological collections gathered by early Academy members such as Increase Lapham, Thomas Chamberlin, Charles E. Brown, Edward Birge, and John Wesley Hoyt.\nCurated by Martha Glowacki and Jody Clowes, Collections & Connections embraces a nuanced view of the Academy’s historical collections, considers the complex legacy of this small but influential organization, and looks to the Academy’s future."}, {"url": "https://msuspartans.com/news/2020/2/9/spartan-wrestling-upsets-no-4-wisconsin-in-madison.aspx", "title": "MSU Wrestling Upsets No. 4 Wisconsin Sunday in Madison", "authors": [], "date": "2020-02-09", "keywords": ["lead", "wrestling", "wisconsin", "spartans", "dec", "redshirt", "leads", "wis", "win", "period", "msu", "madison", "upsets", "takedown"], "summary": "4 Wisconsin 17Logan Griffin (MSU), 6-2 - WIS leads 3-0 125 - Eric Barnett (WIS) dec. over(MSU), 6-2 - WIS leads 3-0Garrett Pepple (MSU), 13-2 - WIS leads 7-0 133 - No.\n1 Seth Gross (WIS) maj. dec. over(MSU), 13-2 - WIS leads 7-0Matt Santos (MSU) maj. dec. over Dominic Dentino (WIS), 16-5 - WIS leads 7-4 141 -(MSU) maj. dec. over Dominic Dentino (WIS), 16-5 - WIS leads 7-4Alex Hrisopoulos (MSU), 7-2 - WIS leads 10-4 149 - No.\n14 Cole Martin (WIS) dec. over(MSU), 7-2 - WIS leads 10-4Jake Tucker (MSU) dec. over Garrett Model (WIS), 12-8 - WIS leads 10-7 157 - No.\n24(MSU) dec. over Garrett Model (WIS), 12-8 - WIS leads 10-7Austin Hiles (MSU), 10-2 - WIS leads 14-7 165 - No.\n24 Johnny Sebastian (WIS), 6-2 - MSU leads 16-14Nick May (MSU) dec. over Peter Christensen (WIS), 6-5 - MSU leads 19-14 197 -(MSU) dec. over Peter Christensen (WIS), 6-5 - MSU leads 19-14Christian Rebottaro (MSU), 9-2 - MSU wins 19-17 285 - No."}, {"url": "https://isthmus.com/arts/visual-arts/retrospect-diy-robin-lee-exhibit-poetry-whimsical/", "title": "The “wacky artist” is back", "authors": ["Rebecca Lemar"], "date": "2020-02-07", "keywords": ["event", "wacky", "walls", "birds", "annual", "lee", "wooden", "images", "poems", "artist", "robin"], "summary": "× Expand Molly Leimontas Artist Robin Lee (right) at last year’s exhibit.\nAt last year’s event, cartoon images hung from white walls, dangling on wooden clothespins.\nIn addition to his annual self-produced shows, Lee vends at neighborhood festivals, including the Willy Street Fair.\nHe sings with several local bands: Birds Birds Birds; Warm Wet Rag (a “sincere” Ween tribute band); and Better Yeti.\nThis year, there are 180 rhyming poems, 100 “wacky art” paintings ranging in theme, 400 photographs and chili, Lee says."}, {"url": "https://isthmus.com/news/news/school-board-candidates-reflect-on-school-climate-ahead-of-primary/", "title": "Changing the narrative", "authors": ["Jenny Peek", "Patrick M O'Loughlin", "Tim Stanek", "Dianne Carey"], "date": "2020-02-13", "keywords": ["district", "board", "strong", "issues", "changing", "working", "students", "narrative", "school", "know", "schools", "pearson"], "summary": "It’s been a difficult year for the Madison school district.\nThe district is also in the midst of changing leadership as Matthew Gutiérrez takes over as superintendent, following Jennifer Cheatham, who announced her departure last May.\nAmid the change and turmoil, voters will begin the process of electing two new members to the Madison school board.\n“We have to know what’s working, what’s not working, and we have to know why.”She also says it’s time to be positive.\nAs the director of academic success at Edgewood College, Ball, 45, has seen firsthand how unprepared many Madison school district graduates are for college."}, {"url": "https://isthmus.com/opinion/opinion/democratic-permanent-progressive-field-program-is-working-on-it/", "title": "Will it be a Democratic 2020? - Isthmus", "authors": ["Ruth Conniff", "Dianne Carey", "David Blaska", "Greg Conniff"], "date": "2020-01-02", "keywords": ["2020", "national", "myers", "democratic", "voters", "state", "purge", "way", "supreme", "voter", "isthmus", "court", "wisconsin"], "summary": "The closer we get to the 2020 election, the more attention Wisconsin is going to get.\nThe Democratic Convention in Milwaukee will pack hotels all the way up I-94 into Madison.\nThe lawsuit brought by the Wisconsin Institute for Law & Liberty will be appealed, but the Wisconsin Supreme Court, the likely final destination, is not exactly a friendly forum for democracy lately.\nThe Milwaukee Journal Sentinel did report on Dec. 23 that Kelly has decided he would recuse himself if the Supreme Court decides to hear the voter purge case.\nBut there is still the problem of the Ozaukee court decision mandating the voter purge, not to mention gerrymandering."}, {"url": "https://isthmus.com/events/tim-eric/", "title": "Tim & Eric", "authors": [], "date": "2019-09-25", "keywords": ["wareheim", "house", "tour", "sitcom", "eric", "heidecker", "adult", "beef", "tim", "swim"], "summary": "× Expand Caroline Bader Tim Heidecker and Eric Wareheim.\nThe irreverent Adult Swim pioneers stop by Madison on the Tim and Eric Mandatory Attendance Tour!\nAttendees can expect surrealism, sketches, songs and Spandex from the comedy duo of Tim Heidecker and Eric Wareheim, best known for Tim and Eric Awesome Show, Great Job!\npress release: Tim and Eric Mandatory Attendance Tour!\nIt’s written and created by Tim Heidecker and Eric Wareheim who also serve as executive producers along with Dave Kneebone."}, {"url": "https://isthmus.com/news/news/when-money-is-no-object/", "title": "When money is no object", "authors": ["Dylan Brogan"], "date": "2020-02-09", "keywords": ["campaign", "think", "money", "state", "paying", "bloomberg", "hes", "presidential", "object", "douglas", "staffer", "wisconsin"], "summary": "× Expand Dylan Brogan News-Bloomberg-02-09-2020 Actor Michael Douglas at the opening of the Bloomberg campaign office in Madison.\nIn December, the candidate himself was at the opening of his first Wisconsin campaign office in Milwaukee.\nBloomberg has said he’s open to spending $1 billion dollars of his own money in his bid to become president.\nPeople chanted “buh-bye” as a Bloomberg staffer showed the young man the door.\nBut, he adds, “If you don’t like Trump, I think Bloomberg is the best person to get him outta office.”"}, {"url": "https://isthmus.com/events/orchid-escape/", "title": "Orchid Escape", "authors": [], "date": "2020-01-16", "keywords": ["admission", "permanent", "apply", "vendors", "water", "orchid", "conservatory", "orchids", "prices", "escape", "bolz"], "summary": "press release: February 1 - 29 | 10 a.m. - 4 p.m. dailyRegular Conservatory Admission Prices Apply: $2This February, escape to the tropics and take in bountiful, beautiful orchids displayed throughout the Bolz Conservatory!\nThe inaugural Orchid Escape show will feature four scenes, each representing one of the four classical elements: earth, water, air, and fire.\nThe show will incorporate both new orchids special ordered from vendors as well as specimens from the permanent collections.\nOrchid Escape will be held in the Bolz Conservatory from 10 a.m. - 4 p.m. daily throughout February.\nRegular Conservatory admission prices will apply during this time."}, {"url": "https://seminoles.com/womens-basketball-adds-three-transfers/", "title": "Women’s Basketball Adds Three Transfers", "authors": ["Steve Stone"], "date": "2020-04-15", "keywords": ["transfers", "point", "guard", "st", "sophomore", "basketball", "assists", "playing", "adds", "womens", "season", "career", "fsu", "points"], "summary": "TALLAHASSEE, Fla. (Seminoles.com) – Florida State Women’s Basketball has added three quality student-athletes as transfers for the 2020-21 season.\nJoining the Seminoles are graduate point guard Tiana England (St. John’s), rising sophomore guard Sara Bejedi (Arizona State) and rising junior forward Erin Howard (Auburn).\nEngland’s transition to Florida State is an important one as FSU loses All-America point guard Nicki Ekhomu after the Bolingbrook, Ill., finished her four-year career.\nIn her lone playing season with the Sun Devils, Bejedi scored a season-high 16 points vs. New Mexico.\nPoint guard Izabela Nicoletti also looks to return from back-to-back years with injury."}, {"url": "https://isthmus.com/events/Dane-County-Farmers-Market-winter-garver/", "title": "POSTPONED: Dane County Farmers' Market", "authors": [], "date": "2019-10-24", "keywords": ["market", "farmers", "county", "dane", "winter", "products", "postponed", "options", "members", "late", "stay"], "summary": "× Expand The Dane County Farmers' Market continues during the winter at Madison Senior Center.\nA message from DCFM: The Dane County Farmers' Market Late Winter Market is closed until further notice.\nTo facilitate our patrons connecting with our members, we have assembled an up-to-date list of our Late Winter Market vendors and the alternative purchasing options they are making available to the community.\nThe Late Winter Market runs each Saturday from the new year until the beginning of the outdoor season.\nYou will still find many of your favorite Dane County Farmers’ Market members, as well as a full array of fruits and vegetables, cheeses, hyper-local meats, honey, bakery items, and many specialty items."}, {"url": "https://wkow.com/2020/02/12/significant-spike-in-flu-activity-in-madison/", "title": "Significant spike in flu activity in Madison", "authors": ["Jennifer Kliese"], "date": "2020-02-12", "keywords": ["spike", "cases", "influenza", "flu", "health", "risk", "season", "say", "numbers", "significant", "madison", "wisconsin", "activity"], "summary": "MADISON (WKOW) -- Hospitals and clinics are seeing a big uptick in cases of the flu right now in the Madison area.\nAs of Monday, there have been 609 adults treated for the flu at UW Health and 67 hospitalized this flu season.\nFor kids, it's 595 cases and 20 hospitalized, up from 38 cases in the previous flu season.\nWe're continuing to see higher case numbers of influenza,\" said Sarah Hughes, immunization coordinator with Public Health Madison & Dane County.\nThis flu season may be overshadowed this year because of the concerns over coronavirus, with one case diagnosed in Madison."}, {"url": "https://isthmus.com/news/madweek/madweek-02-13-2020/", "title": "Madweek for Feb. 13, 2020", "authors": [], "date": "2020-02-13", "keywords": ["usa", "2020", "13", "media", "madweek", "reserved", "feb", "red", "isthmus", "madison", "rights", "card", "wisconsin"], "summary": "ISTHMUS is © 2020 Red Card Media, Inc. | All rights reserved.\n| Madison, Wisconsin | USA"}, {"url": "https://isthmus.com/news/news/maia-pearson-will-face-christina-gomez-schmidt-april-7/", "title": "Maia Pearson is top vote-getter for school board race", "authors": ["Jenny Peek", "Dianne Carey", "Jeri Casper", "Isthmus", "Madison", "Wisconsin"], "date": "2020-02-19", "keywords": ["school", "maia", "campaign", "board", "schmidt", "continue", "really", "gomez", "shell", "race", "work", "votegetter", "pearson"], "summary": "× Expand Maia Pearson pledges to work \"hard to earn the votes” on April 7, when she'll face Christina Gomez Schmidt.\nMadison voters narrowed down the field for the only contested Madison school board race on Tuesday’s primary ballot.\nAccording to unofficial results from the Dane County Clerk’s Office, Maia Pearson finished first in the race for Seat 6 with about 43 percent of the vote.\nShe will join second-place finisher Christina Gomez Schmidt — who got 32 percent of the vote — on the ballot April 7.\n“We really, really will build stronger schools together,” she said."}, {"url": "https://isthmus.com/events/weekend-wonders-mcm/", "title": "Weekend Wonders", "authors": [], "date": "2019-12-18", "keywords": ["admission", "weekend", "tickets", "saturdays", "museum", "set", "crafts", "wonders", "visiting", "buy", "selfexpression", "skill"], "summary": "press release: On the first and third Saturdays of every month, we rotate a set of crafts that promote self-expression, creative learning, and artistic skill development.\nOn the second and fourth Saturdays, we focus on physics by experimenting with light, gravity, density and other forces.\nMadison Children’s Museum’s drop-in programs are included with museum admission (Free for members, $9 for non-member adults and children ages 1+, see our registration pages for information on discounts or to buy admission tickets).\nYou may buy general admission tickets at the front desk, or save time and order them online.\nTickets are good for visiting on any day the museum is open to the public; and they never expire."}, {"url": "https://isthmus.com/events/kohler-art-50/", "title": "Kohler Art 50", "authors": [], "date": "2020-02-04", "keywords": ["warren", "weeden", "books", "library", "art", "50", "students", "verma", "zhiyue", "kohler", "design", "worthington"], "summary": "press release: January 22 - February 26.\nClosing reception 4-6 pm, 2/26.\nArtists: Abby Meyer, Anjika Verma, Annie Plunkett, Arella Warren, Brianna Bailey, Cassidy Kratochvil, Geneva Kinzer, Genevieve Vahl, Jessica Ni, Kath Oku, Lili Sarajian, Madeleine Freitag, Maria Rantis, Maya Allen, Nicole Golownia, Olivia Bratzke, Paulina Eguino, Rachel Betters, Samantha Dorlack, Sarah Worthington, Savannah Byers, Tiffany Laxton, Vanessa Weeden, Zhiyue DingLocation: Curatorial Lab, Room 232 Conrad A. Elvehjem Building, 800 University Ave.Last fall, students from Henrique Nardi’s Basic Graphic Design class were challenged to create a 50th-anniversary poster for the Kohler Art Library.\nSelecting one of the following areas for design inspiration, African art, artists’ books, Islamic art, pop-up books, or sketchbook facsimiles, ART 346 students created a bold range of posters commemorating 50 years of art library research."}, {"url": "https://isthmus.com/arts/stage/the-color-purple-musical/", "title": "Celie’s journey", "authors": ["Gwendolyn Rice"], "date": "2020-02-19", "keywords": ["cast", "color", "journey", "celie", "world", "purple", "love", "celies", "tony", "voice", "broadway"], "summary": "× Expand Jeremy Daniel Cast members of the touring production of \"The Color Purple.\"\nAlice Walker’s groundbreaking novel The Color Purple has been adapted to many other media, garnering larger audiences with each incarnation.\nThen in 2015, a streamlined version of the show came back to Broadway — cutting out 30 minutes, some of the original songs and several plot points, to focus more on the main character’s journey.\nAfter this long journey of invention and reinvention, the national tour of The Color Purple arrived at Overture Center as part of its Broadway Series.\nFortunately, there are many moments of light that buoy Celie on her journey toward self-assuredness and real love."}, {"url": "https://wkow.com/2020/02/20/downtown-madison-fire-ruled-accidental/", "title": "Downtown Madison fire ruled accidental", "authors": [], "date": "2020-02-20", "keywords": ["downtown", "smoking", "ruled", "building", "north", "wkow", "residential", "broke", "naturethe", "department", "street", "accidental", "madison"], "summary": "MADISON (WKOW) -- Investigators with the Madison Fire Department determined the fire that broke out in a residential building on North Franklin Street earlier this month was accidental in nature.\nThe fire broke out February 6 in a building in the 100 block of North Franklin.\nThe Madison Fire Department says the fire was caused by improperly discarded smoking materials.\nNo one was home at the time and no one was hurt.\nDamage was estimated at around $200,000."}, {"url": "https://wkow.com/2020/02/09/a-look-at-snowfall-totals-and-averages/", "title": "A look at snowfall totals and averages", "authors": ["Katherine Noel"], "date": "2020-02-09", "keywords": ["upper", "inches", "snowfall", "snow", "tonight", "viewing", "totals", "wkow", "look", "fall", "averages", "values", "skies", "wisconsin"], "summary": "MADISON (WKOW) - In SE Wisconsin, anywhere from 3 to 6 inches of snow is expected to fall by tonight.\nHighest snowfall is across central Wisconsin, where 7 to 10 inches of snow is possible.\nAlthough, snow will continue to fall in parts of our viewing area until tonight.\nThis will change the snow report values listed above.\nMONDAYMostly sunny skies, with highs in the upper 30's."}, {"url": "https://isthmus.com/events/weirdsconsin/", "title": "EVENT FULL: Weirdsconsin", "authors": [], "date": "2020-01-29", "keywords": ["registration", "event", "wpipa", "weirdsconsin", "ideas", "academy", "working", "free", "room", "anniversary", "150th", "wisconsin"], "summary": "REGISTRATION IS FULL FOR THIS EVENT!\nThere may be additional unreserved space in the tap room to accommodate walk-ins but we cannot guarantee room for unregistered guests.\nHosted by Wisconsin People & Ideas editor Jason A. Smith, \"Weirdsconsin!\"\n), and a tasting of our 150th anniversary beer brewed for the occasion by Working Draft: WP&IPA (get it?).\nWhile this event is free and open to the public, advance registration is appreciated."}, {"url": "https://isthmus.com/events/dreaming-in-ethnic-melodies/", "title": "Dreaming in Ethnic Melodies", "authors": [], "date": "2019-11-26", "keywords": ["practices", "dreaming", "overture", "conference", "state", "melodies", "sessions", "students", "edgewood", "relevant", "ethnic", "madison", "wisconsin"], "summary": "press release: Edgewood College is honored to host the Dreaming In Ethnic Melodies Black History Education Conference.\nBy popular demand, national educational consultant Dr. Gloria Ladson-Billings will, for the second consecutive year, be the featured keynote speaker.\nThe conference is February 21-22, 2020, at Edgewood College, the Overture Center, the Madison Concourse Hotel, and the Wisconsin Historical Society.\n“As recently reported by the National Assessment of Educational Progress, the performance gap between black and white students continues to widen in the state of Wisconsin,” Tony Garcia, Executive Director of Diversity and Inclusion at Edgewood College, said.\n“Locally here in Madison, we continue to see K-12 and higher education institutions struggle with creating equitable learning opportunities for diverse students."}, {"url": "https://isthmus.com/news/news/feb-18-primary-will-narrow-the-supreme-court-candidate-field-to-two/", "title": "Supreme consequences", "authors": ["Bill Lueders", "Tim Stanek", "Dianne Carey"], "date": "2020-02-06", "keywords": ["justice", "law", "state", "conservative", "supreme", "karofsky", "judge", "consequences", "kelly", "court", "wisconsin"], "summary": "× Expand Supreme Court Justice Daniel Kelly (left) is being challenged by Dane County Judge Jill Karofsky and professor Ed Fallone (right).\nIn the nine contested state Supreme Court races since 2007, outside groups have invested more than $25 million, exceeding the $18 million spent by the candidates’ own campaigns, an analysis of data from Wisconsin Democracy Campaign shows.\nLast year’s Supreme Court election, in which Walker appointee Brian Hagedorn beat liberal-backed challenger Lisa Neubauer, was, at nearly $8.3 million, Wisconsin’s costliest Supreme Court race ever.\nHe notes that many distinguished jurists, including Thurgood Marshall, Ruth Bader Ginsburg and former Wisconsin Justice Shirley Abrahamson, also lacked prior judicial experience.\nElected circuit court judge in 2017."}, {"url": "https://isthmus.com/events/bobby-seale/", "title": "Bobby Seale", "authors": [], "date": "2019-10-22", "keywords": ["seale", "party", "talks", "black", "college", "panther", "movement", "feb", "panthers", "bobby"], "summary": "× Expand Risa StaszewskiMadison College continues its quest to highlight the voices of influential people of color with this lecture by Black Panther Party co-founder Bobby Seale.\nSince the Panthers’ heyday, Seale has continued to inspire, and has spoken at more than 500 colleges.\npress release: Madison College Talks presents an evening with Bobby Seale.\nBobby Seale is an African-American political activist and co-founder and national chairman of the Black Panther Party.\nIn the 1970s, as the Black Panthers faded from public view, Seale took on a quieter role, working toward improving social services in black neighborhoods and other causes."}, {"url": "https://isthmus.com/events/sunday-slam-communication/", "title": "POSTPONED: The Sunday Slam", "authors": [], "date": "2019-11-04", "keywords": ["folks", "lgbtq", "women", "slam", "postponed", "way", "open", "mic", "prioritizes", "welcomed", "comedy"], "summary": "press release: The Sunday Slam Open Mic is a stand-up comedy and storytelling mic that prioritizes women and LGBTQ+ folks.\nFrom veteran comedians all the way to folks that want to try comedy for the first time are encouraged to attend!\nVarying based on attendance, attendees can expect to receive anywhere from 3 to 7 minutes of stage time.\nThe Sunday Slam Open mic is a feminist mic that aims to create an inclusive environment for all, and it prioritizes the safety and security of women, LGBTQ+ folks and POC.\nFolks of all genders are welcomed to attend!"}, {"url": "https://wkow.com/2020/02/17/voting-in-the-spring-primary-what-you-need-to-know/", "title": "Voting in the spring primary: What you need to know", "authors": ["Jessica Porter"], "date": "2020-02-17", "keywords": ["wisconsin", "voting", "spring", "id", "state", "primary", "voters", "website", "polls", "service", "race", "need", "know"], "summary": "UPDATE (WKOW) -- The MyVote Wisconsin website is experiencing problems Tuesday, during spring primary voting.\n-------(WKOW) -- Wisconsin's spring primary is Tuesday.\nA few examples of a photo ID include:Wisconsin driver's licenseWisconsin state IDMilitary IDPassportVoters can also get a state of ID for free.\nIn Wisconsin, the supreme court race is the only statewide race on the ballot.\nMyVote Wisconsin website glitch, officials provide backup service"}, {"url": "https://www.forwardlookout.com/2020/02/city-of-madison-week-ahead-2-17-20/30608", "title": "City of Madison Week Ahead – 2/17/20", "authors": ["Brenda Konkel", "Blogger", "Dabble In Community Radio", "Video", "Activist", "Advocate For People Without Homes", "Local Music Fan", "Active Progressive Dane Member", "Served Years As Alder In District City Of Madison", "Years Executive Director Tenant Resource Center"], "date": "2020-02-15", "keywords": ["ahead", "municipal", "21720", "committee", "luther", "king", "blvd", "week", "city", "jr", "room", "wi", "madison", "martin"], "summary": "4:00 PM Facilities Programs and Fees Subcommittee (Parks) CANCELLED Goodman Maintenance Facility 1402 Wingra Creek Pkwy Madison, WICancelled5:00 PM Landmarks Commission Madison Municipal Bldg 215 Martin Luther King Jr Blvd, Room 153 Madison, WI 537031402 Williamson St – Exterior Alteration in the Third Lake Ridge Hist.\n3:00 PM Integrated Pest Management Policy Review Task Force Madison Municipal Building 215 Martin Luther King Jr. Blvd, Room 202 Madison, WI 53703On the clerk’s agenda twice?\nSPECIAL PRESENTATION: Pesticide Applications for CDA Housing Sites (Liz Yszenga, CDA Housing)Public Input Planning ProcessReview and Recommendations on City IPM PolicySee agenda for meeting materials and long list of “resources”4:00 PM Complete County Committee 215 Martin Luther King Jr. Blvd.\nAlder District #195:00 PM Plan Commission Madison Municipal Bldg 215 Martin Luther King Jr Blvd, Room 153 Madison, WI 537035:00 PM Landlord and Tenant Issues Committee 215 Martin Luther King, Jr. Blvd.\nRoom 022 (Madison Municipal Building)In legistar, no agenda5:00 PM Public Safety Review Committee Madison Municipal Building 211 Martin Luther King Jr. Blvd."}, {"url": "https://isthmus.com/events/ita-division-i-national-mens-team-indoor-championship/", "title": "ITA Division I National Men's Team Indoor Championship", "authors": [], "date": "2020-01-14", "keywords": ["mens", "national", "championship", "tennis", "uw", "indoor", "feb", "teams", "host", "team", "tournament", "division", "ita", "wisconsin"], "summary": "press release: The Wisconsin men's tennis team is proud to host the 2020 Oracle ITA Division I National Men's Team Indoor Championship, Feb. 14-17, at the Nielsen Tennis Stadium.\nThis marks the first time since the 1970s that UW will host to the men's tournament, which features 16 of the top Division I men's tennis teams, including the Badgers.\nWe're going to have the top 15 teams in the country here in Madison to duke it out for a national championship.\"\nUW hosted the first edition of the tournament in 1973 before serving as host again in 1975, 1976, 1977, 1978 and 1979.\nThe teams will then compete in a single-elimination tournament over a four-day span to crown a national indoor champion."}, {"url": "https://www.channel3000.com/43-events-to-see-in-february/", "title": "44 events to see in February February is replete with winter festivals, concerts, stand-up comedy shows and dance and theater productions.", "authors": ["Posted", "Updated"], "date": "2020-02-01", "keywords": ["productions", "shows", "standup", "high", "festivals", "theater", "winter", "noon", "concerts", "music", "comedy", "wisconsin", "union", "dance", "events", "feb", "replete", "saloon", "madison"], "summary": "See her perform at High Noon Saloon.\nFeb. 3Special EventOver seven days, the Wisconsin Union Winter Carnival invites folks to embrace the season in a variety of ways.\nSee Beach Bunny and two other rising Chicago indie groups, Lettering and Dearly Somber, at the High Noon Saloon this month.\nSee this world-renown quartet in the Play Circle of the Wisconsin Union Theater.\nFeb. 28MusicIrish folk musicians Eileen Ivers and Karan Casey team up for performance in Shannon Hall at the Wisconsin Union Theater."}, {"url": "https://wkow.com/2020/02/25/2020-census-recruiting-events/", "title": "2020 Census recruiting events", "authors": [], "date": "2020-02-25", "keywords": ["dane", "2020", "suite", "center", "events", "workers", "washington", "madisonat", "recruiting", "bureau", "census"], "summary": "UPDATE (WKOW) -- The U.S. Census Bureau is still in need of workers to help with the 2020 census.\nOn Friday, those who are interested can attend recruiting events at the following locations:Markee Pioneer Student Center, 1 University Plaza, Plateville 10 a.m. to 3 p.m.Environmental Health in Wisconsin HSLC - UW Madison, 12:30 p.m. to 3 p.m.********(WKOW) -- The nation's population is being counted in 2020 and you can help.\nThe U.S. Census Bureau is recruiting workers in our area right now.\nThe wage depends on the job and where you live.\nTuesday, you have a chance to apply at several hiring events around southern Wisconsin."}, {"url": "https://www.wisconsinwatch.org/2020/02/narrow-margin-announcement/", "title": "Narrow Margin project investigates voter suppression, disinformation ahead of 2020 election", "authors": ["Wisconsin Watch", "More Wisconsin Watch"], "date": "2020-02-17", "keywords": ["disinformation", "2020", "ahead", "class", "suppression", "states", "watch", "margin", "project", "election", "reporting", "voter", "investigative", "investigates", "narrow", "wisconsin"], "summary": "In a newly launched investigation, a UW-Madison investigative reporting class led by Wisconsin Watch Managing Editor Dee J.\nHall is examining voter suppression and disinformation efforts in Wisconsin’s 2020 election.\nWisconsin was a top target of voter suppression, misleading candidate messaging, dark money groups and hacking aimed at disrupting the 2016 election.\nCoburn Dukehart / Wisconsin Watch Wisconsin Watch Managing Editor Dee J.\nThis year’s class is working on Narrow Margin, an investigation focused on voter suppression, disinformation and election security ahead of the 2020 presidential election."}, {"url": "https://isthmus.com/events/family-fun-day-middleton-library/", "title": "Family Fun Day", "authors": [], "date": "2019-12-23", "keywords": ["registration", "family", "space", "style", "release", "day", "fun", "press", "required", "opengym", "limited", "service", "questions"], "summary": "press release: Enjoy open-gym style active games and free-play time.\nRegistration required: space is limited.\nQuestions or comments?\nContact the Service Desk at (608) 827-7402."}, {"url": "https://wkow.com/2020/02/06/lady-liberty-returns-to-lake-mendota/", "title": "Lady Liberty returns to Lake Mendota", "authors": ["Emily Friese"], "date": "2020-02-06", "keywords": ["lady", "winter", "unions", "returns", "statue", "mendota", "varjian", "liberty", "lake", "carnival", "wisconsin"], "summary": "MADISON (WKOW) — For the second year in a row, Lady Liberty is making a comeback to the frozen ice of Lake Mendota.\nThe iconic statue was inflated Thursday as part of The Wisconsin Union's Winter Carnival.\nAfter a successful election, the Pail and Shovel Party stayed true to their Lady Liberty promise by erecting a Styrofoam Lady Liberty head, arm and torch on Lake Mendota Feb. 22, 1979.\nBefore this re-creation of Lady Liberty, the Styrofoam Statue of Liberty was last seen on Lake Mendota in 2010.\nTo learn more about the Winter Carnival, including the full schedule of events and activities, visit union.wisc.edu/wintercarnival."}, {"url": "https://isthmus.com/events/wisconsin-raptors/", "title": "Wisconsin Raptors", "authors": [], "date": "2020-02-12", "keywords": ["woods", "wisconsin", "family", "event", "heritage", "center", "raptor", "lussier", "kestrel", "workshop", "learn", "raptors"], "summary": "× Expand Eastern screech owls from Hoo’s Woods Raptor Center.\nHosted by the Friends of Capital Springs Recreation Area on Saturday, February 22, from 10:30am to 1pm, all activities are indoors at the Lussier Family Heritage Center located at 3101 Lake Farm Road in Madison.\nAt 10:30am, experience live owls and eagles from Hoo’s Woods Raptor Center.\nThis Explore Nature event is sponsored by the Friends of Capital Springs Recreation Area and in partnership with the Lussier Family Heritage Center, Dane County Parks, and Madison Metropolitan Sewerage District.\nIf the event is cancelled due to inclement weather, it will take place on Sunday, February 23, at the Lussier Family Heritage Center."}, {"url": "https://wkow.com/2020/02/19/silver-alert-for-chicago-man-last-seen-in-northeast-wisconsin/", "title": "Missing Chicago man found safe", "authors": [], "date": "2020-02-19", "keywords": ["man", "missing", "iancu", "alert", "blue", "black", "wisconsinpetru", "chicago", "wkow", "whereabouts", "safe", "manitowoc", "wisconsin"], "summary": "UPDATE (WKOW) -- Petru Iancu has been found safe, according to an updated alert from the Wisconsin Department of Justice sent Wednesday.\n(WKOW) -- A statewide Silver Alert has been issued for a Chicago man who was last seen in northeast Wisconsin.\nOfficials said he indicated he was planning on immediately returning to his home in Chicago, but he never arrived.\nHe was wearing brown hiking shoes, black sweatpants with a red stripe, blue jacket, glasses and an ascot hat.\nIf you have information about Iancu's whereabouts you are asking to contact the Manitowoc County Sheriff's Office at (920) 683-4201."}, {"url": "https://mgoblue.com/news/2020/2/16/wrestling-wolverines-drop-big-ten-dual-finale-at-no-12-wisconsin.aspx", "title": "Wolverines Drop Big Ten Dual Finale at No. 12 Wisconsin", "authors": ["Leah Howard"], "date": "2020-02-16", "keywords": ["finale", "second", "drop", "loss", "dual", "decision", "12", "pounds", "michigan", "wolverines", "ranked", "seconds", "matches", "big", "wisconsin", "takedown"], "summary": "12 Wisconsin in its Big Ten dual finale.\nSite: Madison, Wis. (UW Field House)Score: #12 Wisconsin 20, #22 Michigan 12Records: U-M (6-6, 5-4 Big Ten), UW (11-5, 4-5 Big Ten)Next U-M Event: Friday, Feb. 21 -- at Edinboro (Edinboro, Pa.), 7 p.m.MADISON, Wis. -- The No.\n12 Wisconsin in its Big Ten Conference dual finale on Sunday afternoon (Feb. 16) at the UW Field House.\nWith the dual already clinched, the Wolverines closed it out with decision wins at 197 pounds and heavyweight.\nSophomore heavyweight Mason Parris , ranked second nationally, remained unbeaten on the season with a 3-1 decision against fifth-ranked Trent Hillger."}, {"url": "https://www.channel3000.com/best-of-madison-2020-winners/", "title": "Best of Madison 2020 Winners", "authors": ["Posted", "Updated"], "date": "2020-03-19", "keywords": ["pet", "2020", "singer", "vino", "credit", "band", "auto", "bar", "best", "brewing", "madison", "winners"], "summary": "In honor of reaching a new decade, this year’s Best of Madison celebrates the connections between the rip-roaring 1920s and today, the new golden age.\nBest of Madison showcases the best of the best in the city.\nBest of Madison 2020 was presented by The Ho-Chunk Nation and Ho-Chunk Gaming-Wisconsin.\nBe a part of the nomination and voting process for next year’s Best of Madison readers poll.\nWe will be taking nominations for the 2021 Best of Madison from Aug. 1-31 at madisonmagazine.com."}, {"url": "https://spectrumnews1.com/wi/madison/coronavirus/2020/03/23/coronavirus-live-updates--latest-on-covid-19-in-wisconsin", "title": "Coronavirus Live Updates: Latest on COVID-19 in Wisconsin", "authors": ["Published Am Et Mar."], "date": "2020-03-23", "keywords": ["wisconsin", "positive", "milwaukee", "cases", "state", "updates", "latest", "health", "today", "evers", "coronavirus", "live", "covid19"], "summary": "pic.twitter.com/Y3l9hdMNKc — Spectrum News 1 Wisconsin (@SpectrumNews1WI) April 1, 20201:15 pm NOW 16 COVID-19 DEATHS IN MILWAUKEE CO.MCMEO investigating four additional deaths due to complications of coronavirus (COVID-19).\nCONFIRMS FIRST COVID-19 DEATHPublic Health Madison & Dane County is confirming the first Dane County death associated with novel coronavirus infection (COVID-19).\n1:45 pm 457 POSITIVE CASES, 8237 NEGATIVE CASES, 5 DEATHSNEW NUMBERS per @DHSWI: Positive cases jumped from 416 at this time Monday to 457 today.\n10:50 am FEES WAIVED FOR WISCONSIN STATE PARKS & TRAILS☀️ Entrance fees at all Wisconsin State Parks and Trails are WAIVED.\nAccording to Milwaukee Co. Office of Emergency Management, most of the positive #COVID19 cases are located in Milwaukee's north side."}, {"url": "https://isthmus.com/opinion/feedback/feedback-03-19-2020/", "title": "Feedback for Mar. 19, 2020", "authors": ["Betsey Day"], "date": "2020-03-19", "keywords": ["african", "2020", "feedback", "guy", "worker", "hmong", "solely", "person", "american", "right", "mar", "search", "19", "skin"], "summary": "ExpectationsRe: “We the Undercounted” (3/12/2020): Peng Her of the Hmong Institute says that “you cannot send Caucasians with clipboards…into neighborhoods that are majority Latinx, Hmong or African American and expect the doors to open.”This sounds pretty racist to me.\nHe is implying that the Latinx or Hmong person in the house (where the census worker appears) has a perfect right to not admit that worker, based solely on the basis of his or her skin color.\nDuring the public input process I suggested to MMSD that they limit the search to the four states (Mississippi, Alabama, New Jersey, Massachusetts) where African American fourth-graders read more than a year ahead of their Wisconsin counterparts.\nThat’s how we would handle a search if it were sports.\nIt turns out he was leaving under a cloud of suspicion over some funky finances where he refused to release the results of an audit!"}, {"url": "https://www.channel3000.com/stretched-thin-already-wisconsin-nurses-prepare-for-coronavirus-storm/", "title": "Stretched thin already, Wisconsin nurses prepare for coronavirus ‘storm’", "authors": ["Posted", "Updated"], "date": "2020-03-21", "keywords": ["marys", "prepare", "hospital", "storm", "health", "nurses", "stretched", "hospitals", "coronavirus", "virus", "nurse", "patients", "covid19", "wisconsin"], "summary": "“We’re short on a good day,” one St. Mary’s nurse said.\nSt. Mary’s nurses are broadly told to stay at home if exposed to a confirmed COVID-19 patient without protection.\nSt. Mary’s nurses say they previously accrued a pool of paid time off called the “Earned Medical Benefit,” allowing them time to take care of themselves or family members.\nSt. Mary’s nurses also expressed fears of a mask shortage.\nSt. Mary’s nurse Laura Vowels said Friday she was told her unit had had one month of protective equipment left, which she found reassuring."}, {"url": "https://www.twincities.com/2020/04/07/daughters-boyfriend-charged-with-killing-doctor-husband-in-university-of-wisconsin-arboretum/", "title": "Daughter’s boyfriend charged with killing doctor, husband in University of Wisconsin arboretum", "authors": ["The Associated Press"], "date": "2020-04-07", "keywords": ["victims", "daughters", "university", "friend", "charged", "told", "boyfriend", "potter", "daughter", "husband", "sanford", "complaint", "classmate", "killing", "wisconsin", "arboretum", "doctor", "larrue", "madison"], "summary": "MADISON, Wis. — Prosecutors on Tuesday charged a teenager with fatally shooting a University of Wisconsin physician and her husband, who were the parents of his girlfriend, and leaving their bodies at the school’s arboretum.\nKhari Sanford, 18, was charged with two counts of party to the crime of first-degree intentional homicide, use of a dangerous weapon.\nAccording to the criminal complaint, Sanford’s girlfriend was the daughter of the victims, Dr. Beth Potter, 52, and her husband, 57-year-old Robin Carre.\nJoggers found the victims at the arboretum, a research and popular recreational area, near the Madison campus on March 31.\nWhen police interviewed the victims’ daughter, she told them she was with Sanford the night of the killings and that neither one had left their rental home."}, {"url": "https://isthmus.com/news/news/dragging-their-feet/", "title": "‘Dragging their feet'", "authors": ["Dylan Brogan"], "date": "2020-03-31", "keywords": ["federal", "wrote", "state", "health", "aid", "evers", "feet", "lawmakers", "vos", "legislative", "department", "dragging"], "summary": "Tony Ever's proposed $700 million state aid package in response to the coronavirus pandemic.\nAssembly Speaker Robin Vos (R-Rochester) told Wisconsin Public Radio on March 26 that “it would be a mistake” for state lawmakers to act before the unprecedented $2.2 trillion federal aid package was passed.\nPresident Donald Trump signed the federal CARES Act the next day, which the state Legislative Fiscal Bureau estimates will bring $2.2 billion in financial aid to the state.\n“They are dragging their feet.\nEvers is asking lawmakers to approve $100 million in grants to health care providers and boost state aid to local governments by one percent."}, {"url": "https://www.forwardlookout.com/2020/03/round-up-3-17-20/31224", "title": "Round Up – 3/17/20 ( EXTREMELY UPDATED!)", "authors": ["Brenda Konkel", "Blogger", "Dabble In Community Radio", "Video", "Activist", "Advocate For People Without Homes", "Local Music Fan", "Active Progressive Dane Member", "Served Years As Alder In District City Of Madison", "Years Executive Director Tenant Resource Center"], "date": "2020-03-17", "keywords": ["county", "available", "meetings", "31720", "health", "city", "working", "updated", "staff", "extremely", "public", "round", "madison", "services"], "summary": "This information will be updated as we learn more:Dane County Department of Human Services Available Services**All DCDHS Offices are closed to the public until further notice.\nChild Protective Services staff will respond to these calls 24 hours per day, 7 days per week.\nHygiene supplies should be provided in all meeting rooms, and attendance lists should be maintained to help Public Health conduct contact-tracing if needed.\nFor non-essential meetings, staff should use discretion to determine whether to cancel or hold meetings via teleconference.\nIt is not only a moral imperative that Congress provide for their needs, but also an urgent public health necessity."}, {"url": "https://isthmus.com/news/cover-story/covid-19-is-in-dane-county-and-changing-life-in-dramatic-ways/", "title": "The new normal - Isthmus", "authors": ["Isthmus Staff"], "date": "2020-03-18", "keywords": ["restaurants", "writer", "note", "local", "cover", "talks", "arts", "isthmus", "looks", "editor", "covid19", "normal"], "summary": "Theaters and arts venues are dark, libraries are shuttered, programs everywhere are canceled, and restaurants are closed for in-house dining.\nWe also scrapped our planned cover story to focus exclusively on how COVID-19 is affecting our community.\nEditor Judith Davidoff looks at how an especially vulnerable population — people experiencing homelessness — is faring and what is being done to address high-risk populations in shelters.\nIsthmus co-owner Craig Bartlett shares some heartbreak and hope in a guest column and Andrew Cohen offers ways to continue exercising — solo.\nCrisis modeHomeless in a pandemicLather, rinse, reprogramEditor's note: Developments relating to COVID-19 are evolving quickly."}, {"url": "https://www.forwardlookout.com/2020/03/city-of-madison-week-ahead-3-23-20/31293", "title": "City of Madison Week Ahead – 3/23/20", "authors": ["Brenda Konkel", "Blogger", "Dabble In Community Radio", "Video", "Activist", "Advocate For People Without Homes", "Local Music Fan", "Active Progressive Dane Member", "Served Years As Alder In District City Of Madison", "Years Executive Director Tenant Resource Center"], "date": "2020-03-20", "keywords": ["district", "meetings", "2020", "ahead", "32320", "week", "city", "sewerage", "wins", "street", "madison", "yahara"], "summary": "These are the meetings that were posted at close of business on Friday in legistar and may change throughout the week.\nI do my best to update through Mo’ Meetings on the home page throughout the week if I’m aware of changes.\nHere is the guide to how I put the city week ahead together.\nMonday, March 23, 20204:30 pm Finance Committee Madison Municipal Building 215 Martin Luther King, Jr. Blvd, Room 215 Madison, WI 53703Tuesday, March 24, 20201:30 pm Madison Metropolitan Sewerage District Yahara WINs Group Held Virtually (see agenda for more information) Madison, WIExecutive Committee updatea. Yahara WINS Financial Summaryb.\nPast Action Reporta. Yahara WINS Financial Summary b."}, {"url": "https://isthmus.com/food-drink/reinventing-the-restaurant/", "title": "Reinventing the restaurant", "authors": ["Linda Falkenstein"], "date": "2020-03-19", "keywords": ["restaurants", "delivery", "curbside", "harvest", "takeout", "restaurant", "meals", "reinventing", "plenty", "customers", "pickup"], "summary": "By lunchtime on Monday, the restaurant had just three or four tables filled and a few customers at the bar.\n“Saturday was good until about 7 or 8 p.m. Sunday was down.” At 12:45 p.m. on Monday, the restaurant had served about 30 customers.\nOthers, like the Food Fight group, were already trying curbside pickup, takeout and delivery only.\nEven so, it was reported on March 17 that the restaurant group, which has 21 restaurants, would be furloughing 750 employees.\nThe Tin Fox’s menu is also available for takeout, curbside pickup and delivery Tuesday through Saturday."}, {"url": "https://www.forwardlookout.com/2020/03/madison-mayor-declared-a-state-of-emergency/31391", "title": "Madison Mayor Declared a State of Emergency", "authors": ["Brenda Konkel", "Blogger", "Dabble In Community Radio", "Video", "Activist", "Advocate For People Without Homes", "Local Music Fan", "Active Progressive Dane Member", "Served Years As Alder In District City Of Madison", "Years Executive Director Tenant Resource Center"], "date": "2020-03-26", "keywords": ["common", "council", "state", "health", "mayor", "city", "proclamation", "public", "madison", "declared", "emergency"], "summary": "It was a couple days ago that the Madison Mayor declared a state of emergency and I never heard about it, can’t find the order and it wasn’t in the news.\nThe Mayor also signed an emergency proclamation which will require some Council action at the 3/31 Council meeting.\nLETTER TO COMMON COUNCILMemo re proclamation 3.23.2020To: Madison Common Council From: Mayor Rhodes-Conway March 23, 2020I am today issuing an Emergency Proclamation.\n3.19, to proclaim that a state of emergency exists and to invoke the emergency powers granted by ordinance and state statute,NOW, THEREFORE, BE IT PROCLAIMED BY THE MAYOR OF MADISON, DANE COUNTY, WISCONSIN:That a state of emergency is hereby declared for the City of Madison pursuant to Wis. Stats.\nThis proclamation of emergency activates the City of Madison emergency operations plan."}, {"url": "https://www.channel3000.com/wiscnosin-state-parks-and-trails-to-remain-open-to-public-during-coronavirus-pandemic/", "title": "Wisconsin state park, trails to remain open to public during coronavirus pandemic", "authors": ["Posted", "Updated"], "date": "2020-03-20", "keywords": ["park", "pandemic", "state", "release", "health", "remain", "open", "parks", "coronavirus", "public", "dnr", "trails", "wisconsin"], "summary": "Wisconsin state park, trails to remain open to public during coronavirus pandemicStephanie Fryer by Stephanie FryerMADISON, Wis. — Wisconsin State Parks and Trails will remain open to the public during the coronavirus pandemic.\nGetting outdoors can also help relieve stress, especially during this public health emergency.\nBathrooms will remain open, the release said.\n✔️ Wisconsin state parks and trails are open to the public.\n✔️ Admission to state parks and trails is voluntary at this time."}, {"url": "https://isthmus.com/arts/books/we-ride-upon-sticks-novel-amy-quan-barry/", "title": "Magical season", "authors": ["Jane Burns"], "date": "2020-03-23", "keywords": ["magical", "book", "hockey", "high", "team", "girls", "season", "barry", "spinach", "field", "school"], "summary": "That’s because her rollicking story of a girls’ high school field hockey team’s 1989 season isn’t just about big hair and teenage angst.\n“Hopefully because the book is fun, people will see the social criticism but not think they’re being preached to.”We Ride Upon Sticks tells the story of, literally, a magical season for the Danvers (Massachusetts) High School field hockey team.\nThe Falcons (in the book) had always been a struggling, hard-luck squad but a whopping two victories the season before and some strange happenings at a summer field hockey camp give the team hope that the forthcoming season could be different.\nShe grew up in Danvers and played field hockey, which is popular for girls and college women on the East Coast.\nFor now, she’s immersed in witchcraft, field hockey and the world of the 1980s."}, {"url": "https://www.wisfarmer.com/story/money/wis-farmer/2020/03/18/auction-calendar-march-20-2020/5055768002/", "title": "Auction calendar: March 20, 2020", "authors": ["Wisconsin State Farmer", "Published A.M. Ct March"], "date": "2020-03-18", "keywords": ["sale", "tractors", "20", "2020", "visit", "wi", "calendar", "farm", "complete", "auction", "equipment", "consignment", "conducted"], "summary": "FRIDAY, MARCH 20Stoughton, WI11:00 AM – Moe & Sons Auction: Auction held at 1680 Williams Drive, Stoughton WI 53589.\n- Large Farm Machinery Auction – St. Anne Consignment Auction and Equipment Sales – now taking consignments for our spring auction – Marvin Stege Estate already consigned – www.stanneconsignments.com sale conducted by St Anne.\nOnlineSpring 2020 Construction, Heavy Equipment Consignment Auction & Spring 2020 Farm Consignment Auction - Huge selection.\n**Online OnlyOnline Equipment Auction - lots begin closing - Monday, March 30th at 6:00PM - Inspection: Friday March 20 - Monday March 30, Weekdays 8AM – 5PM.\n10:00 AM – Spring Consignment Auction – W9663 CTH S. - area’s largest, longest running auction is now accepting consignments of tractors, farm equipment, industrial equipment and more!"}, {"url": "https://www.wisconsinwatch.org/2020/03/wisconsin-covid-19-update-3-30-20/", "title": "Resilient Wisconsin: Health care workers on the front lines — 3/30/20", "authors": ["Wisconsin Watch", "More Wisconsin Watch"], "date": "2020-03-30", "keywords": ["pandemic", "milwaukee", "resilient", "workers", "health", "lines", "help", "journal", "33020", "virus", "covid19", "coronavirus", "care", "wisconsin"], "summary": "You can read all of our coronavirus/COVID-19 coverage by signing up for our Wisconsin COVID-19 Update newsletter, and please consider becoming a member to support our nonprofit journalism.\nCartoon by Steve Benson of Creators SyndicateThe COVID-19 pandemic resembles a war in many respects.\nIt captures the spirit of a nation at war against a virus, with health care workers fighting on the front lines.\nThey are our health care workers — putting it all on the line for us during this ravaging, relentless and spreading war against the coronavirus.\nHe examines ways to help feed the hungry, help elderly and disabled people, house the homeless, care for children and support health care workers during the pandemic."}, {"url": "https://wisconsinexaminer.com/2020/03/18/take-a-stand-against-fatally-flawed-marsys-law/", "title": "Take a stand against fatally flawed Marsy’s Law", "authors": ["Prior To Joining The Democracy Campaign At The Start Of", "Matt Worked At The Progressive Magazine For Years. For Most Of Those", "He Was The Editor", "Publisher Of The Progressive."], "date": "2020-03-18", "keywords": ["flawed", "victims", "stand", "marsys", "amendment", "law", "north", "sessions", "fatally", "dakota", "blue", "rights", "wisconsin"], "summary": "Now while that might sound good, this amendment, which goes by the name Marsy’s Law, is fatally flawed.\nAnd in North Dakota, a big corporation — Blue Cross Blue Shield of North Dakota — claimed to be a victim under Marsy’s Law.\nFinally, I oppose Marsy’s Law because an out-of-state billionaire should not be able to buy an amendment to our state constitution.\nHere in Wisconsin, Nicholas’s group has given $537,000 in loans to the political action committee of Marsy’s Law for Wisconsin.\nThe lobbying by Marsy’s Law for Wisconsin has paid off, as it has already passed those two consecutive sessions."}, {"url": "https://wausaupilotandreview.com/2020/03/20/wausau-area-obituaries-march-20-2020/", "title": "Wausau area obituaries, March 20, 2020", "authors": [], "date": "2020-03-20", "keywords": ["garske", "wausau", "family", "loved", "20", "2020", "laura", "survived", "wagner", "dennis", "obituaries", "area", "service", "wisconsin"], "summary": "Obituaries are a service of Brainard Funeral Home, with locations in Wausau and Weston.\nDennis WolfeDennis Wolfe, 71, of Wausau died unexpectedly March 15, 2020, at Ascension Saint Clare’s Hospital surrounded by his family.\nDennis loved going to his camper up at Walleye Lodge with his brothers to fish.\nIn lieu of flowers, please consider making a donation to Dennis’ family.\nLaura loved the water, boating, fishing and her many furry friends, both dogs and cats."}, {"url": "https://forextv.com/top-news/ratelinx-named-in-the-march-2020-gartner-midmarket-context-magic-quadrant-for-transportation-management-systems/", "title": "RateLinx Named in the March 2020 Gartner Midmarket Context: Magic Quadrant for Transportation Management Systems", "authors": [], "date": "2020-04-16", "keywords": ["market", "quadrant", "supply", "tms", "ratelinx", "logistics", "research", "midmarket", "magic", "management", "systems", "context", "named", "transportation", "visibility", "gartner"], "summary": "Industry-leading logistics data platform named againMADISON, Wis., April 16, 2020 (GLOBE NEWSWIRE) — Gartner, the world’s leading research and advisory company, recently named RateLinx’s ShipLinx TMS in their latest Midmarket Context: Magic Quadrant for Transportation Management Systems again.\nRateLinx was named in this Magic Quadrant Perspective as one of 11 notable vendors.\nWe are proud to help organizations reduce costs within the entire logistics cycle.”RateLinx was previously named in the February 2020 Gartner Market Guides for Real-Time Visibility Providers and the December 2019 Gartner Market Guide for Freight Audit and Payment Providers.\nGartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact.\nThe RateLinx ecosystem is designed to reduce logistics costs and optimize operations, providing companies with shipment management, supply chain visibility, and financial settlement solutions."}, {"url": "https://www.wisconsinwatch.org/2020/03/wisconsin-covid-19-update-3-23-20/", "title": "What to know about Wisconsin’s stay-at-home order — 3/23/20", "authors": ["Wisconsin Watch", "More Wisconsin Watch"], "date": "2020-03-23", "keywords": ["wisconsin", "sentinel", "milwaukee", "state", "32320", "stayathome", "evers", "journal", "wisconsinites", "coronavirus", "order", "tony", "covid19", "wisconsins", "know"], "summary": "You can read all of our coronavirus/COVID-19 coverage by signing up for our Wisconsin COVID-19 Update newsletter, and please consider becoming a member to support our nonprofit journalism.\nOf note: Today we highlight a story by Patrick Marley and Molly Beck of the Milwaukee Journal Sentinel.\nTony Evers’ announced he would issue Tuesday to slow the spread of COVID-19.\nTop StoriesJohn Hart / Wisconsin State Journal Robert Kirchdoerfer, an assistant professor of biochemistry at UW-Madison, uses flasks of moth cells to grow proteins from coronaviruses like the new pandemic strain.\npic.twitter.com/K7QT4FY8jW — Jason Joyce (@jjoyce) March 23, 2020Access to some stories listed in the Wisconsin COVID-19 Update may be limited to subscribers of the news organizations that produced them."}, {"url": "https://www.wisconsinwatch.org/2020/03/wisconsin-covid-19-update-3-26-20/", "title": "Wisconsinites beware: Scammers are preying on pandemic fears — 3/26/20", "authors": ["Wisconsin Watch", "More Wisconsin Watch"], "date": "2020-03-26", "keywords": ["pandemic", "sentinel", "milwaukee", "possible", "scammers", "health", "preying", "watch", "journal", "wisconsinites", "32620", "coronavirus", "help", "covid19", "beware", "fears", "wisconsin"], "summary": "Wisconsin Watch is a nonprofit newsroom that focuses on government integrity and quality of life issues, and we always provide our news for free.\nYou can read all of our coronavirus/COVID-19 coverage by signing up for our Wisconsin COVID-19 Update newsletter, and please consider becoming a member to support our nonprofit journalism.\nOf note: Today we highlight a story by FairWarning, with additional reporting from Wisconsin Watch.\nFairWarning’s Alexandra Tempus, a former Wisconsin Watch intern, details how fraudsters are preying on people’s fears, anxiety and confusion to execute a range of schemes, including stealing identities and selling bogus cures.\nThe Milwaukee Journal Sentinel later reported that the virus had killed two additional Milwaukee County residents."}, {"url": "https://isthmus.com/music/all-about-that-bass/", "title": "All about that bass", "authors": ["Andy Moore"], "date": "2020-03-25", "keywords": ["bass", "playing", "technique", "solo", "music", "cohen", "performing", "amplified", "court", "sound"], "summary": "The 32-year-old Cohen has mastered the six-string bass, and “Frostbite” is a mesmerizing showcase of his ability to play chords, melody, bass lines and percussion all at once.\nThe other difference was that Cohen “just plugged in and played.” Cohen kept it simple, just playing his bass through his amp instead of performing through an array of pedals and loops.\nThis is the sound of the bass.”Born outside of Toronto, Cohen started playing bass at the age of 12.\nThe court will hear Cohen’s appeal of a $180 citation he received last year for playing amplified bass while busking at the midweek farmers’ market downtown.\nAnd I very much intend to keep playing electric bass to do it.”“So I talked to Officer Brown; he’s a really nice guy."}, {"url": "https://www.wisconsinwatch.org/2020/03/wisconsin-covid-19-update-3-25-20/", "title": "Physician assistants say state regulations limit their pandemic response — 3/25/20", "authors": ["Wisconsin Watch", "More Wisconsin Watch"], "date": "2020-03-25", "keywords": ["pandemic", "response", "limit", "milwaukee", "tony", "state", "physician", "32520", "health", "watch", "journal", "say", "assistants", "teachers", "bay", "regulations", "covid19", "wisconsin"], "summary": "Wisconsin Watch is a nonprofit newsroom that focuses on government integrity and quality of life issues, and we always provide our news for free.\nYou can read all of our coronavirus/COVID-19 coverage by signing up for our Wisconsin COVID-19 Update newsletter, and please consider becoming a member to support our nonprofit journalism.\nBram Sable-Smith, a WPR fellow embedded in the Wisconsin Watch newsroom, reports that physician assistants in the state are calling on Gov.\nTony Evers to relax regulations that they say are preventing them from fully responding to the COVID-19 pandemic.\nShe was citing research from Harvard University and Imperial College London, the Milwaukee Journal Sentinel reported."}, {"url": "https://www.chicagotribune.com/coronavirus/ct-nw-wisconsin-coronavirus-travel-gathering-restrictions-20200325-tmrmlifqyva6zijcvqlc3stkfm-story.html", "title": "Amid new coronavirus death warning, Wisconsin Gov. Tony Evers clamps down on nonessential businesses, travel", "authors": ["Scott Bauer"], "date": "2020-03-25", "keywords": ["limit", "state", "gov", "nonessential", "coronavirus", "warning", "services", "tony", "secretary", "hospital", "spread", "death", "wisconsin", "models", "evers", "clamps", "travel", "virus", "number", "palm"], "summary": "Without changes to limit the spread of COVID-19, models show that between 440 and 1,500 people in the state could die and more than 22,000 would contract the virus by April 8, exceeding the number of hospital beds in the state, said state Department of Health Services Secretary Andrea Palm."}, {"url": "https://isthmus.com/events/tim-miller/", "title": "Tim Miller", "authors": [], "date": "2020-03-02", "keywords": ["theatre", "yale", "center", "workshop", "writing", "art", "tim", "university", "department", "program", "body", "miller"], "summary": "Tim Miller is an internationally acclaimed performance artist and gay rights activist.\nHe has performed in such venues as the Yale Repertory Theatre, the Institute of Contemporary Art in London, the Walker Art Center in Minneapolis, and the Brooklyn Academy of Music.\nHe is the author of A BODY IN THE O, BODY BLOWS, and 1001 BEDS.\nPerformer's website: http://www.timmillerperformer.com/Miller's visit is cosponsored by the University of Wisconsin-Madison Interdisciplinary Theatre Studies Program, Department of English, Department of Theatre and Drama, UW Creative Writing Program, Art Department, Center for Visual Cultures, The Gender and Sexuality Campus Center, The Studio, The Mellon-Borghesi Care Workshop, and the University of Wisconsin Press.\nFor more information, email mary.trotter@wisc.edu"}, {"url": "https://www.channel3000.com/45-must-attend-march-events-in-madison/", "title": "45 must-attend March events in Madison", "authors": ["Posted", "Updated"], "date": "2020-03-02", "keywords": ["theatre", "sylvee", "overture", "45", "center", "events", "mustattend", "high", "live", "saloon", "madison", "comedy", "performance"], "summary": "45 must-attend March events in MadisonThere's music, theater, dance and comedy galoreHenry Michaels by Henry MichaelsBritish-American classic rock band Foreigner plays its radio hits on March 15 at The Sylvee.\nMarch 4Special EventChildren’s entertainer and educator Blippi brings his energetic live performance to the Orpheum Theater for a night of singing and dancing.\n6Special EventViolinist Blake Pouliot joins the Madison Symphony Orchestra to play Mendelssohn’s Violin Concerto at Overture Center.\nMarch 7Special EventThe world renowned Trinity Irish Dancers skip and tap their way onto to the Kids of the Rotunda Stage at the Overture Center.\nMarch 13TheaterThe Children’s Theater of Madison brings the cherished fairytale “Peter Pan” to the Capitol Theater at the Overture Center."}, {"url": "https://www.wisconsinwatch.org/2020/03/diabetes-during-coronavirus-pandemic/", "title": "Have diabetes? Here’s what you should know during the coronavirus pandemic", "authors": ["Bram Sable-Smith", "More Bram"], "date": "2020-03-18", "keywords": ["insulin", "pandemic", "supply", "dont", "risk", "outcomes", "coronavirus", "diabetes", "virus", "children", "patients", "heres", "know"], "summary": "There’s a lot we just don’t know.\nDavis: Globally, we know diabetes patients are more susceptible to infections and tend to have more severe outcomes during other viral infections and outbreaks.\nIn addition — especially with Type 2 diabetes — diabetes comes along with multiple other medical problems, including heart disease and high blood pressure.\nDavis: We don’t know the answer to that question for this particular illness.\nSo I don’t know that we need to panic about not having a 90-day supply."}, {"url": "https://isthmus.com/events/space-force-forbidden-isthmus/", "title": "CANCELED: Space Force: Forbidden Isthmus", "authors": [], "date": "2020-02-18", "keywords": ["canceled", "theatre", "director", "writer", "ensemble", "space", "forbidden", "force", "lafayette", "madisons", "isthmus", "theater", "madison", "delicious", "geoff"], "summary": "In 2012, Doug was a member of the original Are We Delicious ensemble.\nShe started her own production company, Madison Theater Collective, which has produced various theatrical productions in Madison.\nIn Madison, she's worked with Forward Theater, Children's Theater of Madison, TheatreLila, Strollers, Madison Theatre Guild, Mercury Players, Bricks Theater, UW Madison's Theater Department and of course, Are We Delicious?\nHer full resume can be found at Clarice LafayetteGeoffrey Lafayette is Master Craftsperson who owns the remodeling firm Geoff Lafayette Builder, LLC.\nSince coming back to Madison, Gina has worked with Mercury Players Theatre, Madison Theatre Guild, Strollers, Stage Q, Theatre Lila, Broom Street Theater, Whoopensocker, and various other companies."}, {"url": "https://isthmus.com/events/peter-pan-ctm/", "title": "CANCELED: Peter Pan", "authors": [], "date": "2019-08-29", "keywords": ["canceled", "guests", "pan", "overture", "tickets", "used", "health", "ticket", "original", "peter", "theater", "refund", "madison"], "summary": "Barrie’s tale of the Darling children flying to Neverland, a magical fairy named Tinkerbell, a scheming pirate named Captain Hook (played by local favorite Marcus Truschinski) and the champion of childhood, Peter Pan.\npress release: Public Health Madison & Dane County issued a countywide directive “to stop mass gatherings of 250 or more people to mitigate the spread of COVID-19, effective at 5:00 pm on Friday, March 13.\nFor all performances through April 13, guests who paid for their tickets with cash or check will receive a refund check via mail.\nOur resident organizations are Bach Dancing and Dynamite Society, Children’s Theater of Madison, Forward Theater Company, Kanopy Dance Company, Li Chiao-Ping Dance, Madison Ballet, Madison Opera, Madison Symphony Orchestra, James Watrous Gallery and Wisconsin Chamber Orchestra.\nChildren's Theater of Madison, 2 & 7 pm on 3/14 & 21, 3 pm on 3/15, 7 pm on 3/20 and 2 pm, 3/22, Overture Center-Capitol Theater."}, {"url": "https://isthmus.com/news/news/coronavirus-impacts-arts-events/", "title": "Canceled!", "authors": ["Michael Muckian"], "date": "2020-03-12", "keywords": ["canceled", "orchestra", "concerts", "scheduled", "events", "spokesperson", "performances", "season", "madison", "cancelling", "wisconsin"], "summary": "Tony Evers’ March 12 declaration of a state of emergency, Wisconsin’s Department of Health secretary advised cancelling events of more than 250 people.\nGroups large and small have announced cancellations in the past 24 hours, while others have embraced a wait-and-see attitude.\nMeanwhile, venues have done everything from posting hygiene notices in theater restrooms to cancelling concerts and performances outright.\nThe Madison Museum of Contemporary Art has canceled its March 13 reception and artists talk for its exhibit Uncommon Accumulation: The Mark and Judy Bednar Collection of Chicago Imagism, as well as all other weekend events.\nOverture Center for the Arts has no plans to cancel any of its scheduled performances, according to a notice on its website posted on March 12."}, {"url": "https://isthmus.com/news/cover-story/transcending-distrust-to-achieve-a-complete-census/", "title": "We the undercounted - Isthmus", "authors": ["Victoria Davis", "Dianne Carey"], "date": "2020-03-12", "keywords": ["african", "undercounted", "hmong", "members", "city", "communities", "community", "outreach", "isthmus", "census", "madison", "santana"], "summary": "Zion Baptist Church kick off census outreach efforts to members of the African American community.\nIn 2012, the Census Bureau estimated that two percent of African Americans were undercounted during the 2010 Census, and more than 10 in every 100 black men were undercounted.\nTony Evers tried to direct $1 million in his last budget to state census outreach efforts, but the Republican-controlled budget committee failed to act on the funding, effectively killing it.\nBut the Hmong institute, partnering with other Hmong community members like Sheesenpooyw Moua at Freedom Inc, are making efforts to ensure as many Hmong are counted this year as possible.\nThese spaces are meant to benefit people who are homeless as well as undercounted minority groups."}, {"url": "https://isthmus.com/events/comedy-at-the-cabaret-mar-12/", "title": "Comedy at the Cabaret", "authors": [], "date": "2020-03-04", "keywords": ["allie", "miss", "months", "comics", "vickie", "music", "standup", "showcase", "wont", "comedy", "cabaret"], "summary": "× Expand Allie Lindsaypress release: Lovable local comic, Allie Lindsay, produces and hosts this fantastic stand-up comedy showcase at the sexy North Street Cabaret, which highlights the most talented comics in the Midwest, and beyond!\nPaired with original music by the multi-talented comic and musician, Jake Snell, this is easily the hottest comedy showcase on the east side!\nLast month's show was another great success, and this month's show is going to be equally incredible!\nYou won't want to miss this tight showcase of rad, hilarious women!\nFEATURING:Stephanie Wolf, Olivia Witt, Shauna Jungdahl, Melody Kate, Sarah Schmidt & headliner Vickie LynnDOORS at 7/Show at 8$5 CASH at DOOR (the bar takes cards for drink purchases)You won't want to miss this incomparable night of music and comedy!!"}, {"url": "https://isthmus.com/events/bikeorama/", "title": "BikeORama", "authors": [], "date": "2020-02-18", "keywords": ["symptoms", "bikeorama", "contact", "exhibiting", "attend", "th", "prices", "test", "staff", "minimize"], "summary": "If you are planning to travel from a state with more than 10 active coronavirus cases, please do not attend Bike-O-Rama.\nIf you are exhibiting symptoms associated with COVID-19, or have been in close contact with anyone exhibiting symptoms within the last 14 days, please do not attend Bike-O-Rama.\nIf we all follow these guidelines, Bike-O-Rama can continue to be a safe and fun event.\n-The Bike-O-Rama StaffYou can comparison shop, test ride, buy, and accessorize from all 2020 bicycle brands in one place!\nJoin us for Bikeorama in 2020:Friday, March 13 th Noon - 9pmNoon - 9pm Saturday, March 14 th 8am - 9pm8am - 9pm Sunday, March 15th 10am - 6pmBicycle company sales reps will be showing their 2020 lines at the lowest prices of the year!"}, {"url": "https://isthmus.com/events/cave-after-dark-hooley/", "title": "Cave After Dark", "authors": [], "date": "2020-01-22", "keywords": ["available", "visitor", "beer", "special", "center", "weekendan", "events", "hours", "wine", "cave", "dark"], "summary": "press release: Celebrate St. Patrick’s Day weekendAn exclusive, after hours cave experienceIrish beer tastingsA true hooley in the hollows with live Irish music in the cave.\nA special souvenir photo taken inside the cave and available for purchaseMusic by O’Darby, Happenstance, Súgradh.\nA special gemstone mining bag with “gold” treasures and other gemstonesA selection of light Ireland-inspired hors d’oeuvres in the Visitor CenterWisconsin wine, craft beer, specialty cocktails as well as cheese and sausage trays available for purchase at the Visitor Center BarCave After Dark is a popular series of themed events for adults 21 and older at Cave of the Mounds – National Natural Landmark.\nEach event includes a unique at-your-own-pace after hours cave experience and theme-related reception in our Visitor Center with cash bar.\nSpace is limited and these events sell out, so reservations are required."}, {"url": "https://wkow.com/2020/02/29/demonstrators-march-to-truax-field-gates-against-f-35s-in-madison/", "title": "Demonstrators march to Truax Field gates against F-35s in Madison", "authors": ["Francisco Almenara"], "date": "2020-02-29", "keywords": ["gates", "council", "choice", "water", "jets", "demonstrators", "protesters", "clean", "truax", "air", "field", "madison", "f35s"], "summary": "MADISON (WKOW) -- For the first time since military officials announced Madison was in the running to house F-35s, protesters took their message to the front gates of Truax Field.\nMadison is the top choice for a future home of F-35 fighter jets, but protesters came with a simple message.\nFor more than a year, Safe Skies Clean Water Wisconsin has been a vocal group of opponents to the bed down of the F-35s in Madison.\n\"This is a worst case scenario type of approach that the Air Force takes whenever they do an environmental survey,\" Mike Moore with the Badger Air Council said.\n\"If I lived in that area I would be concerned about my family having clean air and clean drinking water,\" Moore said."}, {"url": "https://isthmus.com/events/Dane-County-Farmers-Market-winter-garver/", "title": "POSTPONED: Dane County Farmers' Market", "authors": [], "date": "2019-10-24", "keywords": ["market", "farmers", "county", "dane", "winter", "products", "postponed", "options", "members", "late", "stay"], "summary": "× Expand The Dane County Farmers' Market continues during the winter at Madison Senior Center.\nA message from DCFM: The Dane County Farmers' Market Late Winter Market is closed until further notice.\nTo facilitate our patrons connecting with our members, we have assembled an up-to-date list of our Late Winter Market vendors and the alternative purchasing options they are making available to the community.\nThe Late Winter Market runs each Saturday from the new year until the beginning of the outdoor season.\nYou will still find many of your favorite Dane County Farmers’ Market members, as well as a full array of fruits and vegetables, cheeses, hyper-local meats, honey, bakery items, and many specialty items."}, {"url": "https://isthmus.com/events/sunday-slam-communication/", "title": "POSTPONED: The Sunday Slam", "authors": [], "date": "2019-11-04", "keywords": ["folks", "lgbtq", "women", "slam", "postponed", "way", "open", "mic", "prioritizes", "welcomed", "comedy"], "summary": "press release: The Sunday Slam Open Mic is a stand-up comedy and storytelling mic that prioritizes women and LGBTQ+ folks.\nFrom veteran comedians all the way to folks that want to try comedy for the first time are encouraged to attend!\nVarying based on attendance, attendees can expect to receive anywhere from 3 to 7 minutes of stage time.\nThe Sunday Slam Open mic is a feminist mic that aims to create an inclusive environment for all, and it prioritizes the safety and security of women, LGBTQ+ folks and POC.\nFolks of all genders are welcomed to attend!"}, {"url": "https://isthmus.com/events/witches-night-off/", "title": "CANCELED: Witches' Night Off", "authors": [], "date": "2020-02-06", "keywords": ["canceled", "national", "vivent", "events", "cast", "health", "appropriate", "witches", "night", "work", "covid19"], "summary": "press release: The health and wellbeing of our patients, clients, donors and staff is at the core of our mission and our work.\nConsidering the appropriate and growing concerns about COVID-19, and in line with guidelines being issued by public health officials, Vivent Health is postponing our upcoming Make A Promise, Witches’ Night Off and Camp BINGO events.\nOnce we have more information about future dates for these events, we will be sure to share that with you.\nBe assured that Vivent Health is doing all we can to protect the health of the people we serve, including taking all appropriate measures in response to the COVID-19 outbreak.\nPresented by Vivent Health & The National Broadway Touring Company of WickedWitches’ Night Off is a one-night-only cabaret fundraiser benefiting Wisconsin’s united front in the fight against HIV."}, {"url": "https://www.channel3000.com/cuts-in-wisconsin-hospitals-push-nurses-to-the-limit/", "title": "Cuts in Wisconsin hospitals push nurses to the limit", "authors": ["Posted", "Updated"], "date": "2020-03-15", "keywords": ["limit", "care", "hospital", "uw", "health", "nurses", "hospitals", "staffing", "nurse", "patients", "push", "cuts", "wisconsin"], "summary": "The Feb. 27 board meeting was the third in a row in which UW Health nurses asked the board to recognize their new union — so far to no avail.\nThe labor tensions at the UW Health hospitals offer a glimpse into a nationwide pattern of unrest.\nThe company has since given awards to St. Mary’s and other SSM hospitals for improving health care quality and costs.\nUW Health in 2018 contracted with Virginia Mason Institute, known as a leader in applying lean principles to health care.\nPouring from an ‘empty cup’As UW Health nurses push executives to recognize their union, St. Mary’s staff say their shortage is only worsening."}, {"url": "https://fox8.com/news/swiss-cheese-comes-out-on-top-at-world-cheese-championship-in-madison-wi/", "title": "Swiss cheese comes out on top at World Cheese Championship in Madison, WI", "authors": ["Darcie Loreno", "Jen Steer", "Natasha Anderson"], "date": "2020-03-07", "keywords": ["wisconsin", "swiss", "gouda", "championship", "won", "roth", "cheeses", "world", "spycher", "cheese", "wi", "truttmann", "switzerland", "madison", "comes"], "summary": "“This is quite a good cheese,” said Stefan Truttmann, who happily accepted the award when a Gruyere from Switzerland was named the 2020 World Champion Cheese Thursday night at the World Championship Cheese Contest at Monona Terrace.\nWhile no Wisconsin cheese finished in the top three, state producers dominated the competition.\nWisconsin won 45 gold medals out of the 132 categories and swept the top three places in 13 categories.\nTruttmann said Spycher, the cheese maker, was a celebrity in the cheese world back home because of his awards.\nAnd while Truttmann knew why Spycher won — it was a technically superior cheese — he wasn’t sure how he does it."}, {"url": "https://isthmus.com/events/nadia-bolz-weber/", "title": "Nadia Bolz-Weber", "authors": [], "date": "2020-01-22", "keywords": ["sex", "secret", "shame", "nadia", "talk", "wrong", "bolzweber", "thats", "sexuality", "conversation"], "summary": "Nadia Bolz-Weber is not your average Lutheran minister.\nA former stand-up comic who has battled addiction, Bolz-Weber rose to national acclaim as the heavily tattooed founder of House for All Sinners & Saints in Denver.\nIn this frank conversation, Bolz-Weber will explore traditional religious attitudes about human sexuality and how to more fully celebrate the body, people and love.\npress release:A Night with Nadia Bolz-WeberMarch 12 at 7pm, Bethel Lutheran Church,312 Wisconsin AveIt’s time for “the TALK.” Yep, that’s the one, the talk.\nJoin Nadia Bolz-Weber in the evening for a frank conversation about bodies, shame, sex, love, and more."}, {"url": "https://www.forwardlookout.com/2020/03/city-of-madison-week-ahead-3-16-20/31154", "title": "City of Madison Week Ahead? – 3/16/20 (Updated)", "authors": ["Brenda Konkel", "Blogger", "Dabble In Community Radio", "Video", "Activist", "Advocate For People Without Homes", "Local Music Fan", "Active Progressive Dane Member", "Served Years As Alder In District City Of Madison", "Years Executive Director Tenant Resource Center"], "date": "2020-03-14", "keywords": ["31620", "ahead", "building", "municipal", "luther", "king", "blvd", "week", "city", "jr", "updated", "room", "wi", "madison", "martin"], "summary": "UPDATED: To reflect additional cancellations (12:54, Monday, 3/16/20)At the moment there are at least 6 cancelled meetings.\nThese are the meetings that were posted at close of business on Friday in legistar and may change throughout the week.\nI do my best to update through Mo’ Meetings on the home page throughout the week if I’m aware of changes.\nHere is the guide to how I put the city week ahead together.\n5:30 pm Alcohol License Review Committee City-County Building 210 Martin Luther King Jr. Blvd, Room 201 Madison, WI 537036:00 pm Task Force on Municipal Golf in Madison Parks CANCELLED Goodman Maintenance Facility 1402 Wingra Creek Parkway Madison, WI 53715Thursday, March 19, 202012:15 pm President’s Work Group to Review Council Communication Tools & Processes Room 206, Madison Municipal Building 215 Martin Luther King Jr. Blvd."}, {"url": "https://www.theverge.com/2020/4/12/21217060/foxconn-wisconsin-innovation-centers-empty-buildings", "title": "Foxconn’s buildings in Wisconsin are still empty, one year later", "authors": ["Josh Dzieza", "Nilay Patel", "Apr"], "date": "2020-04-12", "keywords": ["foxconns", "innovation", "factory", "foxconn", "building", "later", "buildings", "contract", "originally", "company", "wisconsin"], "summary": "Share All sharing options for: Foxconn’s buildings in Wisconsin are still empty, one year laterLast April, The Verge reported that the Foxconn “innovation centers” scattered around Wisconsin were largely empty and that renovations were stalled.\nIt is now April 12th, 2020, making it exactly one year since Foxconn promised a statement or correction regarding The Verge’s report of empty buildings in Wisconsin.\nHere’s another photo of Foxconn’s innovation center in Eau Claire, Wisconsin, taken this past Friday:Foxconn originally promised to turn two buildings in Eau Claire into office space and research facilities.\n(Foxconn originally said it planned to remodel 20,000 square feet and open in January 2019.)\nIt’s still unclear exactly what Foxconn’s factory will produce when it becomes operational in MayBut it’s unclear whether Foxconn will receive any subsidies."}, {"url": "https://www.wiscontext.org/while-world-war-i-ended-uw-madison-endured-deadly-pandemic", "title": "While World War I Ended, UW-Madison Endured A Deadly Pandemic", "authors": [], "date": "2020-04-10", "keywords": ["available", "pandemic", "wiscontext", "wisconsin", "welcome", "war", "information", "articles", "republish", "world", "website", "endured", "deadly", "uwmadison", "weve", "ended", "button"], "summary": "WisContext serves the residents of Wisconsin, providing information and insight into issues as they affect the state.\nWe want to share what we've learned, and media and educational organizations are welcome to republish our articles online and/or in print.\nAt the top of each of our available stories, you will see a button labeled \"republish.\"\nThis button provides an easy way for you to copy and paste WisContext story text on to your website.\nFor more information, here are our republishing guidelines:If you republish our articles, please send us a note with a link to where it appears."}, {"url": "https://www.channel3000.com/october-2019-snowiest-october-on-record-for-madison/", "title": "October 2019 snowiest October on record for Madison", "authors": ["Posted", "Updated"], "date": "2019-11-01", "keywords": ["wind", "inches", "snowfall", "snowiest", "wisctv_news3", "day", "record", "2019", "madison", "wisconsin"], "summary": "October 2019 snowiest October on record for MadisonStephanie Fryer by Stephanie FryerOctober 2019 is now the snowiest October on record for Madison.\nOur back-to-back snow storms this past week have dumped 8.0 inches.\nA snowfall record of 1.1 inches was set overnight for Oct. 30.\nTemperatures will be falling into the 20s during trick-or-treat hours, but wind chills will be in the teens and low 20s.\nWe update with short, easy-to-use video forecasts you can watch on your phone every day."}, {"url": "https://www.channel3000.com/31-days-of-rain-in-31-hours-madison-already-above-average-for-october-rainfall/", "title": "31 days of rain in 31 hours: Madison already above average for October rainfall", "authors": ["Posted", "Updated"], "date": "2019-10-02", "keywords": ["inches", "southern", "days", "rainfall", "average", "hours", "31", "dry", "record", "night", "weather", "madison", "rain", "wisconsin"], "summary": "31 days of rain in 31 hours: Madison already above average for October rainfallDave Caulfield by Dave CaulfieldOctober picked up where September left off across southern Wisconsin, as a slow-moving cold front produced another round of heavy rain Tuesday night and Wednesday morning.\nMadison has recorded more than 3 inches of rain since the start of Tuesday.\nTypically, Madison picks up about 2.5 inches of rain for the entire month.\nSouthern Wisconsin could pick up another quarter-to-half-inch of rain Wednesday night before the storm system that caused this heavy rain and severe weather moves out Thursday.\nExcept for Saturday, cool and dry weather will settle into southern Wisconsin, giving the region a much-needed chance to dry out."}, {"url": "https://www.stevenspointjournal.com/story/news/2020/04/15/stevens-point-gregg-hansel-retire-pacelli-catholic-schools-names-new-elementary-school-principal/5136494002/", "title": "Gregg Hansel set to retire, Pacelli Catholic Schools announces new elementary school principal", "authors": ["Alan Hovorka", "Published A.M. Ct April"], "date": "2020-04-15", "keywords": ["elementary", "pacelli", "principal", "st", "set", "point", "stevens", "catholic", "stephen", "retire", "hansel", "gregg", "school", "schools"], "summary": "CLOSESTEVENS POINT - Pacelli Catholic Schools has named the successor to its long-time elementary school principal and leader, who's set to retire this summer.\nGregg Hansel, director of education and principal of the Catholic school system's elementary schools St. Bronislava and St. Stephen, will retire on June 30 after 36 years on the job, according to a news release Wednesday from Pacelli Catholic Schools.\nGregory Kaster will begin working as the principal at St. Bronislava in Plover and St. Stephen in Stevens Point.\nHe's worked as the K-8 teaching principal at St. Joseph Catholic School in Stratford for the past three years and before then served as principal for Madison Elementary School in the Marshfield School District for 16 years.\nPacelli Catholic Schools is seeking applicants for a school system president to take over some of Hansel's duties."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "won", "virtually", "upfield", "participate", "team", "touches", "packers", "wants", "invites", "nfl", "draft", "super", "tons"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Ohio State running back J.K. Dobbins:What he can do– Built low to the ground at 5-9.\nCompact frame, with big, powerful legs– Tons of experience as a one-cut runner.\nWants to get upfield with initial patience following by burst–..."}, {"url": "https://isthmus.com/events/gender-fest-2/", "title": "Gender Fest 2", "authors": [], "date": "2019-10-03", "keywords": ["cafe", "locust", "tickets", "black", "winnebago", "day", "evening", "gender", "fest", "queerirl"], "summary": "Gender Fest 2 starts at The Winnebago, as local punk institution Gender Confetti (pictured) presents an afternoon of raucous bands and music.\npress release: GENDER FEST 2: SATURDAY, OCTOBER 12, 2019TICKETS - available at www.queerirl.comALL DAY passes at the door: $20Bands at The Winnebago (day only) tickets: $7Vault at Black Locust Cafe (evening only) tickets: $7QueerIRL at Gender Fest 2 (night only) tickets:$7WHAT IS GENDER FEST???\nWHEN AND WHERE IS GENDER FEST???\n- EVENING >>> 7-9pm at Black Locust Cafe, words & comedy- NIGHT >>> 10P-2A at Robinia Courtyard, queer dance party presented by Saint Saunter [queerIRL] >> QueerIRL at Gender Fest 2WHO IS PERFORMING AT GENDER FEST???\nMORE ABOUT GENDER FEST???"}, {"url": "https://isthmus.com/events/good-noise-neighbors-festival/", "title": "Good Noise Neighbors' Festival", "authors": [], "date": "2019-10-12", "keywords": ["park", "tv", "blooming", "dance", "wort", "welcomedlineup1200", "noise", "water", "good", "festival", "ways", "packers", "vo5sponsors", "neighbors"], "summary": "press release: Good Noise Neighbors' FestivalOctober 20, 12:00-6:00PMIt's time to dance together in Blooming Grove!\nNeighbors of Blooming Grove (the town inside of Madison) are putting on a music festival on October 20th at Thurber Park off of Fair Oaks and Milwaukee Street.\nAlong with gathering together, we will raise money for Safe Skies Clean Water Organization.\nWe will have information about the proposed F- 35s and ways you can share your opinion.\nWe will have the Packers on TV in our Packers Tent."}, {"url": "https://isthmus.com/events/madison-circus-space-grand-opening/", "title": "Madison Circus Space Grand Opening", "authors": [], "date": "2019-10-24", "keywords": ["circus", "william", "space", "arts", "winnebago", "members", "grand", "mcs", "2082", "variety", "opening", "madison"], "summary": "press release: Madison Circus Space Grand Opening: Friday, October 25, 4:30-9:30 pm, 2082 Winnebago StreetWe invite you to join us in our brand-new, built-for-circus space at 2082 Winnebago Street!\nExperience mini shows happening at the top of every hour, where a variety of circus disciplines will be performed by our very own MCS students and members!\nSample circus activities for FREE after each show!\nNow we have over 80 members and a new, permanent facility designed for training and performing a variety of circus arts.\nSpecial thanks to Madison Community Foundation, William T Evjue Charitable Trust, Endres Manufacturing, Dane Arts, SASY Neighborhood Association, Monona Bank, Diane Ballweg, Madison Arts Commission, and many, many individuals!"}, {"url": "https://isthmus.com/events/sistastrings-oct-25/", "title": "SistaStrings", "authors": [], "date": "2019-10-02", "keywords": ["traditions", "purchase", "sistastrings", "shows", "proceeds", "violence", "ticket", "community", "threshold", "food", "performers"], "summary": "× Expand SistaStringspress release: Friday, October 25, 7:30 pm, SistaStrings, \"Raising our Voices\"The acclaimed Milwaukee-based sister-duo returns to Threshold after a sold out concert in May.\nSoul Food and drinks will be available for purchase and proceeds will go to the Wisconsin Anti Violence Effort, WAVE (https://waveedfund.org).\nThis provides $10 toward a ticket for a community member who wouldn't otherwise be able to attend the performance.\nFood and beverages are available for purchase at each of the shows, and cuisines are culturally paired with each of the musical traditions.\nProceeds from food and beverage sales go to a charity of the performer's choice."}, {"url": "https://isthmus.com/events/cave-after-dark-oct-19/", "title": "Cave After Dark", "authors": [], "date": "2019-08-28", "keywords": ["discovery", "rockstoberfest", "center", "oktoberfest", "season", "required", "cave", "fall", "encouraged", "wisconsin", "dark"], "summary": "press release:Celebrate the fall season and Oktoberfest at Cave of the Mounds!\nOr, sit back and enjoy live bluegrass music by Down from the Hills in our historic Barn Discovery Center.\nTasty snacks and appetizers inspired by the fall season and Oktoberfest are included with your ticket and available in the Barn Discovery Center.\nCave After Dark is a popular series of themed events for adults 21 and older at Cave of the Mounds – National Natural Landmark.\nEach event includes a unique at-your-own-pace after hours cave experience and theme-related reception in our Barn Discovery Center with cash bar."}, {"url": "https://isthmus.com/arts/books/wisconsin-book-festival-features/", "title": "The most literary time of year", "authors": ["Michael Popke"], "date": "2019-10-10", "keywords": ["history", "literary", "festival", "book", "states", "library", "central", "life", "oct", "wisconsin", "writers"], "summary": "Writers from the Badger state are all over this year’s Wisconsin Book Festival, which runs Oct. 17-20 at the Madison Central Library and other downtown venues.\n“We have Wisconsin writers presented in every genre.”Memoir fans will be moved by Joshua Mezrich, an associate professor of surgery in the division of multi-organ transplantation at the University of Wisconsin School of Medicine and Public Health.\n“The festival provides the perfect opportunity to meet new writers from the area.”Local writers also will participate in panels.\nAllen, who began transitioning from male to female in 2012, will share her stories from the road at Central Library on Oct. 20 at noon.\nWitching hour is 9 p.m. on Oct. 18 at Central Library."}, {"url": "https://www.channel3000.com/50-things-to-do-in-madison-this-october/", "title": "50 things to do in Madison this October", "authors": ["Posted", "Updated"], "date": "2019-10-04", "keywords": ["theatre", "things", "overture", "jazz", "center", "theater", "music", "come", "50", "oct", "madison", "perform"], "summary": "50 things to do in Madison this OctoberHalloween- and fall-themed funDana Munro by Dana MunroPhoto by Flickr user Richard Hurd Freakfest will bring costumed music fans to State Street on Oct. 26.\nThe orchestra includes Madison jazz musicians such as drummer Rand Moore and vocalist Angela Babler.\nOct. 4-13MusicCome see Madison Bach Musicians’ tribute to Georg Philipp Telemann, “Telemann’s Tales Quixote, Gulliver, and a Canary,” at First Unitarian Society of Madison and Holy Wisdom Monastery.\nOct. 13MusicCome see the best UW- Madison jazz students perform at Stoughton Opera House.\nKanopy Dance honors her legacy with their show “Martha Graham: Power and Passion” at Overture Center."}, {"url": "https://isthmus.com/events/girls-in-aviation-day/", "title": "Girls in Aviation Day", "authors": [], "date": "2019-08-19", "keywords": ["wai", "chapter", "women", "introduce", "international", "day", "opportunities", "lakes", "2019", "girls", "aviation"], "summary": "press release: The Four Lake Chapter of Women in Aviation International (WAI), based in Madison, will be hosting the Madison area’s first ever Girls in Aviation Day on October 5, 2019.\nThe event will also showcase female aviators and introduce girls to career opportunities in the growing aviation industry.\n“We could not be more excited to introduce girls in our community to female role models in aviation and aerospace such as pilots, air traffic controllers, aviation mechanics, and flight instructors,” says Four Lakes Chapter President Sarah Pozdell.\n“The afternoon of aviation fun will educate girls on the thrill of aviation and the variety of opportunities available in aviation and aerospace while they build their confidence during the hands-on activities.”The Four Lakes Chapter will join Women in Aviation International chapters around the world on October 5, 2019, for an outreach event to inspire the next generation of women in aviation.\nChapters all over the world are putting on their own, unique programs, and U.S. states are proclaiming October 5, 2019 to be Girls in Aviation Day in their state."}, {"url": "https://www.channel3000.com/best-places-to-work-2019/", "title": "Best Places to Work 2019", "authors": ["Posted", "Updated"], "date": "2019-09-20", "keywords": ["companies", "ways", "nikki", "talent", "places", "2019", "best", "employees", "work", "madison", "looking"], "summary": "Best Places to Work 2019Take a look at what makes these places the bestMaija Inveiss by Maija Inveiss1/12 Nikki Hansen2/123/12 Nikki Hansen4/12 Nikki Hansen5/12 Nikki Hansen6/12 Nikki Hansen7/12 Nikki Hansen8/12 Amadou Kromah9/12 Nikki Hansen10/12 Nikki Hansen11/12 Nikki Hansen12/12 Nikki Hansen NordicA business is only as good as its best employees.\nThis year, 30 Madison companies were selected as Madison Magazine’s Best Places to Work based on survey results analyzed by Quantum Workplace, an employee-engagement software company.\n“Competition is fierce for top talent in Madison,” says Mike Victorson, president and CEO of M3 Insurance Solutions Inc., one of this year’s Best Places to Work.\nMadison is consistently named one of the best places to live among larger cities.\nThe Douglas Stewart Co.To learn more about the Best Places to Work finalists, click one of the images and links below."}, {"url": "https://isthmus.com/events/hamel-music-center-opening-weekend/", "title": "Hamel Music Center Opening Weekend", "authors": [], "date": "2019-08-12", "keywords": ["mead", "weekend", "concert", "hall", "center", "music", "musics", "witter", "hamel", "students", "school", "opening", "performance"], "summary": "7:30 PM: Student Collage Concert, Mead Witter Foundation Concert HallBack-to-back short performances featuring some of our most exciting student musicians playing throughout the concert hall.\nThe 50 or so construction workers from JP Cullen and Strang Architects were the first to experience music in the Hamel Music Center, the Mead Witter School of Music's new performance venue.\nNeighboring the Chazen Museum of Art, the Hamel Music Center welcomes visitors into the bustling East Campus Mall area just outside its windows.\n(Music instruction will continue to take place in the Mosse Humanities Building, the School's administrative home, and in historic Music Hall.)\nBuilt by-and for-WisconsinThe Hamel Music Center at 740 University Avenue in Madison is the first academic building on campus to be built entirely with private funds."}, {"url": "https://isthmus.com/events/ufo-day/", "title": "UFO Day", "authors": [], "date": "2019-10-17", "keywords": ["park", "main", "beer", "day", "ufo", "library", "2019", "fest", "belleville", "bcc", "street"], "summary": "Annual extraterrestrials-themed activities, 10/26, throughout Belleville, with parade 1 pm (Main Street), beer fest 2-5 pm (Library Park; $40; $50 with early entry).\npress release: The Belleville Community Club (BCC) is excited to announce the 2019 UFO Day Beer Fest.\nIn partnership with the Belleville Area Chamber of Commerce which hosts the annual UFO Day event, the BCC plans to hold the Beer Fest rain or shine on Saturday, October 26th, 2019 at Library Park in Belleville WI.\nWe are pleased to invite you to join us in your love of craft beer and in raising funds that allows the BCC to donate to many worthy causes.\nOctober 26, 2019, Library Park, 10 East Main Street, Belleville$10- Designated Driver; $40- General Admission; $50- VIP (includes swag and 1 pm entry) http:// bellevillecommunityclub.com/ events.html#beerfest"}, {"url": "https://isthmus.com/events/trunk-or-treat-red-village/", "title": "Trunk or Treat", "authors": [], "date": "2019-10-23", "keywords": ["treat", "event", "village", "way", "tricks", "red", "weather", "church", "whitney", "trunk", "regent"], "summary": "press release: No tricks, just treats!\nJoin us for a scare-free evening of trunk or treating at Red Village Church, in Madison on the corner of Whitney Way and Regent St, on October 31st from 5:30-8pm.\nEvent will be held in the parking lot, weather permitting.\nIn the case of inclement weather, the event will be moved inside to the gymnasium.\nThurs, Oct 31 5:30-8:00pm, Red Village Church, 5202 Regent Street"}, {"url": "https://www.wortfm.org/madison-third-week-of-october-1969/", "title": "Madison, third week of October, 1969", "authors": ["Wort News Department"], "date": "2019-10-17", "keywords": ["dc", "1969", "war", "young", "rally", "16", "week", "ct", "university", "moratorium", "madison"], "summary": "Madison, the third week of October, 1969.\n[ii] Bogdanich, “Moratorium Blooms at WSA Office, with Barefoot Girls, Rainbow Paper,” DC, October 11, 1969; Clifford S. Behnke, “Moratorium’s Smorgasbord,” WSJ, October 14, 1969; “Moratorium Events to Take Many Aspects,” CT, October 14, 1969; Steve Vetzner, “U Anti-War Protests Date Back to 1965,” DC, October 14, 1969; Whitney Gould, “War Foes Here Rap Policies,” CT, October 15, 1969; “Jam-Packed Teach-Ins Mark Protest Here,” CT, October 15, 1969.\n[iii] “SDS Gives ‘Ultimatum’ to End 3 U. Operations,” CT, October 15, 1969; “Young Refuses to Negotiate SDS Ultimatum,” DC, October 16, 1969; David Fine, “Demand Limit Past; SDS Plots Course,” DC, October 28, 1969; Edwin Young interview, War at Home papers.\n[iv] George Bogdanich and Maureen Santini, “15,000 Attend Moratorium Day Fieldhouse Rally,” DC, October 16, 1969; Bogdanich, “Protest Rally Draws 3,000; Outline Morning Activities,” DC, October 16, 1969; Whitney Gould, “Middleton Mother, Who Lost Son in Viet, Stirs Rally,” CT, October 16, 1969; “Rowen Elucidates U-Military Cooperation,” DC, October 23, 1969; James Rowen and Margery Tabankin interviews, War at Home papers.\n[v] Rosemary Kendrick, “15,000 Here Rally, March against War,” CT, October 16, 1969; Whitney Gould, “Peace Group Keeps Full Control,” CT, October 16, 1969."}, {"url": "https://isthmus.com/events/hollow-een/", "title": "HOLLOW-een", "authors": [], "date": "2019-09-11", "keywords": ["coloring", "discovery", "family", "tour", "center", "buried", "fun", "cave", "holloween", "costume"], "summary": "ENTER THE COSTUME CONTESTEnter our HOLLOWeen costume contest in the Barn Discovery Center for a chance to win Keys to the Cave memberships.\nEveryone wearing a costume to our HOLLOWeen event will receive a bonus gemstone “treat”!\nThe trick-or-treat gemstones are all included with your HOLLOWeen Cave Tour ticket.\nBECOME A HOLLOWEEN SCIENTISTHead to the Barn Discovery Center for some sticky, bubbling, oozing experiments and sensory experiences and get answers to your tough science questions!\nENTER THE HOLLOWEEN COLORING CONTESTKids of all ages can enter the annual HOLLOWeen Coloring Contest or color just for fun!"}, {"url": "https://isthmus.com/events/the-war-at-home-oct-13/", "title": "The War at Home", "authors": [], "date": "2019-09-25", "keywords": ["film", "progressive", "united", "war", "screening", "york", "premiere", "theater", "madison", "vietnam"], "summary": "× Expand Rich Faverty/CapitalTimesThis must-see documentary looks at the tumultuous years when Madison’s streets were filled with protesters fighting the war in Vietnam.\npress release: 40th Anniversary Benefit Screening of The War at HomeThe Progressive magazine is proud to present a One-Night-only, 40th Anniversary Screening of the Academy Award Nominated feature documentary The War at Home.\nThe Moratorium to End the War in Vietnam\" was a massive demonstration and teach-in across the United States (including 15,000 demonstrating in Madison and several Wisconsin cities) against the United States involvement in the Vietnam War.\nThese events are among the many important events of the antiwar movement documented in the film The War at Home.\nThe War at Home had its World Premiere at the Majestic Theater in Madison on October 12, 1979."}, {"url": "https://isthmus.com/events/one-day-in-the-season-of-rain/", "title": "One Day in the Season of Rain", "authors": [], "date": "2019-10-11", "keywords": ["interdisciplinary", "dharwadker", "tickets", "studies", "performance", "day", "season", "south", "uwmadison", "theater", "indian", "rain", "play"], "summary": "press release: The Center for South Asia at UW-Madison is pleased to announce a costumed dramatic reading of One Day in the Season of Rain, a play by the Indian playwright Mohan Rakesh, translated into English by Professors Aparna Dharwadker and Vinay Dharwadker (Department of English, UW-Madison).\nIt is directed by Joshua Thomas Kelly (PhD candidate in Interdisciplinary Theatre Studies), and features trained actors from Interdisciplinary Theater Studies and the Department of Theater and Drama.\nSince its publication in 1958, Rakesh’s play has been recognized as a foundational work in post-independence Indian theater, and a classic of postcolonial modernism.\nThe performance is free, but seating at the Play Circle is limited.\nTo reserve tickets, please email Professor Aparna Dharwadker (adharwadker@wisc.edu) as soon as possible."}, {"url": "https://isthmus.com/events/madison-matters/", "title": "#MadisonMatters", "authors": [], "date": "2019-10-15", "keywords": ["shauna", "discussion", "madisonmatters", "unity", "panel", "noon", "high", "unified", "fem", "stronger", "respectful"], "summary": "#MadisonMatters is a community building and benefit event for Fem Fest, coming to Madison's High Noon Saloon this January 2020.\nWe seek to empower our communities through the celebration of art, creativity, unity, and respectful open dialogues regarding matters that affect us all.\nA round-table discussion, hosted by The Homegrown Poster Child; featuring: Dr. Shagashus Levingston, Alan Strozak, Cooper Talbot, Nick Hart, and Dana Pellebon.\nFollowing the panel discussion, there will be a moderated public discussion; to remain respectful, inclusive, and conducive to strengthening our bonds.\nAll proceeds from event go to performers, panel, and towards the inaugural launch of Madison Fem Fest, to be held this January at the High Noon Saloon."}, {"url": "https://isthmus.com/events/forward-madison-fc-thank-you-party/", "title": "Forward Madison FC Thank-You Party", "authors": [], "date": "2019-10-14", "keywords": ["fans", "flamingos", "party", "forward", "league", "fc", "team", "teams", "usl", "players", "thankyou", "madison", "33", "thank"], "summary": "press release: Forward Madison FC is inviting its fans to an end-of-season thank you party at Breese Stevens Field on Wednesday, Oct. 16.\nThe party will take place in FMFC’s stadium store from 5-8 p.m., with players scheduled to make appearances between 6-7:30 p.m.Wednesday’s party will likely be the last chance for fans of the team to say thank you and goodbye to Forward’s players before the offseason.\nThe Flamingos captivated the city in their first year, leading USL League One in attendance with an average of 4,292 fans per game.\nDuring the party, the Flamingos will celebrate the season by taking 33 percent off select merchandise items in honor of the team’s 33 USL League One goals.\nThe team also plans to sell game-used shorts and jerseys, and will have beer on offer."}, {"url": "https://isthmus.com/food-drink/mad-faves-fish-frys-2019/", "title": "Five (actually six) fish fries you need to try in Madison, Wisconsin", "authors": ["D.R. Westbury"], "date": "2019-10-22", "keywords": ["wisconsin", "fish", "actually", "fries", "fry", "slaw", "club", "cod", "try", "perch", "walleye", "order", "madison", "need", "choice"], "summary": "Every Friday, restaurants across the state pull out that special menu: fish fry.\nThe search for the perfect fish fry is a constant, but fish fries are far from homogenous.\nThe fish fry is a crowded, chummy scene — everyone seems to know the drill.\nOrder from cod, walleye or Canadian lake perch, which all come with slaw, fries and a dinner roll.\nQuivey’s Grove proves that a little country charm never hurt a fish fry."}, {"url": "https://isthmus.com/events/walk-to-defeat-als/", "title": "Walk to Defeat ALS", "authors": [], "date": "2019-10-01", "keywords": ["chapter", "walk", "visit", "als", "website", "defeat", "team", "patients", "join", "care", "wisconsin"], "summary": "press release: The ALS Association Wisconsin Chapter will host its first Madison Walk to Defeat ALS on Saturday, Oct. 26.\nThis Walk allows ALS patients, families and supporters to walk in honor of those currently battling ALS and in memory of those we have lost to ALS.\n100% of the money raised stays in Wisconsin to help Wisconsin ALS patients and their families.\nAbout The ALS Association Wisconsin ChapterWith localized care and resources against ALS, the Wisconsin Chapter works with the NationalOffice to share information and advocate for patients.\nOur Chapter evolved from an in-statesupport group to an official ALS Chapter in 1987."}, {"url": "https://isthmus.com/events/chuck-bauer-nov/", "title": "Chuck Bauer", "authors": [], "date": "2019-10-28", "keywords": ["hang", "painting", "paintings", "exhibit", "bauer", "art", "chuck", "painter", "gallery", "university", "madison", "wisconsin"], "summary": "× Expand Chuck Bauer \"House on Chadbourne.\"\npress release: Reflections Exhibits presents \"Chuck Bauer Recent Paintings\".\nThe exhibit will hang in the gallery in the offices of the Wisconsin Academy of Sciences, Arts & Letters at 1922 University Ave., Madison.\nThe exhibit includes many paintings of Madison.\nI am Represented by Milward Farrell Fine Art, Madison, Wisconsin."}, {"url": "https://isthmus.com/events/carrallee-cider-farm/", "title": "Carrallee", "authors": [], "date": "2019-10-16", "keywords": ["guitar", "weaves", "release", "holiday", "favorites", "mandolin", "originals", "night", "carrallee", "free", "piano"], "summary": "× Expand Ben Enke Carralleepress release: Carrellee weaves together a night of holiday favorites, originals on piano, guitar, and mandolin."}, {"url": "https://www.jsonline.com/story/entertainment/2019/10/29/wisconsin-snow-photos-states-first-snowfall-season/2495690001/", "title": "Wisconsin's first seasonal snowfall hit in October, so naturally, people went on social media to share photos.", "authors": ["Jordyn Noennig", "Published A.M. Ct Oct."], "date": "2019-10-29", "keywords": ["posted", "state", "hit", "light", "share", "wisconsins", "good", "snowfall", "milwaukee", "media", "went", "scenic", "social", "saw", "seasonal", "wisconsin", "photos", "snow", "naturally"], "summary": "Areas west and north of Milwaukee saw up to 4 inches of snow, while Milwaukee had a light dusting with more snow predicted for Thursday.\nSome people were excited, some were disappointed, and a lot of people posted an obligatory \"first snow\" picture.\nHere is a roundup of Wisconsin snow photos:The fall snowfall has some people in the state confused.\nPeople throughout the rest of the state posted scenic snowy pictures.\nCLOSE An early snowfall frosts the trees along the northern Kettle Moraine Scenic Drive which winds through Fond du Lac and Sheboygan Counties in Wisconsin."}, {"url": "https://www.channel3000.com/50-must-do-october-events-in-the-madison-area/", "title": "50 must-do October events in the Madison area", "authors": ["Posted", "Updated"], "date": "2018-10-03", "keywords": ["works", "overture", "jazz", "local", "arts", "dance", "events", "music", "50", "night", "area", "oct", "mustdo", "madison"], "summary": "50 must-do October events in the Madison areaTheater season openers, art gallery tours and moreSammy Gibbons by Sammy GibbonsPhoto by Flickr user Richard Hurd Freakfest returns, this time with headliners Misterwives and Tank and the Bangas, for another Halloween weekend in Madison.\nOct. 5ArtMadison will be dotted with galleries during Madison Museum of Contemporary Art’s Fall Gallery Night.\nVenues for the concerts include Grace Episcopal and Emmanuel Lutheran churches in Madison and Historic Park Haul in Sauk City.\nOct. 12-13Special EventDane Arts Buy Local connects local business with local artists with two days of unique pop-up shops around the city.\nOct. 21MusicPaul Jacobs, who made history for playing Bach for 18 hours straight, makes his first Madison appearance at the Overture Center."}, {"url": "https://isthmus.com/food-drink/mad-faves-new-restaurants-2019/", "title": "Five new restaurants you need to try in Madison, Wisconsin", "authors": ["Rhonda Bingham"], "date": "2019-10-10", "keywords": ["restaurants", "wisconsin", "menu", "n", "transition", "restaurant", "salad", "favorites", "hot", "try", "list", "location", "madison", "prairie", "need"], "summary": "Any one of them might hijack your dreams and your own favorites list.\nWhile the numerous taco fillings are fun, don’t overlook the non-taco menu, including chicken empanadas, corn fritters and spicy cucumber salad.\nThe Tipsy Cow’s new Sun Prairie location brings favorites from its Capitol Square location to the ’burbs.\nThe momos — hearty beef dumplings — are a big draw, and are served as an appetizer or as an entree.\nCurries and stir-fries are plentiful, but try a hot Bhutanese dish at one of the few restaurants in the country that serves this cuisine."}, {"url": "https://isthmus.com/events/kutler-lectures-loeffler/", "title": "Kutler Lectures", "authors": [], "date": "2019-09-19", "keywords": ["lectures", "jews", "jewish", "hate", "talks", "law", "studies", "speech", "american", "kutler", "pyle"], "summary": "press release: The Mosse/Weinstein Center for Jewish Studies is pleased to announce the 2019 Stanley Kutler Lectures in American Jewish Studies.\nThis year’s speaker is James Loeffler, Jay Berkowitz Professor of Jewish History at the University of Virginia, who will be delivering two talks on the subject of Jews, hate speech, and antisemitism.\nThe lectures will take place at 7 p.m. on Wed., Oct. 2 and 4 p.m. on Thurs., Oct. 3.\n(Note the different hours for the two lectures.)\nThat legal campaign produced the world’s first anti-racism law – and a new definition of Zionism as a form of racism."}, {"url": "https://isthmus.com/events/garver-gallery-night/", "title": "Garver Gallery Night", "authors": [], "date": "2019-09-19", "keywords": ["historic", "yoga", "skillet", "american", "feed", "garver", "night", "gallery", "making", "wellness"], "summary": "× Expand American Skillet Companypress release: Gallery Night at Garver Feed Mill, 3241 Garver Green5pm - 9pm, Friday, October 4Art and artisans abound at the premier of Gallery night in the Historic Garver Feed Mill.\nHighlights include...* Ian’s Pizza “MADE U LOOK” rooftop graffiti mural* American Skillet Company “Made in America” making its Madison debut* Twig and Olive portrait photography* Surya Cafe “Art as Food”, edible creations of Chef Lauren* Sitka Salmon Shares gallery featuring “American Fisheries”* Grasshopper Goods locally designed apparel and accessories* Perennial Yoga studios presents “Prayer Flags for Peace”* Making Flower Mandalas with Kosa Wellness Spa and RetreatAnd of course photographs, vintage items and artifacts from the historic Garver Feed Mill"}, {"url": "https://isthmus.com/events/maxine-gordon/", "title": "Maxine Gordon", "authors": [], "date": "2019-09-18", "keywords": ["jazz", "maxine", "uw", "book", "gordon", "studies", "music", "street", "dexter", "madison"], "summary": "× Expand C. Daniel DawsonAs a part of a four-day residency in Madison, Maxine Gordon celebrates her new book on the life of her husband and jazz great Dexter Gordon.\nOn this evening, Gordon will read excerpts from her book, Sophisticated Giant: The Life and Legacy of Dexter Gordon.\nUW Department of Afro-American Studies professor Ethelene Whitmire will also conduct an interview with Gordon, and the UW Blue Note Ensemble will provide musical accompaniment.\npress release: Maxine Gordon, widow of legendary modern jazz saxophonist Dexter Gordon, is in the midst of a global tour to celebrate her new book, \"Sophisticated Giant: The Life and Legacy of Dexter Gordon”.\n****************************** ****************************** ****************Maxine Gordon’s Madison area residency is co-sponsored by the Greater Madison Jazz Consortium, the Wisconsin Book Festival, the UW Afro-American Studies Department, and the UW’s Mead Witter School of Music, with additional support from Hotel Indigo."}, {"url": "https://isthmus.com/music/threshold-deepens-the-connection-between-artist-and-audience/", "title": "More than a concert", "authors": ["Andy Moore"], "date": "2019-10-24", "keywords": ["concert", "space", "way", "social", "started", "threshold", "food", "livny", "thresholds", "performers", "performance"], "summary": "Threshold on Madison’s near east side is more of a living organism than it is a performance venue.\nInstead of plant species, Threshold’s co-minglers are performers and patrons, and the expanded boundary allows for greater diversity.\nShe went on to work on campus at the Biotechnology Center, where she created and ran the bio-tech information program.\nShe started Threshold five years ago as a privately funded coworking and events space.\nThreshold brings people together in a way that leaves a lot of room for serendipity.”"}, {"url": "https://www.channel3000.com/city-of-madison-declares-racism-a-public-health-crisis/", "title": "City of Madison declares racism a public health crisis", "authors": ["Posted", "Updated"], "date": "2019-10-17", "keywords": ["organizations", "wisconsin", "health", "anthony", "racism", "declares", "city", "crisis", "color", "public", "madison", "resolution"], "summary": "City of Madison declares racism a public health crisisAmy Reid by Amy ReidThe city of Madison signed on to a statewide resolution declaring racism as a public health crisis Tuesday.\nThe move brings no additional programming or funding, but community leaders who run programs for youth of color and people of color in Madison say this is a good step for the city to take.\nTonight @CityofMadison joined at least 32 other organizations in Wisconsin declaring racism a public health crisis.\nOther notable orgs include @UWHealth, @PublicHealthMDC, SSM St. Mary’s, and UW School of Medicine and Public Health.\n“It’s now been proven that the stress caused by the pressures of racism is a leading indicator of health disparities for African Americans,” he said."}, {"url": "https://isthmus.com/events/halloween-comic-fest/", "title": "Halloween Comic Fest", "authors": [], "date": "2019-10-09", "keywords": ["shops", "east", "comics", "book", "west", "fest", "community", "free", "westfield", "comic", "halloween"], "summary": "Worldwide comic book giveaway, 10/26, with participants including Capital City Comics (608-251-8445); Westfield Comics West (608-833-4444) & East (608-633-5555).\npress release: Both Westfield Comics location in Madison will be participating in this year’s Halloween Comic Fest on Saturday, October 26!\nHalloween ComicFest (HCF) is the comic book industry’s premiere fall event similar to each spring’s Free Comic Book Day in May – a single day when participating comic book specialty shops across North America and around the world give away specially published comic books absolutely free to anyone who comes into their shops.\nHCF is the perfect event to experience comic shops as destinations for Halloween and horror-themed comic books, collectibles, and other merchandise!\nEvery year, on the last Saturday in October, the industry comes together to give away free comics and encourage both curious, first-time comic book readers and seasoned comic book fans to flock to the best place in the comic book community: local comic shops."}, {"url": "https://isthmus.com/events/uw-wind-ensemble-hamel/", "title": "CANCELED: UW Wind Ensemble", "authors": [], "date": "2019-10-03", "keywords": ["canceled", "wind", "concert", "concerts", "ensemble", "jazz", "uw", "music", "311", "witter", "website", "school", "wisconsin"], "summary": "Mead Witter School of Music concert.\npress release: Due to concerns about the spread of COVID-19 and the Chancellor’s directive to cancel events of more than 50 people until at least April 10, the School of Music is canceling a number of concerts, including: UW Jazz Orchestra with Sun Prairie High School Jazz I Ensemble (3/11), Wisconsin Brass Quintet (3/11), UW Concert Band (3/29), Concerto Competition Concert (April 5).\nFor other concerts and recitals, check the website regularly for any updates.\nWe will do everything possible to reschedule and to keep you informed.\nFor more information on the campus response to COVID-9, see the website."}, {"url": "https://isthmus.com/music/anna-vogelzang-beacon/", "title": "On the road again", "authors": ["Andy Moore"], "date": "2019-10-03", "keywords": ["wintersong", "song", "space", "beacon", "la", "winnebago", "way", "road", "vogelzang", "work", "sound"], "summary": "× Expand Carla Richmond Coffing Vogelzang is back in the Midwest, and brings her new tunes to The Winnebago on Oct. 12.\nShe started the song “Beacon” while on a Madison-based tour.\nTogether with Adam Levy (who provides some guitar on Beacon) she created Song Salon, an L.A. songwriter collective that produced weekly house concerts.\nThat, in turn, opened the door to others who found their way into her life and on the new album.\nVogelzang will play an album release show at The Winnebago on Oct. 12 (with Courtney Hartman and Coyote Brother)."}, {"url": "https://www.channel3000.com/shots-fired-on-langdon-street-near-uw-madison-campus-police-find-property-damage/", "title": "Shots fired on Langdon Street near UW-Madison campus, police find property damage", "authors": ["Posted", "Updated"], "date": "2019-10-18", "keywords": ["rewritten", "reserved", "damage", "shots", "langdon", "fired", "sent", "uwmadison", "published", "street", "property", "rights", "campus", "near"], "summary": "Shots fired on Langdon Street near UW-Madison campus, police find property damageAriana Baldassano by Ariana BaldassanoCopyright 2019 by Channel 3000.\nAll rights reserved.\nMadison police are investigating after shots were fired on the 600 block of Langdon Street near the UW-Madison campus Thursday night.\nOfficers found property damage in the area, according to Madison police Sgt.\nALL RIGHTS RESERVED."}, {"url": "https://isthmus.com/news/news/madison-east-teacher-pleads-not-guilty/", "title": "Madison East teacher pleads not guilty", "authors": ["Dylan Brogan"], "date": "2020-01-30", "keywords": ["jan", "30", "kruchten", "cameras", "minneapolis", "bugni", "students", "pleads", "teacher", "school", "east", "guilty", "madison", "oppeneer"], "summary": "× Expand David Michael MillerAround 30 East High School students filled the small hearing room at the federal courthouse in Madison on Jan. 30.\nDavid Kruchten, an East teacher who wore a green T-shirt and sweatpants, was escorted in by U.S.\nKruchten, a business education teacher at East, was arrested the morning of Jan. 30.\nThe indictment, also released Jan. 30, does not include the December dates when students found the cameras in Minneapolis.\nAssistant U.S. Attorney Elizabeth Altman brought up the December trip to Minneapolis by East students when arguing that Kruchten should remain in custody."}, {"url": "https://isthmus.com/arts/visual-arts/2019-wisconsin-triennial/", "title": "Material world", "authors": ["Linda Falkenstein"], "date": "2019-10-24", "keywords": ["triennial", "works", "paint", "wisconsin", "oil", "multiple", "material", "world", "art", "artist", "work", "madison"], "summary": "The 2019 Madison Museum of Contemporary Art’s Wisconsin Triennial is, as always, a snapshot of artistic work being created throughout Wisconsin.\nThe exhibit occupies the entire museum, minus the Henry Street Gallery, and features work, often multiple works, by 32 artists and two artist groups.\nAnd while it is impossible to condense this show to an encompassing statement about Wisconsin art, there are common threads.\nBut as with Goldsworthy’s arrangements, these earth works prompt the viewer to recontextualize and re-appreciate the natural world.\nAnother innovative consideration of materials comes from Madison artist Jennifer Bucheit."}, {"url": "https://isthmus.com/events/immigrant-journeys-madison-college-south/", "title": "Immigrant Journeys from South of the Border ¡Mi travesía hasta Wisconsin!", "authors": [], "date": "2019-10-16", "keywords": ["border", "mi", "exhibit", "release", "www", "hasta", "immigrant", "wisconsinimmigrantjourneysorg", "journeys", "south", "travesía", "work", "wisconsin"], "summary": "× Expand Gary Porter Panfilo, a participant in the \"Immigrant Journeys\" project.\npress release: \"Immigrant Journeys from South of the Border ¡Mi travesía hasta Wisconsin!\"\nis a traveling exhibit that invites you to meet eight people from Colombia, Honduras, Mexico and Uruguay who live and work in Wisconsin today.\nJoin us for the opening of the exhibit at Madison College - South Goodman Campus on Saturday, October 26, from 3 - 5 PM.\n\"Immigrant Journeys from South of the Border\" was produced by the Wisconsin Humanities Council in partnership with Centro Hispano of Dane County."}, {"url": "https://fox6now.com/2019/08/06/vehicle-titles-registration-fees-increase-in-wisconsin-starting-october-1/", "title": "Vehicle titles, registration fees increase in Wisconsin starting Oct. 1", "authors": ["Katie Delong"], "date": "2019-08-06", "keywords": ["registration", "title", "fee", "increase", "vehicle", "fuel", "starting", "fees", "titles", "dot", "oct", "wisconsin", "vehicles"], "summary": "Please enable Javascript to watch this videoMADISON -- Vehicle titles and registration fees are increasing in Wisconsin due to a provision in the 2019-2020 budget.\nAccording to officials with the Wisconsin Department of Transportation, the new fees take effect Oct. 1.\nAccording to the DOT, the new vehicle title fee will increase from $69.50 to $164.50.\nThe title fee for a surviving spouse/surviving domestic partner or a low-speed vehicle will increase from $62 to $157.\nAnnual registration fees for automobiles will increase from $75 to $85."}, {"url": "https://isthmus.com/events/yarn-fabric-consignment-sale-radisson/", "title": "Yarn & Fabric Consignment Sale", "authors": [], "date": "2019-09-23", "keywords": ["sale", "supplies", "youyoull", "shopper", "retail", "sewingquilting", "10am", "fabric", "shop", "whimsyall", "wi", "consignment", "yarn"], "summary": "press release: Hosted by Green WhimsyAll items consigned (and priced) by crafters just like you!\nYou'll find supplies for:~ Sewing/Quilting Supplies~ Beading/Jewelry Making Supplies~ Knitting/Crocheting Supplies~ Needlepoint Kits & Supplies~ Collectible Dolls & Accessories including American Girl, Build-a-bear, Barbie, etc.\nSaturday, October 5, 10am to 3pm; Sunday, October 6, 10am to 1pm (EVERYTHING HALF PRICE SALE!\n), Radisson Hotel, 517 Grand Canyon Drive, Madison, WI 53719www.greenwhimsy.comwww.facebook.com/GreenWhimsyJoin us as a Shopper and SHOP for all your crafting needs for a fraction of retail!\nAdmission is Free and we accept Cash and Credit Cards."}, {"url": "https://isthmus.com/music/year-end-music-roundup-by-marc-eisen/", "title": "A surprising year", "authors": ["Marc Eisen", "Nita Lay"], "date": "2020-01-23", "keywords": ["jazz", "symphony", "surprising", "great", "good", "chicago", "music", "2019", "coda", "band", "times"], "summary": "Good music is good music.\nNone better in 2019 than the august Riccardo Muti at the helm of the world class Chicago Symphony performing Mozart's Requiem.\nAnd Marsalis, who unleashed several bravura solos as if he were facing down every trumpeter within a 500-mile radius, left no doubt that today he is America's great jazz ambassador.\nBe honest: Is there a better account of the sweet sadness of a relationship ending than “For the Good Times”?\nThe pipeline to the great Chicago players is wide open."}, {"url": "https://indiagoneviral.com/worldnews/2020/04/14/live-analysis-wisconsin-primary-election-results/23644/india-gone-viral/", "title": "Live Analysis: Wisconsin Primary Election Results", "authors": ["Igv- News Desk Team", "Hello People", "We Are The Team Of India Gone Viral News Portal.", "Members Actively Working To Provide The True", "Real Time News Happening All Around The India", "Zoom Not Safe", "Government Warns People On Video Conference Service - News Info Park", "Audry Dawahoya", "Keylogger For Mac", "Cases In India Surge To"], "date": "2020-04-14", "keywords": ["analysis", "viral", "primary", "provide", "india", "true", "real", "portal", "members", "election", "world", "working", "results", "live", "team", "wisconsin"], "summary": "Hello People!\nWe are the team of India Gone Viral News Portal.\n30+ Members actively working to provide the true and real time news happening all around the India and world."}, {"url": "https://isthmus.com/news/news/how-karofsky-pulled-it-off/", "title": "How Karofsky pulled it off", "authors": ["Dylan Brogan", "David Blaska"], "date": "2020-04-14", "keywords": ["state", "counties", "votes", "wagner", "supreme", "vote", "karofsky", "election", "pulled", "court", "wisconsin"], "summary": "Dane County Judge Jill Karofsky defeated incumbent Justice Daniel Kelly in Wisconsin’s spring election by more than 160,000 votes.\nIt was the largest margin of victory in a Wisconsin Supreme Court race in more than a decade.\nVoter turnout was 55.5 percent in Dane County on April 7; 43 percent turned out in spring 2019, which also featured a state Supreme Court race.\n“I think Wisconsinites...have come around to the fact that [state] Supreme Court races are partisan races now.\n“Based on polling and early turnout of voters about two weeks ago, it looked like Karofsky had the advantage,” says Wagner."}, {"url": "https://www.motherjones.com/politics/2020/04/voter-purges-wisconsin-republican-election/", "title": "Republicans Are Trying to Kick Thousands of Voters Off the Rolls During a Pandemic", "authors": ["Ari Berman", "Becky Z. Dernbach", "Kara Voght", "Aj Vicens", "Delilah Friedler", "Dan Spinelli", "Inae Oh", "David Corn", "Laura Thompson", "Nathalie Baptiste"], "date": "2020-04-14", "keywords": ["registration", "pandemic", "voting", "trying", "state", "voters", "states", "kick", "purge", "rolls", "vote", "election", "republicans", "voter", "thousands"], "summary": "Roll ReversalsBetween 2016 and 2018, more than 17 million names were taken off voter rolls nationwide.\nWisconsin: 14% of voters removed, 2016-18In 2017, Wisconsin officials mailed postcards to 340,000 registered voters thought to have moved, informing them that they would be removed from voter rolls if they did not respond.\nOklahoma: 11.7% of voters removed, 2016-18Oklahoma’s “use-it-or-lose-it” voter registration law means voters are purged if they don’t vote for several election cycles and don’t respond to a mailing.\nFrom 2016 to 2018, 17 million Americans—8 percent of the nation’s electorate—were taken off the voting rolls, according to the Brennan Center for Justice.\nLast year, Judicial Watch reached a settlement with California to reassess 1.5 million names on the voter rolls in Los Angeles County."}, {"url": "https://spectrumnews1.com/wi/madison/politics/2020/04/13/wisconsin-voters-approve-crime-victims-amendment", "title": "Wisconsin voters approve crime victims amendment", "authors": ["Published Pm Et Apr."], "date": "2020-04-13", "keywords": ["victims", "crime", "amendment", "law", "voters", "victim", "state", "approve", "right", "amendments", "passed", "results", "rights", "wisconsin"], "summary": "MADISON, Wis. (AP) — Wisconsin voters have approved amending the state constitution to guarantee crime victims more rights.\nThe Wisconsin Constitution and state law already lay out a host of victim rights.\nWisconsin constitutional amendments must pass two consecutive legislative sessions and a statewide referendum before they can be added to the document.\nThe Legislature passed the victim rights amendment in November 2017 and November 2019.\nSupporters have dubbed the amendments “Marsy’s Law” for California college student Marsalee Nicholas, who was killed by an ex-boyfriend in 1983."}, {"url": "https://www.wisfarmer.com/story/news/2020/04/16/swigg-update-identifying-sources-contamination-private-wells/5143918002/", "title": "SWIGG study update – Identifying sources of fecal contamination in private wells in Lafayette, Grant, and Iowa counties", "authors": ["Division Of Extension", "Published A.M. Ct April"], "date": "2020-04-16", "keywords": ["county", "sources", "grant", "identifying", "contamination", "water", "study", "wells", "swigg", "lafayette", "iowa", "private", "update", "wisconsin"], "summary": "(Photo: K. Abbott, Iowa County LCD)The Southwest Wisconsin Groundwater and Geology Study of Grant, Iowa, and Lafayette Counties is halfway through its second phase to identify fecal sources of contamination in private wells.\nThe study began in late 2018 with the goal of assessing the quality of drinking water sources from private wells in southwest Wisconsin and determining the probable sources of any contamination found.\nThe latest phase of the study found fecal contamination in 27 of the 34 private wells sampled.\nThe SWIGG study has been designed to sample water in all four seasons of the year since contaminant abundance can vary seasonally.\nSupport for the study comes from the counties and agencies involved, the Lafayette Ag Stewardship Alliance, the Iowa County Uplands Watershed Group and donations from Lafayette county citizens."}, {"url": "https://www.detroitnews.com/story/news/politics/2020/04/15/macomb-selfridge-air-base-snubbed-f-35-aircraft-trump-administration/5139613002/", "title": "Macomb's Selfridge base snubbed on F-35 aircraft", "authors": ["Keith Laing", "Published P.M. Et April"], "date": "2020-04-15", "keywords": ["macombs", "selected", "base", "selfridge", "national", "force", "aircraft", "air", "trump", "snubbed", "f35", "guard", "future"], "summary": "Washington — The Trump administration is deploying F-35 aircraft to Truax Field Air National Guard Base in Madison, Wisconsin, snubbing the Selfridge Air National Guard Base in Harrison Township.\n“The Department of the Air Force selected the 115th Fighter Wing and the 187th Fighter Wing as the next Air National Guard locations to receive the F-35A,” Air Force Secretary Barbara Barrett said in a Wednesday statement.\n“Putting F-35s at these two bases continues our transition into the next generation of air superiority.”Each F-35 Lightning II fighter jet requires more than 900 pounds of rare-earth materials (Photo: Lockheed Martin)Trump said in late January his administration was giving \"strong consideration\" to deploying F-35 aircraft to Selfridge Air National Guard Base.\nIn 2017, the U.S. Air Force announced Selfridge was not selected at that point to host one of the next two units of F-35A fighter aircraft.\nThe Air Force said then Selfridge and the other two finalists — Gowen Field Air National Guard Base in Idaho and Jacksonville Air Guard Station in Florida — were “reasonable alternatives” but not preferred."}, {"url": "https://isthmus.com/news/cover-story/wisconsin-s-choice-between-jill-karofsky-and-daniel-kelly-will-shape-its-future/", "title": "Supreme decision - Isthmus", "authors": ["Bill Lueders", "Josh K"], "date": "2020-03-25", "keywords": ["going", "justice", "law", "decision", "state", "supreme", "karofsky", "election", "isthmus", "kelly", "court", "wisconsin"], "summary": "The state Supreme Court race presents Wisconsin with a dramatic choice, especially given that Kelly, who was appointed to the bench in 2016 by Gov.\nEach of the last four conservative contenders for state Supreme Court, Kelly included, has been tied to extreme words and deeds.\nBut now that WILL has asked the Supreme Court for a final ruling, Kelly has said he would “rethink” his decision not to participate after this election is over.\nIn the nine contested state Supreme Court races since 2007, outside interests spent about $25 million, compared to $18 million by the candidates’ campaigns.\nRecusalKarofsky says Wisconsin has “one of the weakest recusal rules in the country” and would like the state Supreme Court to adopt tougher ones, especially when substantial donors are litigants."}, {"url": "https://news.illinoisstate.edu/2020/04/stevenson-center-alum-publishes-in-environmental-sociology/", "title": "Stevenson Center alum publishes in Environmental Sociology", "authors": ["Shaylin Quaid"], "date": "2020-04-16", "keywords": ["sociology", "environmental", "center", "peace", "masters", "research", "publishes", "dondanville", "stevenson", "peruvian", "development", "community", "alum", "volunteer", "students", "corps"], "summary": "Stevenson Center for Community and Economic Development graduate students have assisted communities all over the globe, through Peace Corps, AmeriCorps, and other organizations.\nBoth Dougherty and Dondanville were part of the now-retired Peace Corps Master’s International program that allowed graduate students to combine their studies with Peace Corps service.\nWorking and being successful as a Peace Corps volunteer is incredibly dependent on successful cultural integration.\nI thought that receiving an education from various disciplines really enhanced my on-campus experience, as well as my capabilities as a Peace Corps Volunteer and field researcher.\n”The Stevenson Center also manages the Peace Corps Prep program for undergraduate students interested in Peace Corps service or careers in the public sector."}, {"url": "https://isthmus.com/opinion/feedback/feedback-12-05-2019/", "title": "Feedback for Dec. 5, 2019", "authors": [], "date": "2019-12-05", "keywords": ["family", "feedback", "states", "dec", "leave", "education", "2019", "teachers", "students", "snowmobile", "public", "wisconsin", "left"], "summary": "Family leave is unpaidRe: “Biology was destiny” (11/28/2019): The article mentions both the Wisconsin Family And Medical Leave Act of 1998 and the federal Family and Medical Leave Act of 1993, which guarantee six and 12 weeks of leave, respectively, for the birth of a child.\nHowever, I just wanted to point out that the family leave under both laws is unpaid.\nThis situation has been ongoing for years, so how can you fault the legislators for giving up on public education?\nWisconsin once excelled in education; now students can’t read or understand the Constitution/articles etc.\nSnowmobilers, I ask you, “Can you say the same?”I know that the snowmobile industry and lobby is strong in Wisconsin."}, {"url": "https://www.insidethehall.com/2020/04/15/top-moments-from-the-2019-20-indiana-mens-basketball-season-moments-10-6/", "title": "Top moments from the 2019-20 Indiana men's basketball season: Moments 10-6", "authors": ["Cameron Drummond"], "date": "2020-04-15", "keywords": ["mens", "davis", "game", "basketball", "201920", "indiana", "season", "win", "moments", "106", "played", "thompson", "points", "millers"], "summary": "Cameron Drummond 04/15/2020 10:13 am in CommentaryWith the 2019-20 NCAA men’s college basketball season officially over due to the COVID-19 pandemic, plenty of time has been spent reflecting on what was an eventful campaign for the Indiana Hoosiers.\nHunter finished the season with a 3.8 points per game average across 30 games played, but his journey is far from over.\nThis remained the standout moment of the season from Davis, who like Devonte Green finished his IU career without an NCAA tournament appearance.\nThompson played 20 or more minutes in six of Indiana’s final nine games this season, and Thompson figures to be an important part of the plan next season as well.\nStay tuned for tomorrow’s release of the final five defining moments of the 2019-20 Indiana men’s basketball season."}, {"url": "https://isthmus.com/events/transgender-day-of-remembrance/", "title": "Transgender Day of Remembrance", "authors": [], "date": "2019-11-08", "keywords": ["transgender", "usa", "20", "sanctuary", "circle", "day", "world", "remembrance", "wi", "temple"], "summary": "press release: 12 PM – 1 PM, Wednesday, November 20, 2019, Circle Sanctuary Nature Preserve, 5354 Meadowvale Road, Barneveld, WI 53507https://www.facebook.com/ events/1196526207198946/Every year on November 20, Circle Sanctuary holds an Interfaith Memorial Ceremony at its Temple.\nSelena Fox will facilitate this year’s event, as part of Circle Sanctuary’s participation in the international Transgender Day of Remembrance (TDOR).\nTransgender Day of Remembrance, which began in 1999, is held across the USA and around the world on and near November 20 to memorialize those killed due to anti-transgender hatred and prejudice."}, {"url": "https://isthmus.com/events/brian-courtney-wllson-anita-wilson-fall-gospel-fest-choir/", "title": "Brian Courtney Wllson, Anita Wilson, Fall Gospel Fest Choir", "authors": [], "date": "2019-10-17", "keywords": ["courtney", "experience", "wilson", "gospel", "brian", "wllson", "music", "anita", "yes", "2019", "fest", "stars", "fall", "choir", "worship"], "summary": "press release:SSM Health Fall Gospel Fest6:30pm-9:30m, Saturday, November 16, 2019, High Point Church, 7702 Old Sauk Rd.\nYes, Fall Gospel Fest is just around the corner!\nFall Gospel Fest, Madison's premier gospel music event provides a platform that brings people together and allows attendees to enjoy some of gospel music's biggest stars, including rising and local gospel favorites to produce an awesome experience of great music, fellowship and praise.\nThe 2019 Fall Gospel Fest line-up features Grammy-nominated artists Brian Courtney Wilson, Anita Wilson and the Fall Gospel Fest Choir.\nCome join us for our 15th annual worship experience!"}, {"url": "https://isthmus.com/events/veterans-day-celebration-madison-college/", "title": "Veterans Day Celebration", "authors": [], "date": "2019-11-08", "keywords": ["event", "local", "wright", "withe", "veterans", "rsvp", "american", "day", "truax", "celebration", "madison", "native"], "summary": "press release: The Native American Student Association (NASA) at Madison Area Technical College (MATC) would like to send an invitation to our local veterans, their friends, and family.\nOn November 15, 2019, we will be hosting our 3rd Annual Veteran’s Day Celebration from 5:30pm-8:30pm at the Truax Campus located at 1701 Wright Street in Madison, WI.\nThe event will include a Native American Color Guard and drum group.\nA feast of traditional Native American food will be served.\nIn addition, gifts and door prizes will be given to all Veterans."}, {"url": "https://isthmus.com/events/open-relationship/", "title": "Open Relationship", "authors": [], "date": "2019-11-07", "keywords": ["public", "n", "mfa", "lofts", "relationship", "open", "students", "reception", "street", "scheeler"], "summary": "press release: Wednesday, November 13, from 5:00 –8:00 p.m., the 4-D area MFA candidates at the University of Wisconsin-Madison will host a reception for their group exhibition titled Open Relationship, located in the Art Lofts Gallery at 111 N. Frances Street.\nFeatured in the exhibition include all 4-D area MFA students, as well as students specializing in other areas, and one undergraduate.\nOpen Relationship will be on display for the public beginning Monday, November 11, and will close Thursday, November 14.\nThe Art Lofts Gallery is located at 111 N. Frances Street, across from the Kohl Center.\nThis event is free and open to the public."}, {"url": "https://isthmus.com/events/houdini-club-of-wisconsin/", "title": "Houdini Club of Wisconsin", "authors": [], "date": "2019-10-14", "keywords": ["houdini", "shows", "west", "club", "magicians", "open", "magic", "wi", "wanted", "wisconsin"], "summary": "press release: The Houdini Club of Wisconsin will be celebrating their 81st year with two Gala Magic Shows, on Friday, November 1 and Saturday, November 2 at 8 p.m. each night.\nThe Houdini Club of Wisconsin was founded in 1938 by three corresponding magical devotees who wanted to have a state-wide magic club, with the potential for an occasional get-together.\nThe club is linked by means of a newsletter, The Houdini Gram.\nMagicians from all over the United States of America are members of the club.\nThis years edition of the show features magicians from Wisconsin as well as from Texas, Pennsylvania and Kentucky."}, {"url": "https://www.channel3000.com/october-2019-snowiest-october-on-record-for-madison/", "title": "October 2019 snowiest October on record for Madison", "authors": ["Posted", "Updated"], "date": "2019-11-01", "keywords": ["wind", "inches", "snowfall", "snowiest", "wisctv_news3", "day", "record", "2019", "madison", "wisconsin"], "summary": "October 2019 snowiest October on record for MadisonStephanie Fryer by Stephanie FryerOctober 2019 is now the snowiest October on record for Madison.\nOur back-to-back snow storms this past week have dumped 8.0 inches.\nA snowfall record of 1.1 inches was set overnight for Oct. 30.\nTemperatures will be falling into the 20s during trick-or-treat hours, but wind chills will be in the teens and low 20s.\nWe update with short, easy-to-use video forecasts you can watch on your phone every day."}, {"url": "https://isthmus.com/events/voice-of-our-youth-research-summit/", "title": "Voice of Our Youth Research Summit", "authors": [], "date": "2019-09-12", "keywords": ["county", "dane", "youth", "survey", "public", "research", "data", "summit", "school", "madison", "voice"], "summary": "press release: This year, the Dane County Youth Commission and partners will be hosting the first Voice of Our Youth--DCYA Research Summit on Friday, November 8, 2019 at UW Madison, Union South!\nA central focus of this event will be to elevate youth voice, through the data and through youth participation!\nWhat is the Dane County Youth assessment?\nSince 1980, Dane County youth in grades 7-12 have been surveyed regarding their opinions, concerns, attitudes, behaviors and experiences.\nThe 2018 Youth Assessment was a collaborative effort led by the Dane County Youth Commission in partnership with the United Way of Dane County, Public Health Madison & Dane County, the City of Madison, seventeen public school districts and one private high school."}, {"url": "https://isthmus.com/events/diwali-night/", "title": "Diwali Night", "authors": [], "date": "2019-10-21", "keywords": ["union", "various", "uw", "stage", "diwali", "night", "students", "vibrant", "staff", "indian", "vimal"], "summary": "× Expand Vimal Konduri Dancers at Diwali Night.\npress release: Diwali Night is Indian Graduate Students Association’s biggest annual cultural event – a time where we all come together to celebrate the Indian festive season.\nIt is an evening showcasing the diverse and vibrant culture of India via various dance, music and other stage performances by UW students, faculty, staff and members of the Madison community.\nAdmission is free, and doors open at 4:30 pm.\n5-8 pm, Sunday, November 17, Shannon Hall, Memorial Union"}, {"url": "https://isthmus.com/events/yule-festival-circle/", "title": "Yule Festival", "authors": [], "date": "2019-11-21", "keywords": ["traditionally", "winter", "solstice", "sanctuary", "festival", "storytelling", "community", "nature", "encourage", "yuletide", "yule"], "summary": "press release: 10 am-6:30 pm, Saturday December 21, 2019, Circle Sanctuary Nature Preserve, 5354 Meadowvale Road, Barneveld.\n(608) 924-2216Join the Circle Sanctuary community as we celebrate the Winter Solstice.\nYule is traditionally a time for sharing food and drink, storytelling and music, traditions and lore, and celebration of the community we all share.\nYule is also traditionally a time for family, and we encourage bringing children of all ages!\nCooking and ornament making, Nature Walks, Winter Solstice Goddesses Workshop with Selena Fox, Birdseed crafting, Community Gifting, Yuletide Bards and Storytelling, & Yuletide Ritual with Rev."}, {"url": "https://isthmus.com/events/synonyms/", "title": "Synonyms", "authors": [], "date": "2019-10-03", "keywords": ["nadav", "spotlight", "synonyms", "personal", "2019", "mmocas", "french", "end", "cinema", "lucio"], "summary": "press release: MMoCA’s Spotlight Cinema features premieres of critically acclaimed and award-winning documentary and feature films.\nThis year’s series includes Lucio Castro’s End of the Century, an alluring art-house romance set in sunsoaked Barcelona.\nSpotlight Cinema is curated by Mike King, and is a program of MMoCA’s education department.\nNOVEMBER 13, 2019 • 7 PM: Synonyms (2019, France/Israel/Germany, 123 min., Digital)Dir: Nadav Lapid; Cast: Tom Mercier, Quentin Dolmaire, Louise ChevillotteWinner of the Golden Bear at the Berlin Film Festival and already appearing on Best of the Decade lists, here is an immigrant tale like no other.\nBased on director Nadav Lapid’s personal experiences, Synonyms is an exhilarating reckoning with nationalism and personal history."}, {"url": "https://isthmus.com/events/mike-leckrone-wisconsin-showman/", "title": "Mike Leckrone: Wisconsin Showman", "authors": [], "date": "2019-10-31", "keywords": ["wisconsinmadison", "union", "university", "wpt", "mike", "watch", "leckrone", "showman", "nov", "work", "w", "wisconsin", "wisconsins"], "summary": "× Expand Amandalynn Jones Mike Leckronepress release: Mike Leckrone: Wisconsin's ShowmanGo inside the life and work of the legendary University of Wisconsin-Madison band director.\nAfter the screening, enjoy a special live Q&A with Mike Leckrone!\n7 p.m. Wednesday, Nov. 20, Union South, Marquee Theater, 1308 W. Dayton St.Can't make the event?\nWatch on WPT 7 p.m. Tuesday, Nov. 26."}, {"url": "https://www.theicegarden.com/2020/4/16/21212837/the-wraparound-april-16-womens-hockey-story-links", "title": "The Wraparound: April 16", "authors": ["Michelle Jay", "Apr"], "date": "2020-04-16", "keywords": ["pride", "national", "ice", "201920", "hockey", "16", "womens", "season", "win", "team", "best", "wraparound"], "summary": "Here’s three on women’s hockey from us and Eyes On The Prize.\nBoston College’s Hannah Bilka is the 2019-20 National Rookie of the Year | NCAA.comBoston College’s Hannah Bilka has been named the 2019-20 National Rookie of the Year in women’s ice hockey.\nSwedish women’s hockey All-Star Team - second team - Hockey SwedenNärmare 100 aktiva eller före detta damspelare har röstat fram tidernas All-Star Team i svensk damhockey.\nSwedish women’s hockey All-Star Team - first man - Hockey SwedenNärmare 100 aktiva eller före detta damspelare har röstat fram tidernas All-Star Team i svensk damhockey.\n's Marilyn Fortin hopes to keep spot on Switzerland national hockey team for next year’s world championship | The Journal PioneerBedeque’s Marilyn Fortin has played hockey for the Swiss national team in the past but never at an International Ice Hockey Federation (IIHF) event."}, {"url": "https://isthmus.com/events/festival-choir-of-madison-nov-2/", "title": "Festival Choir of Madison", "authors": [], "date": "2019-10-09", "keywords": ["concert", "fate", "tickets", "song", "sergei", "festival", "singers", "stabat", "choir", "madison", "schicksalslied"], "summary": "The venerable Festival Choir of Madison offers music with a conscience and a global perspective, but also has tackled esoteric topics like angels and demons.\nAt this concert, the choristers will explore another rarefied subject: fate.\npress release: Festival Choir of Madison will present the first concert of the season, “Songs of Fate”, on Saturday, November 2, 2019, at 8:00 PM at Luther Memorial Church, 1021 University Ave., Madison.\nThe choir under its artistic director, Sergei Pavlov, will perform “Gesang der Parzen” and “Schicksalslied” by Johannes Brahms, “Stabat Mater”by Giuseppe Verdi, and Alexander Borodin’s “Polovtsian Dances,” featuring the Romanian pianist Samir Golescu.\nFestival Choir of Madison is an auditioned, mixed-voice volunteer choir of over 50 experienced singers."}, {"url": "https://isthmus.com/events/madison-public-market-holiday/", "title": "Madison Public Market", "authors": [], "date": "2019-11-18", "keywords": ["market", "stopping", "little", "vendors", "holiday", "library", "check", "public", "santa", "madison"], "summary": "press release: Our holiday market is fast approaching!\nJoin us this Saturday, December 14th from 11am - 3pm for a fun and festive holiday market, hosted by the Madison Public Market.\nIn addition to these wonderful vendors, the following events will also be available as part of the market festivities:11-3: The Madison Public Library will be hosting crafts for the little ones including button making and color your own bookmarks.\nYou will also be able to check out holiday books, and register for your very own library card!\n12:45-1: Madison Santa Cycle Rampage will be stopping by to spread a little holiday cheer on their ride around Madison."}, {"url": "https://isthmus.com/events/frozen-2-party/", "title": "\"Frozen 2\" Party", "authors": [], "date": "2019-11-20", "keywords": ["frozen", "theatres", "treat", "party", "movie", "tickets", "way", "cinema", "tip", "free", "variety", "marcus"], "summary": "press release: “Frozen 2” is already on everyone’s holiday must-see movie list, so why not make your outing even more special by heading to Marcus Theatres for a free family party?\nPro tip: the parties are a great way to burn off extra energy before or after the film!\nMovie admission sold separately.\nFor event details and movie tickets: http://bit.ly/2JOTvxY.\n· Marcus Point Cinema in Madison and Marcus Palace Cinema in Sun Prairie"}, {"url": "https://isthmus.com/events/climate-fast-forward/", "title": "Climate Fast Forward", "authors": [], "date": "2019-08-14", "keywords": ["recommendations", "climate", "change", "forward", "conference", "fast", "solutions", "resilience", "wisconsin", "strategy"], "summary": "press release: On November 8, 2019, the Wisconsin Academy of Sciences, Arts & Letters and partners will bring together the state's best strategic thinkers on climate change for Climate Fast Forward, a working conference designed to \"fast forward\" solutions for carbon reduction and climate resilience in Wisconsin.\nTaking place at the Monona Terrace Community and Convention Center in Madison, Climate Fast Forward will include a projected 300 leaders from a variety of sectors in Wisconsin.\nClimate Fast Forward participants will work together to develop key recommendations for how Wisconsin can become a clean energy leader with a practical plan to deal with climate change.\nThese key recommendations will be shared with top-level decision makers, the media, and the general public as a call to fast-track Wisconsin's response to climate change.\nThe Climate Fast Forward conference is an opportunity to advance ready-to-go solutions and deliver a climate change strategy that will benefit the entire state.\""}, {"url": "https://isthmus.com/events/yazmin/", "title": "Yazmin", "authors": [], "date": "2019-10-25", "keywords": ["yazmin", "concerts", "house", "contact", "cuban", "seats", "ticket", "music", "life", "reserve"], "summary": "press release: YAZMIN, Friday, November 15.\nYazmin Bowers has lived a life of music from day one, having grown up on the shores of Lake Superior with musician parents.\nCuban music has played a big role in her life and she spends much of her time making music in that country.\nAt the concerts, we offer free snacks and (decaf) coffee, and beer, wine and soda for a small donation.\nContact us at annedave@chorus.net for more info and to reserve your seats."}, {"url": "https://isthmus.com/all-events/photos/isthmus-cat-issue-readers-cats/", "title": "#IsthmusCatIssue", "authors": [], "date": "2019-11-27", "keywords": ["youre", "stella", "thankful", "isthmuscatissue", "thewinston313", "sushi", "using", "submitted", "weve", "warning", "maya"], "summary": "We're so thankful for our cats, we dedicated an entire issue to them.\nWe see you're thankful for your kittehs, too.\nIsthmus readers submitted photos on social media using #IsthmusCatIssue and we've compiled them here.\nWarning: Cuteness overload.\nStarlord Ansel Pat Merkes Maya Elizabeth Olcikas Cheetoh Buddy thewinston313 Sushi Stella Belly Rep_Melissa Ray Mowgli Oscar Otis Piper Po Meg Krueger Kitty Maya Maisie Little joycardin Jenga HP Lovekitty Hermione Farquaad and Fiona Baby Elinor bloranc3 Cheeto & Kumquat Dublin & Finnegan Eowyn Asesumotina Angelo @abloodman"}, {"url": "https://isthmus.com/food-drink/mad-fave-vegan-dishes-2019/", "title": "Five (actually six) vegan entrees you need to try in Madison, Wisconsin", "authors": [], "date": "2019-11-12", "keywords": ["wisconsin", "actually", "topped", "butternut", "tsos", "tie", "try", "squash", "thai", "food", "williamson", "vegan", "madison", "entrees", "need", "curry"], "summary": "× Expand Chris Hynes Butternut squash curry at EverlyVegan.\nBut increasingly, Madison restaurants are cooking for vegans and annotating their menus to cater to those who forego animal products.\nThe butternut squash curry at Everly is, like much of Everly’s food, vegetable-centric (and scrupulously noted on the menu when vegan).\n(tie) Squash curry at Lao Laan-Xang is for squash lovers — and anyone who loves Thai food.\nAcorn and butternut squash as well as zucchini are joined by slices of Thai eggplant."}, {"url": "https://www.channel3000.com/51-things-to-do-in-madison-this-november/", "title": "51 things to do in Madison this November", "authors": ["Posted"], "date": "2019-11-01", "keywords": ["things", "center", "music", "come", "songs", "51", "night", "art", "nov", "theater", "madison", "play"], "summary": "51 things to do in Madison this NovemberFestive performances and holiday eventsDana Munro by Dana MunroThe smash hit \"Hamilton\" takes to the stage at Overture Center this month.\nOne of the only remaining ones is coming to Madison this month.\nThis new film, ” Synonyms,” can be seen at the Madison Museum of Contemporary Art.\nHear them play songs from Trigger Hippy’s second album at High Noon Saloon.\nNov. 16TheaterAfter years of anticipation, the show of the decade has finally arrived in Madison."}, {"url": "https://isthmus.com/events/garver-feed-mill-open-house/", "title": "Garver Feed Mill Open House", "authors": [], "date": "2019-10-10", "keywords": ["history", "tours", "supply", "house", "speakers", "spaces", "sharing", "feed", "garver", "open", "sign", "madison"], "summary": "× Expand Baum Revisionpress release: Garver Open HouseMeet the Collective: November 1, 2019, 3pm - 10pmJoin us in celebrating Madison’s newest multi-faceted destination and the 11 locally owned businesses revolutionizing their industries at Garver Feed Mill.You’re invited to a special Garver experience that will feature the producers individually and collaboratively as they showcase products and services through in-space demonstrations.\nAll attendees will have the chance to participate in a behind the scenes tours of spaces with the business owners.\nRSVP - https://www.eventbrite.com/e/ garvers-open-house-tours- storytelling-history-panel- tickets-75693488261Story Gathering Station - Share your memories of Garver Feed Mill!\nHelp document the unique history of the building known as Garver Feed Mill on Madison's East Side.\nStories will be added to a new collection in the Living History Project, the digital repository hosted by Madison Public Library."}, {"url": "https://isthmus.com/events/comedy-at-the-cabaret-nov-14/", "title": "Comedy at the Cabaret", "authors": [], "date": "2019-11-04", "keywords": ["jake", "allie", "north", "snell", "music", "showcase", "street", "lineup", "comedy", "cabaret"], "summary": "× Expand Allie Lindsaypress release: Comedy at The Cabaret celebrates 2-Year Anniversary!\nLovable local comic, Allie Lindsay, produces and hosts this fantastic stand-up comedy showcase at the sexy North Street Cabaret, which highlights the most talented comics in the Midwest, and beyond!\nPaired with original music by the multi-talented comic and musician, Jake Snell, this is easily the hottest comedy showcase on the east side!\nAllie has put together another tight line-up, this time with of some of the best, most notable comics from Milwaukee and Madison!\nDOORS at 7/Show at 8 pm, North Street Cabaret: 610 North Street (blue building across from the Tip Top Tavern)."}, {"url": "https://www.channel3000.com/winter-storm-to-affect-travel-with-snow-in-northwestern-wisconsin-rain-wind-elsewhere/", "title": "Winter storm to affect travel with snow in northwestern Wisconsin; rain, wind elsewhere", "authors": ["Posted", "Updated"], "date": "2019-11-26", "keywords": ["winter", "wind", "affect", "snow", "expected", "storm", "winds", "temperatures", "morning", "high", "night", "travel", "northwestern", "rain", "wisconsin"], "summary": "Winter storm to affect travel with snow in northwestern Wisconsin; rain, wind elsewhereGary Cannalte by Gary CannalteCopyright 2019 by Channel 3000.\nA storm system will affect the Midwest from later Tuesday through Wednesday morning with wind, rain and accumulating snow for areas northwest of Madison.\nRain will develop around mid-afternoon Tuesday as high temperatures still reach the middle 40s.\nAir travel may also be affected by snow and high winds.\nHigh winds may affect operations at O’Hare and Midway airports in Chicago and possibly Detroit, as well."}, {"url": "https://www.channel3000.com/hundreds-of-air-force-members-from-southern-wisconsin-return-home-to-family-and-friends/", "title": "Hundreds of Air Force members from Southern Wisconsin return home to family and friends", "authors": ["Posted", "Updated"], "date": "2019-11-10", "keywords": ["hundreds", "family", "support", "southern", "months", "wing", "force", "troops", "friends", "members", "middle", "air", "fighter", "janczak", "military", "madison", "return", "wisconsin"], "summary": "Hundreds of Air Force members from Southern Wisconsin return home to family and friendsAdam Duxter by Adam DuxterHundreds of airmen from the 115th Fighter Wing returned home to family and friends at Truax Field in Madison on Saturday evening.\nA MILITARY REUNION:200 members of the 115th fighter wing came back to Madison tonight.\npic.twitter.com/YRelSv79bR— Adam Duxter (@News3Adam) November 10, 2019According to military leaders, the troops saved over 10 Afghan National Army outposts that were under attack during their time overseas.\nFor Rebecca Janczak, it’s an opportunity to see her boyfriend, Robert Weeden, after months apart.\nShe joined Weeden’s parents, who said they’ve been relying on cellphone communication to stay in contact with him."}, {"url": "https://www.channel3000.com/madison-radio-station-switches-to-playing-all-holiday-tunes-for-season/", "title": "Madison radio station switches to playing all holiday tunes for season", "authors": ["Posted", "Updated"], "date": "2019-11-01", "keywords": ["tunes", "station", "snow", "mix1051madison", "playing", "holiday", "radio", "1051", "music", "season", "mix", "switches", "madison", "christmas"], "summary": "Madison radio station switches to playing all holiday tunes for seasonTabatha Wethal by Tabatha WethalFreeImages.com/RAWKU5 File photoAlthough Thursday was covered in snow and teeming with trick-or-treaters, a Madison radio station was already in the holiday spirit.\nWe’re now Madison’s Home for the Holidays (you can thank all that snow on the ground!)\npic.twitter.com/w76WGSUBcW— MIX 105.1 (@Mix1051Madison) October 31, 2019WMHX MIX 105.1 announced on its website and social media Thursday that it has made the seasonal change to “play Christmas music all the time” on Halloween.\nOn its Twitter account, 105.1 said the reason for the Oct. 31 switch is because the “snow has got us in the Christmas spirit.”Last year, the station switched to holiday music on Nov. 15.the amount of people that don’t like Christmas music is crazy.\ny’all are on Santa’s naughty list pic.twitter.com/DeINSMoEKs— MIX 105.1 (@Mix1051Madison) November 1, 2019Get your weather forecast from people who actually live in your community."}, {"url": "https://isthmus.com/events/Kids-in-the-Rotunda-Madison-Mystery-Tour/", "title": "Kids in the Rotunda", "authors": [], "date": "2019-09-03", "keywords": ["wisconsin", "tours", "tour", "thrilled", "beatles", "state", "music", "rotunda", "specializes", "kids", "madison", "mystery"], "summary": "Music by Madison Mystery Tour, 9:30 am, 11 am & 1 pm.\npress release: Madison Mystery Tour is a Madison-based group that specializes in note-for-note renditions of the music of the Beatles.\nDubbed “the Beatles Purists” by the Wisconsin State Journal, Madison Mystery Tour’s fun, engaging shows have been drawing sell-out crowds for years.\nThey are thrilled to return to Kids in the Rotunda for a celebration of the Fab Four with songs, stories, and audience participation."}, {"url": "https://isthmus.com/events/natty-nation-acoplados-atimevu-dj-trichrome/", "title": "Natty Nation, Acoplados, Atimevu, DJ Trichrome", "authors": [], "date": "2019-11-06", "keywords": ["acoplados", "folk", "dance", "natty", "class", "black", "music", "atimevu", "trichrome", "latin", "nation", "w", "dj"], "summary": "Madison reggae ambassadors Natty Nation provide a musical oasis each Thanksgiving weekend for those who are ready to dance off some turkey, or just recover with a beverage from frenzied Black Friday shopping adventures.\nAlong with an extended NN set, this year’s show includes Afro-Latin folk by Acoplados (plus a dance lesson at 8:15 pm), traditional Ghanaian music by Atimevu, and DJ Trichrome.\n*Latin Dance class w/ Luis Armacanqui!\nImmerse yourself for the 1st time in the movements of Bachata or Salsa; or, refresh your steps learned long ago with one of Madison's Latin dance legends, Luis!\nFull schedule:7:30 - doors/ DJ Trichrome8:15-9:00 - Latin Dance class w/ Luis9:00-10:00 - Acoplados / Folk Afro Latin Music10:00-10:30 - DJ Trichrome10:30-12:00 - NATTY NATION12:00-1:00 - Atimevu___________________"}, {"url": "https://isthmus.com/events/the-power-of-storytelling-traditional-ecological-knowledge/", "title": "CANCELED: The Power of Storytelling & Traditional Ecological Knowledge", "authors": [], "date": "2019-10-30", "keywords": ["ecological", "canceled", "partners", "lecture", "special", "storytelling", "nelson", "traditional", "knowledge", "power", "mary", "louise", "willow"], "summary": "Due to unforeseen circumstances, the Nelson Institute and its partners regrettably must cancel the Everyone's Earth Lecture: The Power of Storytelling and Traditional Ecological Knowledge on Thursday, November 21, 2019.press release: Join the Nelson Institute and its partners for a special Native November Everyone's Earth lecture featuring the Fall 2019 UW-Madison Elder-in-Residence, Mary Louise Defender-Wilson.\nThis lecture series helps to spotlight issues and opportunities related to diversity and inclusion across the environmental spectrum.\nA nationally renowned traditional Dakotah/Hidatsa elder, storyteller, and traditionalist enrolled at the Standing Rock Indian Reservation of North Dakota, Mary Louise has been honored for her artistry with multiple awards including the Arts National Heritage Award as well as multiple Native American music and spoken words awards.\nWe invite you to join us for a special evening with Mary Louise where we will explore the power of storytelling and traditional ecological knowledge.\nFor more information visit: go.wisc.edu/everyonesearth2019Free parking is available near Dejope Hall after 4:30 p.m. in:Lot 57, 632 Willow DriveLot 58, 1975, Willow DriveLot 62, 525 Easterday Lane"}, {"url": "https://www.channel3000.com/new-start-dismissal-times-for-several-madison-schools-for-2020-21-school-year/", "title": "New start, dismissal times for several Madison schools for 2020-21 school year", "authors": ["Posted", "Updated"], "date": "2019-11-29", "keywords": ["start", "rewritten", "dismissal", "reserved", "middle", "202021", "times", "published", "school", "madison", "rights", "schools"], "summary": "New start, dismissal times for several Madison schools for 2020-21 school yearStephanie Fryer by Stephanie FryerCopyright 2019 by Channel 3000.\nSeveral Madison schools are changing start and dismissal times for the 2020-21 school year.\nHamilton, Toki and Wright middle schools will start at 8:40 a.m. during the next school year.\nThe Madison school board approved of changing school start times beginning in the 2019-20 school year.\nSix elementary and five middle schools will change in the 2021-22 school year."}, {"url": "https://www.channel3000.com/wisc-tv-gm-provides-rescan-antenna-project-details-for-over-the-air-viewers/", "title": "WISC-TV GM provides rescan, antenna project details for over-the-air viewers", "authors": ["Posted", "Updated"], "date": "2019-11-02", "keywords": ["tv", "watching", "gm", "viewers", "provides", "antenna", "rescan", "installation", "project", "overtheair", "weather", "process", "television", "details", "wisctv", "able"], "summary": "WISC-TV GM provides rescan, antenna project details for over-the-air viewersSite staff by Site staffiStock/DeshaCAMOn Oct. 18, WISC-TV conducted a government-mandated frequency change that required all Madison-area over-the-air television viewers to rescan their television sets to view WISC-TV and its related programming including News 3 Now, the NFL on CBS, and the CBS Television Network.\nSome have been able to rescan without a problem and are able to view us as they always have.\nWhen the switch happened, we began transmitting from a temporary antenna while construction and installation of our new permanent, top-mount antenna is underway.\nWhen the new antenna installation is finished, we will be broadcasting at full-power again with a stronger signal than is now, alleviating most reception issues people are currently experiencing.\nOnce the process is complete, you’ll be able to continue watching WISC-TV."}, {"url": "https://www.wpr.org/after-string-police-shootings-2019-will-see-increase-wisconsin-fatalities", "title": "After String Of Police Shootings, 2019 Will See Increase In Wisconsin Fatalities", "authors": ["Rob Mentzer"], "date": "2019-11-22", "keywords": ["wisconsin", "fatal", "string", "states", "state", "shootings", "data", "officers", "johnsrud", "training", "2019", "fatalities", "increase"], "summary": "A string of police shootings in recent weeks means Wisconsin will end 2019 with more deaths at the hands of police than in 2018.\nData from the WPPA and the Washington Post's public database of shootings show 2017 was a particularly deadly year, with 24 fatal shootings by police.\nThe 2019 data 11 of those killed were white, three were black and two were Hispanic.\nAccording to U.S. Census data, Wisconsin is 87.1 percent white, 6.4 percent black and 6.9 percent Latino.\nAmong Midwestern states, Missouri (22) and Ohio (19) have had more police shootings in 2019 than Wisconsin, according to the database."}, {"url": "https://isthmus.com/events/a-charlie-brown-christmas-live/", "title": "A Charlie Brown Christmas Live", "authors": [], "date": "2019-07-16", "keywords": ["snoopy", "twig", "vince", "winning", "charlie", "way", "peanuts", "watch", "live", "brown", "christmas"], "summary": "× Expand Dan Norman Cast members in \"A Charlie Brown Christmas Live.\"\nFor those who watch the classic animated special A Charlie Brown Christmas every holiday season, there’s a new way to enjoy this heartwarming tale of Snoopy, Charlie Brown, Linus, Lucy and the whole Peanuts gang as they discover the true meaning of Christmas.\nA Charlie Brown Christmas Live On Stage is the theatrical adaptation of the beloved cartoon, complete with the original jazz musical score of Vince Guaraldi.\nCharlie Brown is still mocked when he buys a droopy pine twig for a Christmas tree.\nBut when the snow begins to fall and the Peanuts kids try to catch the flakes on their tongues, it’s magical."}, {"url": "https://www.jconline.com/story/sports/2019/11/23/wisconsin-badgers-safety-collin-wilder-ejected-targeting-purdue-football/4187280002/", "title": "Wisconsin safety Collin Wilder ejected for targeting vs. Purdue football", "authors": ["Erik Hall", "Published P.M. Et Nov."], "date": "2019-11-23", "keywords": ["brycen", "safety", "half", "saturdays", "vs", "hit", "collin", "purdue", "wilder", "targeting", "ejected", "wisconsin", "football"], "summary": "CLOSEMADISON, Wisconsin — The Wisconsin football team lost safety Collin Wilder in the second half of Saturday's game against Purdue.\nWilder was ejected with 4:22 left in the third quarter for a hit on Purdue safety Brycen Hopkins.\nWisconsin DB Collin Wilder ejected for targeting off of this hit to Brycen Hopkins.\nWorth noting: Wilder will miss first half against Minnesota.\npic.twitter.com/DRq5lcE8Ga — Paul Harvey (@HammerHarvey) November 23, 2019Wisconsin DB Collin Wilder ejected for targeting after hit on Purdue’s Brycen Hopkins https://t.co/3lAskfEYIdpic.twitter.com/VrMsxqAdN6 — Wisconsin Badgers (@Wisconsin) November 23, 2019In addition to missing the rest of Saturday's game, Wilder will not be able to play the first half at Minnesota on Saturday, Nov. 30."}, {"url": "https://www.wisconsinwatch.org/2019/12/wisconsin-weekly-marijuana-is-dangerous-for-some-people-experts-warn/", "title": "Wisconsin Weekly: Marijuana is dangerous for some people, experts warn", "authors": ["Wisconsin Watch", "More Wisconsin Watch"], "date": "2019-12-02", "keywords": ["dangerous", "don", "weekly", "state", "hmong", "media", "warn", "watch", "experts", "journal", "marijuana", "university", "dementia", "wisconsin"], "summary": "You can change your preferences at any timeEmily Hamer / Wisconsin Watch Lena Stojiljkovic, a University of Wisconsin-Madison student, is seen in her friend’s apartment in Madison, Wis., April 10, 2019.\nWisconsin Watch — November 23, 2019As Wisconsin and other states eye possible legalization of marijuana for medical or recreational use, many effects of using cannabis are still not fully understood.\nEarlier: Mia Sato, a former Wisconsin Watch intern who explored the Hmong conference call networks for The Verge, learned about them while researching news deserts for Wisconsin Watch.\nWisconsin State Journal — November 26, 2019Saturated soils combined with a wetter-than-usual forecast could lead to widespread flooding and another year of delayed planting for Wisconsin farmers still struggling with one of the worst growing seasons in modern history.\nEmily Hamer / Wisconsin Watch Gov."}, {"url": "https://www.channel3000.com/callan-bird-bear/", "title": "Callan Bird Bear", "authors": ["Posted", "Updated"], "date": "2019-11-01", "keywords": ["loved", "machotka", "callan", "bear", "including", "music", "bird", "moreau", "love", "madison"], "summary": "Callan Bird BearSite staff by Site staffCallan Machotka Bird Bear, age of 15, of Teejop (Madison, Wis.) passed away on Monday, Oct. 28, 2019, at sunset.\nShe was born on April 8, 2004, in Teejop (Madison, Wis.), the daughter of Marianne (Machotka) and Aaron Bird Bear.\nHer family name comes from Bird Bear, a person of this continent who married Bear Woman.\nCallan is survived by her parents; grandparents, JoAnn and Robert Machotka and Carol Harvey & Dag Nedkvitne; two uncles, Robert Machotka and Duane Bird Bear Jr.; four aunts, Amy (Pascal) Moreau, Joletta Bird Bear, Theodora Bird Bear, and Malin Bird Bear; nine cousins, Ceera Machotka, Mason Machotka, Jonathon Moreau, Thomas Moreau, Antoine Moreau, Hadlie Bird Bear, Sander Bird Bear, Kennedie Bird Bear, Cooper Bird Bear; and the extended Bird Bear, Harvey, Galbraith, and Machotka families loved Callan dearly.\nShe was preceded in death by her grandfather, Duane T Bird Bear; and her great-grandparents, Dorothy and Lester Galbraith."}, {"url": "https://isthmus.com/events/the-gift-of-the-magi/", "title": "The Gift of the Magi", "authors": [], "date": "2019-11-25", "keywords": ["gift", "society", "offer", "performed", "octagon", "della", "magi", "watertown", "theater", "players", "room"], "summary": "This year’s production will be an adaptation of the famous O. Henry story of love and self-sacrifice, “The Gift of the Magi.” The show will be presented this Sat., Nov. 30. and Sun.. Dec. 1. from 11:00 to 3:00 each day, with a new performance every half hour.\nWanting to purchase a Christmas gift for the other, each gives up their most precious objects.\nThe actors will lead the viewers from room, to room and then downstairs into the kitchen where there will be demonstrations of crafts.\nOther events coming up at the Watertown Players Theater will be The Watertown Youth Theater Workshop which will present “Beauty and the beast Jr.,” in January, 2020.\nFor more information on “Gift of the Magi” please call the Octagon House at (920) 261-2796, or the Watertown Players information line, (920) 306-4364, or visit the Players on their Facebook page."}, {"url": "https://www.channel3000.com/madison-police-look-for-group-of-teenagers-in-west-side-carjacking/", "title": "Madison police look for group of teenagers in west side carjacking", "authors": ["Posted", "Updated"], "date": "2019-11-15", "keywords": ["man", "point", "incident", "west", "vehicle", "road", "look", "car", "sitting", "carjacking", "group", "knife", "madison", "teenagers"], "summary": "Madison police look for group of teenagers in west side carjackingJaymes Langrehr by Jaymes LangrehrMadison police say they’re looking for a group of teenagers after a 60-year-old man was carjacked while sitting in his vehicle Wednesday night.\nOfficers were called to the 400 block of South High Point Road, near the Marcus Point Cinema, at 8:49 p.m.\nPolice believe this incident is related to another attempted carjacking nearby less than 10 minutes earlier, at the KFC on Mineral Point Road.\nIn that incident, two teenagers showed a knife to a different man as he was waiting in the drive through.\nAnyone with information is asked to call Madison Area Crime Stoppers or the Madison Police Department."}, {"url": "https://www.fdlreporter.com/story/news/2019/11/25/fireball-lights-up-sky-across-wisconsin-saturday-night/4296573002/", "title": "'Fireball' lights up the sky in Wisconsin Saturday night, seen from Superior to Kenosha", "authors": ["Sarah Razner", "Published P.M. Ct Nov."], "date": "2019-11-25", "keywords": ["described", "meteor", "lights", "seen", "space", "sky", "lattis", "person", "track", "kenosha", "night", "superior", "according", "fireball", "known", "wisconsin"], "summary": "Also known as a \"fireball,\" Lattis said, these meteor sightings are \"fairly common if one spends any amount of time watching the sky.\"\nIn Winneconne, a person described it as like nothing she had ever seen before with its changing colors.\nMore typical than smell is noise — known to happen occasionally with the passage of a fireball, Lattis said.\nOne person in Michigan reported hearing a crackling sound with the fireball, according to IMO.\nWhen it comes to Saturday's fireball, Lattis has yet to hear of any findings."}, {"url": "https://isthmus.com/events/blue-years-eve/", "title": "Blue Year's Eve", "authors": [], "date": "2019-11-14", "keywords": ["jimmys", "wheelhouse", "eve", "party", "tickets", "midnight", "music", "wine", "blues", "blue", "oleary"], "summary": "One of Madison’s favorite New Year’s spots invites you to have a blue holiday.\nThe party will feature performances by bluegrass group WheelHouse, blues outfit the Chris O’Leary Band, and The Jimmys.\nTickets are $95, but include beer and wine and a midnight champagne toast.\npress release: DESTINATION BLUE YEAR’S EVE (December 31) – It’s all about the blues this year at The Edgewater’s Blue Year’s Eve Party.\nFrom the bluegrass music of WheelHouse to the blues styling of the Chris O’Leary Band and The Jimmy’s, the evening is made for music lovers."}, {"url": "https://www.twincities.com/2019/11/05/republicans-in-wisconsin-senate-fire-agriculture-secretary-governor-uses-profanity-to-blast-the-process/", "title": "Republicans in Wisconsin Senate fire agriculture secretary. Governor uses profanity to blast the process.", "authors": ["Scott Bauer"], "date": "2019-11-05", "keywords": ["secretary", "farmers", "governor", "uses", "state", "pfaff", "blast", "senate", "vote", "evers", "republicans", "process", "profanity", "veto", "wisconsin", "agriculture"], "summary": "MADISON, Wis. — Wisconsin’s Republican-controlled Senate fired the state agriculture secretary on Tuesday, and the Democratic governor who appointed him watched quietly a row behind lawmakers before using profanity to blast the process.\nThe Senate voted along party lines to fire Pfaff, with all 19 Republicans in favor and all 14 Democrats against.\nPfaff also upset Republicans and powerful agriculture industry groups when he moved forward with new siting rules, first started under Republican Gov.\nThe Senate was also slated to approve a constitutional amendment Tuesday weakening Evers’ veto powers.\nIt comes after Evers used his expansive veto authority this summer to increase funding for schools, above what Republicans approved in the state budget."}, {"url": "https://isthmus.com/events/the-greatest-war-shannon-hall/", "title": "The Greatest War: World War I, Wisconsin & Why It Still Matters", "authors": [], "date": "2019-09-25", "keywords": ["matters", "rock", "roll", "war", "today", "music", "performed", "photos", "world", "greatest", "live", "wisconsin"], "summary": "press release: The Greatest War rock ‘n’ roll history show is a multimedia live music exploration of the modern, living legacy of the First World War and the uneasy truce that ended it.\nHow are the events of World War One relevant to us today?\nFirst performed in front of a sold-out crowd on November 11, 2018–100 years to the day after the Armistice, The Greatest War: World War One, Wisconsin, and Why It Still Matters lays bare that legacy while searching for meaning in The War to End War.\nEqual parts rock opera and documentary, The Greatest War uses music, imagery, and words to tell the story of the Armistice and the war that lead up to it.\nNo prior knowledge of World War One is needed to enjoy this concert."}, {"url": "https://isthmus.com/events/hamilton/", "title": "Hamilton", "authors": [], "date": "2019-04-18", "keywords": ["tickets", "purchase", "prior", "store", "prices", "lottery", "hamilton", "overture", "app", "performance"], "summary": "One of the most anticipated tours in Broadway history, Hamilton is finally coming to Overture Center.\nHAMILTON is the story of America’s Founding Father Alexander Hamilton, an immigrant from the West Indies who became George Washington’s right-hand man during the Revolutionary War and was the new nation’s first Treasury Secretary.\nSingle tickets for HAMILTON are on sale for performances November 19 – December 8, 2019.\nAlso, producer Jeffrey Seller and Overture Center announced a digital lottery for HAMILTON tickets will begin in conjunction with the show’s first performance (November 19) in Madison at Overture Center.\nHOW TO ENTERUse the official app for HAMILTON , now available for all iOS and Android devices in the Apple App Store and the Google Play Store (http://hamiltonmusical.com/ app)."}, {"url": "https://spectrumnews1.com/wi/madison/news/2020/01/08/wisconsin-loses-10-percent-of-dairy-farms-in-2019", "title": "Wisconsin loses 10 percent of dairy farms in 2019", "authors": ["Published Pm Et Jan."], "date": "2020-01-08", "keywords": ["loses", "good", "price", "prices", "milk", "dairy", "2019", "farms", "dairies", "stephenson", "wisconsin", "schultz"], "summary": "MADISON, Wis. (SPECTRUM NEWS) — About 10 percent of dairy farms in Wisconsin closed in 2019.\nHe also said the holidays will naturally give milk prices a boost because it is the time of year with the most demand.\nOverall Stephenson projects 2020 to be a better year on average for milk prices than 2019.\n“For us and our family, just some kind of stability would be more beneficial than a higher price, a stable price,” Schultz said.\nIt could have a positive impact on dairy prices."}, {"url": "https://isthmus.com/news/cover-story/isthmus-cat-issue-2019/", "title": "The cat issue", "authors": [], "date": "2019-11-27", "keywords": ["cats", "dogs", "local", "popular", "visit", "special", "cat", "meow", "issue", "madison"], "summary": "× Expand Carolyn Fath AshbyLast year at Thanksgiving we put together a special issue celebrating Madison’s dogs, dog people, and dog culture.\nIn the popular phrase “It’s raining cats and dogs,” it’s the cats that come first.\nWhile cats, largely indoor pets, are less publicly visible than dogs, they are hardly less popular.\nAnd they, like dogs, are ineffably, unutterably, members of the family.\nIn our special Cat Issue, we visit a housecat show, elucidate the ins and outs of Madison cat law, discuss the negatives of declawing, and visit with the rescue Madison Cat Project."}, {"url": "https://isthmus.com/events/adult-swim-wizard-academy-yule/", "title": "Adult Swim", "authors": [], "date": "2019-11-08", "keywords": ["activities", "adult", "mandrake", "wand", "academy", "win", "yetspecial", "swim", "wizard", "yule"], "summary": "press release: Wizard Academy is coming back to Adult Swim, with a holiday twist!\nBy popular demand, Adult Swim at Madison Children’s Museum is bringing back our Wizard Academy theme; this year we’re channeling the festivity and drama of the Hogwarts Yule Ball!\nFeatured activities (so far!\n):Craft sparkling potions as jewelry, gifts, or ornamentsDelve into the obscure art and science of wand makingAdopt your own “adorable” mandrake from our mandrake nurseryCompete to win the Triwizard cup for your school in our most challenging scavenger hunt yet!\nSpecial Add-On Activities:"}, {"url": "https://finance.yahoo.com/news/ratelinx-named-march-2020-gartner-152432943.html", "title": "RateLinx Named in the March 2020 Gartner Midmarket Context: Magic Quadrant for Transportation Management Systems", "authors": [], "date": "2020-04-16", "keywords": ["market", "quadrant", "supply", "tms", "ratelinx", "logistics", "research", "midmarket", "magic", "management", "systems", "context", "named", "transportation", "visibility", "gartner"], "summary": "Industry-leading logistics data platform named againMADISON, Wis., April 16, 2020 (GLOBE NEWSWIRE) -- Gartner, the world’s leading research and advisory company, recently named RateLinx’s ShipLinx TMS in their latest Midmarket Context: Magic Quadrant for Transportation Management Systems again.\nRateLinx was named in this Magic Quadrant Perspective as one of 11 notable vendors.\nWe are proud to help organizations reduce costs within the entire logistics cycle.”RateLinx was previously named in the February 2020 Gartner Market Guides for Real-Time Visibility Providers and the December 2019 Gartner Market Guide for Freight Audit and Payment Providers.\nGartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact.\nThe RateLinx ecosystem is designed to reduce logistics costs and optimize operations, providing companies with shipment management, supply chain visibility, and financial settlement solutions."}, {"url": "https://www.theguardian.com/us-news/2020/apr/16/profit-over-people-cost-over-care-americas-broken-healthcare-exposed-by-virus", "title": "Profit over people, cost over care: America's broken healthcare exposed by virus", "authors": ["Amanda Holpuch", "Heidi Shierholz", "Robert Reich", "Renee C Wurth", "Jeffrey Pfeffer"], "date": "2020-04-16", "keywords": ["costs", "system", "americas", "broken", "health", "insurance", "doctor", "exposed", "medical", "healthcare", "virus", "profit", "cost", "treatment", "pay", "care"], "summary": "There were 27.9 million people without health insurance in 2018 and that figure is projected to increase by millions because of record-high unemployment.\nHow much testing and treatment costs individuals depends on if the patient was insured, how they were insured, and whether they survived.\nPhotograph: Damian Dovarganes/Associated PressAnd simply overcoming the American instinct to question how much medical treatment costs is a hurdle in the pandemic.\nSince 2006, 30% of Americans each year on average have delayed any sort of medical treatment for cost, according to the polling firm Gallup.\nWhile intensive care units and emergency rooms are billing sky-high figures, there has been a pause on non-essential care that has, in turn, cut medical system profits."}, {"url": "https://www.motherjones.com/politics/2020/04/voter-purges-wisconsin-republican-election/", "title": "Republicans Are Trying to Kick Thousands of Voters Off the Rolls During a Pandemic", "authors": ["Ari Berman", "Becky Z. Dernbach", "Kara Voght", "Aj Vicens", "Delilah Friedler", "Dan Spinelli", "Inae Oh", "David Corn", "Laura Thompson", "Nathalie Baptiste"], "date": "2020-04-14", "keywords": ["registration", "pandemic", "voting", "trying", "state", "voters", "states", "kick", "purge", "rolls", "vote", "election", "republicans", "voter", "thousands"], "summary": "Roll ReversalsBetween 2016 and 2018, more than 17 million names were taken off voter rolls nationwide.\nWisconsin: 14% of voters removed, 2016-18In 2017, Wisconsin officials mailed postcards to 340,000 registered voters thought to have moved, informing them that they would be removed from voter rolls if they did not respond.\nOklahoma: 11.7% of voters removed, 2016-18Oklahoma’s “use-it-or-lose-it” voter registration law means voters are purged if they don’t vote for several election cycles and don’t respond to a mailing.\nFrom 2016 to 2018, 17 million Americans—8 percent of the nation’s electorate—were taken off the voting rolls, according to the Brennan Center for Justice.\nLast year, Judicial Watch reached a settlement with California to reassess 1.5 million names on the voter rolls in Los Angeles County."}, {"url": "https://isthmus.com/opinion/feedback/feedback-12-05-2019/", "title": "Feedback for Dec. 5, 2019", "authors": [], "date": "2019-12-05", "keywords": ["family", "feedback", "states", "dec", "leave", "education", "2019", "teachers", "students", "snowmobile", "public", "wisconsin", "left"], "summary": "Family leave is unpaidRe: “Biology was destiny” (11/28/2019): The article mentions both the Wisconsin Family And Medical Leave Act of 1998 and the federal Family and Medical Leave Act of 1993, which guarantee six and 12 weeks of leave, respectively, for the birth of a child.\nHowever, I just wanted to point out that the family leave under both laws is unpaid.\nThis situation has been ongoing for years, so how can you fault the legislators for giving up on public education?\nWisconsin once excelled in education; now students can’t read or understand the Constitution/articles etc.\nSnowmobilers, I ask you, “Can you say the same?”I know that the snowmobile industry and lobby is strong in Wisconsin."}, {"url": "https://www.channel3000.com/50-things-to-do-in-madison-this-december/", "title": "50 things to do in Madison this December", "authors": ["Posted", "Updated"], "date": "2019-12-02", "keywords": ["winter", "things", "overture", "dance", "center", "dec", "50", "majestic", "madison", "christmas", "perform", "comes"], "summary": "50 things to do in Madison this DecemberOne word: ChristmasDana Munro by Dana Munrocourtesy of flickr Madison Ballet bringsFilmExplore the difficult reality of AIDS in America today with the exhibit “Still Beginning: The 30th Annual Day With(out) Art” at the Chazen Museum of Art.\nThirty-five years later, Cherish the Ladies arrive in Madison to perform “A Celtic Christmas” at Stoughton Opera House.\nSee the Madison premiere of “Jinpa” at Madison Museum of Contemporary Arts.\nDec. 13-15MusicLocal opera stars Mackenzie Whitney and Michelle Johnson lead the Madison Symphony Orchestra in “A Madison Symphony Christmas” at Overture Center.\nDec. 13-15MusicThe Madison Symphony Orchestra will lead a Free Community Carol Sing at Overture Center."}, {"url": "https://isthmus.com/events/blue-years-eve/", "title": "Blue Year's Eve", "authors": [], "date": "2019-11-14", "keywords": ["jimmys", "wheelhouse", "eve", "party", "tickets", "midnight", "music", "wine", "blues", "blue", "oleary"], "summary": "One of Madison’s favorite New Year’s spots invites you to have a blue holiday.\nThe party will feature performances by bluegrass group WheelHouse, blues outfit the Chris O’Leary Band, and The Jimmys.\nTickets are $95, but include beer and wine and a midnight champagne toast.\npress release: DESTINATION BLUE YEAR’S EVE (December 31) – It’s all about the blues this year at The Edgewater’s Blue Year’s Eve Party.\nFrom the bluegrass music of WheelHouse to the blues styling of the Chris O’Leary Band and The Jimmy’s, the evening is made for music lovers."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["prospects", "wire", "2020", "58", "won", "virtually", "upfield", "participate", "team", "touches", "packers", "wants", "invites", "nfl", "draft", "super", "tons"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Ohio State running back J.K. Dobbins:What he can do– Built low to the ground at 5-9.\nCompact frame, with big, powerful legs– Tons of experience as a one-cut runner.\nWants to get upfield with initial patience following by burst–..."}, {"url": "https://isthmus.com/events/wisconsin-chamber-orchestra_winter-celebration/", "title": "Wisconsin Chamber Orchestra", "authors": [], "date": "2019-12-10", "keywords": ["orchestra", "concert", "tickets", "reuterfoss", "violinist", "pine", "sandy", "chamber", "rachel", "kutz", "wisconsin"], "summary": "Wisconsin Chamber Orchestra is pulling out all the stops with a surprise year-end classical concert featuring virtuoso violinist Rachel Barton Pine; mezzo-soprano Kitt Reuter-Foss; and pianist Jason Kutz in the magnificent Mead Witter Foundation Concert Hall.\nTickets are free, thanks to WCO supporters Jun and Sandy Lee, who are celebrating their 50th anniversary; but a donation to the orchestra is strongly encouraged.\npress release: Please join us for a special Winter Celebration concert in honor of Jun & Sandy Lee on their 50th wedding anniversary.\nA grand concert is planned, featuring guest soloists violinist Rachel Barton Pine; mezzo soprano Kitt Rueter-Foss; and pianist Jason Kutz.\nA donation to support the Wisconsin Chamber Orchestra is suggested."}, {"url": "https://isthmus.com/events/yule-festival-circle/", "title": "Yule Festival", "authors": [], "date": "2019-11-21", "keywords": ["traditionally", "winter", "solstice", "sanctuary", "festival", "storytelling", "community", "nature", "encourage", "yuletide", "yule"], "summary": "press release: 10 am-6:30 pm, Saturday December 21, 2019, Circle Sanctuary Nature Preserve, 5354 Meadowvale Road, Barneveld.\n(608) 924-2216Join the Circle Sanctuary community as we celebrate the Winter Solstice.\nYule is traditionally a time for sharing food and drink, storytelling and music, traditions and lore, and celebration of the community we all share.\nYule is also traditionally a time for family, and we encourage bringing children of all ages!\nCooking and ornament making, Nature Walks, Winter Solstice Goddesses Workshop with Selena Fox, Birdseed crafting, Community Gifting, Yuletide Bards and Storytelling, & Yuletide Ritual with Rev."}, {"url": "https://isthmus.com/events/winter-fantasia/", "title": "Winter Fantasia", "authors": [], "date": "2019-06-13", "keywords": ["winter", "dance", "eve", "tree", "norse", "fantasia", "winters", "kanopy", "life", "young", "company"], "summary": "press release: Winter FantasiaDecember 13-15, 2019Friday 7:30pm; Saturday 2:00 & 5:00pm; Sunday 1:00pm & 4:00pmSingle Ticket Prices: $35/general, $28/students, $18/children, youthKanopy’s Winter Fantasia returns to the Overture stage with some artistic joy for the holidays…or as the Danish say so well, “Hygge,” to celebrate the season and bring delight.\nThe dance concert includes two treasured winter stories that are brought to life through dance: Once Upon a Winter’s Eve and The Norse Tree of Life (Yggdrasil).\nPerformers appearing in Winter Fantasia include professional members of Kanopy Dance Company, the Kanopy 2 studio company and 17 Kanopy Dance Academy students who will appear in starring and supporting roles as the icy Snow Queen, delightful star snow fairies and charming little friends.\n“A special addition to the Winter Fantasia program this year is Winter in the City, danced to the score of Leonard Bernstein’s Three Dance Episodes from “On the Town”.\nKanopy’s co –artistic directors Lisa Thurrell and Robert Cleary and Kanopy Dance Company member, Alyssa Jendusa, created the original choreography for Winter in the City with valuable input from the Kanopy Dance corps."}, {"url": "https://isthmus.com/events/madison-public-market-holiday/", "title": "Madison Public Market", "authors": [], "date": "2019-11-18", "keywords": ["market", "stopping", "little", "vendors", "holiday", "library", "check", "public", "santa", "madison"], "summary": "press release: Our holiday market is fast approaching!\nJoin us this Saturday, December 14th from 11am - 3pm for a fun and festive holiday market, hosted by the Madison Public Market.\nIn addition to these wonderful vendors, the following events will also be available as part of the market festivities:11-3: The Madison Public Library will be hosting crafts for the little ones including button making and color your own bookmarks.\nYou will also be able to check out holiday books, and register for your very own library card!\n12:45-1: Madison Santa Cycle Rampage will be stopping by to spread a little holiday cheer on their ride around Madison."}, {"url": "https://www.channel3000.com/october-2019-snowiest-october-on-record-for-madison/", "title": "October 2019 snowiest October on record for Madison", "authors": ["Posted", "Updated"], "date": "2019-11-01", "keywords": ["wind", "inches", "snowfall", "snowiest", "wisctv_news3", "day", "record", "2019", "madison", "wisconsin"], "summary": "October 2019 snowiest October on record for MadisonStephanie Fryer by Stephanie FryerOctober 2019 is now the snowiest October on record for Madison.\nOur back-to-back snow storms this past week have dumped 8.0 inches.\nA snowfall record of 1.1 inches was set overnight for Oct. 30.\nTemperatures will be falling into the 20s during trick-or-treat hours, but wind chills will be in the teens and low 20s.\nWe update with short, easy-to-use video forecasts you can watch on your phone every day."}, {"url": "https://isthmus.com/all-events/photos/things-to-do-new%20years-eve-in-madison-wisconsin-2020/", "title": "Toast to a new decade", "authors": ["Tom Whitcomb"], "date": "2019-12-26", "keywords": ["tributes", "things", "wort", "toast", "alchemy", "warm", "sure", "ween", "wet", "vulfpeck", "word", "decade"], "summary": "×Nasty New Year's at Alchemy CafeOne of the few things as sure as the endless march of time is Alchemy Cafe putting on a killer benefit party for WORT every New Year’s Eve.\nThis year will feature a pair of tributes to two seriously funky bands.\nDart will offer their take on the music of Vulfpeck, while Warm Wet Rag will become Ween.\nNo word on whether or not there will be chocolate and cheese, but there will be champagne.\nClick here for more info."}, {"url": "https://isthmus.com/events/all-is-calm-the-christmas-truce-of-1914/", "title": "All is Calm: The Christmas Truce of 1914", "authors": [], "date": "2019-09-25", "keywords": ["soldiers", "theatre", "wisconsin", "seasons", "truce", "war", "music", "radio", "world", "calm", "15", "christmas", "1914"], "summary": "× Expand Eric SchwierskeThere is a wonderful, implausible story about a moment on the Western Front during World War I when men who had been fighting each other for months in the trenches of France put their weapons down to celebrate Christmas together.\nFour Seasons Theatre presents the Wisconsin premiere of All is Calm, a collection of folk music, patriotic songs and popular music from the time mixed with excerpts from radio broadcasts, letters and journals.\n7:30 pm on 12/6-7 & 13-14 and 2 pm, 12/8 & 15 (all sold out); performance added at 4:30 pm on 12/15.\npress release: Celebrating 15 years of storytelling through music and theater, Four Seasons Theatre will present the Wisconsin premiere of “All is Calm: The Christmas Truce of 1914,” December 6-15 at The Playhouse.\nStudent rush are $15 with ID, available in person at the box office starting one hour before show."}, {"url": "https://isthmus.com/arts/books/wisconsin-authors-2019-books/", "title": "Making Wisconsin great", "authors": ["Jay Rath"], "date": "2019-12-19", "keywords": ["milwaukee", "softcover", "great", "war", "state", "ship", "readers", "hardcover", "author", "making", "young", "wisconsin"], "summary": "The late August Derleth, celebrated regionalist and Wisconsin author, famously wrote that his town, Sauk City, was a microcosm of the macrocosm.\nDear Delia: The Civil War Letters of Captain Henry F. Young, Seventh Wisconsin Infantry is outstanding.\nFor young readers, there’s Sport, Ship Dog of the Great Lakes, written by Pamela Cameron and illustrated by Renee Graéf.\nIt features gorgeous pictures with a multicultural cast ($17.95 hardcover, Wisconsin Historical Society Press).\nThe Land Still Lives, by prolific author and Wisconsin treasure Jerry Apps, is being reissued in a 50th anniversary edition."}, {"url": "https://isthmus.com/news/cover-story/isthmus-winds-up-and-delivers-its-annual-cheap-shots/", "title": "Take That 2019! - Isthmus", "authors": ["Jo Espos"], "date": "2019-12-19", "keywords": ["african", "campaign", "award", "state", "mayor", "age", "job", "2019", "isthmus", "public", "court", "wisconsin"], "summary": "To that end, for more than three decades, Isthmus has been ending each year with a presentation of its Cheap Shots Awards — a devilish blend of high purpose and low blows.\nEnabler of the Year: Ron JohnsonWisconsin’s senior U.S. senator has emerged from the pack of presidential butt-kissers with the brownest of noses.\nFoxconn pledged to spend $100 million on the state’s flagship university, which promptly agreed to sweeping confidentiality provisions.\nPolluters’ Paradise Award: State of WisconsinThe Badger State, home of Aldo Leopold and Gaylord Nelson, just ranked number one in the nation — in terms of how drastically it has cut funding for environmental protection over the last decade.\nBut Martin, who died June 29 at age 74 after a brief illness, was also regarded as a good judge."}, {"url": "https://isthmus.com/events/wisconsin-chamber-choir-dec-14/", "title": "Wisconsin Chamber Choir", "authors": [], "date": "2019-11-25", "keywords": ["orchestra", "university", "vivaldi", "including", "bach", "chamber", "14", "choir", "madison", "wisconsin"], "summary": "× Expand Jim Pippitt Wisconsin Chamber Choirpress release: Wisconsin Chamber Choir presents: Vivaldi Gloria and Bach Nun komm der Heiden Heiland (Cantata 61)Saturday, December 14, 2019 7:30 p.m., First Unitarian Society Atrium Auditorium, 900 University Bay DriveJoin the Wisconsin Chamber Choir on December 14 for a riveting performance of Vivaldi’s jubilant Gloria paired with J. S. Bach’s luminous Advent cantata, Nun komm der Heiden Heiland (Now Come, Savior of the Nations, BWV 61), performed with our professional orchestra, Sinfonia Sacra.\nOne concert only, at 7:30 pm on December 14, at First Unitarian Society Atrium Auditorium, 900 University Bay Drive, Madison, Wisconsin.\nComplimenting the Vivaldi and Bach are additional selections, including a unique collection of O Antiphons—Latin prayers for the season of Advent.\nFounded in 1998, the Wisconsin Chamber Choir has established a reputation for excellence in the performance of oratorios by Bach, Handel, Mozart, and Brahms; a cappella works from various centuries; and world-premieres.\nThe players assembled for these performances, known collectively as Sinfonia Sacra, are members of the best regional orchestras, including the Madison Symphony Orchestra, the Wisconsin Chamber Orchestra, the Madison Bach Musicians, the Wisconsin Baroque Ensemble, and Sonata à Quattro."}, {"url": "https://isthmus.com/events/tubachristmas/", "title": "TubaChristmas", "authors": [], "date": "2019-11-06", "keywords": ["registration", "rehearsal", "tuba", "euphonium", "music", "tubachristmas", "wilder", "christmas", "performers", "capitol"], "summary": "press release: 2019 is the 46th anniversary for TUBACHRISTMAS concerts/events which are presented throughout the world.\nTUBACHRISTMAS was conceived in 1974 by Harvey Phillips as a tribute to his teacher and mentor William J.\nThe first TUBACHRISTMAS was conducted by Paul Lavalle in New York City's Rockefeller Plaza Ice Rink on Sunday, December 22, 1974.\nTraditional Christmas music performed at the first TUBACHRISTMAS was arranged by American composer Alec Wilder who ironically died on Christmas Eve, 1980.\nMore information about TubaChristmas around the world can be found atwww.tubachristmas.com"}, {"url": "https://www.channel3000.com/56-new-years-eve-events-in-madison/", "title": "56 New Year’s Eve events in Madison", "authors": ["Posted", "Updated"], "date": "2019-12-22", "keywords": ["click", "eve", "toast", "party", "2020", "dj", "events", "champagne", "night", "56", "madison", "midnight"], "summary": "Originally from Madison, the band has won several awards from local groups, including the Madison Area Music Association and Madison Magazine’s Best of Madison readers’ poll.\nTo celebrate, the arcade will screen a Marvel movie marathon and drink specials, as well as a midnight champagne toast and a countdown.\n8 p.m.-7 a.m. Click here for more informationLiquid Madison will also host a dance party with New Year’s Eve 2020 at Liquid Madison, featuring a red carpet photo shoot and all-night Patron specials.\nThat’s not to mention the midnight champagne toast, appearances from several local DJs and live musical acts.\nPresented by UnityPoint Health – Meriter, Madison Family Eve celebrates 29 years at the Monona Terrace Community & Convention Center this New Year’s Eve."}, {"url": "https://isthmus.com/food-drink/year-in-madison-restaurants-2019/", "title": "Plenty", "authors": ["Linda Falkenstein"], "date": "2019-12-19", "keywords": ["corners", "second", "restaurant", "state", "closed", "plenty", "food", "bar", "opened", "street", "east"], "summary": "Portillos, a Chicagoland chain, created somewhat of a sensation when it opened in the parking lot at East Towne in March.\nGrace, a coffeehouse featuring beans from Heart Coffee Roasters of Portland, Oregon, turned the old Sacred Feather hat shop on State Street into a many-roomed hangout.\nIn short order, Grace opened a second outlet on East Washington Avenue, after Stone Creek coffee closed there.\nRoast Sandwich House closed, but owners Doug Hamaker and Henry Aschauer found their other State Street concept, Forage, successful enough to launch new locations at Hilldale and in Monona.\nBrocach on the Square closed; its Monroe Street offshoot closed in 2018."}, {"url": "https://www.insidethehall.com/2020/04/15/top-moments-from-the-2019-20-indiana-mens-basketball-season-moments-10-6/", "title": "Top moments from the 2019-20 Indiana men's basketball season: Moments 10-6", "authors": ["Cameron Drummond"], "date": "2020-04-15", "keywords": ["mens", "davis", "game", "basketball", "201920", "indiana", "season", "win", "moments", "106", "played", "thompson", "points", "millers"], "summary": "Cameron Drummond 04/15/2020 10:13 am in CommentaryWith the 2019-20 NCAA men’s college basketball season officially over due to the COVID-19 pandemic, plenty of time has been spent reflecting on what was an eventful campaign for the Indiana Hoosiers.\nHunter finished the season with a 3.8 points per game average across 30 games played, but his journey is far from over.\nThis remained the standout moment of the season from Davis, who like Devonte Green finished his IU career without an NCAA tournament appearance.\nThompson played 20 or more minutes in six of Indiana’s final nine games this season, and Thompson figures to be an important part of the plan next season as well.\nStay tuned for tomorrow’s release of the final five defining moments of the 2019-20 Indiana men’s basketball season."}, {"url": "https://isthmus.com/events/wintersong-2019/", "title": "Wintersong", "authors": [], "date": "2019-09-24", "keywords": ["harvest", "wintersong", "second", "tickets", "barrymore", "holiday", "vogelzang", "anna", "benefit", "wisconsins"], "summary": "× Expand Carla Coffing Anna VogelzangSinger-songwriter Anna Vogelzang (pictured) — recently returned to the Midwest — has curated another top-flight lineup for the annual Wintersong holiday concert, a benefit for Second Harvest Foodbank of Southern Wisconsin.\npress release: For six of the last seven years, local folk musicians, headed by Anna Vogelzang, have banded together to present Wintersong, an all-ages holiday show to benefit Second Harvest Foodbank of Southern Wisconsin.\nGuests will also hear from Michelle Orge of Second Harvest Foodbank.\nAgain this year ticket and raffle proceeds will benefit Second Harvest.\nTo date Wintersong concerts have raised more than $41,000 to help families and individuals who struggle with hunger in southwestern Wisconsin."}, {"url": "https://www.channel3000.com/man-arrested-in-connection-with-fatal-madison-shooting-police-call-targeted-incident-concerning/", "title": "Man arrested in connection with fatal Madison shooting; police call targeted incident ‘concerning’", "authors": ["Posted", "Updated"], "date": "2019-12-17", "keywords": ["connection", "targeted", "man", "fatal", "prosecution", "patterson", "incident", "arrested", "unit", "concerning", "deferred", "shooting", "according", "madison", "victim"], "summary": "Man arrested in connection with fatal Madison shooting; police call targeted incident ‘concerning’Amanda Quintana by Amanda QuintanaOne man has been arrested in connection with a shooting Saturday afternoon that left a man dead, according to an incident report.\nOfficers were called to the 1000 block of Spruce Street just after 1:15 p.m. for shots fired, according to an incident report.\nHamilton was accepted into the deferred prosecution unit after being charged with forgery in 2018, according to court documents.\nThe Deferred Prosecution Unit allows eligible defendants to avoid a criminal conviction by agreeing to a contract with the Dane County District Attorney.\nCourt records show Hamilton was recently allowed to enter a deferred prosecution program on a forgery charge."}, {"url": "https://www.channel3000.com/complaint-suspect-in-madisons-first-homicide-of-2019-argued-with-victim-over-drugs/", "title": "Complaint: Suspect in Madison’s first homicide of 2019 argued with victim over drugs", "authors": ["Posted", "Updated"], "date": "2019-08-29", "keywords": ["woods", "man", "station", "away", "complaint", "walking", "argued", "drugs", "jefferson", "person", "woman", "homicide", "2019", "madisons", "suspect", "gas", "saw", "victim"], "summary": "Complaint: Suspect in Madison’s first homicide of 2019 argued with victim over drugsBree Levine by Bree LevineBail has been set for a man accused of committing Madison’s first homicide of the year.\nThe other woman told police Jefferson had followed them to the gas station but didn’t recognize him.\nWoods purchased the drugs using the combined money, but according to the woman, Woods didn’t want to give Jefferson any drugs.\nCourt documents go on to say the woman saw Woods walking away, with Jefferson following her, on a pedestrian bridge over the creek running parallel to Marquette Street.\nThe detective said he saw two people just before 4 a.m., appearing to be Woods and the other woman, walking toward the gas station."}, {"url": "https://isthmus.com/news/news/police-search-east-high-classroom/", "title": "Police search East High classroom", "authors": ["Dylan Brogan", "Dianne Carey"], "date": "2019-12-13", "keywords": ["school", "lemonds", "investigation", "trip", "minneapolis", "high", "students", "staff", "warrant", "classroom", "search", "east"], "summary": "× Expand News-EastUpdate-12-13-2019 Dylan BroganMinneapolis police searched an East High School classroom Dec. 12 as part of an investigation into hidden cameras found in the hotel rooms of students during a recent school trip, according to an email sent to families from East principal Brendan Kearney.\nIsthmus broke the news that an East High staff member has been put on administrative leave during the investigation.\nThere was no arrest made.”The investigation centers on a recent school trip to Minneapolis, during which East High students found several hidden cameras in their rooms at the downtown Hyatt Regency.\n“There was an advisory email, internally, from the [Madison] North District Captain Brian Ackeret just indicating that this incident had taken place — this incident involving cameras in a hotel and East High School students,” says DeSpain.\nAt this point, it’s a purely precautionary measure.”Isthmus has now confirmed that two East staff members accompanied students on the trip."}, {"url": "https://www.channel3000.com/lawrence-larry-hanson/", "title": "Lawrence “Larry” Hanson", "authors": ["Posted", "Updated"], "date": "2019-12-12", "keywords": ["loved", "university", "lawrence", "alice", "larry", "truly", "2019", "hanson", "children", "school", "madison", "wisconsin"], "summary": "Lawrence “Larry” HansonSite staff by Site staffLawrence (Larry) Hanson, age 85, passed away Tuesday, December 10, 2019 at his home.\nLarry was born on February 24, 1934, to Adele and Ivan Hanson in Madison, WI.\nLarry married the love of his life, Alice (Ripp) on June 21, 1958.\nLarry felt truly blessed to have had such a wonderful family and so many friends.\nLarry and Alice lived for a short time in Milwaukee before moving to Middleton, where they became fixtures in the community."}, {"url": "https://isthmus.com/news/news/madison-east-teacher-pleads-not-guilty/", "title": "Madison East teacher pleads not guilty", "authors": ["Dylan Brogan"], "date": "2020-01-30", "keywords": ["jan", "30", "kruchten", "cameras", "minneapolis", "bugni", "students", "pleads", "teacher", "school", "east", "guilty", "madison", "oppeneer"], "summary": "× Expand David Michael MillerAround 30 East High School students filled the small hearing room at the federal courthouse in Madison on Jan. 30.\nDavid Kruchten, an East teacher who wore a green T-shirt and sweatpants, was escorted in by U.S.\nKruchten, a business education teacher at East, was arrested the morning of Jan. 30.\nThe indictment, also released Jan. 30, does not include the December dates when students found the cameras in Minneapolis.\nAssistant U.S. Attorney Elizabeth Altman brought up the December trip to Minneapolis by East students when arguing that Kruchten should remain in custody."}, {"url": "https://www.channel3000.com/update-faq-on-wisc-tv-frequency-change/", "title": "Update, FAQ on WISC-TV frequency change", "authors": ["Posted", "Updated"], "date": "2019-12-17", "keywords": ["tv", "available", "change", "frequency", "box", "converter", "tower", "weather", "update", "work", "faq", "wisctv"], "summary": "Update, FAQ on WISC-TV frequency changeSite staff by Site staffiStock/DeshaCAMWe know many loyal viewers are struggling to receive WISC-TV while we have been making the frequency change for our TV broadcast signal.\nMore detail:WISC-TV and other local broadcasters are in the middle of a government-mandated frequency change.\nIf you have rescanning difficulties, you can usually find instructions by selecting the Set-Up or Menu button on your television or converter box remote control.\nConsult the TV or converter box owner’s manual for detailed instructions on how to run a channel scan, or contact customer service for your TV or converter box manufacturer.\nThis frequency change doesn’t affect cable and satellite subscribers."}, {"url": "https://isthmus.com/events/middleton-community-orchestra-dec-18/", "title": "Middleton Community Orchestra", "authors": [], "date": "2019-06-06", "keywords": ["orchestra", "usa", "middleton", "2020", "media", "reserved", "red", "community", "isthmus", "madison", "rights", "card", "wisconsin"], "summary": "ISTHMUS is © 2020 Red Card Media, Inc. | All rights reserved.\n| Madison, Wisconsin | USA"}, {"url": "https://isthmus.com/food-drink/eats-events-12-12-2019/", "title": "Eats events", "authors": ["Isthmus Staff"], "date": "2019-12-12", "keywords": ["market", "cookies", "event", "st", "eats", "events", "dec", "holiday", "winnebago", "public", "anniversary", "kitchen"], "summary": "Holiday marketSaturday, Dec. 14Future vendors at the Madison Public Market will sell local foods and snacks at this holiday event featuring holiday-themed performances, craft projects for kids, and Santa!\nIt’s also a chance to check out the future home of the public market.\n2nd anniversary dinnerSunday, Dec. 15Mint Mark marks its 2nd anniversary by welcoming several Chicago chefs into its kitchen.\nAt 1929 Winnebago St., 5-8 pm.\nKids in the kitchen: Cookies!"}, {"url": "https://www.channel3000.com/police-arrest-suspect-in-first-madison-homicide-of-2019/", "title": "Police arrest suspect in first Madison homicide of 2019", "authors": ["Posted", "Updated"], "date": "2019-08-26", "keywords": ["woods", "jefferson", "unit", "friends", "homicide", "2019", "violent", "medical", "suspect", "madison", "arrest", "near"], "summary": "Police arrest suspect in first Madison homicide of 2019Stephen Cohn by Stephen CohnMadison police say they have arrested a suspect for the city’s first homicide of 2019.\nPolice said he was taken into custody Saturday morning and booked into the Dane County Jail on a charge of first-degree intentional homicide.\n“Delighted to learn from Chief Koval that they have a suspect in custody for the recent homicide on the near east side,” said Mayor Satya Rhodes-Conway.\nThe Medical Examiner indicates Woods died from “homicidal sharp force related trauma” and that additional testing is underway at this time.\nWoods left for a while and her friends became concerned when she never returned, according to police spokesman Joel DeSpain."}, {"url": "https://www.channel3000.com/car-involved-in-east-side-shooting-incident-found-in-sun-prairie/", "title": "Car involved in east side shooting incident found in Sun Prairie", "authors": ["Posted", "Updated"], "date": "2019-12-07", "keywords": ["searched", "rights", "incident", "vehicle", "car", "shooting", "involved", "east", "sedan", "prairie", "madison"], "summary": "Car involved in east side shooting incident found in Sun PrairieBrandon Arbuckle by Brandon ArbuckleCopyright 2019 by Channel 3000.\nThe car involved in a shooting incident on Madison’s east side was found in Sun Prairie Thursday night.\nThe black sedan was found abandoned in Sun Prairie Thursday night, according to the Sun Prairie Police Department.\nMadison police said the car was searched and evidence supporting the claim that there was a shooting was found in that car.\nThe owner of the vehicle was contacted and does not appear to be involved, Madison police said."}, {"url": "https://www.channel3000.com/2019-wettest-year-recorded-for-wisconsin-midwest/", "title": "2019 wettest year recorded for Wisconsin, Midwest", "authors": ["Posted", "Updated"], "date": "2019-12-17", "keywords": ["inches", "snow", "wetness", "2019", "recorded", "vavrus", "wettest", "rain", "timlin", "wisconsin", "midwest"], "summary": "2019 wettest year recorded for Wisconsin, MidwestSite staff by Site staffWisconsin and the Midwest recorded their wettest year ever in 2019 since record-keeping began in 1895, climatologists said.\nMore than 43 inches of rain and snow fell across nine states in the Midwest through November.\nClimatologist Mike Timlin told Wisconsin Public Radio it’s been wet all year.\n“September and October, in particular for the fall, were wet all across the Upper Midwest,” Timlin said.\n“What we’re really seeing in the Midwest so far is a whole lot more of the bigger rains,” Timlin said."}, {"url": "https://isthmus.com/events/rocket-bureau-beach-patrol-cribshitter/", "title": "Rocket Bureau, Beach Patrol, Cribshitter", "authors": [], "date": "2019-11-12", "keywords": ["bays", "local", "patrol", "guitars", "songs", "beach", "bureau", "pop", "rocket", "cribshitter", "green"], "summary": "Madison’s Rocket Bureau, the project of songwriter-guitarist Kyle Motor, is a study in power pop with tremendous harmonizing guitars.\nGreen Bay’s Beach Patrol are reminiscent of Elvis Costello and The Replacements.\nAnd local favorites Cribshitter offer up exquisitely crafted pop tracks with titles like “If These (Vaginal) Walls Could Talk.”press release: Doors: 7:30 pm / Show: 9:00 pm.21+ / $5 at the door.\nRocket Bureau (Madison): Local rock'n'rollers climb out of a basement to show off with catchy songs and harmonized guitars.\ncom/Beach Patrol (Green Bay): Green Bay's Beach Patrol has been at it for well over a decade, playing hooky pop-rock of the highest order."}, {"url": "https://isthmus.com/arts/stage/theater-critic-picks-2019-stage/", "title": "What a long, strange year it’s been", "authors": ["Gwendolyn Rice"], "date": "2019-12-19", "keywords": ["theatre", "production", "words", "long", "cast", "thrilling", "night", "musical", "love", "strange", "theater", "overture"], "summary": "× Expand Kat Stiennon On the TownTis the season for making lists and taking stock of the past 12 months.\nAnd there is something thrilling about seeing a stage full of people all singing and dancing their hearts out.\nFewest words per minute:Small Mouth Sounds, Madison Theatre GuildWhat if the true path to inner calm and enlightenment is through silence?\n× Expand Joan Marcus HamiltonMost words per minute:Hamilton, Overture CenterThe songs in Lin-Manuel Miranda’s magnum opus don’t just sound fast, they are fast.\nMost effective use of absorbent materials:SpongeBob The Musical, Overture CenterThe incredible choreography done with actual, glow-in-the-dark kitchen sponges sent my love for this unorthodox, hyper-creative musical over the edge."}]