[{"url": "https://operawire.com/florida-grand-opera-announces-2020-21-season/", "title": "Florida Grand Opera Announces 2020-21 Season", "authors": [], "date": "2020-01-23", "keywords": ["opera", "season", "fort", "theater", "lauderdale", "202021", "knight", "ziff", "florida", "house", "announces", "grand", "miami"], "summary": "The Flordia Grand Opera has announced its 2020-21 season c elebrating its 80 anniversary, the seventh oldest opera company in America.\nThis season Knight Concert Hall will become the new home for FGO’s Made for Miami series branded “Opera at Knight” to showcase 20th and 21st century operatic work.\nPerformance Dates: Jan. 30 – Feb. 13, 2021, in Miami: Ziff Opera House, Arsht Center & Fort Lauderdale: Au-Rene Theater, Broward CenterGounod’s “Faust” returns to the Florida Grand Opera featuring some of the most popular music in the operatic repertoire.\nPerformance Dates: March 20 – April 10, 2021, n Miami: Ziff Opera House, Arsht Center & Fort Lauderdale: Au-Rene Theater, Broward CenterGregory Spears and Greg Pierce’s “Fellow Travelers” makes its Florida Grand Opera premiere.\nTravelers will be part of the company’s Made for Miami series, “Opera at Knight.”"}, {"url": "https://www.stateoftheu.com/2020/1/27/21083993/miami-hurricanes-football-manny-diaz-goals-deriq-king-culture-acc-coastal-fsu-rivalry-brevin-jordan", "title": "My 3 Biggest Goals For The Miami Hurricanes In 2020", "authors": ["Jan"], "date": "2020-01-27", "keywords": ["season", "biggest", "goals", "canes", "2020", "hurricanes", "win", "coming", "football", "acc", "coastal", "miami"], "summary": "We’re only a month into the offseason for the Miami Hurricanes, and currently sit at 222 days away from their 2020 opener against Temple, but it’s never too early to start setting goals for the upcoming season.\nWin the ACC CoastalIf the Hurricanes want to get back on track and become a force in college football once again, they must start winning the ACC Coastal.\nMiami officially eliminated from ACC Coastal.\nWith players like King, Brevin Jordan, Gregory Rousseau and several other playmakers, there’s no reason why Miami can’t win the division.\nThe Miami Hurricanes Football team should take culture lessons from the @MiamiHEATWhen the Heat organization talks about culture, it actually means something."}, {"url": "https://www.nytimes.com/2019/10/31/us/politics/trump-new-york-florida-primary-residence.html", "title": "Trump, Lifelong New Yorker, Declares Himself a Resident of Florida", "authors": ["Maggie Haberman"], "date": "2019-10-31", "keywords": ["mr", "weekends", "taxes", "president", "york", "yorker", "triplex", "lifelong", "tower", "tax", "florida", "days", "resident", "declares", "trump"], "summary": "Since becoming president, Mr. Trump has spent 99 days at Mar-a-Lago compared with 20 days at Trump Tower, according to NBC News.\nWhite House officials declined to say why Mr. Trump changed his primary residence, but a person close to the president said the reasons were primarily for tax purposes.\nChanging his residence to Florida is not expected to have any effect on Mr. Vance’s case, which Mr. Trump has sought to thwart with a federal lawsuit.\nIt was unclear how much time he would spend in New York in the future or if he would keep his triplex at the top of Trump Tower.\nUnder New York law, if he spends more than 184 days a year there, he will have to pay state income taxes."}, {"url": "https://www.gobblercountry.com/2020/1/26/21082265/virginia-tech-vs-miami-q-a-with-sb-nation-state-of-the-u-ahead-of-tuesday-game-hokies-landers-nolley", "title": "Virginia Tech vs. Miami - Q&A with the SB Nation’s State of the U ahead of the Hokies next game", "authors": ["Nathan Reynolds", "Jan"], "date": "2020-01-26", "keywords": ["virginia", "hokies", "far", "vs", "state", "tech", "qa", "lykes", "game", "sb", "players", "nations", "season", "acc", "mcgusty", "team", "miami", "program"], "summary": "After what looked like a probably road win against Boston College, the Hokies let the game slip away in the second half.\nVirginia Tech travel down to Miami on Tuesday for what both schools will see as a must win game.\nGC: Heading into the season what were the expectations around the program - total wins, ACC place, and postseason chances?\nGC: Miami has a deep roster, with 10 different players averaging at least 10 minutes per game.\nBut until Lykes and McGusty are confirmed to return I give the edge to Virginia Tech."}, {"url": "https://news.cgtn.com/news/2020-02-23/Miami-Heat-owe-Dwyane-Wade-way-more-than-jersey-retiring-OkbkWqh42s/index.html", "title": "Miami Heat owe Dwyane Wade way more than jersey-retiring", "authors": ["Li Xiang"], "date": "2020-02-23", "keywords": ["american", "arena", "dwyane", "heat", "jerseyretiring", "way", "nba", "owe", "vcg", "l", "wade", "airlines", "miami", "team"], "summary": "3 jersey of Dwayne Wade in the Miami Heat is raised in the rafters of the American Airlines Arena in Miami, Flordia, February 22, 2020.\n3 jersey of Dwayne Wade in the Miami Heat is raised in the rafters of the American Airlines Arena in Miami, Flordia, February 22, 2020.\nDwyane Wade (L) hugs Erik Spoelstra (R), head coach of the Miami Heat at Wade's jersey-retiring ceremony at the American Airlines Arena, February 22, 2020.\n/VCG Dwyane Wade (L) hugs Erik Spoelstra (R), head coach of the Miami Heat at Wade's jersey-retiring ceremony at the American Airlines Arena, February 22, 2020.\n/VCG Dwyane Wade #3 of the Miami Heat screams \"This is my house!\""}, {"url": "https://www.dailymail.co.uk/news/article-7884409/Mom-three-children-lived-Disney-resort-created-town-dead-home.html", "title": "Mom and three children who lived in Disney resort-created town 'are found dead in their home'", "authors": ["Lauren Edmonds", "Lauren Edmonds For Dailymail.Com"], "date": "2020-01-14", "keywords": ["bodies", "saw", "todts", "investigation", "town", "todt", "physical", "mom", "resortcreated", "dead", "disney", "children", "death", "lived", "megan", "family", "celebration"], "summary": "Anthony Todt( left), Megan Todt (right) and their three children, Alek, Tyler and Zoe were reported missing by relatives on January 6.\nAccording to the business' page, Family Physical Therapy, Megan was a physical therapy instructor at the family's business.\nAfter the family were feared missing, a Facebook group titled 'Looking for the Todt Family' was created where one family friend wrote: 'Worried sick!\nOsceola County Sheriff Russell Gibson said the death investigation was launched after authorities arrived to the home.\n'This is an isolated incident, and all parties involved with this death investigation are accounted for,' he told reporters."}, {"url": "https://patch.com/rhode-island/cranston/florida-man-sentenced-federal-prison-ri-ma-atm-thefts", "title": "Florida Man Sentenced To Federal Prison For RI, MA ATM Thefts", "authors": [], "date": "2020-01-14", "keywords": ["cards", "ma", "atm", "seekonk", "sentenced", "atms", "large", "withdrawals", "federal", "bank", "ri", "florida", "colin", "room", "prison", "thefts", "cash", "man"], "summary": "PROVIDENCE, RI — A Florida man was sentenced to 36 months in federal prison after he admitted to stealing money from more than 100 ATMs in Rhode Island and Massachusetts last May.\nThe targeted accounts all had large or no limit to cash withdrawals from an ATM.\nWhen he was arrested, Colin had nine ATM cards in his possession.\nInside his car, police found more bank cards and his hotel room key card.\nOn Tuesday, he was sentenced to 36 months in federal prison followed by three years of supervised release."}, {"url": "https://coltswire.usatoday.com/gallery/2020-nfl-draft-senior-bowl-players-of-the-week/", "title": "Top QBs among offensive players of the week at Senior Bowl", "authors": ["Kevin Hickey", "January", "Pm Et"], "date": "2020-01-24", "keywords": ["alabama", "week", "2020", "usa", "offensive", "bowl", "south", "practice", "mobile", "players", "qbs", "jan", "senior"], "summary": "The week of practice for the Senior Bowl has wrapped up and now the focus will be shifting toward the big game on Saturday in Mobile.\nAs the week of practice ends, several players had an impact on their stock.\nSome had a strong week to improve their standing in the draft process while others didn’t do much to move the needle.\nJim Nagy, director of the Senior Bowl, announced the players of the week for the practices.\nHill, Ohio StateSouth WR: Van Jefferson Jan 23, 2020; Mobile, Alabama, USA; South wide receiver Van Jefferson of Florida (14) sets up… Jan 23, 2020; Mobile, Alabama, USA; South wide receiver Van Jefferson of Florida (14) sets up at the line during Senior Bowl practice at University of South Alabama’s Jaguar Football Practice Facility."}, {"url": "https://www.usatoday.com/in-depth/news/investigations/2020/01/09/reporters-notebook-afghanistan/2820013001/", "title": "How we reported the deadly airstrike: A reporter's notebook from Afghanistan", "authors": ["Brett Murphy", "Usa Today"], "date": "2020-01-09", "keywords": ["security", "murphy", "brett", "aleem", "deadly", "usa", "reporters", "afghan", "told", "kabul", "airstrike", "children", "reported", "notebook", "afghanistan"], "summary": "Illustrations by Brett Murphy, USA TODAY“The thing is the walls,” Aleem told me as we drove.\nBrett Murphy, USA TODAYThere are few street lights in Herat.\nTwo Afghan children play with a kite on the outskirts of Herat, where infrastructure like paved roads become more rare.\nBrett Murphy, USA TODAYAt the local hospital, amputees, orphans and widows waited outside the director’s office.\nBrett Murphy, USA TODAYJust before I went to bed, there was a knock on the door to my room."}, {"url": "https://news.cgtn.com/news/2020-02-27/NBA-highlights-on-Feb-26-Jayson-Tatum-growing-to-be-a-superstar-OqAUcY2BKo/index.html", "title": "NBA highlights on Feb. 26: Jayson Tatum, growing to be a superstar", "authors": ["Li Xiang"], "date": "2020-02-27", "keywords": ["arena", "celtics", "feb", "nba", "smart", "growing", "2020", "game", "utah", "jayson", "superstar", "points", "highlights", "tatum", "26", "miami", "ball"], "summary": "Jayson Tatum #0 of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena in Salt Lake City, Utah, February 26, 2020.\n/VCG Jayson Tatum #0 of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena in Salt Lake City, Utah, February 26, 2020.\nMarcus Smart of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena, February 26, 2020.\nJimmy Butler #22 of the Miami Heat reacts in the game against the Minnesota Timberwolves at the American Airlines Arena, February 26, 2020.\n/VCG Jimmy Butler #22 of the Miami Heat reacts in the game against the Minnesota Timberwolves at the American Airlines Arena, February 26, 2020."}, {"url": "https://www.montgomeryadvertiser.com/story/sports/2019/09/05/ut-martin-florida-football-what-channel-how-watch-tv-stream-online-point-spread/2191978001/", "title": "UT Martin vs. Florida football: How to watch on TV, stream online, betting odds", "authors": ["Bro Krift", "Published A.M. Ct Sept."], "date": "2019-09-05", "keywords": ["shark", "watchespn", "vs", "martin", "watch", "stream", "odds", "stadium", "florida", "room", "football", "ut", "tv", "online", "takes"], "summary": "CLOSEGAINESVILLE, Fla. — UT Martin takes on Florida at Ben Hill Griffin Stadium on Saturday night.\nHere's what you need to know to follow the game in your living room, at the bar, in the car or online.\nHow to watch UT Martin vs. Florida footballGame time: 6:30 p.m. Central, 7:30 p.m. EasternTV: ESPNUOnline radio:TuneIn broadcastSteaming live broadcast: WatchESPN appLine: Florida is a 44.5-point favorite, according to Odds Shark."}, {"url": "https://www.foodsafetynews.com/2019/01/florida-town-imposes-50-per-day-fine-for-growing-edible-plants-in-front-yards/", "title": "Florida town imposes $50 per day fine for growing edible plants in front yards", "authors": ["Dan Flynn", "Bill Marler", "Coral Beach", "Trevor Suslow", "January", "April", "Powered By"], "date": "2019-01-18", "keywords": ["ordinance", "yards", "growing", "day", "town", "50", "court", "city", "residential", "local", "shores", "florida", "fine", "plants", "82", "edible", "miami", "imposes"], "summary": "That court ruling meant Hermine Ricketts and her husband Tom Carroll were breaking Miami Shores city ordinances by growing edible plants like Asian cabbage and tomatoes in their front yard.\nThe city ordinance empowered the city to fine residential owners $50 a day for violations.\nAri Bargil, an IJ attorney, questioned why the local government should care whether a homeowner opts to go with edible rather than ornamental plants.\nThe present Miami Shores roughly corresponds with the original “Biscayne” neighborhood of the City of Miami.\nResidents of Miami Shores challenged the constitutionality of the zoning ordinance prohibiting growing vegetables in their front yards."}, {"url": "https://www.wate.com/entertainment/jennifer-lopez-and-shakira-vow-empowering-halftime-show/", "title": "Jennifer Lopez and Shakira vow ’empowering’ halftime show", "authors": ["Tom Canavan", "Associated Press", "Gregory Raucoules"], "date": "2020-01-31", "keywords": ["little", "lopez", "message", "jennifer", "empowering", "miami", "city", "think", "singers", "latino", "performance", "vow", "shakira", "halftime"], "summary": "MIAMI (AP) — Jennifer Lopez and Shakira said their Super Bowl halftime show will pay homage to Latino culture, promising a joint performance that has an empowering message and also one that will remember NBA icon Kobe Bryant.\nLopez said Thursday she wanted to send love and support to Bryant’s wife and family.\nAnd that’s why we have to live every moment as intensely as we can,” Shakira said.\nLopez noted that for the first time two Latinas are headlining the halftime show.\n“The relieving factor is they’re going to be people out there and it’s our people cheering for us, fans, and it’s in Miami,” Shakira said as the audience cheered on loudly."}, {"url": "https://www.al.com/auburnfootball/2019/10/florida-will-expose-auburns-ol-cover-as-home-underdog.html", "title": "Florida will expose Auburn’s OL, cover as home underdog", "authors": ["Christopher Smith", "Secfootballeditor Gmail.Com"], "date": "2019-10-01", "keywords": ["gators", "auburn", "mississippi", "underdog", "state", "week", "cover", "expose", "game", "offensive", "ol", "texas", "florida", "hes", "auburns"], "summary": "17 Texas A&M in Week 4 and embarrassed Mississippi State in Week 5.\nI went against the grain and told everyone to bet on Auburn against Texas A&M, and then leaned toward Auburn against Mississippi State but got scared off by a few trends.\nHe finally broke out against Mississippi State, completing 16 of 21 passes for 335 yards, with Schwartz and Seth Williams getting healthy.\nAuburn built first-quarter leads of 14-0 and 21-0 over Texas A&M and Mississippi State, respectively.\nThe Gators offensive line has regressed after losing four starters from the 2018 team."}, {"url": "https://www.hustlebelt.com/2020/1/16/21064124/ball-state-cardinals-football-season-review-in-brief-2019", "title": "2019 MAC Football End-of-Season Brief: Ball State Cardinals", "authors": ["James H. Jimenez", "Jan"], "date": "2020-01-16", "keywords": ["brief", "state", "second", "cardinals", "game", "2019", "games", "recap", "team", "endofseason", "football", "points", "mac", "ball", "yards"], "summary": "The Ball State Cardinals had a tough task ahead of them going into 2019.\n(Recap by Ball State Athletics)The game was a loss on the scoreboard, yes, but it was also Ball State’s first chance to show their competitive nature.\nToledo, who had been MAC West favorites to start the season, was sent reeling after the game, while Ball State established its legitimacy.\n(Recap by Ball State Atheltics)Key DeparturesBall State will be without a good handful of contributors from last season’s roster in all three phases, most notably on the offensive side of the ball.\nAll-MAC second team kick returner in 2019 (third team in 2018)TE Kyle Shrank: 11 games, three starts in 2019; 30-yard reception."}, {"url": "https://www.jsonline.com/story/news/nation/2020/01/01/baghdad-embassy-attack-protesters-disperse-troops-fire-tear-gas/2789540001/", "title": "Protesters at US Embassy in Baghdad disperse as security personnel fire tear gas", "authors": ["Grace Hauck", "John Bacon", "Published A.M. Ct Jan."], "date": "2020-01-01", "keywords": ["iraqi", "security", "disperse", "airstrikes", "iranbacked", "forces", "trump", "gas", "military", "embassy", "personnel", "tear", "protesters", "killed", "militia", "baghdad"], "summary": "CLOSE A detachment of one hundred Marines are reinforcing the US Embassy in Baghdad after Iraqi protestors attempted to storm the compound.\n(Dec. 31) AP DomesticDemonstrators laying siege to the U.S. Embassy in Baghdad began to disperse as security personnel fired tear gas Wednesday in the second day of unrest after U.S. airstrikes killed at least two dozen Iran-backed fighters in Iraq.\nIraqi forces who guard the usually safe Green Zone where the embassy is located did little to stop the chaos.\nIran’s supreme leader, Ayatollah Ali Khamenei, criticized the U.S. airstrikes on the Iran-backed Iraqi militia on Sunday.\nThe Iranian-backed Iraqi militia vowed Monday to retaliate for the U.S. military strikes."}, {"url": "https://www.theyeshivaworld.com/news/promotions/1680946/send-your-belongings-to-florida-for-pesach-safely-and-affordably-with-shippesach.html", "title": "Send Your Belongings to Florida for Pesach Safely and Affordably with Shippesach", "authors": [], "date": "2019-02-18", "keywords": ["affordably", "stress", "send", "safely", "schlepping", "process", "pesach", "offers", "experience", "shippesach", "need", "florida", "belongings"], "summary": "Sponsored ContentGoing down to Florida for Pesach is a tradition practiced by hundreds of families each year.\nBut for many, this is accompanied by a tremendous amount of schlepping and stress, incredible amounts of luggage and personal items required to celebrate the holiday.\nShippesach, a company with a vast amount of logistics experience, now offers ground shipping from the New York and New Jersey area to Orlando and Miami, simplifying the process of bringing your belongings down south.\n“Our goal is to simplify the entire process of visiting Flordia for Pesach,” explains Shippesach’s co-founder, Joseph Cohen.\nContact Shippesach today at 718-500-2766, email them at [email protected], or visit their Instagram account at @ship_pesach to learn more about having a hassle-free Pesach experience in Florida."}, {"url": "https://houston.sportsmap.com/lance-zierlein-nfl-mock-draft-10", "title": "2020 NFL Mock Draft", "authors": ["Lance Zierlein", "Joshua Jordan", "Sportsmap Staff", "Jayson Braddock"], "date": "2020-01-31", "keywords": ["positions", "2020", "prospects", "mock", "nfl", "texans", "draft", "need", "houston"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://www.express.co.uk/showbiz/tv-radio/1235804/Cheer-on-Netflix-documentary-Where-are-the-Navarro-cheerleaders-now-Jerry-Harris-Lexi", "title": "Cheer on Netflix: Where are the Navarro cheerleaders now?", "authors": ["Molli Mitchell"], "date": "2020-01-30", "keywords": ["really", "cheer", "series", "college", "netflix", "squad", "navarro", "world", "gun", "cheerleaders", "parents"], "summary": "Cheer, the six-part documentary series about Navarro College competitive cheer squad is available to stream and download on Netflix now.\nThe documentary followed the personal and competitive lives of Navarro College cheerleaders as they trained for the Daytona College Nationals.\nCheer on Netflix: Who is in the cast of Cheer?\nGabi ButlerGabi Butler was the most well-known member of the Navarro College cheer squad.\nSadly, 20-year-old Gabi did not return to Navarro College and is currently a member of the Top Gun cheer squad in Miami."}, {"url": "http://www.basketballinsiders.com/nba-mip-watch-2019-20-preseason-edition/", "title": "NBA MIP Watch 2019-20: Preseason Edition", "authors": ["Quinn Davis", "Matt John", "David Yapkowitz"], "date": "2019-10-14", "keywords": ["point", "edition", "best", "nba", "preseason", "watch", "thats", "simmons", "201920", "mip", "guards", "end", "season", "league", "hes", "team"], "summary": "In some ways, it’s hard to assess who’s better than who when trying to rank point guards.\nIf the team he’s playing for isn’t winning, then how good is he?\nOne last little tidbit before we begin- Point guards come in all shapes and sizes these days.\nThat’s Simmons’ problem.\nWho would you rank as your top eight point guards?"}, {"url": "https://www.wate.com/news/national-world/mahomes-feet-arms-lift-chiefs-to-super-bowl-over-titans-2/", "title": "Mahomes’ feet, arm lift Chiefs to Super Bowl over Titans", "authors": ["Kim Tong-Hyung", "Associated Press", "Felicia Fonseca"], "date": "2020-01-19", "keywords": ["kansas", "super", "city", "mahomes", "bowl", "henry", "arm", "lift", "chiefs", "feet", "titans", "team", "yards"], "summary": "(AP) — With his best imitation of a tightrope walker, Patrick Mahomes high-wired the Kansas City Chiefs into their first Super Bowl since 1970.\nAt last, for the third time overall, the Chiefs (14-4) are Super Bowl bound.\n“Chiefs Kingdom, we are going to the Super Bowl.”The Chiefs lost in 1967 in the first AFL-NFL Championship Game — nope, it wasn’t called the Super Bowl yet — to the Lombardi Packers 35-10.\nREID’S RETURNReid goes back to the Super Bowl for the first time since the 2004 season, when his Eagles lost to New England.\nVrabel caught 12 touchdown passes as a linebacker, including one in the Super Bowl when his Patriots beat Reid’s Eagles."}, {"url": "https://www.bizjournals.com/tampabay/news/2017/01/20/here-are-the-worst-florida-data-breaches-in-2016.html", "title": "", "authors": [], "date": "2017-01-20", "keywords": [], "summary": ""}, {"url": "https://www.nytimes.com/2017/01/12/travel/cathy-salustri-florida-backroads-history.html", "title": "How an Author Found the Real Florida", "authors": ["John L. Dorman"], "date": "2017-01-12", "keywords": ["author", "really", "state", "states", "wpa", "trip", "salustri", "real", "florida", "zora", "road", "writers"], "summary": "Cathy Salustri, the author of “Backroads of Paradise: A Journey to Rediscover Old Florida,” delights in letting people know that to really discover Florida, you have to turn off the congested Interstates and explore the state’s towns and cities.\n“Legally, we’re one state, but we’re really a bunch of different states,” she said.\n“I want people to see that there’s actually a lot of Florida beyond the theme parks.”Ms. Salustri, the arts and entertainment editor at Creative Loafing Tampa, took a 5,000-mile road trip across Florida.\n), which culminated in the book “Florida: A Guide to the Southernmost State.”Below are edited excerpts from an interview with Ms. Salustri.\nDuring your road trip, what was the most eye-opening route for you?"}, {"url": "https://www.cleveland.com/browns/2019/11/browns-vs-bills-preview-5-things-to-know-about-clevelands-next-opponent.html", "title": "Browns vs. Bills preview: 5 things to know about Cleveland’s next opponent", "authors": ["Ellis Williams", "Ewilliams Cleveland.Com", "Ellis L. Williams"], "date": "2019-11-04", "keywords": ["clevelands", "buffalo", "vs", "cleveland", "know", "mayfield", "opponent", "allen", "win", "game", "browns", "games", "preview", "things", "bills", "yards"], "summary": "Since then Buffalo carries the inverse of Cleveland’s record and looks playoff-bound and the Browns may have a top 10 pick.\nHere are five things you need to know about the Browns’ upcoming opponent.\nBills will be a playoff teamUnlike Cleveland, the Bills look headed for the playoffs.\nAgain, unlike the Browns, Buffalo won the games it should have, affording them more margin of error during the final eight games.\nIn Buffalo, Mayfield faces an opportunity to prove he’s more than those other underachieving throwers the Bills have already beat."}, {"url": "https://www.floridaphoenix.com/2018/08/03/yes-this-really-is-rick-scott-adam-putnam-and-pam-bondis-fault/", "title": "Yes, this really is Rick Scott, Adam Putnam and Pam Bondi’s fault", "authors": ["Julie Hauserman Has Been Writing About Florida For More Than Years. She Is A Former Capitol Bureau Reporter For The St. Petersburg", "Tampa Bay", "Times", "Reported For The Stuart News", "The Tallahassee Democrat. She Was A National Commentator For National Public Radio S Weekend Edition Sunday", "The Splendid Table . She Has Won Many Awards", "Including Two Nominations For The Pulitzer Prize. Her Work Is Featured In Several Florida Anthologies", "Including The Wild Heart Of Florida", "The Book Of The Everglades", "Between Two Rivers . Her New Book Is Drawn To The Deep"], "date": "2018-08-03", "keywords": ["rick", "really", "regulations", "scott", "bondis", "state", "putnam", "runoff", "manure", "adam", "fault", "fertilizer", "florida", "sewage", "yes", "pam", "pollution", "limits"], "summary": "Rick Scott, Agriculture Commissioner Adam Putnam, and Attorney General Pam Bondi – fought bitterly against stricter limits for the very pollution now sliming South Florida.\nThe EPA’s proposed pollution limits were lame, but at least they were a start.\nIn fact, Florida was to be the first state in America to set limits for sewage, manure, and fertilizer runoff.\nIn regulatory circles, they prefer to call sewage, manure and fertilizer “nutrients” – it sounds like it’s actually good for you.\nScott got his Department of Environmental Protection to convince the EPA that Florida should set its own regulations for sewage, manure and fertilizer."}, {"url": "https://www.news-press.com/story/weather/hurricane/2016/10/05/hurricane-matthew-andros-island-bahamas-holds-key-for-florida/91617234/", "title": "Hurricane Matthew: Andros Island (Bahamas) holds key for Florida", "authors": ["Doyle Rice", "Usa Today", "Published P.M. Et Oct."], "date": "2016-10-05", "keywords": ["impact", "matthew", "hurricane", "key", "storms", "island", "florida", "bahamas", "andros", "holds", "storm", "miami", "setzer"], "summary": "CLOSE Hurricane Matthew, the Caribbean's worst storm in nearly a decade, barrels towards the Bahamas after killing several people and pummeling Haiti and Cuba.\nVideo provided by AFPBuy Photo The sun rises over the bay at AUTEC, the Atlantic Undersea Test and Evaluation Center, on Andros Island in the Bahamas on Monday, May 5, 2008.\n(Photo: Amanda Inscore/news-press.com)Buy PhotoAndros Island, the largest island in the Bahamas, holds a key to where Hurricane Matthew will have the most impact on Florida.\nSetzer also noted that Andros is only a marker for this specific storm and not a rule to apply to any other hurricane situation.\nDOWNLOAD: Hurricane Hub appDOWNLOAD: 2016 Hurricane Guide PDFRead or Share this story: https://newspr.es/2dKP6cy"}, {"url": "https://www.usatoday.com/story/news/nation/2016/10/06/hurricane-matthew-batters-bahamas-set-strengthen-florida-approach/91652096//", "title": "Hurricane Matthew: Florida governor says 'Evacuate, evacuate, evacuate'", "authors": ["Arek Sarkissian", "J.D. Gallop", "Doug Stanglin", "Usa Today Network", "Published A.M. Et Oct."], "date": "2016-10-06", "keywords": ["carolina", "winds", "matthew", "hurricane", "governor", "emergency", "beach", "south", "florida", "evacuate", "storm"], "summary": "Steve Taylor of Cape Canaveral, Fla. get ready to sandbag his apartments as he prepares for the impact of hurricane Matthew.\nWith Florida, Georgia, South Carolina and North Carolina under states of emergency, Florida Gov.\nThe governor's message was clear: \"Evacuate, evacuate, evacuate.\n“Hurricane Matthew is a storm not to be messed with,” Savannah Mayor Eddie DeLoach said.\nAuthorities say a motorist in South Carolina was shot and wounded by deputies during an altercation over a Hurricane Matthew evacuation route, the Associated Press reported."}, {"url": "https://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2018/12/23/ut-vols-1998-tennessee-football-national-championship-florida-state-fiesta-bowl/2301386002/", "title": "How the 1998 UT Vols beat Florida State in the Fiesta Bowl to cap the program's most storied season", "authors": ["Blake Toppmeyer", "Published P.M. Et Dec."], "date": "2018-12-23", "keywords": ["storied", "state", "fsus", "seminoles", "fiesta", "programs", "bowl", "game", "championship", "florida", "tennessee", "season", "cap", "ut", "play", "vols"], "summary": "1 in the Bowl Championship Series rankings and needed to beat Mississippi State in the SEC Championship to remain undefeated.\n2, followed by Kansas State and Florida State.\nBut who would Florida State play?\nDwayne Goodrich (23) runs back an interception for UT's second touchdown in the Fiesta Bowl against Florida State on Jan. 4, 1999.\nThe scoreboard shows the Vols' victory over Florida State in the Fiesta Bowl on Jan. 4, 1999."}, {"url": "https://www.thebluetestament.com/2019/1/5/18164859/complete-sporting-kc-mls-superdraft-history-kansas-city-wizards-draft", "title": "Complete Sporting KC MLS SuperDraft History", "authors": ["Chad C Smith", "Jan"], "date": "2019-01-05", "keywords": ["complete", "superdraft", "round", "university", "sporting", "second", "traded", "mls", "kc", "history", "pick", "forward", "midfielder", "defender"], "summary": "2nd RoundNoneThis pick (along with the 2021 first round pick) was traded to the Vancouver Whitecaps for striker Erik Hurtado.\nSKC traded midfielder Ryan Smith for this selection and the third round pick in this same supplemental draft (which is essentially a fifth round pick overall).\nThey would later flip this essentially sixth round pick for a second round pick in the 2015 draft.\nSporting’s natural pick, #28 overall, was traded to the Union along with a 2012 second round pick for Shavar Thomas.\nKC also traded away the 60th pick to the Tampa Bay Mutiny for a 2002 fifth round pick."}, {"url": "https://www.tennessean.com/story/sports/nfl/draft2019/2019/04/19/nfl-draft-nashville-2019-through-years/3498030002/", "title": "NFL Draft through the decades: Stories show how the selection process has evolved", "authors": ["Luis Torres", "Evan Barnes", "Tommy Deas", "Blake Toppmeyer", "Tom Kreager", "Adam Sparks", "Andy Humbles", "Published P.M. Ct April"], "date": "2019-04-19", "keywords": ["evolved", "round", "process", "overall", "selection", "went", "nfl", "drafted", "draft", "going", "thought", "football", "decades", "pick"], "summary": "CLOSE Jim Haslam speaks about his 1953 NFL draft experience at his office in the Pilot Flying J Headquarters in Knoxville.\nSo Tennessee both of those years had a first-round draft pick.\n92 overall pick, Philadelphia EaglesAbout: The Riverdale High School graduate was a Pro Bowl lineman and played in Super Bowl XV for the Eagles.\nThe Maplewood Comprehensive School product played in the league for 13 years and went into coaching, working in the NFL, NFL Europe and the collegiate ranks.\n70 overall pick, Chicago BearsAbout: An All-SEC performer from Birmingham, Bennett spent six seasons in Chicago, amassing 2,277 receiving yards."}, {"url": "https://www.washingtontimes.com/news/2018/feb/1/how-amtrak-has-come-off-the-rails/", "title": "How Amtrak has come off the rails", "authors": ["The Washington Times Http", "Bruce K. Chapmann"], "date": "2018-02-01", "keywords": ["passenger", "competition", "private", "come", "infrastructure", "intercity", "amtrak", "rails", "rail", "safety", "train", "service"], "summary": "But, for the first time since the bankruptcy of the Penn Central railroad in 1970, private passenger rail is becoming feasible.\nSome states help subsidize Amtrak service now.\nFollowing the recent deadly Amtrak derailment near Tacoma, the Cascades service funded by Washington and Oregon is a logical next prospect for inter-city competition.\nPrivate commuter rail companies in a number of metropolitan areas already make successful private bids against Amtrak.\nYet for road freight haulers, and for bus and air carriers that use federally financed infrastructure, private competition predominates."}, {"url": "https://hiphopwired.com/800042/xxxtentacions-son-born-7-months-after-rappers-death/", "title": "XXXTentacion’s Son Born 7 Months After Rapper’s Death", "authors": ["Robert Longfellow"], "date": "2019-01-28", "keywords": ["shot", "months", "xxxtentacions", "x", "south", "born", "death", "yume", "rappers", "untimely", "son"], "summary": "XXXTentacion‘s legacy lives on.\nSeven months after the rapper’s untimely death, his son has been born.\nJenesis Sanchez reportedly gave birth this past Saturday (Jan. 26) to a son, Gekyume Onfroy.\nThe late rapper’s girlfriend was several months pregnant at the time of his murder.\nX was born January 23."}, {"url": "https://www.cleveland.com/tv-blog/2013/09/former_cleveland_news_anchor_john_hambrick_dies_of_cancer.html", "title": "Former Cleveland news anchor John Hambrick dies of cancer", "authors": ["Mark Dawidziak", "Mdawidziak Plaind.Com", "The Plain Dealer"], "date": "2013-09-11", "keywords": ["cancer", "cleveland", "hambrick", "career", "night", "texas", "john", "dies", "anchor", "channel", "tv", "told"], "summary": "\"The years at WEWS were extremely important to my career,\" Hambrick told The Plain Dealer July 22, responding to questions by e-mail.\nFive years younger, Judd Hambrick, was an anchor in Cleveland at WKYC Channel 3 and WJKW (now WJW) Channel 8.\nJohn Hambrick and his son, Jack, teamed up to co-produce \"The Florida Highwaymen,\" a 2002 PBS documentary about African-American artists.\nDuring his tenure in Cleveland, Hambrick released a country-western album, \"Windmill in a Jet-Filled Sky,\" featuring songs he wrote and performed.\nWhen he died, Hambrick was finishing \"Thunderbolt Raiders,\" a script he was writing with former Cleveland TV news colleague Lee Bailey."}, {"url": "https://www.abc.net.au/news/2016-02-01/heather-hawkins-eyes-next-marathon-challenge/7129388", "title": "Heather Hawkins eyes next marathon challenge only days after running 7 races in 7 continents in 7 days", "authors": ["Australian Broadcasting Corporation"], "date": "2016-02-01", "keywords": ["marathon", "started", "seven", "race", "run", "continents", "sydney", "thought", "challenge", "races", "days", "running", "eyes", "heather", "hawkins", "united"], "summary": "Heather Hawkins eyes next marathon challenge only days after running 7 races in 7 continents in 7 daysPostedAfter a weekend of rest, the \"enormity\" of running seven marathons in seven continents in seven days is only just hitting Heather Hawkins.\nThe long-distance runner and ovarian cancer survivor is back home in Sydney after completing the World Marathon Challenge.\n\"I finished the race at 4:00am on Saturday and I thought I'm sure I'll be wanting to sleep,\" Ms Hawkins said.\n\"It was the middle race and I was running up hills and because I was so tired I tripped over,\" she said.\n\"I've got my eye on the volcano marathon — a run at higher altitude in the Atacama Desert in Chile.\""}, {"url": "https://www.popsugar.com/latina/Summer-Outfit-Ideas-From-Latina-Bloggers-41080205", "title": "100 Easy and Breezy Summer Outfit Ideas", "authors": ["Alessandra Foresto"], "date": "2017-08-28", "keywords": ["easy", "summer", "ideas", "wrong", "topsthis", "wearing", "weve", "breezy", "outfit", "outfits", "winter", "youll", "weeks", "100", "weekend"], "summary": "Don't get us wrong — we've been complaining about the sweltering temperatures, too, but after a long Winter and a mild Spring, we're so happy to be wearing our jean shorts and tank tops.\nThis Summer, we've been on a mission to not fall into a rut, wearing the same outfit every weekend.\nInstead, we aimed to elevate our looks, putting together stylish but still fresh outfits that allow us to have all the fun we still have planned for the season.\nThanks to these 100 ideas, courtesy of some of our favorite Latina fashion bloggers, we're not out of outfits yet.\nLook ahead for all the inspiration you'll need for the last few weeks of the Summer."}, {"url": "https://www.shropshirestar.com/entertainment/weekend/2013/08/16/paul-michael-glaser-fame-its-not-been-easy-for-me/", "title": "Paul Michael Glaser: Fame – it's not been easy for me", "authors": [], "date": "2013-08-16", "keywords": ["glaser", "easy", "know", "series", "hutch", "fame", "celebrity", "lot", "life", "paul", "hes", "work", "michael", "film"], "summary": "When I ask him if he's proud, he's quick to find a different word, a more appropriate word, a word that reflects his critical sensibilities.\nGlaser is honoured by the timeless appeal of ABC's great seventies cop series.\nThe series opened up the door to a life of fame and reasonable fortune.\nHe wished people realised there's more to Paul Michael Glaser than Starsky.\nHe's one of the better characters in musicals, he's an iconic character, he's just a marvellously complex everyman."}, {"url": "https://thesource.com/2020/04/03/florida-governor-ron-desantis-believes-coronavirus-outbreak-started-super-bowl-weekend/", "title": "Florida Governor Ron DeSantis Believes Coronavirus Outbreak Started Super Bowl Weekend", "authors": [], "date": "2020-04-03", "keywords": ["started", "governor", "super", "youve", "didnt", "coronavirus", "bowl", "florida", "outbreak", "ron", "desantis", "weekend", "circulating", "miami", "cases"], "summary": "DeSantis said during a Wednesday press conference that the coronavirus first began making its way through Florida during Super Bowl week in Miami.\nAs you’ve been able to get more testing in Miami, you’ve been able to identify cases,” DeSantis said.\nMore than 200,000 people visited Miami during Super Bowl weekend.\nThe first Florida case of COVID-19 didn’t emerge until roughly a month after the Super Bowl.\nAdvertisementWith the total coronavirus cases exceeding 200k, and Florida accounting for 6k of those cases, he could be right."}, {"url": "https://operawire.com/florida-grand-opera-announces-2020-21-season/", "title": "Florida Grand Opera Announces 2020-21 Season", "authors": [], "date": "2020-01-23", "keywords": ["opera", "season", "fort", "theater", "lauderdale", "202021", "knight", "ziff", "florida", "house", "announces", "grand", "miami"], "summary": "The Flordia Grand Opera has announced its 2020-21 season c elebrating its 80 anniversary, the seventh oldest opera company in America.\nThis season Knight Concert Hall will become the new home for FGO’s Made for Miami series branded “Opera at Knight” to showcase 20th and 21st century operatic work.\nPerformance Dates: Jan. 30 – Feb. 13, 2021, in Miami: Ziff Opera House, Arsht Center & Fort Lauderdale: Au-Rene Theater, Broward CenterGounod’s “Faust” returns to the Florida Grand Opera featuring some of the most popular music in the operatic repertoire.\nPerformance Dates: March 20 – April 10, 2021, n Miami: Ziff Opera House, Arsht Center & Fort Lauderdale: Au-Rene Theater, Broward CenterGregory Spears and Greg Pierce’s “Fellow Travelers” makes its Florida Grand Opera premiere.\nTravelers will be part of the company’s Made for Miami series, “Opera at Knight.”"}, {"url": "https://news.cgtn.com/news/2020-02-23/Miami-Heat-owe-Dwyane-Wade-way-more-than-jersey-retiring-OkbkWqh42s/index.html", "title": "Miami Heat owe Dwyane Wade way more than jersey-retiring", "authors": ["Li Xiang"], "date": "2020-02-23", "keywords": ["american", "arena", "dwyane", "heat", "jerseyretiring", "way", "nba", "owe", "vcg", "l", "wade", "airlines", "miami", "team"], "summary": "3 jersey of Dwayne Wade in the Miami Heat is raised in the rafters of the American Airlines Arena in Miami, Flordia, February 22, 2020.\n3 jersey of Dwayne Wade in the Miami Heat is raised in the rafters of the American Airlines Arena in Miami, Flordia, February 22, 2020.\nDwyane Wade (L) hugs Erik Spoelstra (R), head coach of the Miami Heat at Wade's jersey-retiring ceremony at the American Airlines Arena, February 22, 2020.\n/VCG Dwyane Wade (L) hugs Erik Spoelstra (R), head coach of the Miami Heat at Wade's jersey-retiring ceremony at the American Airlines Arena, February 22, 2020.\n/VCG Dwyane Wade #3 of the Miami Heat screams \"This is my house!\""}, {"url": "https://www.tampabay.com/news/health/2020/03/03/could-coronavirus-in-florida-hurt-spring-break-travel-officials-arent-worried-yet/", "title": "Could coronavirus in Florida hurt spring break travel? Officials aren’t worried yet.", "authors": ["Jack Evans", "Breaking News", "Pasco County Crime Courts Reporter"], "date": "2020-03-03", "keywords": ["spring", "officials", "virus", "university", "hurt", "arent", "tourism", "coronavirus", "numbers", "travel", "florida", "days", "tampa", "worried", "break", "cases"], "summary": "Coronavirus cases have been confirmed in the Tampa Bay area.\nState officials confirmed three cases of the virus by Tuesday afternoon, including two women who have been quarantined in Hillsborough County.\nSome people took to Twitter with worries that the virus’ spread would halt their spring break plans, or that spring breakers would bring the virus with them.\nCorrada, the Visit Tampa Bay CEO, said canceling travel plans is a “personal decision,” but so far, he’s not worried.\n• • •Tampa Bay Times coronavirus guideQ&A: What you need to know after Florida’s first positive coronavirus cases."}, {"url": "https://www.clickorlando.com/weather/2020/02/29/temps-may-hit-the-70s-on-sunday-in-central-flordia/", "title": "Temps may hit the 70s on Sunday in Central Flordia", "authors": ["Tom Sorrells"], "date": "2020-02-29", "keywords": ["wind", "degrees", "hit", "70s", "turned", "way", "near", "central", "high", "day", "turnaround", "low", "temps", "flordia"], "summary": "ORLANDO, Fla. – Friday turned out to be a turnaround kind of day in Central Florida.\nThursday Central Florida residents saw a high of 62 degrees, Friday we made it all the way to 65 degrees in Orlando.\nFriday night, with a clear sky and calming wind we are looking at a low of 44 degrees.\nThe high on Sunday will be near 70 degrees.\nI would encourage you to embrace the chill while it is here, by next Wednesday the high will be near 90 degrees."}, {"url": "https://www.housingwire.com/articles/u-s-cities-are-taking-action-on-halting-evictions/", "title": "U.S. cities are taking action on halting evictions", "authors": ["Julia Falcon", "Ben Lane", "Kathleen Howley", "Angela De Gale", "Kristin Messerli", "Sarah Wheeler"], "date": "2020-03-12", "keywords": ["taking", "eviction", "san", "spread", "evictions", "city", "coronavirus", "halting", "county", "borrowers", "jose", "action", "moratorium", "unable", "cities"], "summary": "According to the Mercury News, a San Jose, California-based newspaper, the city is moving forward with a moratorium on evictions.\nThe moratorium, which is expected to receive final approval from the San Jose City Council in the next few weeks, will be in effect for at least 30 days.\nThe city will evaluate extending the eviction moratorium in a month after it goes into effect.\nSan Jose council members will also consider adding small businesses under commercial leases to the eviction moratorium at their meeting next week.\nIn addition, they will consider setting aside a pool of additional public funds for San Jose renters and small businesses to access if needed to meet their rent payments."}, {"url": "https://news.cgtn.com/news/2020-02-27/NBA-highlights-on-Feb-26-Jayson-Tatum-growing-to-be-a-superstar-OqAUcY2BKo/index.html", "title": "NBA highlights on Feb. 26: Jayson Tatum, growing to be a superstar", "authors": ["Li Xiang"], "date": "2020-02-27", "keywords": ["arena", "celtics", "feb", "nba", "smart", "growing", "2020", "game", "utah", "jayson", "superstar", "points", "highlights", "tatum", "26", "miami", "ball"], "summary": "Jayson Tatum #0 of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena in Salt Lake City, Utah, February 26, 2020.\n/VCG Jayson Tatum #0 of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena in Salt Lake City, Utah, February 26, 2020.\nMarcus Smart of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena, February 26, 2020.\nJimmy Butler #22 of the Miami Heat reacts in the game against the Minnesota Timberwolves at the American Airlines Arena, February 26, 2020.\n/VCG Jimmy Butler #22 of the Miami Heat reacts in the game against the Minnesota Timberwolves at the American Airlines Arena, February 26, 2020."}, {"url": "https://esportsobserver.com/palm-beach-county-misfits/", "title": "Why Palm Beach County Incentivized a $1.3M Esports Facility for Misfits", "authors": ["Graham Is A Business Journalist With The Esports Observer", "With Four Years Writing In The Industry. He Covers The Governance Side Of Esports", "Including Federations Associations", "The Olympic Movement. In Addition", "He Is The Host Of The Esports Observer Podcast", "Is A Frequent Moderator At Conferences", "Events. His Previous Journalistic Work Covered Music"], "date": "2020-02-15", "keywords": ["companies", "esports", "state", "beach", "misfits", "facility", "county", "incentivized", "smallridge", "13m", "florida", "development", "league", "team", "palm"], "summary": "While team facilities are increasingly common in esports, Misfits divulged that local and state authorities would provide over $200K in grants and tax refunds.\nThe company is also looking to create 30 new jobs—with average salaries of $95K—and its two Florida franchise esports teams will also add to the state’s heavy sports history.\n“[Misfits] falls within a targeted industry sector for not only our county efforts, but state efforts as well,” added Smallridge.\nThe organization is hosting three total “homestand” weekends this year; essentially home games for its Call of Duty League franchise, the Florida Mutineers, and Overwatch League team, the Florida Mayhem.\nSmallridge said the board facilitates 35 companies a year, from aviation aerospace and financial services to logistics and biosciences."}, {"url": "https://heavy.com/entertainment/2020/02/hard-rock-super-bowl-2020-commercial-ad/", "title": "Hard Rock International’s Super Bowl 2020 Commercial Ad", "authors": ["S.M. Walsh"], "date": "2020-02-02", "keywords": ["international", "rock", "commercial", "2020", "super", "hard", "bowl", "vaynermedia", "statement", "ad", "hotel", "internationals"], "summary": "VideoVideo related to watch: hard rock international’s super bowl 2020 commercial 2020-02-02T18:28:45-05:00Today, Hard Rock International will air its first-ever Super Bowl commercial before halftime.\nThe ad, which stars Jennifer Lopez, her fiancé Alex Rodriguez, and Miami’s Pitbull and DJ Khaled, was directed by Michael Bay in his first-ever Super Bowl ad.\nBuilt for the now.”Ad Age writes, “The decision for Hard Rock to make its first Super Bowl buy coincides with the game being played at the Hard Rock Stadium in Miami.\nIt also follows the opening of the guitar-shaped Hard Rock Hotel & Casino in nearby Hollywood, Florida, in October.\nThe spot was filmed at the location.”READ NEXT: Watch All Super Bowl 2020 Commercials & Ads [VIDEOS]"}, {"url": "https://www.artnews.com/art-news/news/hurricane-dorian-art-community-13166/", "title": "Hurricane Dorian: As Storm Nears, Arts Institutions Brace for Impact", "authors": ["The Editors Of Artnews"], "date": "2019-08-30", "keywords": ["impact", "art", "university", "gallery", "hurricane", "institutions", "beach", "nears", "reopen", "close", "museum", "florida", "arts", "brace", "storm", "miami", "dorian"], "summary": "South Beach in Miami Beach, as Hurricane Dorian nears.\nThe Lowe Art Museum at the University of Miami will shutter on Friday afternoon, along with the rest of the school.\nAnd the Bass Art Museum in Miami Beach has also begun preparing, having deinstalled Eternity Now (2015), a Sylvie Fleury neon sculpture that typically hangs on the museum’s facade, on Thursday.\nTomorrow, the Institute of Contemporary Art Miami will close; it will reopen on Wednesday.\nOne major client had their work removed from their Miami Beach home this earlier week, Schwartz said, though he was quick to add that not everything can get evacuated."}, {"url": "https://www.itv.com/news/2020-02-14/harry-and-meghan-s-staff-lose-their-jobs-as-royal-couple-prepare-to-leave/", "title": "Harry and Meghan's staff lose their jobs as royal couple prepare to leave", "authors": ["Chris Ship", "Royal Editor"], "date": "2020-02-14", "keywords": ["members", "sussex", "meghan", "leave", "staff", "harry", "jobs", "meghans", "work", "royal", "duke", "household", "office", "lose", "couple", "prepare", "palace"], "summary": "Staff who work for the Duke and Duchess of Sussex are being made redundant as Buckingham Palace prepares to shut down their office.\nIt’s thought around 15 members of the Royal Household, who have been employed to work for Harry and Meghan, will have to leave their jobs in the Spring.\nIt’s the inevitable consequence of the Sussexes’ decision to step down as working members of the Royal Family and move to North America.\nBuckingham Palace had set up a separate household, at the couple’s request, when they split their office from Harry’s brother and sister-in-law William and Kate last year.\nHarry and Meghan hired an experienced communications chief, Sara Latham, who had previously worked for Hillary Clinton, to promote their work and deal with the media attention around them and their new son Archie."}, {"url": "https://patch.com/rhode-island/cranston/florida-man-sentenced-federal-prison-ri-ma-atm-thefts", "title": "Florida Man Sentenced To Federal Prison For RI, MA ATM Thefts", "authors": [], "date": "2020-01-14", "keywords": ["cards", "ma", "atm", "seekonk", "sentenced", "atms", "large", "withdrawals", "federal", "bank", "ri", "florida", "colin", "room", "prison", "thefts", "cash", "man"], "summary": "PROVIDENCE, RI — A Florida man was sentenced to 36 months in federal prison after he admitted to stealing money from more than 100 ATMs in Rhode Island and Massachusetts last May.\nThe targeted accounts all had large or no limit to cash withdrawals from an ATM.\nWhen he was arrested, Colin had nine ATM cards in his possession.\nInside his car, police found more bank cards and his hotel room key card.\nOn Tuesday, he was sentenced to 36 months in federal prison followed by three years of supervised release."}, {"url": "https://www.nbcnews.com/news/us-news/police-respond-shooting-parkland-florida-high-school-n848101", "title": "17 killed in mass shooting at high school in Parkland, Florida", "authors": [], "date": "2018-02-15", "keywords": ["shooting", "stoneman", "mass", "high", "tend", "parkland", "school", "south", "17", "personnel", "florida", "wednesdayjohn", "victim", "killed", "sunsentinel", "medical"], "summary": "Medical personnel tend to a victim after a mass shooting at Marjory Stoneman Douglas High School on Wednesday.\nJohn McCall / South Florida Sun-Sentinel via"}, {"url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-church-paula-white-miami-usa-florida-a9347686.html", "title": "Trump’s spiritual guide urges congregation to prioritise church donations before paying bills", "authors": ["Louise Hall"], "date": "2020-02-20", "keywords": ["church", "white", "trumps", "bills", "afp", "epa", "urges", "congregation", "guide", "prioritise", "pay", "spiritual", "getty", "donations", "president", "paying", "plan", "email", "peace"], "summary": "Donald Trump’s pastor is telling Florida worshippers to prioritise giving money to the church, before paying their own mortgages.\nPaula White, the controversial televangelist who serves as Mr Trump’s spiritual guide, warned thousands of congregants in Miami to put God before their own financial needs.\nMs White continued to encourage members to contribute large amounts of money to the church.\nPalestinian protests against President Trump's Middle East peace plan Show all 18 left Created with Sketch.\nHowever, Ms White emphasised to the room, which hosts almost 7,000 people, that members should prioritise the investment in God above all else."}, {"url": "https://www.cnn.com/2018/02/26/us/dwyane-wade-flordia-school-shooting-trnd/index.html", "title": "NBA player Dwyane Wade gets emotional about Florida school shooting victim", "authors": ["Amanda Jackson"], "date": "2018-02-26", "keywords": ["dwyane", "heat", "shooting", "player", "nba", "stoneman", "school", "told", "17", "parents", "oliver", "florida", "marjory", "victim", "wade", "gets", "miami", "emotional"], "summary": "(CNN) Miami Heat star guard Dwyane Wade got emotional Monday as he reflected on Joaquin Oliver, one of the 17 people killed in the Marjory Stoneman Douglas High School shooting earlier this month.\nOliver, 17, was an avid sports fan who was excited to see his favorite basketball player, Wade, back with the Miami Heat this season.\nJoaquin Oliver, one of 17 people killed by a gunman at Marjory Stoneman Douglas High School in Parkland, Florida.\nOn Sunday, Oliver's parents told Univision talk show \"Al Punto\" that they buried their son on February 17 wearing Wade's Miami Heat jersey.\n\"It's emotional even thinking about that -- that his parents felt that burying him in my jersey was something that he wanted,\" Wade told CNN affiliate WPLG after the team's practice."}, {"url": "https://www.foodsafetynews.com/2019/01/florida-town-imposes-50-per-day-fine-for-growing-edible-plants-in-front-yards/", "title": "Florida town imposes $50 per day fine for growing edible plants in front yards", "authors": ["Dan Flynn", "Bill Marler", "Coral Beach", "Trevor Suslow", "January", "April", "Powered By"], "date": "2019-01-18", "keywords": ["ordinance", "yards", "growing", "day", "town", "50", "court", "city", "residential", "local", "shores", "florida", "fine", "plants", "82", "edible", "miami", "imposes"], "summary": "That court ruling meant Hermine Ricketts and her husband Tom Carroll were breaking Miami Shores city ordinances by growing edible plants like Asian cabbage and tomatoes in their front yard.\nThe city ordinance empowered the city to fine residential owners $50 a day for violations.\nAri Bargil, an IJ attorney, questioned why the local government should care whether a homeowner opts to go with edible rather than ornamental plants.\nThe present Miami Shores roughly corresponds with the original “Biscayne” neighborhood of the City of Miami.\nResidents of Miami Shores challenged the constitutionality of the zoning ordinance prohibiting growing vegetables in their front yards."}, {"url": "https://www.firehouse.com/safety-health/news/21077682/fl-senate-passes-firefighters-cancer-coverage-bill", "title": "FL Senate Passes Firefighters Cancer Coverage Bill", "authors": ["Elizabeth Koh"], "date": "2019-04-24", "keywords": ["cancer", "firefighters", "state", "single", "senate", "passes", "local", "oliva", "fl", "house", "florida", "bill", "coverage"], "summary": "TALLAHASSEE, FL—The Florida Senate voted unanimously Tuesday to entitle firefighters to cancer coverage as part of doing their jobs, moving Florida closer to joining about 40 other states in making the disease an occupational hazard for those first responders.\nThe Florida House also heard the bill late Tuesday, and it is expected to pass with the backing of House Speaker José Oliva, R-Miami Lakes.\nUnder the bill, firefighters would qualify after meeting requirements including not smoking in the last five years.\nThe bill was fast-tracked through a single House committee last week, where it passed unanimously.\nOn the Senate floor Tuesday, Flores noted that the bill was for not just survivors of firefighters but those who might consider the profession in the future."}, {"url": "https://www.politico.com/newsletters/florida-playbook/2019/08/02/coming-to-certain-florida-towns-an-immigration-listening-tour-woman-who-threw-drink-at-gaetz-pleads-guilty-up-up-and-away-for-gov-desantis-an-epic-new-theme-park-464129", "title": "The GOP immigration listening tour — Woman who threw drink at Gaetz pleads guilty — Up, up and away for Gov. DeSantis — An epic new theme park", "authors": ["Follow Us On Twitter"], "date": "2019-08-02", "keywords": ["gov", "heralds", "state", "tour", "senate", "sentinels", "theme", "miami", "immigration", "listening", "woman", "florida", "desantis", "federal", "park", "guilty", "pleads", "threw"], "summary": "The GOP immigration listening tour — Woman who threw drink at Gaetz pleads guilty — Up, up and away for Gov.\nGruters is already promising to sponsor a bill during next year’s session that would force businesses to use a federal immigration database to check the status of their employees.\nDeSantis names woman in charge of helping Florida adapt to climate change,” by Miami Herald’s Alex Harris: “Gov.\nCan the Miami-Dade County school district save them?” by Miami Herald's Colleen Wright: “Hormones.\nThat may change,\" by Miami Herald's Douglas Hanks— \"Woman arrested with 63 pounds of pot at Tallahassee airport."}, {"url": "https://lastwordonprofootball.com/2020/03/02/players-improved-draft-stock-2020-nfl-combine/", "title": "10 Players Who Improved Their Draft Stock At The 2020 NFL Combine", "authors": ["Ben Ramos-Salsberg"], "date": "2020-03-02", "keywords": ["stock", "lbs", "2020", "broad", "mention", "dash", "improved", "nfl", "players", "draft", "yard", "drills", "running", "combine"], "summary": "The 2020 NFL Combine is the second big pillar on the pre-draft calendar and is maybe the easiest outlet, outside of the college football season, to improve your draft stock.\nFor four days, the nation’s top draft-eligible players compete side-by-side with hopes of climbing in the NFL Draft rankings.\nThese are 10 players that improved their stock at the 2020 NFL Combine.\n2020 NFL Combine: 10 Players Who Helped Their StockJustin Herbert (Oregon) – QuarterbackHonorable Mention: Jalen HurtsWhile the draft world seems to be very split on Herbert, he did himself a lot of favors with his combine performance.\nGay finished top-two in each the Forty Yard Dash, broad jump, and vertical jump, and finished tied for fifth in the bench press."}, {"url": "https://www.mlbtraderumors.com/2020/02/tony-clark-mlbpas-strong-preference-rays-remain-in-tampa-bay.html", "title": "Tony Clark: MLBPA’s ‘Strong Preference’ Rays Remain In Tampa Bay", "authors": ["Anthony Franco"], "date": "2020-02-22", "keywords": ["remain", "clark", "player", "tony", "topkin", "mlbpa", "strong", "preference", "plan", "rays", "players", "season", "tampa", "union", "mlbpas", "bay"], "summary": "The Rays’ deliberations about splitting their season between Tampa Bay and Montreal have their fair share of logistical difficulties.\nMLBPA executive director Tony Clark made his first comments in an interview with Marc Topkin of the Tampa Bay Times.\n“It would be our strong preference that the club and the players remain in Tampa Bay, and that they’re identified with playing in one market,” Clark told Topkin.\n“I’m not going to say it’s impossible that we couldn’t come to an agreement that’s acceptable for them to split between Tampa Bay and Montreal,” the union head told Topkin.\nSpecifically, owner Stuart Sternberg has posited that the move could be a boon for Rays’ players."}, {"url": "https://www.theyeshivaworld.com/news/promotions/1680946/send-your-belongings-to-florida-for-pesach-safely-and-affordably-with-shippesach.html", "title": "Send Your Belongings to Florida for Pesach Safely and Affordably with Shippesach", "authors": [], "date": "2019-02-18", "keywords": ["affordably", "stress", "send", "safely", "schlepping", "process", "pesach", "offers", "experience", "shippesach", "need", "florida", "belongings"], "summary": "Sponsored ContentGoing down to Florida for Pesach is a tradition practiced by hundreds of families each year.\nBut for many, this is accompanied by a tremendous amount of schlepping and stress, incredible amounts of luggage and personal items required to celebrate the holiday.\nShippesach, a company with a vast amount of logistics experience, now offers ground shipping from the New York and New Jersey area to Orlando and Miami, simplifying the process of bringing your belongings down south.\n“Our goal is to simplify the entire process of visiting Flordia for Pesach,” explains Shippesach’s co-founder, Joseph Cohen.\nContact Shippesach today at 718-500-2766, email them at [email protected], or visit their Instagram account at @ship_pesach to learn more about having a hassle-free Pesach experience in Florida."}, {"url": "https://www.news4jax.com/sports/2019/12/08/fsu-introduces-mike-norvell-as-new-head-football-coach/", "title": "Florida State introduces Mike Norvell as new head football coach", "authors": ["Justin Barney", "Mike Vasilinda"], "date": "2019-12-08", "keywords": ["coach", "right", "university", "state", "introduces", "norvell", "mike", "florida", "football", "opportunity", "head", "told"], "summary": "TALLAHASSEE, Fla. – Florida State University made it official on Sunday, announcing Mike Norvell as its new head football coach.\n“I’m humbled and honored for the opportunity to be the head coach at Florida State University, one of the iconic brands in college football,” Norvell said in a release from the university.\n“I’m so very excited for the future and the opportunity to return Florida State football to one of the nation’s elite.\n“This gentleman right here was the only person I offered the head coaching job at Florida State University,\" said Thrasher.\nNovell also left open the possibility of coaching in a bowl game -- either for Memphis or Florida State."}, {"url": "https://houston.sportsmap.com/texans-offseason-cliffsnotes", "title": "Texans offseason CliffsNotes: A look at all the potential moves", "authors": ["Jayson Braddock", "Joshua Jordan", "Sportsmap Staff"], "date": "2020-02-13", "keywords": ["potential", "cliffsnotes", "moves", "improve", "texans", "2020texans", "offseason", "look"], "summary": "How do the Texans improve in 2020?\nTexans offseason CliffsNotes: A look at all the potential moves"}, {"url": "https://houston.sportsmap.com/houston-roughnecks-a-game-day-survival-guide", "title": "Houston Roughnecks: a game day survival guide", "authors": ["Paul Muth", "Joshua Jordan", "Sportsmap Staff", "Jayson Braddock"], "date": "2020-02-14", "keywords": ["guide", "positions", "day", "game", "survival", "prospects", "roughnecks", "texans", "need", "houston"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://www.wtsp.com/article/news/regional/florida/google-florida-man-followed-by-your-birthday-whats-your-story/67-1f9a2d84-e3be-410a-b6dc-9d883b688f8e", "title": "Google 'Florida man' followed by your birthday: What's your story?", "authors": ["Author", "Andrew Krietz", "Mark Bergin", "Published", "Pm Edt March", "Updated", "Am Edt March"], "date": "2019-03-21", "keywords": ["stolen", "birthday", "asking", "10news", "page", "post", "facebook", "claims", "florida", "google", "man", "followed", "whats"], "summary": "ST. PETERSBURG, Fla. — More than 21 million people call the Sunshine State home, but none are more infamous than Florida Man and Florida Woman.\nAppearing first to be popularized from a Tumblr post last week, people are asked to Google \"florida man,\" followed by your birthday.\nSeveral people from the 10News Facebook page responded to our post with their Florida man stories.\nCathy New Bostwick: \"Florida man claims people were eating his brains leads police on insane golf course chase....’ (seriously)\"Many others started sharing their reactions on Twitter.\nMore Florida man...and Florida woman storiesRelated: Minor league baseball team to host 'Florida Man Night'►Make it easy to keep up-to-date with more stories like this."}, {"url": "https://houston.sportsmap.com/grading-j-j-watts-snl-appearance", "title": "Grading J.J. Watt's SNL appearance", "authors": ["Cody Stoots", "Joshua Jordan", "Sportsmap Staff", "Jayson Braddock"], "date": "2020-02-03", "keywords": ["watts", "rockefeller", "snl", "jj", "center", "appearance", "star", "30", "texans", "grading"], "summary": "How did the Texans star do at 30 Rockefeller Center?"}, {"url": "https://floridapolitics.com/archives/287601-house-panel-hears-how-state-colleges-move-money-to-pay-for-capital-maintenance", "title": "House panel hears how state colleges move money to pay for capital, maintenance", "authors": ["Scott Powers", "Written By"], "date": "2019-02-06", "keywords": ["state", "money", "colleges", "pay", "fund", "million", "projects", "college", "maintenance", "building", "balance", "ucf", "house", "hears", "capital", "panel"], "summary": "It was such a balance that UCF tapped into in recent years to build a $38 million building that wasn’t authorized by the Florida Legislature.\nConsequently it has a $13 million balance on the books but the vast majority of that is money being set aside to one day construct a $24 million building.\nAnd then Gulf State had to pay $800,000 for emergency building repairs to get the college open again after Hurricane Michael.\nWhen asked specifically if Gulf State had used operating money for capital expenses, Mercer said yes.\n“This is one of the reasons that we feel that some level of fund balance is appropriate."}, {"url": "http://www.basketballinsiders.com/nba-mip-watch-2019-20-preseason-edition/", "title": "NBA MIP Watch 2019-20: Preseason Edition", "authors": ["Quinn Davis", "Matt John", "David Yapkowitz"], "date": "2019-10-14", "keywords": ["point", "edition", "best", "nba", "preseason", "watch", "thats", "simmons", "201920", "mip", "guards", "end", "season", "league", "hes", "team"], "summary": "In some ways, it’s hard to assess who’s better than who when trying to rank point guards.\nIf the team he’s playing for isn’t winning, then how good is he?\nOne last little tidbit before we begin- Point guards come in all shapes and sizes these days.\nThat’s Simmons’ problem.\nWho would you rank as your top eight point guards?"}, {"url": "https://www.narcity.com/us/fl/miami/news/the-florida-state-fair-is-coming-soon-to-tampa-and-its-going-to-be-more-lit-than-ever-before", "title": "The Florida State Fair Is Coming Soon To Tampa And It's Going To Be More Lit Than Ever Before", "authors": [], "date": "2019-01-28", "keywords": ["shows", "taking", "state", "original", "soon", "fair", "coming", "zoo", "going", "florida", "tampa", "vendors", "rides", "lit"], "summary": "It's that really fun time of the year when all the fairs and festivals start coming back to town - and the Florida State Fair is kicking it all off.\nFrom chowing down on some delicious fair food to riding all of the rides, whether you are an annual attendee or this is your first year going, you will not be disappointed with everything the Florida State Fair has to offer this year.\nFrom February 7 to the 18th the fair will be taking over the Tampa fairgrounds located at 4800 US Hwy.\nThere will be shows, competitions, new vendors and concessions, fair exhibits, a petting zoo, rides, and basically everything you could ever want and expect from the ultimate-fair experience.\nYou can take a ride in N3079G, the original Batcopter from the Batman TV series and the original Batman movie!"}, {"url": "https://www.narcity.com/news/police-investigate-double-homicide-of-two-canadians-who-were-found-dead-in-florida", "title": "Police Investigate Double Homicide Of Two Canadians Who Were Found Dead In Florida", "authors": [], "date": "2019-03-24", "keywords": ["canadian", "double", "canadians", "mobile", "homicide", "dead", "sheriffs", "quebec", "investigate", "florida", "case", "past", "office", "neighbours", "couple"], "summary": "This past Friday evening, police found a Canadian couple dead inside their mobile home in Flordia.\nThe case is being treated as a double homicide by authorities.\nEmergency services were called immediately and the Broward County Sheriff's Office is investigating.\nPolice are not stating if there any suspects at the moment, but are treating the case as a double homicide.\nNeighbours also state that the couple was well-liked and to them, no motivation behind a double homicide is clear."}, {"url": "https://www.refinery29.com/en-us/2017/09/171517/hurricane-irma-florida-report", "title": "Hurricane Irma Causes Massive Power Outages In Florida As The State Anticipates Extensive Damage", "authors": ["Sarah Midkiff", "Britni De La Cretaz", "Erin Corbett", "Elly Belle", "Ai-Jen Poo", "Hurricane Irma Florida Tracking Weather Report"], "date": "2017-09-17", "keywords": ["hurricane", "florida", "extensive", "netflix", "outages", "victims", "national", "outcomes", "causes", "power", "damage", "irma", "newsyou", "trafficking", "brown", "state", "cyntoia", "think", "massive", "ripple"], "summary": "NewsYou May Think You Know The Cyntoia Brown Story — But Netflix Has ...Cyntoia Brown Long’s story gained national attention and will hopefully have ripple effects when it comes to changing outcomes for trafficking victims fo"}, {"url": "https://www.jsonline.com/story/news/nation/2020/01/01/baghdad-embassy-attack-protesters-disperse-troops-fire-tear-gas/2789540001/", "title": "Protesters at US Embassy in Baghdad disperse as security personnel fire tear gas", "authors": ["Grace Hauck", "John Bacon", "Published A.M. Ct Jan."], "date": "2020-01-01", "keywords": ["iraqi", "security", "disperse", "airstrikes", "iranbacked", "forces", "trump", "gas", "military", "embassy", "personnel", "tear", "protesters", "killed", "militia", "baghdad"], "summary": "CLOSE A detachment of one hundred Marines are reinforcing the US Embassy in Baghdad after Iraqi protestors attempted to storm the compound.\n(Dec. 31) AP DomesticDemonstrators laying siege to the U.S. Embassy in Baghdad began to disperse as security personnel fired tear gas Wednesday in the second day of unrest after U.S. airstrikes killed at least two dozen Iran-backed fighters in Iraq.\nIraqi forces who guard the usually safe Green Zone where the embassy is located did little to stop the chaos.\nIran’s supreme leader, Ayatollah Ali Khamenei, criticized the U.S. airstrikes on the Iran-backed Iraqi militia on Sunday.\nThe Iranian-backed Iraqi militia vowed Monday to retaliate for the U.S. military strikes."}, {"url": "https://www.indystar.com/story/sports/motor/2019/03/26/brickyard-400-ims-race-moves-back-july-part-new-nascar-schedule/3275975002/", "title": "Brickyard 400 is on the move ... again", "authors": ["Jim Ayello", "Published A.M. Et March"], "date": "2019-03-26", "keywords": ["brickyard", "fans", "race", "ims", "speedwaysunday", "indianapolis", "nascar", "400", "weekend", "motor"], "summary": "CLOSE IndyStar Motorsports Insider Jim Ayello details the news that the Brickyard 400 NASCAR race will move to July 4 weekend.\nIndianapolis StarINDIANAPOLIS – The Brickyard 400 overhaul continues.\nThat hole on the calendar will be filled by Indianapolis’ Brickyard 400, which will occupy its third different date on the NASCAR slate in four years.\nBuy Photo Drivers head down the main straightaway for the green flag at the start of the final stage of the Brickyard 400 at Indianapolis Motor Speedway on Monday, Sept.10, 2018.\nKurt Busch, a 30-time NASCAR Cup Series winner and 18-time Brickyard 400 starter said heat is always part of the July 4th weekend, and people party anyway."}, {"url": "https://blockmanity.com/news/bitcoin/bitcoin-btc-news-florida-court-argues-that-bitcoin-is-a-legal-tender/", "title": "Bitcoin [BTC] news: Florida court argues that Bitcoin is a legal tender", "authors": [], "date": "2019-02-04", "keywords": ["legal", "tender", "money", "btc", "court", "espinoza", "does", "considered", "florida", "case", "michell", "medium", "bitcoins", "argues", "bitcoin"], "summary": "Earlier last week, Flordia’s Third District Court appealed for Bitcoin to be considered as a legal tender.\nAccording to the court, Bitcoin does not constitute as a proper definition of money but it does act as a medium of exchange.\nJudge Teresa Pooler, dropped the case saying Bitcoins aren’t considered as money according to Florida state law.\nIf Michell Espinoza is charged for illegal money transmitting, then the state of Florida would have to legally recognize Bitcoin as a legal tender.\nThe debate is still ongoing, but some countries such as Venezuela have started to recognize Bitcoin as a legal tender."}, {"url": "https://floridapolitics.com/archives/260078-victor-torres-puerto-rican-groups-urging-more-help-for-displaced-puerto-ricans", "title": "Victor Torres, Puerto Rican groups, urging more help for displaced Puerto Ricans", "authors": ["Scott Powers", "Written By"], "date": "2018-03-29", "keywords": ["kissimmee", "help", "state", "groups", "ricans", "torres", "emergency", "urging", "rico", "rican", "florida", "victor", "puerto", "federal", "assistance", "displaced"], "summary": "State Sen. Victor Torres, clergy, and others are joining with Puerto Rican activists in Florida to protest the closures of assistance offices for people displaced by Hurricane Maria last year and to renew attention on their plight.\nThe three centers had served as touch-stones for many of the estimated more than 300,000 Puerto Ricans who came to Florida after Hurricane Maria had made their homes on the island unlivable last September.\nWe need to continue to have people understanding how important it is to support Americans from Puerto Rico who are suffering, who are here, and who are over there,” Torres said.\nPuerto Rico Gov.\nRick Scott issued a series of executive orders in early October providing a myriad of assistance and red-tape cutting initiatives for Puerto Ricans coming to Florida."}, {"url": "https://floridadailypost.com/notre-dame-cathedral-aftermath/", "title": "Notre Dame Cathedral Aftermath", "authors": [], "date": "2019-04-17", "keywords": ["shows", "dame", "cathedral", "spire", "aftermath", "million", "notre", "massive", "century", "paris", "nearly"], "summary": "The massive fire that burned parts of the Notre Dame Cathedral on Monday April 15, toppled its spire as Parisians watched in shock in the streets.\nThis photo shows the Notre Dame Cathedral aftermath once the fire was put out.\nThis image made available by Gigarama.ru on Wednesday April 17, shows an aerial shot of the fire damage to Notre Dame cathedral in Paris on Tuesday April 16.\nBern told broadcaster France-Info that 880 million euros ($995 million) had been raised since the fire.\n—Notre Dame Cathedral Aftermath"}, {"url": "https://campussports.net/2020/02/14/top-10-trade-contracts-in-mlb-history/", "title": "Top 10 Trade Contracts in MLB History", "authors": ["Cailyn Szelinski", "Please Enter Your Name Here"], "date": "2020-02-14", "keywords": ["season", "reached", "series", "million", "harper", "yankees", "mlb", "contract", "trade", "history", "contracts", "world", "stanton", "price"], "summary": "These are the top 10 contracts in MLB history that put players on the move:1.\nTo us, he'll always be a World Series champ.\nHowever, Price did well in Boston and helped the Red Sox win a World Series in 2018.\nAfter several contract extensions with the Brewers and a World Series run Fielder reached free agency.\nThe Detriot Tigers offered Fielder a $214 million contract for nine years."}, {"url": "https://krod.com/utep-wbb-ready-for-crucial-florida-road-swing-at-fau-and-fiu/", "title": "UTEP WBB Ready for Crucial Florida Road Swing at FAU and FIU", "authors": ["Brandon Cohn"], "date": "2019-02-06", "keywords": ["utep", "swing", "trip", "wbb", "won", "games", "ready", "ppg", "cusa", "florida", "fiu", "season", "points", "road", "crucial", "team", "teams", "fau"], "summary": "Injuries have plagued this team all season long as neither Jordan Jenkins nor Alexa Hoy made the trip, and Sabine Lipe is out for the season.\nThe reason why these games are so important is because UTEP is tied for 11th in the C-USA standings with FAU and UTSA, while FIU is one game back in 14th place.\nIt has not been an easy road for UTEP as its first nine conference opponents have a combined record of 125-71, 54-29 in league play.\nUTEP won a 77-76 thriller last season and lost on a buzzer-beating 3-pointer in triple overtime in 2016.\nThey are led by Chelsea Guimaraes who's averaging 9.8 ppg, Paula Orenes, 9.1 ppg, and Ce'Nara Skanes, 8.3ppg."}, {"url": "https://campussports.net/2020/03/05/will-the-new-york-yankees-be-raviged-by-injuries-again/", "title": "Will the New York Yankees Be Ravaged by Injuries Again?", "authors": ["Cailyn Szelinski", "Please Enter Your Name Here"], "date": "2020-03-05", "keywords": ["spring", "2020", "training", "yankees", "york", "2019", "injuries", "soreness", "season", "ravaged", "severino"], "summary": "The 2019 season for the New York Yankees was a rough one, not because the Yankees didn’t play well but because the team was plagued by injuries.\nThis has yet to happen as just as spring training started three key Yankees have gone down with injuries.\nMany of the injuries the Yankees faced in 2019 have had lasting effects going into the 2020 season.\nHicks is currently rehabbing his elbow and is expected to rejoin the rest of the roster later in the 2020 season.\npic.twitter.com/dPxE1F8kvR — New York Yankees (@Yankees) January 14, 2020Fans had been asking themselves this question the entire 2019 season."}, {"url": "https://www.express.co.uk/life-style/style/1089237/Melania-Trump-news-Donald-today-florida", "title": "Melania Trump travels to Florida as 16 states SUE Donald over national emergency", "authors": ["Emily Hodgkin"], "date": "2019-02-19", "keywords": ["gown", "travels", "16", "trump", "emergency", "white", "donald", "melania", "florida", "pictures", "wore", "national", "sue", "red", "states"], "summary": "Melania Trump and her husband were spotted at the Florida International University Ocean Bank Convocation Center in Miami last night.\nMelania Trump news: Donald and wife in Flordia after national emergency causes states to sueMelania wore a white and red floral gown with a pleated skirt.\nSixteen US states are suing Donald Trump over the move, which was considered by some to be ploy to access fund to building part of his border wall.\nMelania Trump news: The White House revealed Melania was visiting the children’s hospitalMelania Trump in pictures Sat, July 28, 2018 America's First Lady Melania Trump in pictures.\nPlay slideshow Getty•REUTERS 1 of 100 Melania Trump in pictures"}, {"url": "https://houston.sportsmap.com/top-10-trades-for-jadeveon-clowney", "title": "5 teams that could trade for Jadeveon Clowney", "authors": ["Jayson Braddock", "Joshua Jordan", "Sportsmap Staff"], "date": "2019-06-24", "keywords": ["positions", "jadeveon", "prospects", "texans", "need", "trade", "houston", "clowney", "teams"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://craigmedred.news/2018/03/19/florida-fresh/", "title": "Tasty salmon, Florida fresh", "authors": [], "date": "2018-03-19", "keywords": ["fresh", "growing", "market", "wild", "salmon", "fish", "farmed", "florida", "sapphire", "atlantic", "tasty", "water", "alaska"], "summary": "More potentially bad news for the Alaska commercial salmon fishing industry was Monday emanating from, of all places, South Florida.\n“Atlantic Sapphire salmon will never have contact with sea lice or be exposed to wild fish diseases.\nIn October, it announced the operation is now making a “modest profit,” and the company is “in discussions with potential investors for its land-based Atlantic salmon farm on northern Vancouver Island.”“The land-based Atlantic salmon industry is accelerating globally,” Eric Hobson, the chairman of Kuterra said in that statement.\nWashington state had five but has voted to phase them out after a net failure loosed a bunch of Atlantic salmon in Puget Sound.\nIt takes under a pound and a half to grow a pound of Atlantic salmon."}, {"url": "https://www.nbcsports.com/washington/ncaa/atlantic-sun-tournament-bracket-2019-how-watch-dates-preview-location", "title": "Atlantic Sun Tournament Bracket 2019, How to watch, Dates, Preview, Location", "authors": [], "date": "2019-02-28", "keywords": ["season", "lipscomb", "watch", "liberty", "location", "bracket", "2019", "tournament", "championship", "ncaa", "florida", "preview", "atlantic", "dates", "teams"], "summary": "To be safe, though, they need to win it all to get the automatic bid to the NCAA Tournament.\nALANTIC SUN TOURNAMENT 2019 INFORMATION:When is the 2019 Atlantic Sun Tournament?\nHow to watch the 2019 Atlantic Sun Tournament?\nATLANTIC SUN TOURNAMENT 2019 BRACKET:Atlantic Sun Tournament Quarterfinals (3/4, Times ET):- No.\nThe Bisons are led by the 2019 Atlantic Sun Player of the Year, Garrison Matthews (19.8 ppg)."}, {"url": "https://theblast.com/117191/peter-weber-who-bachelor-nation-cant-get-enough-of-tyler-cameron", "title": "Peter Weber, Who? Bachelor Nation Can’t Get Enough Of Tyler Cameron", "authors": ["Jordan White", "Ryan Naumann", "Whitney Vasquez", "Jeff Mazzeo"], "date": "2020-02-29", "keywords": ["tyler", "season", "nation", "fans", "rumors", "bachelor", "cant", "went", "peter", "say", "tylers", "weber", "wellwishestyler", "cameron", "showthanks"], "summary": "Gettyimages | Presley AnnTyler Cameron was a fan favorite during Hannah Brown’s season of The Bachelorette.\nBut, as you know, the role went to Peter Weber.\nThat said, Cameron has become quite popular since his appearance on the show.\nThe Bachelorette alum didn’t say what happened, but fans were quick to extend well-wishes.\nTyler is a likable guy, which explains why the internet is so obsessed with this Florida native."}, {"url": "https://campussports.net/2018/10/24/watch-scooter-road-rage-video-miami-beach/", "title": "WATCH: Scooter Driver Tries To Run Over Man In Road Rage Incident", "authors": ["Josh Sanchez", "Please Enter Your Name Here"], "date": "2018-10-24", "keywords": ["scene", "watch", "scooter", "run", "video", "vehicle", "wild", "incident", "driver", "tries", "road", "man", "rage"], "summary": "A wild scene was captured on video involving a man on a scooter and another driver who was parked directly in front of him in a neon green vehicle.\nThe scooter driver had a passenger on the back of his ride, but that did not stop him from accelerating and attempting to run the other man over.\nCheck out the wild moment below:A bizarre scene was captured in Miami Beach, Florida, when a scooter driver got involved in a road rage incident.\nAfter getting into an argument with another motorist, the seemingly enraged man attempted to run him over with his bike.\nYou can check out road rage statistics from the NHTSA and the Auto Vantage auto club below."}, {"url": "https://www.azcentral.com/story/news/local/phoenix/2018/02/28/school-threats-reported-arizona-schools-since-parkland-flordia-shooting/380100002/", "title": "School threats: Here's a look at 17 we've reported on at Arizona schools since Parkland shooting", "authors": ["Megan Cassidy", "Published A.M. Mt Feb."], "date": "2018-02-28", "keywords": ["heres", "phoenix", "feb", "shooting", "high", "threat", "parkland", "school", "weve", "arrested", "schools", "students", "threats", "reported", "arizona", "look", "parents"], "summary": "Students from Desert Mountain High School in Scottsdale participate in a walkout protest on Feb. 22, 2018, in solidarity with Stoneman Douglas High School.\nHoward added that the number threats against Phoenix schools was actually closer to 50, but most were deemed not valid or actionable.\nPletenik noted the rash of clown threats that gained traction in 2016, and a series of bomb threats at Betty Fairfax High School in 2014.\nPhoenix-area incidentsIn addition to the 17 school threats, an 18th incident reported on azcentral.com involved a threat against a Phoenix church.\nA screenshot of an email sent by Mesa Unified School District to families of Skyline High School and Superstition High School on Feb. 21, 2018, regarding a social-media threat."}, {"url": "https://www.dailymail.co.uk/news/article-3604102/The-place-pedophiles-rapists-call-home-Florida-trailer-park-126-residents-sex-offender-live-there.html", "title": "Florida trailer park with 126 residents where you have to be a sex offender to live there", "authors": ["Chris Pleasance", "Chris Pleasance For Dailymail.Com"], "date": "2016-05-23", "keywords": ["live", "away", "sex", "similar", "offenders", "site", "trailer", "subject", "florida", "residents", "parks", "126", "park", "offender"], "summary": "AdvertisementTheir crimes are among the worst imaginable: sex offences, often carried out against children, that has seen them shunned from regular society.\nBut for sex criminals who have no choice but to try and rebuild their lives outside of jail, places like Palace Mobile Home Park in Florida offer them a second chance.\nThe park, located away from parks, bus stops and schools because of restrictions placed on many of its residents, bills itself as 'a safe place for sex offenders to begin transitioning back into society'.\nBack then, sex offenders lived alongside members of the public, though that is not the case anymore, according to the park's website.\nTypically the majority of those are sex offenders, criminals caught looking at child pornography or expressing an interest in sex with children, without actually carrying it out."}, {"url": "https://www.politico.com/story/2018/05/22/rubio-venezuela-trump-plot-602658", "title": "Trump’s team gets payback for Rubio on Venezuelan assassination plot", "authors": ["Marc Caputo", "Michael Mcfaul"], "date": "2018-05-22", "keywords": ["assassination", "venezuelan", "state", "venezuela", "president", "cabello", "plot", "payback", "trump", "sanctions", "pompeo", "trumps", "united", "policy", "rubio", "gets", "team"], "summary": "| Stringer/AFP/Getty Images Trump’s team gets payback for Rubio on Venezuelan assassination plotWhen one of Venezuela’s top leaders was suspected of conspiring to assassinate Florida Sen. Marco Rubio last year, the reaction of the United States was uncharacteristically tame.\n“The previous secretary of state protected and assisted the people who undermined the president on Venezuela,” Rubio told POLITICO.\nTrump, Rubio added, “finally has a team that will turn his orders into action.\nAsked whether Shannon was responsible for blocking the Cabello sanctions, a State Department spokesman would only say that “we don't comment on internal deliberations.\"\nLast month, at a tax event in Miami, the president spoke to Rubio about Venezuela, and this month, called the senator when Rubio was in Panama."}, {"url": "https://www.tennessean.com/story/sports/nfl/draft2019/2019/04/19/nfl-draft-nashville-2019-through-years/3498030002/", "title": "NFL Draft through the decades: Stories show how the selection process has evolved", "authors": ["Luis Torres", "Evan Barnes", "Tommy Deas", "Blake Toppmeyer", "Tom Kreager", "Adam Sparks", "Andy Humbles", "Published P.M. Ct April"], "date": "2019-04-19", "keywords": ["evolved", "round", "process", "overall", "selection", "went", "nfl", "drafted", "draft", "going", "thought", "football", "decades", "pick"], "summary": "CLOSE Jim Haslam speaks about his 1953 NFL draft experience at his office in the Pilot Flying J Headquarters in Knoxville.\nSo Tennessee both of those years had a first-round draft pick.\n92 overall pick, Philadelphia EaglesAbout: The Riverdale High School graduate was a Pro Bowl lineman and played in Super Bowl XV for the Eagles.\nThe Maplewood Comprehensive School product played in the league for 13 years and went into coaching, working in the NFL, NFL Europe and the collegiate ranks.\n70 overall pick, Chicago BearsAbout: An All-SEC performer from Birmingham, Bennett spent six seasons in Chicago, amassing 2,277 receiving yards."}, {"url": "https://www.thebluetestament.com/2019/1/5/18164859/complete-sporting-kc-mls-superdraft-history-kansas-city-wizards-draft", "title": "Complete Sporting KC MLS SuperDraft History", "authors": ["Chad C Smith", "Jan"], "date": "2019-01-05", "keywords": ["complete", "superdraft", "round", "university", "sporting", "second", "traded", "mls", "kc", "history", "pick", "forward", "midfielder", "defender"], "summary": "2nd RoundNoneThis pick (along with the 2021 first round pick) was traded to the Vancouver Whitecaps for striker Erik Hurtado.\nSKC traded midfielder Ryan Smith for this selection and the third round pick in this same supplemental draft (which is essentially a fifth round pick overall).\nThey would later flip this essentially sixth round pick for a second round pick in the 2015 draft.\nSporting’s natural pick, #28 overall, was traded to the Union along with a 2012 second round pick for Shavar Thomas.\nKC also traded away the 60th pick to the Tampa Bay Mutiny for a 2002 fifth round pick."}, {"url": "https://www.dailymail.co.uk/news/article-7234271/US-file-secret-evidence-against-Chinese-Mar-Lago-interloper.html", "title": "US can file secret evidence against Chinese Mar-a-Lago interloper", "authors": ["Emily Crane", "Emily Crane For Dailymail.Com", "Associated Press"], "date": "2019-07-10", "keywords": ["maralago", "interloper", "club", "chinese", "secret", "drive", "zhang", "evidence", "agents", "national", "service", "file", "told"], "summary": "A federal judge will let prosecutors file secret evidence in the trespassing case of a Chinese woman accused of sneaking into President Donald Trump's Mar-a-Lago club because it contains national security information.\nZhang, 33, is charged with illegally entering the president's Florida club in March and then lying to Secret Service agents when confronted.\nZhang, a Shanghai business consultant, allegedly told Secret Service agents she was a member.\nThey pointed to a receipt Zhang received from Charles Lee, a Chinese national who promotes such events at Mar-a-Lago, and a flyer she had promoting it.\n'I can work it out,' Zhang told the court."}, {"url": "https://www.advocate.com/politics/transgender/2015/02/16/florida-lawmaker-fine-or-jail-trans-people-using-wrong-bathroom", "title": "Florida Lawmaker: Fine or Jail Trans People for Using the 'Wrong' Bathroom", "authors": [], "date": "2015-02-16", "keywords": ["using", "public", "ordinance", "trans", "wrong", "bathroom", "lawmaker", "gender", "florida", "fine", "herald", "jail", "bill", "walk", "transgender"], "summary": "Florida Lawmaker: Fine or Jail Trans People for Using the 'Wrong' BathroomA proposed bill Florida aims to make it a crime for transgender people to use public facilities, including bathrooms and dressing rooms, that accord with their affirmed gender, reports the Miami Herald.\nThe lawmaker explained his proposed bill as a way to ensure \"public safety,\" rather than a means to criminalize trans citizens.\nAs many advocates have pointed out, it is actually trans people who are more likely to be harassed or physically attacked in public facilities.\nFlorida LGBT rights advocates reacted strongly to the bill, including the ACLU of Florida.\n\"A bill labeling members of our transgender community as criminals for living their lives is an abomination and an embarassment.\""}, {"url": "https://www.bet.com/music/2018/07/01/xxxtentacion-grave.html", "title": "Heartbreaking: See XXXTentacion's Final Resting Place", "authors": ["Renee Samuel", "Written Renee Samuel"], "date": "2018-07-01", "keywords": ["resting", "broward", "shot", "scared", "place", "south", "transferred", "final", "sheriffs", "heartbreaking", "williams", "xxxtentacion", "xxxtentacions", "flordia", "xxxtentacionon"], "summary": "XXXTentacion fans are still mourning the death of the 20-year-old rapper.\nOn June 18, XXXTentacion, whose real name was Jahseh Dwane Onfroy, was fatally shot while leaving a motorcycle dealer in South Flordia.\nHe was officially pronounced dead by the Broward County Sheriff’s Department after he was transferred to Broward Health North hospital.\nDedrick Williams has been charged with the murder of XXXTentacion.\nOn Thursday, June 26, XXXTentacion was laid to rest at a private funeral in Flordia."}, {"url": "https://www.washingtontimes.com/news/2018/feb/1/how-amtrak-has-come-off-the-rails/", "title": "How Amtrak has come off the rails", "authors": ["The Washington Times Http", "Bruce K. Chapmann"], "date": "2018-02-01", "keywords": ["passenger", "competition", "private", "come", "infrastructure", "intercity", "amtrak", "rails", "rail", "safety", "train", "service"], "summary": "But, for the first time since the bankruptcy of the Penn Central railroad in 1970, private passenger rail is becoming feasible.\nSome states help subsidize Amtrak service now.\nFollowing the recent deadly Amtrak derailment near Tacoma, the Cascades service funded by Washington and Oregon is a logical next prospect for inter-city competition.\nPrivate commuter rail companies in a number of metropolitan areas already make successful private bids against Amtrak.\nYet for road freight haulers, and for bus and air carriers that use federally financed infrastructure, private competition predominates."}, {"url": "https://campussports.net/2019/09/04/top-7-nfl-players-poised-to-breakout-in-2019/", "title": "Top 7 NFL Players Poised To Breakout in 2019", "authors": ["Jurgen Koni", "Please Enter Your Name Here"], "date": "2019-09-04", "keywords": ["showed", "breakout", "2018", "best", "help", "poised", "2019", "set", "nfl", "players", "williams", "season", "ridley", "cohen", "rookie"], "summary": "Before his rookie season starting in 2017, Adams suffered a stress fracture during training camp, effectively taking him out for the preseason.\nThe Alabama product had an outstanding rookie season, totaling 64 catches for 821 yards and 10 touchdowns.\nIn Week 4 of the 2018 season, Cohen recorded seven catches for 121 yards.\nAfter dealing with his own injuries as a rookie, Williams showed in 2018 why he was worth a top-10 pick.\nHooker came into his rookie season recovering from surgeries but still played well before missing more time."}, {"url": "https://www.dailymail.co.uk/news/article-1391583/U-S-best-beaches-Siesta-Beach-Sarasota-Florida-named-number-1.html", "title": "U.S. best beaches: Siesta Beach, Sarasota, Florida named number 1", "authors": ["Daily Mail Reporter"], "date": "2011-05-27", "keywords": ["leatherman", "best", "sand", "siesta", "beach", "number", "dr", "sarasota", "named", "island", "oil", "florida", "cape", "park", "beaches"], "summary": "Number one: Siesta Beach in Sarasota, Flordia, was named the best beach in the U.S.AMERICA'S BEST BEACHES1.\nSiesta Beach in Sarasota, Florida2.\nSiesta Beach got big points for shallow water and gentle currents.\n'It's a really wide beach,' said 20-year-old Britanica Graves, who lives in Sarasota and visits Siesta Beach often.\n'Even then, when the oil spill occurred, I said oil is not going to get to the Sarasota beaches [and] southwest Florida,' Dr Leatherman said."}, {"url": "https://www.tiebreaker.com/female-athletes-dominate-male-counterparts/", "title": "Play Like a Girl: Female Athletes Who Dominate Their Male Counterparts", "authors": ["Eli Laskey"], "date": "2019-03-29", "keywords": ["athletes", "male", "female", "win", "career", "game", "olympic", "basketball", "counterparts", "tennis", "woman", "world", "history", "dominate", "play", "girl"], "summary": "It’s not often that female athletes reach the top level of sports and compete side by side next to their male counterparts.\nAnn Meyers DrysdaleThe Michael Jordan of women’s basketball, Ann Meyers Drysdale was a pioneer in women’s basketball and is the GOAT when it comes to female basketball players.\nNancy LiebermanDubbed “Lady Magic” as an ode to Magic Johnson, Nancy Lieberman is widely regarded as one of the greatest female basketball players ever.\nA No.1-ranked player, Graf won 22 Grand Slam singles titles, which is second among female tennis players since the start of the Open Era in 1968.\nBut if you dig a bit deeper, you’ll soon realize that Sharapova is also one of the best female tennis players in the world."}, {"url": "https://tvline.com/2012/05/13/cbs-cancels-csi-miami-fall-tv-2012/", "title": "CBS Renews CSI: NY, Cancels CSI: Miami, Unforgettable and Others; Rules Still on Bubble", "authors": ["Matt Webb Mitovich"], "date": "2012-05-13", "keywords": ["cast", "rules", "bubble", "key", "decision", "ny", "programs", "cbs", "led", "renewed", "csi", "unforgettable", "cancels", "miami", "renews"], "summary": "CBS made call on all but one of its lingering “bubble” programs on Sunday, renewing CSI: NY for another season while pulling the plug on 10-year-old CSI: Miami and the freshman programs Unforgettable, Rob and NYC 22.\nA decision has yet to be made on the Eye’s last “bubble” show, Rules of Engagement.\nUPDATE: CBS reversed its decision on Unforgettable and renewed it for a Summer 2013 return — albeit with some cast changes.\nWe thank all the producers – led by Jerry Bruckheimer, Jonathan Littman and Ann Donahue — and its talented cast, led by David Caruso, for 10 outstanding seasons.\nViewers around the world will continue to enjoy rebroadcasts of CSI: Miami in syndication and on key digital platforms for many years to come."}, {"url": "https://campussports.net/2018/07/25/top-10-best-uniforms-in-college-football/", "title": "Top 10 Best Uniforms In College Football", "authors": ["Jonathan Abbott", "Please Enter Your Name Here"], "date": "2018-07-25", "keywords": ["best", "classic", "good", "white", "college", "uniforms", "jerseys", "combo", "football", "black", "gray", "look"], "summary": "College Football Saturdays are fast approaching, and you all know that can only mean one thing.\nNot only have the classic red/white uniforms been improved, but the recently unveiled all-black alternates are on a whole other level.\nHighlight that with one of the red, white, or black uniforms and you have some of the best looking jerseys in all of football.\n5: Miami (FL)The phrase “Look good, feel good, play good.” may apply more to the Universtiy of Miami more than any other team.\n3: TCUOne of the fresher looks in all of college football, TCU always brings the heat when it comes to uniforms."}, {"url": "https://campussports.net/2019/05/24/campus-connect-college-sports-entertainment-viral-news-5-24-2/", "title": "Campus Connect: College Sports, Entertainment & Viral News – 5/24", "authors": ["Josh Sanchez", "Please Enter Your Name Here"], "date": "2019-05-24", "keywords": ["program", "track", "model", "abby", "sportscenter", "chicken", "viral", "college", "entertainment", "waffle", "524", "texas", "24", "raptors", "campus", "connect"], "summary": "College life can be busy, so at times it can be tough to keep up with the daily news cycle.\nThat’s why we bring you Campus Connect, where you can catch the latest news in college sports and entertainment to keep on top of the buzz that everyone on campus will be talking about.\nEntertainment NewsEd Sheeran dropped his latest single “Cross Me” in the wee hours of the morning on Friday, May 24.\nJoyner Lucas previously teased an unnamed collaboration and on Thursday, May 24, the new track titled “ISIS” dropped.\npic.twitter.com/mXJztoLAtS — SportsCenter (@SportsCenter) May 24, 2019Kawhi Leonard came up clutch for the Toronto Raptors to lift them to a crucial Game 5 victory over the Milwaukee Bucks."}, {"url": "https://www.dailymail.co.uk/tvshowbiz/article-1358377/Mug-shot-surfaces-Real-Housewives-Miami-star-Marysol-Patton--mother.html", "title": "Mug shot surfaces of Real Housewives of Miami star Marysol Patton... and her mother", "authors": ["Amy Webber"], "date": "2011-02-18", "keywords": ["elsa", "shot", "series", "patton", "star", "surfaces", "arrested", "mother", "real", "mug", "marysol", "housewives", "tv", "miami"], "summary": "Mug shot surfaces of Real Housewives of Miami star Marysol Patton... and her motherThe Real Housewives of Miami series has not even aired yet, but already there is plenty of drama.\nA mug shot of Marysol Patton, who stars in the upcoming reality TV show, has emerged from her DUI arrest in January last year.\nMug shot: Marysol Patton, who is set to star in the new series Real Housewives of Miami, was arrested last yearFamily drama: Patton's mother Elsa Carrears Patton was also arrested last year in a separate incidentAnd her mother and business partner Elsa Carreras Patton, who also stars in the reality TV show, had a run in with the law nine months later.\nThe Florida State’s Attorney’s Office confirmed Marysol was arrested by Miami Police at the beginning of last year.\nThe Real Housewives of Miami premieres in the U.S. February 22 on Bravo."}, {"url": "https://nypost.com/2017/03/02/alleged-serial-killer-wont-give-up-his-fingerprints/", "title": "Alleged serial killer won’t give up his fingerprints", "authors": ["March"], "date": "2017-03-02", "keywords": ["brazell", "alleged", "murder", "thomas", "wont", "taken", "fingerprints", "court", "justice", "printed", "brooklyn", "govan", "supreme", "killer", "serial"], "summary": "The Department of Correction declined to comment on why Govan has yet to be printed, or how fingerprints are taken from an involuntary inmate.\nI can’t even dissect a frog!”Brooklyn Supreme Court Justice Neil Firetog declined to arraign him at that time because he refused to be printed.\n“My understanding is that the defendant was to be brought before me for arraignment, but he has yet to be fingerprinted,” Brooklyn Supreme Court Justice Michael Brennan told Govan’s defense attorney, Frederick Spiegel.\nGovan had been brought to the courthouse, but was relegated to a cell and did not appear before the judge.\nIn both Brazell and Thomas’ cases, Govan is known to have lived just blocks from their homes in Bushwick and Bedford-Stuyvesant."}, {"url": "https://www.express.co.uk/life-style/style/919239/melania-trump-news-donald-latest-red", "title": "Melania Trump stuns in £2,000 red coat for Valentine’s Day to visit sick children", "authors": ["Emily Hodgkin"], "date": "2018-02-15", "keywords": ["lady", "cards", "stuns", "shooting", "day", "sick", "melania", "valentines", "visit", "children", "coat", "red", "trump"], "summary": "The 47-year-old old former model, originally from Slovenia, made Valentine’s Day cards with the children in Bethesda, Maryland.\nMother-of-one to 11-year-old Barron Trump wore a red coat worth over £2,000 to visit the Children's Inn at the National Institutes of Health.\nGETTY Melania Trump: First Lady made Valentine’s Day cards with the children in Bethesda, MarylandMelania Trump stuns in red for Valentine’s day: Donald’s wife meets childrenMelania’s red Calvin Klein coat had deep pockets and a belt with a silver buckle.\n#HappyValentinesDay”Melania Trump in pictures: The First Lady visits children on Valentine’s Day Thu, February 15, 2018 Melania Trump visits Children's Inn on Valentine’s Day in pictures.\nNo child, teacher or anyone else should ever feel unsafe in an American school.”GETTY Melania Trump: Red Calvin Klein coat had deep pockets and a belt with a silver buckle"}, {"url": "https://www.thewrap.com/ex-gawker-editor-almost-went-into-hiding-after-hulk-hogan-verdict/", "title": "Ex-Gawker Editor Almost Went Into Hiding After Hulk Hogan Verdict", "authors": ["Tim Molloy", "Brian Flood", "Reid Nakamura", "Ross A. Lincoln", "Daniel Goldblatt", "J. Clara Chan", "Brian Welk", "Margeaux Sippell"], "date": "2016-09-29", "keywords": ["lawyer", "sex", "million", "daulerio", "longform", "tape", "went", "editor", "exgawker", "hogans", "verdict", "gawker", "going", "hulk", "case", "hogan", "hiding"], "summary": "Former Gawker editor AJ Daulerio says he considered going into hiding after he was hit with a $140 million judgement in Hulk Hogan‘s lawsuit against Gawker for posting of an excerpt of his sex tape.\nBut I do still have a copy of the sex tape,” he told the Longform podcast in an episode that aired Tuesday.\nWhy don’t I do a post on Ratter that says ‘Here’s What a $140 Million Sex Tape Looks Like” and then just peace out.\nGawker and Daulerio had argued that the sex tape was newsworthy, and Daulerio was asked in a 2013 deposition if he could imagine a sex tape that wouldn’t be newsworthy.\nThe sex tape included Hogan using the N-word."}, {"url": "https://www.theguardian.com/us-news/2016/sep/27/new-york-city-emissions-sea-level-rise-climate-change", "title": "New York City accelerates emissions efforts in face of daunting sea level rise", "authors": ["Oliver Milman"], "date": "2016-09-27", "keywords": ["waste", "daunting", "state", "emissions", "city", "york", "rise", "efforts", "accelerates", "electric", "vehicles", "need", "set", "level", "sea", "energy", "face"], "summary": "New York City has set out a plan to quicken its pace of decarbonization in order to meet its emissions reduction target, as the metropolis prepares for a daunting sea level rise due to climate change.\nWhile New York has already made progress in areas such as building energy efficiency, a key ongoing challenge is likely to be energy generation.\nNew York state is winding down its nuclear capacity, which provides a third of New York City’s power, requiring a sharp uptake in renewables.\nLast year the state generated 242 MW of solar electric capacity but that will need to hit 1,000 MW by 2030.\nThat hasn’t been worked out yet, nor has the roll out of electric vehicles."}, {"url": "https://www.valuewalk.com/2018/02/fake-tsunami-alert-questions/", "title": "Fake Tsunami Alert Raises More Questions", "authors": ["While Pursuing Her B.A. In Religious Studies", "M.A. In Nationalism Studies", "Isabella Developed A Passion For The Narratives That Motivate Individuals To Act. Post Academia", "She Applies This Interest To Creating Compelling Stories Through Her Writing. A Flordia Born Citizen", "Isabella Is Currently Based In Budapest", "Covers Politics For Valuewalk - Email", "Isabellagbeham Gmail.Com"], "date": "2018-02-06", "keywords": ["fake", "false", "warning", "coast", "tsunami", "sent", "questions", "alert", "weather", "national", "service", "raises"], "summary": "The fake tsunami alert was quickly remedied, but not without evoking panic and images of disaster for many.\nAccording to the National Weather Service’s National Tsunami Warning Center, a test alert was sent out at 8:30 am.\nAccording to the Weather Channel, the fake tsunami alert was received by thousands of subscribers on the East Coast.\nThe recent false alarms, between Hawaii’s traumatic false missile warning and the fake tsunami alert, creates a “boy who cried wolf” kind of scenario.\nThe National Weather Service says an investigation into the fake tsunami alert is ongoing."}, {"url": "http://blogs.mercurynews.com/49ers/2016/04/30/49ers-draft-capsules-from-deforest-buckner-at-no-7-to-prince-charles-iworah-at-no-249/", "title": "49ers draft capsules", "authors": ["Tom Bastian"], "date": "2016-04-30", "keywords": ["capsules", "round", "49ers", "facts", "win", "poundscollege", "game", "games", "draft", "season", "highlights", "yards"], "summary": "7 overall)College: OregonPosition: Defensive linemanHt/Wt: 6-foot-7, 300 poundsCollege highlights: Pac-12 Defensive Player of the Years as a senior with a conference-best 10 ½ sacks.\n… Earned all-conference honors as junior when he played on same line with Arik Armstead, the 49ers’ top pick in 2015.\nQuirky facts: His father, Scott, played five games at defensive line for the 49ers in 1985, and he still has his jersey (No.\nQuirky facts: Hails same alma mater as 49ers center Daniel Kilgore, a 2011 fifth-round draft pick.\n249)College: Wester KentuckyPosition: CornerbackHt/Wt: 5-foot-11, 193 poundsCollege highlights: Produced team-high four interceptions and recorded 42 tackles as senior starter."}, {"url": "https://www.kcur.org/arts-life/2012-04-06/innovation-the-key-to-worlds-fair-exhibition", "title": "Innovation The Key To World's Fair Exhibition", "authors": ["Laura Spencer Caught The Radio Bug More Than A Decade Ago When She Was Asked To Read A Newscast On The Air On Her First Day Volunteering For Koop", "The Community Radio Station In Austin"], "date": "2012-04-06", "keywords": ["worlds", "innovation", "exhibition", "objects", "art", "futter", "key", "today", "nelsonatkins", "fair", "museum", "fairs"], "summary": "The first World’s Fair was held in London in 1851.\nA new exhibition at the Nelson-Atkins Museum of Art, Inventing the Modern World: Decorative Arts at World's Fairs, 1851 - 1939, highlights the ongoing importance and influence of innovation at the World’s Fairs.\nMaybe it’s the Eiffel Tower created as the entrance to the 1889 World's Fair in Paris; the Ferris Wheel, the largest attraction at the World's Columbian Exposition in 1893 in Chicago; or songs like \"Meet Me in St. Louis\" from the 1944 musical film starring Judy Garland; it's set the year before the 1904 World’s Fair in St. Louis.\nThe exhibition spans the first World’s Fair in London in 1851 to the 1939 fairs in New York and San Francisco.\nThe World's Fairs promoted innovation, competition and consumerism, but Footer says they also led to a cross-cultural dialogue as the first global meeting places."}, {"url": "https://campussports.net/2017/10/19/katie-nolan-craps-on-the-new-york-yankees-to-start-her-espn-career/", "title": "Katie Nolan Craps On The New York Yankees To Start Her ESPN Career", "authors": ["Michael Napoles", "Please Enter Your Name Here"], "date": "2017-10-19", "keywords": ["nolan", "craps", "taking", "start", "career", "win", "yankees", "york", "espn", "wellnolan", "katie", "rallying", "view", "evil"], "summary": "VIEW GALLERYDan Le Batard made a career taking unpopular opinions and defending them; first in the Miami-Herald, then on 790 The Ticket radio in Miami, and now on ESPN.\nBy the looks of it, Katie Nolan is going to fit in well.\nNolan, a Boston native, took the opportunity to eschew the notion that the New York Yankees are “likeable.” She chalks it up to the fact that they aren’t as evil as they have been in the past.\nThe Bronx Bombers fell behind by two games in each series before rallying to win three straight.\nExcept Katie Nolan, of course."}, {"url": "https://www.si.com/college/2015/02/06/lions-john-bonamego-central-michigan-coach", "title": "Lions' John Bonamego finalizing deal to be Central Michigan coach", "authors": ["Si Wire"], "date": "2015-02-06", "keywords": ["coach", "western", "central", "special", "finalizing", "bonamego", "coordinator", "deal", "john", "michigan", "season", "lions", "head", "teams"], "summary": "Detroit Lions special teams coordinator John Bonamego is will be the next head coach at Central Michigan.\nDetroit Lions special teams coordinator John Bonamego will be the next head coach at Central Michigan, the school announced.\nBonamego will replace Dan Enos, who had been the Chippewas' coach since 2010 before recently leaving to become Arkansas' offensive coordinator.\nSince then, he's served as the special teams coordinator for the Jacksonville Jaguars, Green Bay Packers, New Orleans Saints, Miami Dolphins and Lions.\n“Since I left CMU in 1987, my dream job was to be the head coach of the Central Michigan football program."}, {"url": "https://www.popsugar.com/latina/Summer-Outfit-Ideas-From-Latina-Bloggers-41080205", "title": "100 Easy and Breezy Summer Outfit Ideas", "authors": ["Alessandra Foresto"], "date": "2017-08-28", "keywords": ["easy", "summer", "ideas", "wrong", "topsthis", "wearing", "weve", "breezy", "outfit", "outfits", "winter", "youll", "weeks", "100", "weekend"], "summary": "Don't get us wrong — we've been complaining about the sweltering temperatures, too, but after a long Winter and a mild Spring, we're so happy to be wearing our jean shorts and tank tops.\nThis Summer, we've been on a mission to not fall into a rut, wearing the same outfit every weekend.\nInstead, we aimed to elevate our looks, putting together stylish but still fresh outfits that allow us to have all the fun we still have planned for the season.\nThanks to these 100 ideas, courtesy of some of our favorite Latina fashion bloggers, we're not out of outfits yet.\nLook ahead for all the inspiration you'll need for the last few weeks of the Summer."}, {"url": "https://sportige.com/college-football-082012-season-week-1-predictions/", "title": "College Football 2012 Season – Week 1 Predictions", "authors": [], "date": "2012-08-30", "keywords": ["season", "nation", "best", "state", "week", "sec", "win", "college", "game", "predictions", "michigan", "football", "national", "title"], "summary": "Having Marcus Lattimore back and healthy, ready to carry the load isn’t a bad thing to build on.\nOnce beating them 55-14 in what started a 13-0 season and the 2000 national title and again in Norman, back in 2002, with Oklahoma winning 68-0.\nOklahoma are 31 points favorites, and has won its last eight regular-season non-conference games by an average of 18.0 points.\nThe Seminoles did beat Notre Dame in the bowl game last season to finish it 9-4 and have EJ Manuel back for a final season behind center.\nJohn L. Smith is the new man in charge, and he has a returning Knile Davis after missing all of last season."}, {"url": "https://campussports.net/2016/09/25/video-espns-eduardo-perez-remembers-jose-fernandez/", "title": "Video: ESPN’s Eduardo Perez remembers Jose Fernandez", "authors": ["Caleb Bailey", "Please Enter Your Name Here"], "date": "2016-09-25", "keywords": ["marlins", "yearhttpsyoutubep7tgpp_2sqcperez", "way", "eduardo", "perez", "video", "age", "fernandez", "jose", "world", "young", "baseball", "espns", "remembers"], "summary": "Sunday morning, Miami Marlins star pitcher Jose Fernandez was tragically killed in a boating accident at age 24.\nThe news rocked the sports world and many have begun sharing their emotional tributesESPN baseball analyst Eduardo Perez was one who discussed Fernandez and his tragic passing on-air after the news broke.\nhttps://youtu.be/p7tgPP_2sQcPerez also had a close relationship with Fernandez as he was the Marlins’ hitting coach for two seasons while Fernandez was with the team.\nJose Fernandez had a huge impact on the Latino community after he attempted multiple times to defect from Cuba, which landed him in prison for a year at a young age.\nRest in peace, Jose Fernandez."}, {"url": "https://patch.com/massachusetts/newton/two-new-restaurants-announced-for-newton-s-chestnut-hill-square", "title": "Developers Announce Two New Restaurants Coming to Newton's Chestnut Hill Square", "authors": [], "date": "2012-09-04", "keywords": ["seasons", "hill", "chestnut", "restaurants", "press", "release", "restaurant", "developers", "announce", "owners", "newtons", "52", "tuscan", "coming", "square", "locations"], "summary": "\"We are excited to bring Seasons 52 to the residents of New England for the first time.\nChestnut Hill is an ideal setting for our guests – people who celebrate living well while enjoying upscale dining, shopping and entertainment,\" Seasons 52 President Stephen Judge said in a press release.\nSeasons 52 will be approximately 9,500 square feet, the press release said, and will feature a custom-built wine cellar, a piano bar, two private dining rooms and an \"exclusive\" chef's table.\nThere are more than 30 Seasons 52 locations nationwide, according to the restaurant's website, with restaurants in Texas, Pennsylvania, Georgia, Florida, California, New Jersey and New York, among others.\nThe full press release from New England Development is included below:"}, {"url": "https://fox8.com/news/coronavirus/coronavirus-spread-florida-declares-public-health-emergency-new-travel-restrictions-nationwide/", "title": "Florida declares public health emergency as coronavirus spreads; new travel restrictions nationwide", "authors": ["Kevin Freeman", "Natasha Anderson", "Associated Press"], "date": "2020-03-02", "keywords": ["pence", "suspended", "coronavirus", "south", "florida", "declares", "italy", "nationwide", "public", "korea", "cases", "state", "spreads", "emergency", "health", "iran", "travel", "restrictions", "announced"], "summary": "ST. PETERSBURG, Florida (WJW) – The death toll from the coronavirus has topped 3,000 with cases reaching every continent except Antarctica.\nThe US is expanding travel restrictions from Iran and heightening a travel advisory for certain regions of South Korea and Italy, Vice President Mike Pence said Saturday.\nDelta announced reductions to service between the US and Seoul, South Korea, last week.\nFlights between the US and Shanghai and Beijing also remain suspended until April 30 following travel restrictions from US Health and Human Services.\nSome service to Tokyo Narita, Osaka, Singapore, and Seoul, South Korea, has also been suspended, according to the notice."}, {"url": "https://www.tampabay.com/news/health/2020/03/03/could-coronavirus-in-florida-hurt-spring-break-travel-officials-arent-worried-yet/", "title": "Could coronavirus in Florida hurt spring break travel? Officials aren’t worried yet.", "authors": ["Jack Evans", "Breaking News", "Pasco County Crime Courts Reporter"], "date": "2020-03-03", "keywords": ["spring", "officials", "virus", "university", "hurt", "arent", "tourism", "coronavirus", "numbers", "travel", "florida", "days", "tampa", "worried", "break", "cases"], "summary": "Coronavirus cases have been confirmed in the Tampa Bay area.\nState officials confirmed three cases of the virus by Tuesday afternoon, including two women who have been quarantined in Hillsborough County.\nSome people took to Twitter with worries that the virus’ spread would halt their spring break plans, or that spring breakers would bring the virus with them.\nCorrada, the Visit Tampa Bay CEO, said canceling travel plans is a “personal decision,” but so far, he’s not worried.\n• • •Tampa Bay Times coronavirus guideQ&A: What you need to know after Florida’s first positive coronavirus cases."}, {"url": "https://www.nytimes.com/2019/10/31/us/politics/trump-new-york-florida-primary-residence.html", "title": "Trump, Lifelong New Yorker, Declares Himself a Resident of Florida", "authors": ["Maggie Haberman"], "date": "2019-10-31", "keywords": ["mr", "weekends", "taxes", "president", "york", "yorker", "triplex", "lifelong", "tower", "tax", "florida", "days", "resident", "declares", "trump"], "summary": "Since becoming president, Mr. Trump has spent 99 days at Mar-a-Lago compared with 20 days at Trump Tower, according to NBC News.\nWhite House officials declined to say why Mr. Trump changed his primary residence, but a person close to the president said the reasons were primarily for tax purposes.\nChanging his residence to Florida is not expected to have any effect on Mr. Vance’s case, which Mr. Trump has sought to thwart with a federal lawsuit.\nIt was unclear how much time he would spend in New York in the future or if he would keep his triplex at the top of Trump Tower.\nUnder New York law, if he spends more than 184 days a year there, he will have to pay state income taxes."}, {"url": "https://news.cgtn.com/news/2020-02-23/Miami-Heat-owe-Dwyane-Wade-way-more-than-jersey-retiring-OkbkWqh42s/index.html", "title": "Miami Heat owe Dwyane Wade way more than jersey-retiring", "authors": ["Li Xiang"], "date": "2020-02-23", "keywords": ["american", "arena", "dwyane", "heat", "jerseyretiring", "way", "nba", "owe", "vcg", "l", "wade", "airlines", "miami", "team"], "summary": "3 jersey of Dwayne Wade in the Miami Heat is raised in the rafters of the American Airlines Arena in Miami, Flordia, February 22, 2020.\n3 jersey of Dwayne Wade in the Miami Heat is raised in the rafters of the American Airlines Arena in Miami, Flordia, February 22, 2020.\nDwyane Wade (L) hugs Erik Spoelstra (R), head coach of the Miami Heat at Wade's jersey-retiring ceremony at the American Airlines Arena, February 22, 2020.\n/VCG Dwyane Wade (L) hugs Erik Spoelstra (R), head coach of the Miami Heat at Wade's jersey-retiring ceremony at the American Airlines Arena, February 22, 2020.\n/VCG Dwyane Wade #3 of the Miami Heat screams \"This is my house!\""}, {"url": "https://www.housingwire.com/articles/u-s-cities-are-taking-action-on-halting-evictions/", "title": "U.S. cities are taking action on halting evictions", "authors": ["Julia Falcon", "Ben Lane", "Kathleen Howley", "Angela De Gale", "Kristin Messerli", "Sarah Wheeler"], "date": "2020-03-12", "keywords": ["taking", "eviction", "san", "spread", "evictions", "city", "coronavirus", "halting", "county", "borrowers", "jose", "action", "moratorium", "unable", "cities"], "summary": "According to the Mercury News, a San Jose, California-based newspaper, the city is moving forward with a moratorium on evictions.\nThe moratorium, which is expected to receive final approval from the San Jose City Council in the next few weeks, will be in effect for at least 30 days.\nThe city will evaluate extending the eviction moratorium in a month after it goes into effect.\nSan Jose council members will also consider adding small businesses under commercial leases to the eviction moratorium at their meeting next week.\nIn addition, they will consider setting aside a pool of additional public funds for San Jose renters and small businesses to access if needed to meet their rent payments."}, {"url": "http://www.wruf.com/headlines/2020/03/09/five-teams-have-punched-their-ticket-to-march-madness/", "title": "Five Teams have punched their ticket to March Madness", "authors": [], "date": "2020-03-09", "keywords": ["conference", "madness", "state", "second", "punched", "game", "won", "tournament", "points", "clinch", "team", "teams", "ticket", "aggies"], "summary": "Selection Sunday is less than one week away and five teams have punched their ticket to March Madness.\nAggies Clinch on Buzzer BeaterIt started with Utah State stunning No.\nUtah State is a team that has shown they can beat top teams as they have already beaten LSU and Flordia earlier this season.\nThe Flames have allowed 57 points and entered the game allowing 53.7 points a game this season, second-lowest in D-1 behind Virginia.\nWho’s NextAnother team will clinch a spot to play in March Madness with East Tennessee State and Wofford playing for the Southern Conference Championship tonight."}, {"url": "https://news.cgtn.com/news/2020-02-27/NBA-highlights-on-Feb-26-Jayson-Tatum-growing-to-be-a-superstar-OqAUcY2BKo/index.html", "title": "NBA highlights on Feb. 26: Jayson Tatum, growing to be a superstar", "authors": ["Li Xiang"], "date": "2020-02-27", "keywords": ["arena", "celtics", "feb", "nba", "smart", "growing", "2020", "game", "utah", "jayson", "superstar", "points", "highlights", "tatum", "26", "miami", "ball"], "summary": "Jayson Tatum #0 of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena in Salt Lake City, Utah, February 26, 2020.\n/VCG Jayson Tatum #0 of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena in Salt Lake City, Utah, February 26, 2020.\nMarcus Smart of the Boston Celtics shoots the ball in the game against the Utah Jazz at the Vivint Smart Home Arena, February 26, 2020.\nJimmy Butler #22 of the Miami Heat reacts in the game against the Minnesota Timberwolves at the American Airlines Arena, February 26, 2020.\n/VCG Jimmy Butler #22 of the Miami Heat reacts in the game against the Minnesota Timberwolves at the American Airlines Arena, February 26, 2020."}, {"url": "https://www.news5cleveland.com/news/national-politics/florida-bill-would-require-gun-owners-to-get-safety-training-when-renewing-concealed-carry-license", "title": "Florida bill would require gun owners to get safety training when renewing concealed carry license", "authors": [], "date": "2019-12-05", "keywords": ["license", "legislation", "training", "owners", "fried", "weapons", "carry", "florida", "require", "renewing", "safety", "gun", "concealed", "hes", "bill", "strickland"], "summary": "TALLAHASSEE, Fla. — A new bill requiring more training to carry concealed weapons in Florida isn't getting support from those who stand to benefit: The instructors.\nIf passed, gun owners would need safety training each time they renew a conceal carry permit, and they'd need to renew it every five years instead of seven.\nShe's called the proposal as a win for gun safety in the state — touting, in particular, its other provision.\nIf passed, Florida could keep gun licensing fingerprints to better stop those with out-of-state felonies from renewing carry permits.\nHe and Fried are hoping for bipartisan support after Senate President Bill Galvano tapped lawmakers to look for ways to improve Florida gun law in the upcoming session, beginning in January."}, {"url": "https://www.dawn.com/news/1539978", "title": "EU suspends aviation slots rule as coronavirus hammers airlines", "authors": ["Gordon D. Walker", "Ikram Junaidi", "Maliha Rehman", "Usama Malik", "Rafia Zakaria", "Zahid Hussain", "Syed Bakhtiyar Kazmi"], "date": "2020-03-11", "keywords": ["rule", "helps", "aviation", "suspends", "flights", "fly", "eu", "coronavirus", "leyen", "hammers", "european", "suspension", "industry", "airlines", "slots"], "summary": "BRUSSELS: The European Union will suspend a rule requiring airlines to run most of their scheduled services or else forfeit landing slots, to give carriers some breathing space as the coronavirus crisis deepens, EU chief Ursula von der Leyen said on Tuesday.\nVon der Leyen, president of the European Commission, said the suspension of the rule would do away with “ghost flights” where airlines fly almost empty planes simply to keep their slots.\n“We want to make it easier for airlines to keep their airport slot even if they do not operate flights in those slots because of the declining traffic.\nIt will relieve the pressure on aviation industry and in particular on smaller airline companies.” The EU chief did not say how long the suspension of the rule would last.\n“In order not to lose their slots, airlines have to fly with almost empty aircraft through the crisis,” a spokesman for the economy ministry said in a statement."}, {"url": "https://www.sun-sentinel.com/news/florida/fl-ne-florida-daylight-savings-time-20181030-story.html", "title": "Permanent daylight saving time for Florida awaits Congress", "authors": ["Dan Sweeney"], "date": "2018-10-30", "keywords": ["protection", "permanent", "daylight", "state", "tallahassee", "senate", "support", "tourism", "reasons", "sunshine", "presumed", "awaits", "saving", "florida", "positive", "congress"], "summary": "The increased evening daylight hours in the Sunshine State and the presumed positive effect on the tourism industry were the top reasons to support the bill when it was debated in Tallahassee, where the law was given the glowing moniker the Sunshine Protection Act and passed with overwhelming, bipartisan support — 33-2 in the Senate and 103-11 in the House."}, {"url": "https://www.theyeshivaworld.com/news/promotions/1680946/send-your-belongings-to-florida-for-pesach-safely-and-affordably-with-shippesach.html", "title": "Send Your Belongings to Florida for Pesach Safely and Affordably with Shippesach", "authors": [], "date": "2019-02-18", "keywords": ["affordably", "stress", "send", "safely", "schlepping", "process", "pesach", "offers", "experience", "shippesach", "need", "florida", "belongings"], "summary": "Sponsored ContentGoing down to Florida for Pesach is a tradition practiced by hundreds of families each year.\nBut for many, this is accompanied by a tremendous amount of schlepping and stress, incredible amounts of luggage and personal items required to celebrate the holiday.\nShippesach, a company with a vast amount of logistics experience, now offers ground shipping from the New York and New Jersey area to Orlando and Miami, simplifying the process of bringing your belongings down south.\n“Our goal is to simplify the entire process of visiting Flordia for Pesach,” explains Shippesach’s co-founder, Joseph Cohen.\nContact Shippesach today at 718-500-2766, email them at [email protected], or visit their Instagram account at @ship_pesach to learn more about having a hassle-free Pesach experience in Florida."}, {"url": "https://houston.sportsmap.com/texans-resign-bradley-roby", "title": "Texans resign Bradley Roby", "authors": ["Jermaine Every", "Joshua Jordan", "Sportsmap Staff", "Jayson Braddock"], "date": "2020-03-15", "keywords": ["positions", "resign", "bradley", "prospects", "texans", "need", "roby", "houston"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://www.wate.com/news/bristol-motor-speedway-no-changes-to-race-weekend-schedule/", "title": "Bristol Motor Speedway: ‘No changes to race weekend schedule’", "authors": ["Elizabeth Kuebel", "Kellyanne Stitts", "Wate Staff"], "date": "2020-03-13", "keywords": ["officials", "upcoming", "tenn", "touched", "race", "schedule", "changes", "bristol", "nascar", "speedway", "things", "weekend", "wjhl", "motor"], "summary": "BRISTOL, Tenn. (WJHL)- In a social media post on Thursday, officials said that there are no changes to Bristol Motor Speedway’s NASCAR race weekend schedule in April.\nBristol Motor Speedway officials added, “We’ll be adding hand-washing stations in key places, distributing hand sanitizer and deep-cleaning high-traffic areas where things like hand-rails are touched often.”SEE ALSO: NASCAR: Fans will not be in attendance at upcoming races in Atlanta, Miami"}, {"url": "http://www.basketballinsiders.com/nba-mip-watch-2019-20-preseason-edition/", "title": "NBA MIP Watch 2019-20: Preseason Edition", "authors": ["Quinn Davis", "Matt John", "David Yapkowitz"], "date": "2019-10-14", "keywords": ["point", "edition", "best", "nba", "preseason", "watch", "thats", "simmons", "201920", "mip", "guards", "end", "season", "league", "hes", "team"], "summary": "In some ways, it’s hard to assess who’s better than who when trying to rank point guards.\nIf the team he’s playing for isn’t winning, then how good is he?\nOne last little tidbit before we begin- Point guards come in all shapes and sizes these days.\nThat’s Simmons’ problem.\nWho would you rank as your top eight point guards?"}, {"url": "https://www.breitbart.com/politics/2019/03/21/andrew-gillum-targets-enfranchised-felons-in-2020-florida-voter-drive/", "title": "Andrew Gillum Targets Enfranchised Felons in 2020 Florida Voter Drive", "authors": ["Joshua Caplan"], "date": "2019-03-21", "keywords": ["targets", "state", "vote", "presidential", "enfranchised", "2020", "gillum", "voter", "felons", "million", "party", "registered", "drive", "andrew", "florida", "registration"], "summary": "Failed gubernatorial candidate Andrew Gillum has unveiled plans to register enfranchised felons as part of one-million voter drive in Flordia aimed at thwarting President Donald Trump’s chances of winning the crucial swing state in the 2020 presidential election.\n“We can deny Donald Trump a second term right here in the state of Florida.”The former Tallahassee mayor is calling the voter registration drive “Bring it Home Florida,” a political action group named after his 2018 campaign slogan.\n“Voter registration is red flag No.\nMore than 3 million registered voters in the state have no party affiliation.\nIn addition to overseeing the ambitious voter drive, Gillum will likely continue as a political commentator for CNN."}, {"url": "https://www.dailymail.co.uk/news/article-7234271/US-file-secret-evidence-against-Chinese-Mar-Lago-interloper.html", "title": "US can file secret evidence against Chinese Mar-a-Lago interloper", "authors": ["Emily Crane", "Emily Crane For Dailymail.Com", "Associated Press"], "date": "2019-07-10", "keywords": ["maralago", "interloper", "club", "chinese", "secret", "drive", "zhang", "evidence", "agents", "national", "service", "file", "told"], "summary": "A federal judge will let prosecutors file secret evidence in the trespassing case of a Chinese woman accused of sneaking into President Donald Trump's Mar-a-Lago club because it contains national security information.\nZhang, 33, is charged with illegally entering the president's Florida club in March and then lying to Secret Service agents when confronted.\nZhang, a Shanghai business consultant, allegedly told Secret Service agents she was a member.\nThey pointed to a receipt Zhang received from Charles Lee, a Chinese national who promotes such events at Mar-a-Lago, and a flyer she had promoting it.\n'I can work it out,' Zhang told the court."}, {"url": "https://happygamer.com/rockstar-reveals-release-date-for-grand-theft-auto-v-onlines-diamond-casino-and-resort-19259/", "title": "Rockstar Reveals Release Date For Grand Theft Auto V Online’s Diamond Casino And Resort", "authors": ["Aaron Hans", "Manuel Romero"], "date": "2019-07-21", "keywords": ["gta", "added", "v", "resort", "release", "support", "auto", "theft", "game", "rockstar", "date", "reveals", "grand", "onlines", "diamond", "online", "casino"], "summary": "The new addition to Grand Theft Auto Online, which is being called the Diamond Casino and Resort, will become available on July 23.\nMuch like last year’s update to Grand Theft Auto Online, which introduced nightclubs to the mode, there will be some new characters and storylines added.\nEven though it’s been six years since Rockstar launched Grand Theft Auto Online, the mode’s fanbase is still active and growing.\nThere have been a ton of rumors and supposed leaks surrounding Grand Theft Auto 6, with the biggest one being that there will be a female protagonist.\nBut, for now, Rockstar hasn’t confirmed anything regarding the next Grand Theft Auto title, nor have they officially announced that one is coming."}, {"url": "https://www.nbcsports.com/washington/ncaa/atlantic-sun-tournament-bracket-2019-how-watch-dates-preview-location", "title": "Atlantic Sun Tournament Bracket 2019, How to watch, Dates, Preview, Location", "authors": [], "date": "2019-02-28", "keywords": ["season", "lipscomb", "watch", "liberty", "location", "bracket", "2019", "tournament", "championship", "ncaa", "florida", "preview", "atlantic", "dates", "teams"], "summary": "To be safe, though, they need to win it all to get the automatic bid to the NCAA Tournament.\nALANTIC SUN TOURNAMENT 2019 INFORMATION:When is the 2019 Atlantic Sun Tournament?\nHow to watch the 2019 Atlantic Sun Tournament?\nATLANTIC SUN TOURNAMENT 2019 BRACKET:Atlantic Sun Tournament Quarterfinals (3/4, Times ET):- No.\nThe Bisons are led by the 2019 Atlantic Sun Player of the Year, Garrison Matthews (19.8 ppg)."}, {"url": "https://www.express.co.uk/life-style/style/1089237/Melania-Trump-news-Donald-today-florida", "title": "Melania Trump travels to Florida as 16 states SUE Donald over national emergency", "authors": ["Emily Hodgkin"], "date": "2019-02-19", "keywords": ["gown", "travels", "16", "trump", "emergency", "white", "donald", "melania", "florida", "pictures", "wore", "national", "sue", "red", "states"], "summary": "Melania Trump and her husband were spotted at the Florida International University Ocean Bank Convocation Center in Miami last night.\nMelania Trump news: Donald and wife in Flordia after national emergency causes states to sueMelania wore a white and red floral gown with a pleated skirt.\nSixteen US states are suing Donald Trump over the move, which was considered by some to be ploy to access fund to building part of his border wall.\nMelania Trump news: The White House revealed Melania was visiting the children’s hospitalMelania Trump in pictures Sat, July 28, 2018 America's First Lady Melania Trump in pictures.\nPlay slideshow Getty•REUTERS 1 of 100 Melania Trump in pictures"}, {"url": "https://www.sun-sentinel.com/sports/florida-panthers/fl-florida-panthers-1025-20161024-story.html", "title": "Trocheck took no joy in hometown Cup win, seeks own with Panthers", "authors": ["Craig Davis"], "date": "2016-10-24", "keywords": ["took", "far", "panthers", "win", "seeks", "joy", "hometown", "think", "roll", "test", "playoffs", "match", "youve", "things", "cup", "teams", "trocheck"], "summary": "\"You've got to be able to test yourself, especially early on … and figure out if you have that 'it' factor to go far into the playoffs,\" Trocheck said.\n\"I think so far we're getting into the roll of things.\nThink we definitely match up well against most teams in the league.\""}, {"url": "https://www.washingtontimes.com/news/2018/feb/1/how-amtrak-has-come-off-the-rails/", "title": "How Amtrak has come off the rails", "authors": ["The Washington Times Http", "Bruce K. Chapmann"], "date": "2018-02-01", "keywords": ["passenger", "competition", "private", "come", "infrastructure", "intercity", "amtrak", "rails", "rail", "safety", "train", "service"], "summary": "But, for the first time since the bankruptcy of the Penn Central railroad in 1970, private passenger rail is becoming feasible.\nSome states help subsidize Amtrak service now.\nFollowing the recent deadly Amtrak derailment near Tacoma, the Cascades service funded by Washington and Oregon is a logical next prospect for inter-city competition.\nPrivate commuter rail companies in a number of metropolitan areas already make successful private bids against Amtrak.\nYet for road freight haulers, and for bus and air carriers that use federally financed infrastructure, private competition predominates."}, {"url": "https://www.thedailybeast.com/richard-florida-concedes-the-limits-of-the-creative-class", "title": "Richard Florida Concedes the Limits of the Creative Class", "authors": ["Joel Kotkin"], "date": "2013-03-20", "keywords": ["largely", "francisco", "concedes", "san", "urban", "york", "cool", "richard", "florida", "creative", "hip", "limits", "class", "cities"], "summary": "Oh, and thanks again for the check.”One key constituency advocating “creative class” oriented development has been the grandees of urban real estate.\nFocusing on attracting the “hip cool” single set, Piiparinen maintains, simply sets places like Cleveland up for failure.\nThe Issue of RaceOn paper, the “creative class” theory worships at the altar of diversity.\nTen years ago his increasingly “creative class” neighborhood of Bywater was family oriented.\nEqually important, none, including “creative class” hotspots Raleigh and Austin, are dense, transit-centered places of the kind urbanists suggest create economic vibrancy and attract the largest number of migrations."}, {"url": "https://thinkrealty.com/top-10-metros-highest-vacancy-rates/", "title": "Top 10 U.S. Metros for the Highest Vacancy Rates", "authors": [], "date": "2019-03-08", "keywords": ["rates", "highest", "high", "metros", "mean", "market", "vacancy", "prices", "low", "lendingtree", "investors"], "summary": "And thanks to a recent report from LendingTree, investors have more insight into what metros have the highest vacancy rates to help them maximize their strategies and achieve their goals.\nHigh vacancy rates and low home prices might mean that an area is experiencing economic or social challenges such as increased unemployment or crime rates, he added.\nFlorida’s big metros have high vacancy ratesMiami (17.09 percent), Orlando (15.93 percent), and Tampa (15.25 percent) each reported vacancy rates significantly higher than the national average of 9.44 percent, according to LendingTree.\nThese metros enjoy a combination of factors that keep vacancy rates low, including strong job markets, growing economies, and an increasing population of Millennial homebuyers.\nHere are the top 10 metros with the highest and lowest vacancy rates around the United States."}, {"url": "https://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2018/12/23/ut-vols-1998-tennessee-football-national-championship-florida-state-fiesta-bowl/2301386002/", "title": "How the 1998 UT Vols beat Florida State in the Fiesta Bowl to cap the program's most storied season", "authors": ["Blake Toppmeyer", "Published P.M. Et Dec."], "date": "2018-12-23", "keywords": ["storied", "state", "fsus", "seminoles", "fiesta", "programs", "bowl", "game", "championship", "florida", "tennessee", "season", "cap", "ut", "play", "vols"], "summary": "1 in the Bowl Championship Series rankings and needed to beat Mississippi State in the SEC Championship to remain undefeated.\n2, followed by Kansas State and Florida State.\nBut who would Florida State play?\nDwayne Goodrich (23) runs back an interception for UT's second touchdown in the Fiesta Bowl against Florida State on Jan. 4, 1999.\nThe scoreboard shows the Vols' victory over Florida State in the Fiesta Bowl on Jan. 4, 1999."}, {"url": "https://www.news-journalonline.com/news/20171113/eying-politics-john-morgan-wants-to-answer-god-whispers", "title": "Eying politics, John Morgan wants to answer 'God whispers'", "authors": ["Mark Harper"], "date": "2017-11-13", "keywords": ["politics", "morgan", "money", "know", "job", "dont", "think", "say", "john", "im", "going", "god", "answer", "whispers", "eying", "ive", "wants"], "summary": "He lost job after job after job, and then he got a job in Florida.\nDid you start that with Morgan & Morgan?\nI just kept putting money in, money in, money in, and people weren’t joining in.\nI don’t think you have to be too deductive to understand if it’s not allowed in public, it is allowed in private.\nIt’s now called the Morgan & Morgan Hunger Relief Center."}, {"url": "https://www.express.co.uk/news/weather/850672/Hurricane-Irma-path-NOAA-track-models-update-Florida-US-tracking-live-latest-NHC-news", "title": "Hurricane Irma path update LIVE: Latest NOAA track as models show hurricane to HIT Florida", "authors": ["Alice Foster", "Rebecca Perring"], "date": "2017-09-10", "keywords": ["update", "live", "hit", "winds", "track", "noaa", "coast", "islands", "hurricane", "models", "latest", "irma", "keys", "florida", "nhc", "path", "storm", "edt"], "summary": "02.00 Hurricane Irma Update –NOAA Hurricane Irma has been upgraded to a category 4 storm.\n2pm EDT: Hurricane Irma continues towards Florida Hurricane Irma was last located just 225 miles (365 km) east from Caibarien in Cuba, and 380 miles (610 km) southeast of Florida.\n7.50pm EDT: Hurricane Irma kills four people in the US Virgin Islands Hurricane Irma killed four people in the US Virgin Islands, a Government spokesman said.\n11am EDT: Hurricane Irma winds dip to 175 mph Hurricane Irma winds are now 175 mph (280 km/h), down from 180 mph.\n8am EDT: Hurricane Irma winds rage at 180 mph Hurricane Irma winds are still 180 mph (285 km/h)."}, {"url": "https://www.express.co.uk/travel/beach/831639/flordia-orlando-disney-world-holidays", "title": "Florida: What to do that’s NOT Orlando Disney World on East Coast holidays", "authors": ["Emily Hodgkin"], "date": "2017-07-22", "keywords": ["flagler", "orlando", "plenty", "coast", "thats", "state", "white", "visitors", "disney", "museum", "florida", "holidays", "world", "travel", "east", "palm"], "summary": "GETTY Florida: What to do that’s not Orlando Disney World on East Coast holidaysFLORIDA is usually visited by families for one big reason, Orlando’s Walt Disney World.\nThe town of Palm Beach has plenty to offer visitors, as well as being the winter home of President Donald Trump.\nThe Flagler Museum offers a fascinating insight into the history of Florida - made possible by Henry Flagler himself, an oil tycoon who unified the railways along the state and built hotels in his wake.\nAt one time a hotel, which hosted Marlene Dietrich, the building - named White Hall - is now a museum to Flagler and his dynasty.\nGETTY Florida: Palm Beach has plenty to offer visitors, as well as being a home of President Trump"}, {"url": "https://www.thekeyplay.com/content/2019/march/19/buzz-williams-and-texas-am-no-plan-b-thread-part-ii", "title": "Buzz Williams and Texas A&M, No Plan B (Thread Part II)", "authors": [], "date": "2019-03-19", "keywords": ["wide", "b", "virginia", "update", "zwerneman", "turns", "win", "college", "thread", "basketball", "texas", "plan", "williams", "ii", "buzz"], "summary": "Brent Zwerneman of the Houston Chronicle published an update on Texas A&M's coaching search and there's plenty of confidence the Aggies will land their man.\nOnce Williams, 46, is done with his season at Virginia Tech — and the Hokies are built to win at least a couple of games in the postseason — he's expected to pack bags and load up his family for College Station.\n\"The wide expectation among college basketball insiders is that Williams will be the next coach at Texas A&M,\" national college basketball columnist Seth Davis recently opined.\nIf Williams turns this down, a lot of folks around the sport will be quite surprised.\""}, {"url": "https://www.latestly.com/lifestyle/fifa-womens-world-cup-2019-usa-teammates-and-lesbian-couple-ali-krieger-and-ashlyn-harris-to-get-married-in-december-check-instagram-post-986281.html", "title": "FIFA Women's World Cup 2019 USA Teammates and Lesbian Couple Ali Krieger and Ashlyn Harris to Get Married in December! (Check Instagram Post)", "authors": [], "date": "2019-07-05", "keywords": ["ashlyn", "teammates", "married", "usa", "harris", "instagram", "megan", "2019", "post", "womens", "ali", "vogue", "lesbian", "world", "football", "cup", "team", "krieger"], "summary": "Football players Ali Krieger and Ashlyn Harris to get married in December (Photo Credits: Getty Images)American football players Ali Krieger and Ashlyn Harris who represent the United States at the 2019 FIFA Women's World Cup may become the first professional sports teammates to get married.\nThey’re certainly the most high-profile, representing the U.S. at the World Cup, and slated to compete for the final this weekend.\nThe United States will play the Netherlands in the final of the 2019 Women's World Cup on Sunday.\nMegan Rapinoe Insists 'You Can’t Win Without Gays' After USA Beat France 2-1 to Enter 2019 FIFA Women's World Cup Semi-Finals.\nFollowing which, Trump took to Twitter inviting the US women's team to the White House."}, {"url": "https://www.thesouthafrican.com/news/south-african-irma-message/", "title": "South African in Hurricane Irma goes viral after leaving brilliant message", "authors": [], "date": "2017-09-12", "keywords": ["brilliant", "homes", "message", "state", "parts", "hurricane", "goes", "viral", "african", "leaving", "rebuild", "south", "irma", "boarded", "africans", "family"], "summary": "The message from officials was clear, you can rebuild your property but you can’t rebuild your life if you’re dead.\nWhile hundreds of thousands of Flordia residents boarded up their homes, one unknown South African family managed to do so in the most South African way ever.\nThe replies for that tweet only led to even more hilarity as South Africans joked about our ability to keep calm in serious situations and always see the positives.\nA second South African sign was discovered and this one may just take the cake.\nWell, we South Africans really are special people after all."}, {"url": "https://www.lowkickmma.com/not-so-fast-yoel-romero-says-paulo-costa-failed-usada-drug-test-then-retracts-it/", "title": "Not So Fast: Yoel Romero Says Paulo Costa Failed USADA Drug Test, Then Retracts It", "authors": [], "date": "2019-03-12", "keywords": ["costa", "romero", "fast", "paulo", "heard", "usada", "espn", "ufc", "test", "drug", "retracts", "yoel", "need", "failed"], "summary": "Yoel Romero said he heard Paulo Costa was popped by the United States Anti Doping Agency (USADA).\nThe upcoming UFC on ESPN 3 in Miami was supposed to be headlined by a middleweight clash between Romero and Costa.\n“What I hear is Paulo Costa, he had a positive test for USADA,” Romero said.\n(via Twitter)Re: the Paulo Costa story, Yoel Romero called me immediately after the show to clarify that he had only heard that Paulo Costa failed a USADA drug test but he is not sure if that is accurate at this time.\n— Ariel Helwani (@arielhelwani) March 11, 2019I’ve reached out to Costa’s team, USADA, UFC to get an official word on if this is accurate, but no word back yet."}, {"url": "https://www.popsugar.com/latina/Summer-Outfit-Ideas-From-Latina-Bloggers-41080205", "title": "100 Easy and Breezy Summer Outfit Ideas", "authors": ["Alessandra Foresto"], "date": "2017-08-28", "keywords": ["easy", "summer", "ideas", "wrong", "topsthis", "wearing", "weve", "breezy", "outfit", "outfits", "winter", "youll", "weeks", "100", "weekend"], "summary": "Don't get us wrong — we've been complaining about the sweltering temperatures, too, but after a long Winter and a mild Spring, we're so happy to be wearing our jean shorts and tank tops.\nThis Summer, we've been on a mission to not fall into a rut, wearing the same outfit every weekend.\nInstead, we aimed to elevate our looks, putting together stylish but still fresh outfits that allow us to have all the fun we still have planned for the season.\nThanks to these 100 ideas, courtesy of some of our favorite Latina fashion bloggers, we're not out of outfits yet.\nLook ahead for all the inspiration you'll need for the last few weeks of the Summer."}, {"url": "https://patch.com/massachusetts/newton/two-new-restaurants-announced-for-newton-s-chestnut-hill-square", "title": "Developers Announce Two New Restaurants Coming to Newton's Chestnut Hill Square", "authors": [], "date": "2012-09-04", "keywords": ["seasons", "hill", "chestnut", "restaurants", "press", "release", "restaurant", "developers", "announce", "owners", "newtons", "52", "tuscan", "coming", "square", "locations"], "summary": "\"We are excited to bring Seasons 52 to the residents of New England for the first time.\nChestnut Hill is an ideal setting for our guests – people who celebrate living well while enjoying upscale dining, shopping and entertainment,\" Seasons 52 President Stephen Judge said in a press release.\nSeasons 52 will be approximately 9,500 square feet, the press release said, and will feature a custom-built wine cellar, a piano bar, two private dining rooms and an \"exclusive\" chef's table.\nThere are more than 30 Seasons 52 locations nationwide, according to the restaurant's website, with restaurants in Texas, Pennsylvania, Georgia, Florida, California, New Jersey and New York, among others.\nThe full press release from New England Development is included below:"}, {"url": "https://www.nytimes.com/2019/10/31/us/politics/trump-new-york-florida-primary-residence.html", "title": "Trump, Lifelong New Yorker, Declares Himself a Resident of Florida", "authors": ["Maggie Haberman"], "date": "2019-10-31", "keywords": ["mr", "weekends", "taxes", "president", "york", "yorker", "triplex", "lifelong", "tower", "tax", "florida", "days", "resident", "declares", "trump"], "summary": "Since becoming president, Mr. Trump has spent 99 days at Mar-a-Lago compared with 20 days at Trump Tower, according to NBC News.\nWhite House officials declined to say why Mr. Trump changed his primary residence, but a person close to the president said the reasons were primarily for tax purposes.\nChanging his residence to Florida is not expected to have any effect on Mr. Vance’s case, which Mr. Trump has sought to thwart with a federal lawsuit.\nIt was unclear how much time he would spend in New York in the future or if he would keep his triplex at the top of Trump Tower.\nUnder New York law, if he spends more than 184 days a year there, he will have to pay state income taxes."}, {"url": "https://www.clickorlando.com/2019/10/01/tropics-continue-to-bubble-nice-day-on-tap-for-central-florida/", "title": "Tropics continue to bubble as 2 new systems pop up", "authors": ["Daniel Dahm", "Troy Bridges"], "date": "2019-10-01", "keywords": ["pop", "stay", "continue", "near", "bubble", "area", "high", "chances", "tropics", "bridges", "low", "days", "showers", "rain", "systems"], "summary": "ORLANDO, Fla. – The tropics continue to bubble, but two new systems do not appear to be potential threats to Florida.\nDisorganized showers near the southeastern Bahamas are associated with a week surface area of low pressure.\nOrlando-area forecastOrlando will see a high near 90 Tuesday, with a 20% chance of rain.\nRain chances will stay at 20% for most of the workweek.\nA slight bump in rain chances return by Sunday and Monday."}, {"url": "https://www.usatoday.com/in-depth/news/investigations/2019/10/30/security-contractor-g-4-s-plagued-years-international-scandal/4060171002/", "title": "The Pulse nightclub shooting and other G4S scandals", "authors": ["Brett Murphy", "Nick Penzenstadler", "Usa Today", "Gina Barton", "Milwaukee Journal Sentinel"], "date": "2019-10-30", "keywords": ["security", "lost", "shooting", "british", "pulse", "nightclub", "million", "scandals", "facility", "nuclear", "detention", "g4s", "guards", "company"], "summary": "G4S said it was “deeply shocked” by the Pulse shooting but has defended its hiring practices.\nUK prison death prompts outrageIn 2004, Gareth Myatt, 15, died of “positional asphyxia” at the United Kingdom's Rainsbrook Secure Training Centre, a youth detention facility G4S operated until 2016.\nRainsbrook was also cited for “inadequate” care in a government report in 2015 and G4S lost the next contract.\nThree G4S guards were involved in another in-custody death in 2010, when an Angolan man at Heathrow Airport died while being restrained.\nIn December of that year, South African government officials took over the maximum security facility after G4S “lost effective control,” the government told the BBC."}, {"url": "https://www.stateoftheu.com/2020/1/27/21083993/miami-hurricanes-football-manny-diaz-goals-deriq-king-culture-acc-coastal-fsu-rivalry-brevin-jordan", "title": "My 3 Biggest Goals For The Miami Hurricanes In 2020", "authors": ["Jan"], "date": "2020-01-27", "keywords": ["season", "biggest", "goals", "canes", "2020", "hurricanes", "win", "coming", "football", "acc", "coastal", "miami"], "summary": "We’re only a month into the offseason for the Miami Hurricanes, and currently sit at 222 days away from their 2020 opener against Temple, but it’s never too early to start setting goals for the upcoming season.\nWin the ACC CoastalIf the Hurricanes want to get back on track and become a force in college football once again, they must start winning the ACC Coastal.\nMiami officially eliminated from ACC Coastal.\nWith players like King, Brevin Jordan, Gregory Rousseau and several other playmakers, there’s no reason why Miami can’t win the division.\nThe Miami Hurricanes Football team should take culture lessons from the @MiamiHEATWhen the Heat organization talks about culture, it actually means something."}, {"url": "http://www.basketballinsiders.com/nba-mip-watch-2019-20-preseason-edition/", "title": "NBA MIP Watch 2019-20: Preseason Edition", "authors": ["Quinn Davis", "Matt John", "David Yapkowitz"], "date": "2019-10-14", "keywords": ["point", "edition", "best", "nba", "preseason", "watch", "thats", "simmons", "201920", "mip", "guards", "end", "season", "league", "hes", "team"], "summary": "In some ways, it’s hard to assess who’s better than who when trying to rank point guards.\nIf the team he’s playing for isn’t winning, then how good is he?\nOne last little tidbit before we begin- Point guards come in all shapes and sizes these days.\nThat’s Simmons’ problem.\nWho would you rank as your top eight point guards?"}, {"url": "https://www.chicagotribune.com/news/breaking/ct-cps-strike-teacher-pay-comparison-20191011-pixhzru5angsfamk7altrysxr4-story.html", "title": "CPS teachers out-earn many in other districts, but union says pay isn’t the whole picture and numbers can be misleading", "authors": ["Kim Geiger"], "date": "2019-10-11", "keywords": ["picture", "degree", "thats", "experience", "numbers", "districts", "proposal", "outearn", "isnt", "misleading", "pay", "bachelors", "cps", "increase", "union", "salary", "teachers", "today", "similar", "teacher"], "summary": "Under Lightfoot’s proposal, a teacher with a bachelor’s degree and 10 years of experience today would see his or her salary increase to $95,604 by year five of the contract.\nThat amount is $11,000, or 13%, more than the current teacher with 15 years of experience and a bachelor’s degree earns today.\nA teacher with a bachelor’s degree and five years of experience today would go from a salary of $58,315 to a salary of $81,701 in five years.\nThat’s about $6,500 more than the $75,083 earned today by a similar teacher, or an increase of about 2% each year."}, {"url": "https://bigredlouie.com/2019/06/13/louisville-football-makes-top-three-for-three-star-offensive-lineman/", "title": "Louisville football: Newest QB target drawing comparisons to Lamar Jackson", "authors": ["Presley Meyer", "Mike Chiari", "Jacob Lane"], "date": "2019-06-13", "keywords": ["qb", "drawing", "yards", "football", "staff", "run", "game", "target", "louisville", "comparisons", "quarterback", "florida", "lamar", "newest", "spann", "jackson"], "summary": "(Photo by Joe Robbins/Getty Images)Scott Satterfield and the Louisville football program are looking to build a special class for 2020.\nRELATED PRODUCT LAMAR JACKSON LOUISVILLE CARDINALS HEISMAN BOBBLEHEAD Buy Now!\nWhen you turn on his highlights, you quickly can see a link to a past Louisville player, that being Lamar Jackson.\nHe hears and sees the comparisons as well, and when you look through the tweets & retweets of Spann, you see his timeline filled with Lamar Jackson videos.\nHe throws the ball so fluidly.”Like Jackson, Spann has incredible stats over the course of his high school career and is constantly setting high goals for himself."}, {"url": "https://www.nationalobserver.com/2019/12/20/news/shrinking-populations-caribbean-due-climate-change", "title": "Shrinking populations in Caribbean due to climate change", "authors": [], "date": "2019-12-20", "keywords": ["populations", "community", "change", "shrinking", "vieques", "ricans", "hurricanes", "central", "climate", "caribbean", "florida", "puerto", "latona", "maria"], "summary": "One of the most noticeable things that’s changed since the hurricanes, Latona says, is that there are fewer familiar faces.\nPuerto Ricans had already been leaving in droves prior to Maria.\n“There’s a real sense of ‘what’s the point of coming back?’’’ Latona said, describing the perspective of Puerto Ricans who have left.\nBut some Puerto Ricans who have moved to the U.S. after the 2017 hurricanes have encountered hostility from some unexpected sources.\nWith a sustained uptick in Puerto Ricans moving to Central Florida after Maria, their Democratic-leaning votes are predicted to be a political force rivaling Republican-leaning Cuban-Americans."}, {"url": "https://www.saturdaydownsouth.com/sec-football/10-questions-about-the-sec-east-in-2020/", "title": "10 questions I have about the SEC East in 2020", "authors": ["Neil Blackmon", "Neil Blackmon Covers Florida Football For Saturdaydownsouth.Com. An Attorney", "Two-Time Graduate Of The University Of Florida", "He Is A Member Of The Football Writers Association Of America. He Also Coaches Basketball. You Can Follow Him On Twitter"], "date": "2020-02-02", "keywords": ["2020", "sec", "football", "kentucky", "seasons", "questions", "game", "2019", "offensive", "season", "east", "georgia", "program"], "summary": "In the SEC East, the landscape, at least in the previous 3 seasons, has been dominated by Kirby Smart’s Georgia Bulldogs.\nA year after winning the crossover head-to-head against the SEC West for the first time in several seasons, the East broke even with the West in 2019.\nNothing builds hope and hype more than spring football and talking season, so with that in mind, here are 10 topics of conversation I have about the SEC East in 2020.\nThe last ride of Jarrett GuarantanoIf there is a stranger football player in the SEC, I haven’t seen him play.\nIf that changes this season, the SEC East champion will, too."}, {"url": "http://www.wruf.com/headlines/2020/03/09/five-teams-have-punched-their-ticket-to-march-madness/", "title": "Five Teams have punched their ticket to March Madness", "authors": [], "date": "2020-03-09", "keywords": ["conference", "madness", "state", "second", "punched", "game", "won", "tournament", "points", "clinch", "team", "teams", "ticket", "aggies"], "summary": "Selection Sunday is less than one week away and five teams have punched their ticket to March Madness.\nAggies Clinch on Buzzer BeaterIt started with Utah State stunning No.\nUtah State is a team that has shown they can beat top teams as they have already beaten LSU and Flordia earlier this season.\nThe Flames have allowed 57 points and entered the game allowing 53.7 points a game this season, second-lowest in D-1 behind Virginia.\nWho’s NextAnother team will clinch a spot to play in March Madness with East Tennessee State and Wofford playing for the Southern Conference Championship tonight."}, {"url": "https://www.firehouse.com/safety-health/news/21077682/fl-senate-passes-firefighters-cancer-coverage-bill", "title": "FL Senate Passes Firefighters Cancer Coverage Bill", "authors": ["Elizabeth Koh"], "date": "2019-04-24", "keywords": ["cancer", "firefighters", "state", "single", "senate", "passes", "local", "oliva", "fl", "house", "florida", "bill", "coverage"], "summary": "TALLAHASSEE, FL—The Florida Senate voted unanimously Tuesday to entitle firefighters to cancer coverage as part of doing their jobs, moving Florida closer to joining about 40 other states in making the disease an occupational hazard for those first responders.\nThe Florida House also heard the bill late Tuesday, and it is expected to pass with the backing of House Speaker José Oliva, R-Miami Lakes.\nUnder the bill, firefighters would qualify after meeting requirements including not smoking in the last five years.\nThe bill was fast-tracked through a single House committee last week, where it passed unanimously.\nOn the Senate floor Tuesday, Flores noted that the bill was for not just survivors of firefighters but those who might consider the profession in the future."}, {"url": "https://trekmovie.com/2019/05/05/nichelle-nichols-announces-farewell-tour-convention-and-documentary/", "title": "Nichelle Nichols Announces Farewell Tour, Convention And Documentary", "authors": ["Khan'S Chihuahua", "Luke Montgomery", "Michael Hall", "Marc Henson", "St Exp", "Lt. Bailey", "Jonathan Martin-Ives", "Ralph Miranda", "Pat Avila"], "date": "2019-05-05", "keywords": ["trek", "sizzle", "announces", "tour", "star", "documentary", "farewell", "tos", "nichelle", "convention", "reel", "nichols"], "summary": "At the age of 86 Star Trek actress Nichelle Nichols has decided it is time to retire and is lining up her farewell tour of public appearances that will culminate in a special farewell event next May.\nNichelle Nichols Farewell Tour And ConventionThe original Uhura, Nichelle Nichols, has announced she will be making her final public appearances over the next 12 months, with her last being a special “Hailing Frequencies Open…One Last Time!” convention on the first weekend of May 2020.\nFor more details on Nichelle’s Farewell Convention, visit the official site at uhura.space.\nNichols documentary seeking crowdfundingNichelle Nichols has partnered up with the team behind Renegades who are seeking to produce a documentary about her life titled Breaking Barriers.\nPledges of $120 and more also include tickets to the Nichelle Nichols Farewell Convention."}, {"url": "https://unafraidshow.com/pressure-is-on-for-the-ncaa-nil-working-group/", "title": "Pressure is on for the NCAA Name ,Image, Likeness (NIL) Working Group", "authors": ["Kassandra Ramsey"], "date": "2019-10-29", "keywords": ["athletes", "likeness", "profit", "group", "state", "legislation", "act", "college", "ncaa", "allow", "pressure", "working", "nil", "image"], "summary": "Starting in 2023, college athletes in California will be able to profit from their name, image, and likeness (NIL).\nTwo lawmakers in Florida proposed bills seeking to give college athletes including NCAA players the ability to profit from their name, image, and likeness (NIL).\nTherefore, Florida could become the next state to allow college athletes to profit from their NIL.\nThe NCAA could amend its rules to allow college athletes to profit from their NIL.\nWhat would happen if the NCAA did just that and allowed college athletes to profit from their NIL?"}, {"url": "https://yellowjackedup.com/2019/08/28/georgia-tech-football-myles-sims-wins-appeal-eligible-clemson/", "title": "Georgia Tech Football: Myles Sims wins appeal, eligible against Clemson", "authors": ["Dylan Callaghan-Croley", "Paul Kasabian"], "date": "2019-08-28", "keywords": ["season", "myles", "tech", "clemson", "play", "jackets", "received", "appeal", "yellow", "eligible", "wins", "football", "georgia", "sims"], "summary": "ATLANTA, GA - OCTOBER 4: A general view of Bobby Dodd Stadium during the game between the Georgia Tech Yellow and the Miami Hurricanes on October 4, 2014 in Atlanta, Georgia.\n(Photo by Scott Cunningham/Getty Images)The Georgia Tech football program received good news about one of their transfers on Wednesday when Michigan transfer Myles Sims was ruled eligible to play in 2019.\nGeorgia Tech cornerback Myles Sims will be eligible to play in 2019 starting on Thursday night against the Clemson Tigers.\nWhile Sims wasn’t on the Jackets original “Above the Line” report that was published on Sunday, it would be shocking if Sims didn’t see the field against Clemson.\nSims and the Yellow Jackets will kick off their 2019 season on Thursday night against the defending national champions, the Clemson Tigers."}, {"url": "https://www.cheatsheet.com/entertainment/who-will-be-joining-the-jonas-brothers-on-tour.html/", "title": "Who Will Be Joining The Jonas Brothers On Tour?", "authors": ["Bre Williams"], "date": "2019-05-01", "keywords": ["joining", "arenaaugust", "tour", "fans", "jonas", "brothers", "centerseptember", "going", "excited", "centeroctober", "band"], "summary": "The Jonas Brothers are officially going on tour!\nThe Jonas Brothers |Photo by Chris Haston/NBC/NBCU Photo Bank via Getty ImagesThe band has hinted in the last few months that they were considering touring again but never officially confirmed.\nShortly after The Jonas Brothers announced the tour, Bebe Rexha took to Twitter to share her excitement.\nNot only are The Jonas Brothers going on tour for the first time in 10 years, but they are also releasing their comeback album Happiness Begins on June 7.\nFans will be well prepared for the band’s upcoming tour and get to experience The Jonas Brothers live in person once again."}, {"url": "https://dawnofthedawg.com/2019/05/31/georgia-football-the-georgia-florida-game-needs-to-stay-in-jacksonville/", "title": "Georgia Football: The Georgia/Florida game needs to stay in Jacksonville", "authors": ["Savannah Leigh", "Lance Mccurley", "Jenna West"], "date": "2019-05-31", "keywords": ["stay", "know", "college", "game", "needs", "jacksonville", "traditions", "football", "georgiaflorida", "weekend", "georgia", "teams"], "summary": "One of the greatest Georgia football traditions is making the trip to Jacksonville every year for the Georgia/Florida game.\nGeorgia football has some of the best traditions in all of college football.\nOne of those incredible traditions is the annual Georgia/Florida game in Jacksonville.\nHow many other college football teams have an automatic prime time game on their schedule?\nThe Georgia/Florida game shouldn’t move out of Jacksonville; it should stay."}, {"url": "https://redshirtsalwaysdie.com/2019/05/07/nichelle-nichols-announces-farewell-tour-convention/", "title": "Nichelle Nichols announces farewell tour and convention", "authors": ["D. Goodman", "Andrew Depledge", "David Milburn"], "date": "2019-05-07", "keywords": ["trek", "nicholes", "announces", "tour", "appearances", "york", "star", "farewell", "convention", "nichelle", "nichols", "uhura"], "summary": "by Andrew DepledgeNichelle Nichols has announced that this will be her last year doing Star Trek appearances and is embarking on a farewell tour.\nFor almost as long as there have been Star Trek conventions, Nichelle Nichols has been a part of them.\nIf you want to meet the iconic Uhura before it’s too late, these are the shows Nicholes will be attending during her farewell tour.\nCombine that with the announcement of her farewell tour and you have plenty of ways to say “Thanks” for over five decades of bringing diversity to science-fiction before that was even a popular opinion.\nMore information about her farewell tour and the Nichelle Nicholes Farewell Convention can be found at Uhura.com."}, {"url": "http://www.wruf.com/headlines/2019/01/10/florida-lands-talented-linebacker-jon-greenard/", "title": "Florida lands talented linebacker Jon Greenard", "authors": [], "date": "2019-01-10", "keywords": ["gators", "linebacker", "loss", "twitter", "jon", "talented", "lands", "totaled", "greenard", "florida", "season", "tackles", "polite", "team"], "summary": "The Florida Gators have added Jon Greenard, a graduate transfer who is expected to strengthen the talent on the defense.\nhttps://twitter.com/jongreenard7/status/1083136468363763713Jon GreenardThe 6-foot-4, 263-pound linebacker did not play in the 2018 season due to a ligament injury in the wrist.\nIn 2017, Greenard led the team with 15.5 tackles for loss.\nCombined with high energy, it seems that he’ll add some needed depth to a Gators team that needs to fill in some spots on defense this offseason.\nGreenard is expected to make immediate contributions to the team and is enrolling at Florida this week."}, {"url": "https://www.thedailygopher.com/2019/10/22/20926278/minnesota-volleyball-conference-catch-up", "title": "Minnesota Volleyball Conference Catch Up", "authors": ["Oct"], "date": "2019-10-22", "keywords": ["w", "conference", "catch", "vs", "gophers", "state", "minnesota", "set", "l", "volleyball", "illinois", "lead", "iowa"], "summary": "Just as they did in the second set Minnesota had to fight off an Illinois come back to get the win.\nLooking to avoid a fifth set Minnesota got a kill from Rollins and block from Pittman and Hart.\nForced to play an extra set Minnesota dominated the fourth.\nIn the opening set Minnesota hit .385 but it was no match for Iowa’s error-less effort.\nIowa lead early in the third set but Minnesota was able to execute defensively and force some Hawkeye hitting errors."}, {"url": "http://balleralert.com/profiles/blogs/florida-paramedics-can-now-carry-firearms-for-high-risk-situations/", "title": "Florida Paramedics Can Now Carry Firearms For High-Risk Situations", "authors": [], "date": "2019-06-11", "keywords": ["states", "highrisk", "carry", "florida", "paramedics", "armed", "safety", "situations", "law", "firearms"], "summary": "Florida has passed a law that will allow paramedics to carry firearms in high-risk situations.\nFlorida will now allow paramedics to be armed when responding to shootings, drug raids, and other high-risk situations.\nIt states paramedics won’t have to retreat and are justified in using force to defend themselves or others.\nOther instances where paramedics can use firearms is in the event of hostage situations or when confronting an armed suicidal person.\nThose who choose to carry a gun will have to complete an annual firearm safety and tactical training, according to medical professionals."}, {"url": "https://flaglerlive.com/122699/2018-valuations/", "title": "Flagler Property Values Rise 7.5%, Best Since Recession, But Government Revenue Faces Shock", "authors": ["Jim B", "Gary R", "Quido Poncini", "Michael Van Buren", "Maria Darcy", "Name", "Required"], "date": "2018-06-01", "keywords": ["flagler", "75", "governments", "gardner", "best", "shock", "million", "market", "rise", "county", "faces", "values", "tax", "increase", "recession", "revenue", "property"], "summary": "It’s good news: values countywide are up 7.45 percent, the best year-over-year increase since the Great Recession.\nIf the added exemption becomes law, it will have serious consequences for all local government budgets except schools (the exemption doesn’t apply to school tax values).\nIn Flagler County, County Administrator Craig Coffey is estimating a revenue reduction of $3.8 million.\nThe new tax law would become effective in October 2019, making this year’s new revenue potentially illusory–absent a tax increase.\nThe housing market, Gardner said, is showing a lower supply of homes, keeping builders and realtors busy."}, {"url": "https://stormininnorman.com/2020/01/27/oklahoma-football-look-whos-coming-back-as-a-coach/", "title": "Oklahoma football: Look who’s coming back as a coach", "authors": ["Chip Rouse", "Rob Goldberg", "Christopher Dukes"], "date": "2020-01-27", "keywords": ["coach", "oklahoma", "running", "yards", "seasons", "career", "whos", "murray", "nfl", "football", "coming", "look", "rushing", "coaching"], "summary": "(Photo by Ronald Martinez/Getty Images)Former Oklahoma football star DeMarco Murray is headed back to Norman to coach the Sooner running backs, according to reports by several media sources, including The (Oklahoma City) Oklahoman and 247Sports.\nMurray is currently coaching the running backs at Arizona under head coach Kevin Sumlin.\nHe ranks seventh on the Oklahoma career rushing list, having compiled 3,685 rushing yards and 50 rushing touchdowns in four seasons playing for the Sooners (2006-10).\nIn 2014, his final season as a member of the Cowboys, Murray was the NFL rushing champion, with 1,845 rushing yards, and NFL Offensive Player of the Year.\nFormer Sooner quarterback Cale Gundy has been a member of the OU coaching staff since 1999, Bob Stoops’ first season as head coach."}, {"url": "https://www.wtvq.com/2018/05/08/woodford-co-woman-loses-money-bogus-loan-company/", "title": "Woodford Co. woman loses money to bogus loan company", "authors": [], "date": "2018-05-08", "keywords": ["loans", "loses", "money", "fees", "bogus", "loan", "credit", "woman", "florida", "woodford", "quick", "bbb", "company"], "summary": "LEXINGTON, Ky. (WTVQ)- A Versailles woman loses over a thousand dollars to a bogus loan company.\nOfficials at BBB say a company called Money Loans Quick with a Miami, Florida address, contacted her and approved the couple for a $3,000 loan.\nThe “loan” company asked the woman for various fees in advance for “bad credit insurance,” “processing fees,” etc.\nThe company required the money to be paid via Google Play cards.\n“This lady was never going to see a dime of that loan,” said Heather Clary, BBB Director of Communications."}, {"url": "https://houston.sportsmap.com/top-10-trades-for-jadeveon-clowney", "title": "5 teams that could trade for Jadeveon Clowney", "authors": ["Jayson Braddock", "Joshua Jordan", "Sportsmap Staff"], "date": "2019-06-24", "keywords": ["positions", "jadeveon", "prospects", "texans", "need", "trade", "houston", "clowney", "teams"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://www.floridaphoenix.com/2018/08/03/yes-this-really-is-rick-scott-adam-putnam-and-pam-bondis-fault/", "title": "Yes, this really is Rick Scott, Adam Putnam and Pam Bondi’s fault", "authors": ["Julie Hauserman Has Been Writing About Florida For More Than Years. She Is A Former Capitol Bureau Reporter For The St. Petersburg", "Tampa Bay", "Times", "Reported For The Stuart News", "The Tallahassee Democrat. She Was A National Commentator For National Public Radio S Weekend Edition Sunday", "The Splendid Table . She Has Won Many Awards", "Including Two Nominations For The Pulitzer Prize. Her Work Is Featured In Several Florida Anthologies", "Including The Wild Heart Of Florida", "The Book Of The Everglades", "Between Two Rivers . Her New Book Is Drawn To The Deep"], "date": "2018-08-03", "keywords": ["rick", "really", "regulations", "scott", "bondis", "state", "putnam", "runoff", "manure", "adam", "fault", "fertilizer", "florida", "sewage", "yes", "pam", "pollution", "limits"], "summary": "Rick Scott, Agriculture Commissioner Adam Putnam, and Attorney General Pam Bondi – fought bitterly against stricter limits for the very pollution now sliming South Florida.\nThe EPA’s proposed pollution limits were lame, but at least they were a start.\nIn fact, Florida was to be the first state in America to set limits for sewage, manure, and fertilizer runoff.\nIn regulatory circles, they prefer to call sewage, manure and fertilizer “nutrients” – it sounds like it’s actually good for you.\nScott got his Department of Environmental Protection to convince the EPA that Florida should set its own regulations for sewage, manure and fertilizer."}, {"url": "https://craigmedred.news/2018/03/19/florida-fresh/", "title": "Tasty salmon, Florida fresh", "authors": [], "date": "2018-03-19", "keywords": ["fresh", "growing", "market", "wild", "salmon", "fish", "farmed", "florida", "sapphire", "atlantic", "tasty", "water", "alaska"], "summary": "More potentially bad news for the Alaska commercial salmon fishing industry was Monday emanating from, of all places, South Florida.\n“Atlantic Sapphire salmon will never have contact with sea lice or be exposed to wild fish diseases.\nIn October, it announced the operation is now making a “modest profit,” and the company is “in discussions with potential investors for its land-based Atlantic salmon farm on northern Vancouver Island.”“The land-based Atlantic salmon industry is accelerating globally,” Eric Hobson, the chairman of Kuterra said in that statement.\nWashington state had five but has voted to phase them out after a net failure loosed a bunch of Atlantic salmon in Puget Sound.\nIt takes under a pound and a half to grow a pound of Atlantic salmon."}, {"url": "https://section215.com/2019/01/22/philadelphia-phillies-significance-roy-halladays-hof/", "title": "Philadelphia Phillies: Significance of Roy Halladay’s Hall of Fame selection", "authors": ["Dan Parzych", "Cbs Denver"], "date": "2019-01-22", "keywords": ["way", "philadelphia", "hall", "fame", "significance", "halladay", "game", "selection", "2010", "blue", "roy", "phillies", "baseball", "halladays", "jays"], "summary": "PHILADELPHIA - OCTOBER 06: Roy Halladay #34 and Carlos Ruiz #51 of the Philadelphia Phillies celebrate Halladay's no-hitter and the win in Game 1 of the NLDS against the Cincinnati Reds at Citizens Bank Park on October 6, 2010 in Philadelphia, Pennsylvania.\n(Photo by Chris Trotman/Getty Images)Major league baseball announced the 2019 Hall of Fame class on Tuesday, and former Philadelphia Phillies ace Roy Halladay will be heading to Cooperstown.\nIncluded in that class was former Philadelphia Phillies ace, Roy Halladay.\nHe continued to dominate towards the end of the decade, but the Blue Jays began to fall off and enter a rebuild.\nHe will understandably sport a Blue Jays cap on his plaque, but no one will ever forget his Phillies tenure."}, {"url": "https://campussports.net/2020/02/14/top-10-trade-contracts-in-mlb-history/", "title": "Top 10 Trade Contracts in MLB History", "authors": ["Cailyn Szelinski", "Please Enter Your Name Here"], "date": "2020-02-14", "keywords": ["season", "reached", "series", "million", "harper", "yankees", "mlb", "contract", "trade", "history", "contracts", "world", "stanton", "price"], "summary": "These are the top 10 contracts in MLB history that put players on the move:1.\nTo us, he'll always be a World Series champ.\nHowever, Price did well in Boston and helped the Red Sox win a World Series in 2018.\nAfter several contract extensions with the Brewers and a World Series run Fielder reached free agency.\nThe Detriot Tigers offered Fielder a $214 million contract for nine years."}, {"url": "https://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2018/12/23/ut-vols-1998-tennessee-football-national-championship-florida-state-fiesta-bowl/2301386002/", "title": "How the 1998 UT Vols beat Florida State in the Fiesta Bowl to cap the program's most storied season", "authors": ["Blake Toppmeyer", "Published P.M. Et Dec."], "date": "2018-12-23", "keywords": ["storied", "state", "fsus", "seminoles", "fiesta", "programs", "bowl", "game", "championship", "florida", "tennessee", "season", "cap", "ut", "play", "vols"], "summary": "1 in the Bowl Championship Series rankings and needed to beat Mississippi State in the SEC Championship to remain undefeated.\n2, followed by Kansas State and Florida State.\nBut who would Florida State play?\nDwayne Goodrich (23) runs back an interception for UT's second touchdown in the Fiesta Bowl against Florida State on Jan. 4, 1999.\nThe scoreboard shows the Vols' victory over Florida State in the Fiesta Bowl on Jan. 4, 1999."}, {"url": "https://campussports.net/2018/10/24/watch-scooter-road-rage-video-miami-beach/", "title": "WATCH: Scooter Driver Tries To Run Over Man In Road Rage Incident", "authors": ["Josh Sanchez", "Please Enter Your Name Here"], "date": "2018-10-24", "keywords": ["scene", "watch", "scooter", "run", "video", "vehicle", "wild", "incident", "driver", "tries", "road", "man", "rage"], "summary": "A wild scene was captured on video involving a man on a scooter and another driver who was parked directly in front of him in a neon green vehicle.\nThe scooter driver had a passenger on the back of his ride, but that did not stop him from accelerating and attempting to run the other man over.\nCheck out the wild moment below:A bizarre scene was captured in Miami Beach, Florida, when a scooter driver got involved in a road rage incident.\nAfter getting into an argument with another motorist, the seemingly enraged man attempted to run him over with his bike.\nYou can check out road rage statistics from the NHTSA and the Auto Vantage auto club below."}, {"url": "https://www.sportsvideo.org/2018/10/10/147726/", "title": "Ratings Roundup: 2018 MLB Postseason Sees Low Numbers in NLDS; NFL Ratings Continue to Rise", "authors": ["Kristian Hernandez", "Associate Editor"], "date": "2018-10-10", "keywords": ["espn", "fox", "2018", "ratings", "viewers", "sees", "million", "rise", "postseason", "numbers", "nfl", "low", "season", "rating", "game", "network", "mlb", "roundup", "nlds"], "summary": "Ratings Roundup: 2018 MLB Postseason Sees Low Numbers in NLDS; NFL Ratings Continue to RiseStory HighlightsRatings roundup is a rundown of rating news from the past week and is derived from press releases and reports around the industry.\n2018 MLB Postseason At This MomentThe MLB Postseason is underway with the completion of both Wildcard games and Division Series.\nThe telecast peaked with an average of 8.5 million viewers from 11:15-11:30 p.m.\nFor the second straight week, the MNF audience has had a year-over-year increase from 2017 (10.4 million viewers, Vikings-Bears in week 5).\nRegional Sports Networks and ESPN Wrap Up 2018 MLB CoverageThe St. Louis Cardinals’ local television ratings on Fox Sports Midwest ranked No."}, {"url": "https://www.bet.com/music/2018/07/01/xxxtentacion-grave.html", "title": "Heartbreaking: See XXXTentacion's Final Resting Place", "authors": ["Renee Samuel", "Written Renee Samuel"], "date": "2018-07-01", "keywords": ["resting", "broward", "shot", "scared", "place", "south", "transferred", "final", "sheriffs", "heartbreaking", "williams", "xxxtentacion", "xxxtentacions", "flordia", "xxxtentacionon"], "summary": "XXXTentacion fans are still mourning the death of the 20-year-old rapper.\nOn June 18, XXXTentacion, whose real name was Jahseh Dwane Onfroy, was fatally shot while leaving a motorcycle dealer in South Flordia.\nHe was officially pronounced dead by the Broward County Sheriff’s Department after he was transferred to Broward Health North hospital.\nDedrick Williams has been charged with the murder of XXXTentacion.\nOn Thursday, June 26, XXXTentacion was laid to rest at a private funeral in Flordia."}, {"url": "https://www.shropshirestar.com/entertainment/weekend/2013/08/16/paul-michael-glaser-fame-its-not-been-easy-for-me/", "title": "Paul Michael Glaser: Fame – it's not been easy for me", "authors": [], "date": "2013-08-16", "keywords": ["glaser", "easy", "know", "series", "hutch", "fame", "celebrity", "lot", "life", "paul", "hes", "work", "michael", "film"], "summary": "When I ask him if he's proud, he's quick to find a different word, a more appropriate word, a word that reflects his critical sensibilities.\nGlaser is honoured by the timeless appeal of ABC's great seventies cop series.\nThe series opened up the door to a life of fame and reasonable fortune.\nHe wished people realised there's more to Paul Michael Glaser than Starsky.\nHe's one of the better characters in musicals, he's an iconic character, he's just a marvellously complex everyman."}, {"url": "https://www.dailymail.co.uk/news/article-2189720/It-s-shuttle-Endeavour-Atlantis-nose-nose-extremely-expensive-game-chicken.html", "title": "It¿s a shuttle show down as Endeavour and Atlantis go nose to nose in an extremely expensive game of chicken", "authors": ["Daily Mail Reporter"], "date": "2012-08-17", "keywords": ["shuttles", "shuttle", "chicken", "atlantis", "orbiter", "center", "game", "expensive", "visitor", "extremely", "nose", "kennedy", "space", "endeavour"], "summary": "But even though the OV-095 is an exact replica of the Space Shuttle Atlantis, it has never actually flown.\nThe Nasa engineers say it has played as vital a role in exploring space as Atlantis but, like the Space Shuttle itself, it now faces retirement too.\nIn the 30-year duration of the space shuttle program, having two shuttles on the launchpads at once happened just 17 times.\nThe first time two space shuttles were ever on the launchpads at the same time was in 1985.\nAtlantis (OV-104) was delivered to Kennedy Space Center in April 1985."}, {"url": "https://campussports.net/2017/10/19/katie-nolan-craps-on-the-new-york-yankees-to-start-her-espn-career/", "title": "Katie Nolan Craps On The New York Yankees To Start Her ESPN Career", "authors": ["Michael Napoles", "Please Enter Your Name Here"], "date": "2017-10-19", "keywords": ["nolan", "craps", "taking", "start", "career", "win", "yankees", "york", "espn", "wellnolan", "katie", "rallying", "view", "evil"], "summary": "VIEW GALLERYDan Le Batard made a career taking unpopular opinions and defending them; first in the Miami-Herald, then on 790 The Ticket radio in Miami, and now on ESPN.\nBy the looks of it, Katie Nolan is going to fit in well.\nNolan, a Boston native, took the opportunity to eschew the notion that the New York Yankees are “likeable.” She chalks it up to the fact that they aren’t as evil as they have been in the past.\nThe Bronx Bombers fell behind by two games in each series before rallying to win three straight.\nExcept Katie Nolan, of course."}, {"url": "https://www.stampedeblue.com/2010/6/1/1491643/know-your-colts-history-former", "title": "Know Your Colts History: Former Colts quarterback and radio announcer Mark Herrmann elected to College Football Hall of Fame", "authors": ["Brad Wells", "Jun"], "date": "2010-06-01", "keywords": ["season", "mark", "radio", "fans", "know", "1992", "football", "herrmann", "hall", "fame", "george", "game", "player", "quarterback", "history", "colts", "team"], "summary": "Yep, back in the early 1990s, it was fun times for Colts fans.\nIn that '84 season, Herrmann started two games, completing 51.8% of his passes, throwing 1 TD and 6 INTs.\nAfter the game, Colts fans were flying high.\nUnlike Trudeau and George, Herrmann had played well in an opener and had delivered in the clutch.\nHis ten-year gameday radio job was given to former lineman (and 1992 Colts free agent acquisition) Will Wolford."}, {"url": "https://campussports.net/2016/09/25/video-espns-eduardo-perez-remembers-jose-fernandez/", "title": "Video: ESPN’s Eduardo Perez remembers Jose Fernandez", "authors": ["Caleb Bailey", "Please Enter Your Name Here"], "date": "2016-09-25", "keywords": ["marlins", "yearhttpsyoutubep7tgpp_2sqcperez", "way", "eduardo", "perez", "video", "age", "fernandez", "jose", "world", "young", "baseball", "espns", "remembers"], "summary": "Sunday morning, Miami Marlins star pitcher Jose Fernandez was tragically killed in a boating accident at age 24.\nThe news rocked the sports world and many have begun sharing their emotional tributesESPN baseball analyst Eduardo Perez was one who discussed Fernandez and his tragic passing on-air after the news broke.\nhttps://youtu.be/p7tgPP_2sQcPerez also had a close relationship with Fernandez as he was the Marlins’ hitting coach for two seasons while Fernandez was with the team.\nJose Fernandez had a huge impact on the Latino community after he attempted multiple times to defect from Cuba, which landed him in prison for a year at a young age.\nRest in peace, Jose Fernandez."}, {"url": "https://www.stateoftheu.com/2020/1/27/21083993/miami-hurricanes-football-manny-diaz-goals-deriq-king-culture-acc-coastal-fsu-rivalry-brevin-jordan", "title": "My 3 Biggest Goals For The Miami Hurricanes In 2020", "authors": ["Jan"], "date": "2020-01-27", "keywords": ["season", "biggest", "goals", "canes", "2020", "hurricanes", "win", "coming", "football", "acc", "coastal", "miami"], "summary": "We’re only a month into the offseason for the Miami Hurricanes, and currently sit at 222 days away from their 2020 opener against Temple, but it’s never too early to start setting goals for the upcoming season.\nWin the ACC CoastalIf the Hurricanes want to get back on track and become a force in college football once again, they must start winning the ACC Coastal.\nMiami officially eliminated from ACC Coastal.\nWith players like King, Brevin Jordan, Gregory Rousseau and several other playmakers, there’s no reason why Miami can’t win the division.\nThe Miami Hurricanes Football team should take culture lessons from the @MiamiHEATWhen the Heat organization talks about culture, it actually means something."}, {"url": "https://www.cordcuttersnews.com/here-is-every-market-court-tv-is-relaunching-in-as-a-free-ota-tv-network-on-may-8th-2019/", "title": "Here is Every Market Court TV Is Relaunching In As a Free OTA TV Network on May 8th 2019", "authors": ["Luke Bouma"], "date": "2019-04-27", "keywords": ["ota", "tx", "free", "court", "market", "acentek", "relaunching", "2019", "network", "fl", "wi", "rapids", "ca", "coming", "tba", "8th", "tv"], "summary": "Back in December, it was announced that Katz Networks was relaunching the crime network Court TV.\nNow we have an exact launch date of May 8th 2019 for Court TV’s return as a free over the air TV network.\n“Court TV was a top-20 cable network and at the height of its popularity when the network was taken off the air in 2008,” said Jonathan Katz, CEO of Katz Networks.\nNevada:LAS VEGAS, NV KTNV 13.4 Coming May 2019 RENO, NV KREN 26.5 Coming May 2019New Hampshire:No OTA Affiliates.\nTennessee:NASHVILLE, TN WSMV 4.4 Coming May 2019 NASHVILLE, TN CDE LIGHTBAND TBA Coming May 2019 KNOXVILLE, TN WKNX 7.3 Coming May 2019 JACKSON, TN WYJJ 27.1 Coming May 2019Texas:HOUSTON, TX KEHO 32.2 Coming May 2019 SAN ANTONIO, TX KWEX 41.4 Coming May 2019 HARLINGEN, TX KNVO 49.5 Coming May 2019 EL PASO, TX KINT 25.5 Coming May 2019 WACO, TX KXXV 25.4 Coming May 2019 TYLER, TX KPKN 33.3 Coming May 2019 AMARILLO, TX KAUO 15.3 Coming May 2019 ODESSA, TX KUPB 18.5 Coming May 2019 LUBBOCK, TX KLBK 13.2 Coming May 2019 LAREDO, TX KLDO 19.5 Coming May 2019 DALLAS, TX KDAF 33.3 Coming November 2019 DALLAS, TX SPECTRUM (CHARTER) 1257 Coming November 2019 HOUSTON, TX KIAH 39.5 Coming November 2019Utah:SALT LAKE CITY, UT KUCW 30.4 Coming May 2019Vermont:No OTA Affiliates."}, {"url": "https://www.si.com/college/2019/11/04/lane-kiffin-interested-in-florida-state-coach-job", "title": "Lane Kiffin interested in Florida State coaching job", "authors": ["Jenna West"], "date": "2019-11-04", "keywords": ["loss", "state", "job", "seminoles", "interested", "went", "taggart", "florida", "kiffin", "season", "head", "lane", "coaching"], "summary": "Florida Atlantic coach Lane Kiffin has expressed his interested in Flordia State's vacant coaching job, according to CBS Sports' Dennis Dodd.\nFlorida State fired coach Willie Taggart on Sunday following the Seminoles' 27–10 loss to rival Miami.\nAfter missing a bowl game last year for the first time since 1981, Florida State is on the cusp of missing postseason play for the second straight season.\nHe began his college football head coaching career at Tennessee in 2009 before leaving the Vols after one season to join USC.\nKiffin went on to work with Nick Saban as Alabama's offensive coordinator before resuming his head coaching career with FAU."}, {"url": "https://www.usatoday.com/in-depth/news/investigations/2019/10/30/security-contractor-g-4-s-plagued-years-international-scandal/4060171002/", "title": "The Pulse nightclub shooting and other G4S scandals", "authors": ["Brett Murphy", "Nick Penzenstadler", "Usa Today", "Gina Barton", "Milwaukee Journal Sentinel"], "date": "2019-10-30", "keywords": ["security", "lost", "shooting", "british", "pulse", "nightclub", "million", "scandals", "facility", "nuclear", "detention", "g4s", "guards", "company"], "summary": "G4S said it was “deeply shocked” by the Pulse shooting but has defended its hiring practices.\nUK prison death prompts outrageIn 2004, Gareth Myatt, 15, died of “positional asphyxia” at the United Kingdom's Rainsbrook Secure Training Centre, a youth detention facility G4S operated until 2016.\nRainsbrook was also cited for “inadequate” care in a government report in 2015 and G4S lost the next contract.\nThree G4S guards were involved in another in-custody death in 2010, when an Angolan man at Heathrow Airport died while being restrained.\nIn December of that year, South African government officials took over the maximum security facility after G4S “lost effective control,” the government told the BBC."}, {"url": "https://www.ncaa.com/news/football/article/2019-12-21/appalachian-state-vs-uab-new-orleans-bowl-prediction-time-tv", "title": "Appalachian State vs. UAB: New Orleans Bowl prediction, time, TV channel, preview", "authors": [], "date": "2019-12-21", "keywords": ["season", "conference", "vs", "state", "orleans", "uab", "bowl", "appalachian", "game", "app", "channel", "preview", "tv", "mountaineers", "prediction", "team"], "summary": "Appalachian State and UAB will descend on the Big Easy on Dec. 21 to take part in the New Orleans Bowl.\nNew Orleans Bowl: Time & How to watchThe New Orleans Bowl kicks off at 9 p.m.\nNew Orleans Bowl: Prediction, PreviewThe New Orleans Bowl is familiar territory for Appalachian State.\nExpect App State to roll and continue to bolster their pitch to make a New Year's Six bowl next year.\nThe Pick App State 48,UAB 20Appalachian State vs. UAB: Stats, how they compare"}, {"url": "https://www.politico.com/newsletters/florida-playbook/2019/08/02/coming-to-certain-florida-towns-an-immigration-listening-tour-woman-who-threw-drink-at-gaetz-pleads-guilty-up-up-and-away-for-gov-desantis-an-epic-new-theme-park-464129", "title": "The GOP immigration listening tour — Woman who threw drink at Gaetz pleads guilty — Up, up and away for Gov. DeSantis — An epic new theme park", "authors": ["Follow Us On Twitter"], "date": "2019-08-02", "keywords": ["gov", "heralds", "state", "tour", "senate", "sentinels", "theme", "miami", "immigration", "listening", "woman", "florida", "desantis", "federal", "park", "guilty", "pleads", "threw"], "summary": "The GOP immigration listening tour — Woman who threw drink at Gaetz pleads guilty — Up, up and away for Gov.\nGruters is already promising to sponsor a bill during next year’s session that would force businesses to use a federal immigration database to check the status of their employees.\nDeSantis names woman in charge of helping Florida adapt to climate change,” by Miami Herald’s Alex Harris: “Gov.\nCan the Miami-Dade County school district save them?” by Miami Herald's Colleen Wright: “Hormones.\nThat may change,\" by Miami Herald's Douglas Hanks— \"Woman arrested with 63 pounds of pot at Tallahassee airport."}, {"url": "https://www.thetelegraph.com/lifestyle/article/Is-it-OK-to-laugh-at-Florida-Man-14096275.php", "title": "Is it OK to laugh at Florida Man?", "authors": ["Logan Hill", "The Washington Post", "The Telegraph", "Sanford J. Schmidt", "Jill Moon"], "date": "2019-07-15", "keywords": ["pittman", "campion", "ok", "state", "hes", "viral", "internet", "hatfield", "florida", "men", "man", "laugh"], "summary": "Two of Reddit's 10 most popular Florida Man stories are actually exposés of police corruption, including \"Florida Man arrested for possession of laundry detergent - not heroin - among 11 freed after deputy allegedly faked drug tests.\"\nIn Orlando, Florida, there's been a Florida Man Music Festival and a \"Florida Man\" one-man play.\nIn Tampa, a tour guide leads Florida Man walking (and drinking) tours, and writer Tyler Gillespie has published an empathetic book of poems about Florida Man, including one inspired by his own DUI.\nIn late July, the team will host a Florida Man Night, featuring a jorts-clad Florida Man bobblehead, a performance by at least one actual Florida Man and the breaking of \"weird Florida laws.\"\n\"I would never call Michael Dunn a Florida Man, because Michael Dunn was a murderer, and to associate him with Florida Man minimizes what he did,\" says Phillips carefully."}, {"url": "https://realsport101.com/racing/need-for-speed-heat-palm-city-map-revealed/", "title": "Need for Speed Heat: Palm City Map REVEALED", "authors": ["Written By"], "date": "2019-11-02", "keywords": ["nfs", "heat", "revealed", "map", "city", "racing", "need", "florida", "massive", "hills", "park", "palm", "speed"], "summary": "Need for Speed Heat is released next week and we can’t wait to get our hands on Ghost Games’ latest racer.\nPalm City is a fictional metropolis that takes heavy inspiration from the real-life city of Miami, Flordia state’s largest city.\nPalm City could well one day join them in the top echelon, but here’s everything we know so far!\nFlorida isn’t famed for its hills, but Palm City isn’t lacking in sharp inclines.\nNeed for Speed Heat will be released on Playstation 4, Xbox One and Windows PC on 8th November."}, {"url": "https://www.wtsp.com/article/news/regional/florida/google-florida-man-followed-by-your-birthday-whats-your-story/67-1f9a2d84-e3be-410a-b6dc-9d883b688f8e", "title": "Google 'Florida man' followed by your birthday: What's your story?", "authors": ["Author", "Andrew Krietz", "Mark Bergin", "Published", "Pm Edt March", "Updated", "Am Edt March"], "date": "2019-03-21", "keywords": ["stolen", "birthday", "asking", "10news", "page", "post", "facebook", "claims", "florida", "google", "man", "followed", "whats"], "summary": "ST. PETERSBURG, Fla. — More than 21 million people call the Sunshine State home, but none are more infamous than Florida Man and Florida Woman.\nAppearing first to be popularized from a Tumblr post last week, people are asked to Google \"florida man,\" followed by your birthday.\nSeveral people from the 10News Facebook page responded to our post with their Florida man stories.\nCathy New Bostwick: \"Florida man claims people were eating his brains leads police on insane golf course chase....’ (seriously)\"Many others started sharing their reactions on Twitter.\nMore Florida man...and Florida woman storiesRelated: Minor league baseball team to host 'Florida Man Night'►Make it easy to keep up-to-date with more stories like this."}, {"url": "https://www.sun-sentinel.com/news/florida/fl-ne-florida-daylight-savings-time-20181030-story.html", "title": "Permanent daylight saving time for Florida awaits Congress", "authors": ["Dan Sweeney"], "date": "2018-10-30", "keywords": ["protection", "permanent", "daylight", "state", "tallahassee", "senate", "support", "tourism", "reasons", "sunshine", "presumed", "awaits", "saving", "florida", "positive", "congress"], "summary": "The increased evening daylight hours in the Sunshine State and the presumed positive effect on the tourism industry were the top reasons to support the bill when it was debated in Tallahassee, where the law was given the glowing moniker the Sunshine Protection Act and passed with overwhelming, bipartisan support — 33-2 in the Senate and 103-11 in the House."}, {"url": "https://www.turnology.com/features/sema-2019-a-carbon-copy-1972-datsun-240z-pikes-peak-racer/", "title": "SEMA 2019: A Carbon Copy 1972 Datsun 240Z Pikes Peak Racer", "authors": ["Brian Havins", "A Gearhead For Life", "Brian Is Obsessed With All Things Fast. Banging Gears", "Turning Wrenches", "Praying While Spraying Are Just A Few Of His Favorite Things."], "date": "2019-11-13", "keywords": ["fuel", "datsun", "transmission", "racer", "parts", "race", "carbon", "custom", "peak", "pikes", "racing", "sema", "carbonfiber", "copy", "shawn", "2019", "car", "performance", "1972", "240z"], "summary": "But, a properly built car will not only draw attention, but it will also showcase the company’s parts.\nThis year was no different for the Holley crew, as they had some heavy hitters within the confines of their SEMA 2019 spot.\nJudy started off life as a stock ’72 240Z, when Shawn found the car in Miami.\nIt has always been a dream of Shawn’s to race Pikes Peak, and he decided this was his chance.\nTo make sure the transmission was perfect, Shawn called on Tick Performance to go through the T-56 gearbox."}, {"url": "https://www.nbcnews.com/news/us-news/police-respond-shooting-parkland-florida-high-school-n848101", "title": "17 killed in mass shooting at high school in Parkland, Florida", "authors": [], "date": "2018-02-15", "keywords": ["shooting", "stoneman", "mass", "high", "tend", "parkland", "school", "south", "17", "personnel", "florida", "wednesdayjohn", "victim", "killed", "sunsentinel", "medical"], "summary": "Medical personnel tend to a victim after a mass shooting at Marjory Stoneman Douglas High School on Wednesday.\nJohn McCall / South Florida Sun-Sentinel via"}, {"url": "https://www.cleveland.com/browns/2019/11/browns-vs-bills-preview-5-things-to-know-about-clevelands-next-opponent.html", "title": "Browns vs. Bills preview: 5 things to know about Cleveland’s next opponent", "authors": ["Ellis Williams", "Ewilliams Cleveland.Com", "Ellis L. Williams"], "date": "2019-11-04", "keywords": ["clevelands", "buffalo", "vs", "cleveland", "know", "mayfield", "opponent", "allen", "win", "game", "browns", "games", "preview", "things", "bills", "yards"], "summary": "Since then Buffalo carries the inverse of Cleveland’s record and looks playoff-bound and the Browns may have a top 10 pick.\nHere are five things you need to know about the Browns’ upcoming opponent.\nBills will be a playoff teamUnlike Cleveland, the Bills look headed for the playoffs.\nAgain, unlike the Browns, Buffalo won the games it should have, affording them more margin of error during the final eight games.\nIn Buffalo, Mayfield faces an opportunity to prove he’s more than those other underachieving throwers the Bills have already beat."}, {"url": "https://thespun.com/nfl/bryce-langston-2021s-no-3-de-announces-decommitment", "title": "Bryce Langston, 2021’s No. 3 DE, Announces Decommitment", "authors": ["Matt Hladik"], "date": "2019-05-10", "keywords": ["decommitment", "state", "signing", "fourstar", "2021s", "2021", "bryce", "end", "steele", "florida", "announces", "langston", "rankings", "class"], "summary": "Ocala (Fla.) Vanguard four-star defensive end Bryce Langston, one of the top prospects in the 2021 class, has reopened his recruitment as of this afternoon.\nLangston committed to Florida in early December, but has since also visited Florida State and picked up an offer from Auburn.\n“After the long days and nights of me thinking about the recruiting process, talking to my parents and coaches I will announce that will be de-committing from the University of Florida,” Langston wrote on Twitter.\nSteele was a top-50 recruit and the highest-rated member of the Gators’ 2019 signing class.\nFortunately, there’s plenty of time before the class of 2021 can begin signing, so perhaps Florida can reel Langston back in."}, {"url": "https://www.saturdaydownsouth.com/sec-football/10-questions-about-the-sec-east-in-2020/", "title": "10 questions I have about the SEC East in 2020", "authors": ["Neil Blackmon", "Neil Blackmon Covers Florida Football For Saturdaydownsouth.Com. An Attorney", "Two-Time Graduate Of The University Of Florida", "He Is A Member Of The Football Writers Association Of America. He Also Coaches Basketball. You Can Follow Him On Twitter"], "date": "2020-02-02", "keywords": ["2020", "sec", "football", "kentucky", "seasons", "questions", "game", "2019", "offensive", "season", "east", "georgia", "program"], "summary": "In the SEC East, the landscape, at least in the previous 3 seasons, has been dominated by Kirby Smart’s Georgia Bulldogs.\nA year after winning the crossover head-to-head against the SEC West for the first time in several seasons, the East broke even with the West in 2019.\nNothing builds hope and hype more than spring football and talking season, so with that in mind, here are 10 topics of conversation I have about the SEC East in 2020.\nThe last ride of Jarrett GuarantanoIf there is a stranger football player in the SEC, I haven’t seen him play.\nIf that changes this season, the SEC East champion will, too."}, {"url": "https://www.floridatoday.com/story/news/2018/11/02/florida-amendments-2018/1857180002/", "title": "Florida amendments 2018 explained: What passed, what failed", "authors": ["Rob Landers", "Isadora Rangel", "Published P.M. Et Nov."], "date": "2018-11-02", "keywords": ["todayamendment", "2018", "floridas", "passed", "explained", "state", "voters", "12", "constitution", "amendments", "tax", "florida", "amendment", "passedthis", "failed"], "summary": "Click here for Election Day 2018 resultsMore: A voter's guide to Florida's 12 amendments on the 2018 election ballotOur recommendations: How to vote on Florida's 12 amendments on 2018 ballotThese 12 videos videos highlight each amendment.\nFlorida TodayAmendment 5: PassedThis amendment would require a two-thirds vote in the Florida House and Senate — instead of a simple majority — to raise taxes.\nFlorida TodayAmendment 9: PassedThis is a Florida Constitution Revision Commission proposal that bundles two measures under the auspices of clean water and clean air.\nFlorida TodayAmendment 12: PassedIt expands ethics rules for public officials — both elected officials and government employees, including judges.\nFlorida TodayAmendment 13: PassedThe proposal ends commercial greyhound and other dog racing by 2020, but people in Florida would continue to wager on races occurring in other states."}, {"url": "https://www.itv.com/news/2020-02-14/harry-and-meghan-s-staff-lose-their-jobs-as-royal-couple-prepare-to-leave/", "title": "Harry and Meghan's staff lose their jobs as royal couple prepare to leave", "authors": ["Chris Ship", "Royal Editor"], "date": "2020-02-14", "keywords": ["members", "sussex", "meghan", "leave", "staff", "harry", "jobs", "meghans", "work", "royal", "duke", "household", "office", "lose", "couple", "prepare", "palace"], "summary": "Staff who work for the Duke and Duchess of Sussex are being made redundant as Buckingham Palace prepares to shut down their office.\nIt’s thought around 15 members of the Royal Household, who have been employed to work for Harry and Meghan, will have to leave their jobs in the Spring.\nIt’s the inevitable consequence of the Sussexes’ decision to step down as working members of the Royal Family and move to North America.\nBuckingham Palace had set up a separate household, at the couple’s request, when they split their office from Harry’s brother and sister-in-law William and Kate last year.\nHarry and Meghan hired an experienced communications chief, Sara Latham, who had previously worked for Hillary Clinton, to promote their work and deal with the media attention around them and their new son Archie."}, {"url": "https://realsport101.com/racing/nfs/need-for-speed-heat-story-characters-revealed-release-date-demo-cars-news-leaks/", "title": "Need for Speed Heat: Story and Characters REVEALED!", "authors": ["Written By"], "date": "2019-11-04", "keywords": ["nfs", "heat", "racers", "revealed", "street", "racing", "mercer", "city", "games", "need", "characters", "ghost", "palm", "speed"], "summary": "With Ghost Games’ epic new street racer almost out – details around the campaign have been revealed!\nNeed for Speed Heat is released next week and we can’t wait to get our hands on Ghost Games’ latest racer.\nThe original Need for Speed Most Wanted had arguably the best story in the 25 years of NFS, and that will be Ghost Games’ target for their latest creation.\nSPEED – NFS Heat is out on the 8th November!\nNeed for Speed Heat will be released on Playstation 4, Xbox One and Windows PC on 8th November."}, {"url": "https://withthefirstpick.com/2019/08/20/2020-nfl-draft-prospects-to-watch-in-hawaii-v-arizona/", "title": "2020 NFL Draft: Prospects to watch in Hawaii v. Arizona", "authors": ["Nicholas Perlich", "Dan Matney", "Christopher Simpson", "Nicholas Mcgee"], "date": "2019-08-20", "keywords": ["total", "mcdonald", "watch", "2020", "v", "prospects", "nfl", "slot", "draft", "touchdowns", "hawaii", "season", "arizona", "passing", "team", "warriors"], "summary": "Hawaii and Arizona will face off in one of the first games of the college football season.\nStarting at 7:30 p.m. PT on Saturday, the Arizona Wildcats will face off against Hawaii Rainbow Warriors.\nEach team has several draft prospects you’ll want to familiarize yourself with ahead of the match-up.\nLast season McDonald pounced on the scene, putting up back to back 400-yard games and 11 total touchdowns in his first two appearances as a starter.\nCole led the Mountain West in both total passing yards and passing touchdowns last season as a sophomore."}, {"url": "https://notredame.rivals.com/news/what-needs-to-happen-for-notre-dame-to-make-a-new-year-s-six-bowl-", "title": "What Needs To Happen For Notre Dame To Make A New Year's Six Bowl?", "authors": ["Andrew Mentock", "Staff Writer", "Article.Author_Name"], "date": "2019-11-29", "keywords": ["dame", "orange", "college", "bowl", "notre", "selection", "highestranked", "needs", "im", "happen", "team", "ranked"], "summary": "It doesn't help that this season the only New Year's Six games Notre Dame can play in are the Cotton Bowl and the Orange Bowl.\nThis means that it would be impossible for Notre Dame and Florida to meet in the Orange Bowl.\nCOTTON BOWLI’ve heard that Notre Dame needs to be ranked inside the top 10 to make the Cotton Bowl, but I’m not sure that’s true.\nEver since Notre Dame has been unable to move past No.\nFor Notre Dame to move into the top 12, chaos must ensue and even that doesn’t guarantee much progress."}, {"url": "https://www.orlandoweekly.com/Blogs/archives/2015/06/10/a-florida-man-was-arrested-for-assaulting-his-roommate-with-pizza", "title": "A Florida man was arrested for assaulting his roommate with pizza", "authors": ["Colin Wolf"], "date": "2015-06-10", "keywords": ["sauce", "fiejdasz", "wasnt", "worth", "slice", "shirtless", "plunkett", "assaulting", "arrested", "florida", "pizza", "roommate", "man", "violating"], "summary": "click to enlargeDaniel Allen Plunkett, Treasure Island resident and man with little to no respect for Italian American cuisine, was arrested for throwing a slice of pizza at his roommate.The incident occurred last Wednesday, June 3rd, when a shirtless Plunkett got into a pizza-related argument with his roommate, Brenda Fiejdasz, and hurled a slice in her direction.\nAccording to the, the slice was hot and landed on her left hand.\nAlso, some sauce got on her shoulder.Fortunately, Fiejdasz wasn't injured.Plunket claims Fiejdasz also threw pizza, but ultimately the 50-year-old pizza tosser was arrested for simple battery and violating his felony probation for driving under the influence.It is worth noting that the official complaint did mention that Plunket's shirtless body was covered in sauce."}, {"url": "https://www.ozarksfirst.com/local-news/local-news-local-news/cheer-team-hopes-to-win-national-competition-for-the-first-time/", "title": "Cheer team hopes to win national competition for the first time", "authors": ["Chris Six", "Madison Hever", "John Adams"], "date": "2019-11-26", "keywords": ["coach", "competition", "cheer", "quest", "bids", "varsity", "win", "hopes", "event", "rec", "world", "national", "team", "teams"], "summary": "Inside this gym, you will find cheer squads practicing on mats, trampolines, and other gymnastic equipment.\nThe team had their first cheer event earlier in November and got two bids to two different national championships says, Coach McCoy.\nAccording to the Varsity Cheerleading website, “The Quest Recreational Championship is the most competitive and prestigious end-of-season event for Rec & Youth Cheer.\nTeams will earn Paid Bids and At-Large Bids to The Quest during the season at several Varsity Spirit events.\nThe Quest competition is in March, and Coach McCoy and her team are asking for financial help from the community with GoFundMe pages, local events, and some raffles."}, {"url": "https://arktimes.com/arkansas-blog/2018/11/14/asu-to-get-400000-to-settle-lawsuit-with-miami-over-canceled-footbal-game", "title": "ASU to get $400,000 to settle lawsuit with Miami over canceled footbal game", "authors": ["Editor Of The Times Since It Became A Weekly In May"], "date": "2018-11-14", "keywords": ["settle", "lawsuit", "canceled", "university", "state", "jonesboro", "mediation", "game", "cancellation", "asu", "footbal", "lawsuits", "football", "400000", "arkansas", "miami"], "summary": "After mediation, Arkansas State University and the University of Miami have settled a legal dispute over cancellation of a 2017 football game in Jonesboro because of a hurricane threat.\nThe ASU release:We can't resist without our readers!\nArkansas State University and the University of Miami agreed Monday to dismiss their respective lawsuits related to the cancellation of a football game in Jonesboro on Sept. 9, 2017.\nUnder a settlement reached following court-ordered mediation, Miami will also pay Arkansas State $400,000.\n“I am pleased that both lawsuits have been resolved and that this matter is now behind us,” said Brad Phelps, general counsel for the Arkansas State University System."}, {"url": "https://www.wtvq.com/2018/05/08/woodford-co-woman-loses-money-bogus-loan-company/", "title": "Woodford Co. woman loses money to bogus loan company", "authors": [], "date": "2018-05-08", "keywords": ["loans", "loses", "money", "fees", "bogus", "loan", "credit", "woman", "florida", "woodford", "quick", "bbb", "company"], "summary": "LEXINGTON, Ky. (WTVQ)- A Versailles woman loses over a thousand dollars to a bogus loan company.\nOfficials at BBB say a company called Money Loans Quick with a Miami, Florida address, contacted her and approved the couple for a $3,000 loan.\nThe “loan” company asked the woman for various fees in advance for “bad credit insurance,” “processing fees,” etc.\nThe company required the money to be paid via Google Play cards.\n“This lady was never going to see a dime of that loan,” said Heather Clary, BBB Director of Communications."}, {"url": "https://theintercept.com/2019/02/13/neoliberalism-or-death-the-u-s-economic-war-against-venezuela/", "title": "The U.S. Economic War Against Venezuela", "authors": [], "date": "2019-02-13", "keywords": ["aid", "economic", "venezuelan", "know", "venezuela", "president", "mean", "sanctions", "maduro", "united", "war", "states"], "summary": "And we’re going to talk about the economic warfare unleashed against Venezuela and who is really being harmed by these U.S.-led economic sanctions.\nI mean, in Venezuela, we do have an economic crisis, you know, but a country having economic problems doesn’t mean it’s in the middle of a humanitarian crisis.\nBut at the end of the day, you know, Venezuela has an armed force and besides the armed force Venezuela has, Venezuela has its people and they’re very proud people.\nWhat the United States did and what the United States had been doing for 20 years is increasing the pressure, increasing the economic war and then applying sanctions.\nAdZ: Well, the United States is trying anything to bring him down and the United States has miscalculated often enough."}, {"url": "https://www.floridaphoenix.com/2018/08/03/yes-this-really-is-rick-scott-adam-putnam-and-pam-bondis-fault/", "title": "Yes, this really is Rick Scott, Adam Putnam and Pam Bondi’s fault", "authors": ["Julie Hauserman Has Been Writing About Florida For More Than Years. She Is A Former Capitol Bureau Reporter For The St. Petersburg", "Tampa Bay", "Times", "Reported For The Stuart News", "The Tallahassee Democrat. She Was A National Commentator For National Public Radio S Weekend Edition Sunday", "The Splendid Table . She Has Won Many Awards", "Including Two Nominations For The Pulitzer Prize. Her Work Is Featured In Several Florida Anthologies", "Including The Wild Heart Of Florida", "The Book Of The Everglades", "Between Two Rivers . Her New Book Is Drawn To The Deep"], "date": "2018-08-03", "keywords": ["rick", "really", "regulations", "scott", "bondis", "state", "putnam", "runoff", "manure", "adam", "fault", "fertilizer", "florida", "sewage", "yes", "pam", "pollution", "limits"], "summary": "Rick Scott, Agriculture Commissioner Adam Putnam, and Attorney General Pam Bondi – fought bitterly against stricter limits for the very pollution now sliming South Florida.\nThe EPA’s proposed pollution limits were lame, but at least they were a start.\nIn fact, Florida was to be the first state in America to set limits for sewage, manure, and fertilizer runoff.\nIn regulatory circles, they prefer to call sewage, manure and fertilizer “nutrients” – it sounds like it’s actually good for you.\nScott got his Department of Environmental Protection to convince the EPA that Florida should set its own regulations for sewage, manure and fertilizer."}, {"url": "https://www.dailymail.co.uk/news/article-6110587/Who-Andrew-Gillum-Floridas-African-American-nominee-governor-revealed.html", "title": "Who is Andrew Gillum? Florida's first African-American nominee for governor revealed", "authors": ["Caitlyn Hitt"], "date": "2018-08-29", "keywords": ["public", "nominee", "revealed", "africanamerican", "tallahassee", "governor", "gillum", "city", "crime", "andrew", "education", "florida", "floridas", "gun", "wants"], "summary": "Andrew Gillum pulled off a surprise victory in the gubernatorial primaries in Florida on Tuesday.\nWho is Andrew Gillum?\nLet's make history this November and make Andrew Gillum the next Governor of Florida.\nOn education, Gillum is a supporter of the public education system, which he believes is ‘the best path to equal opportunity’.\nAndrew Gillum FBI investigationIn June 2017, the FBI issued a subpoena to Andrew Gillum at city hall, according to the Tampa Bay Times."}, {"url": "https://houston.sportsmap.com/top-10-trades-for-jadeveon-clowney", "title": "5 teams that could trade for Jadeveon Clowney", "authors": ["Jayson Braddock", "Joshua Jordan", "Sportsmap Staff"], "date": "2019-06-24", "keywords": ["positions", "jadeveon", "prospects", "texans", "need", "trade", "houston", "clowney", "teams"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://www.jsonline.com/story/news/nation/2020/01/01/baghdad-embassy-attack-protesters-disperse-troops-fire-tear-gas/2789540001/", "title": "Protesters at US Embassy in Baghdad disperse as security personnel fire tear gas", "authors": ["Grace Hauck", "John Bacon", "Published A.M. Ct Jan."], "date": "2020-01-01", "keywords": ["iraqi", "security", "disperse", "airstrikes", "iranbacked", "forces", "trump", "gas", "military", "embassy", "personnel", "tear", "protesters", "killed", "militia", "baghdad"], "summary": "CLOSE A detachment of one hundred Marines are reinforcing the US Embassy in Baghdad after Iraqi protestors attempted to storm the compound.\n(Dec. 31) AP DomesticDemonstrators laying siege to the U.S. Embassy in Baghdad began to disperse as security personnel fired tear gas Wednesday in the second day of unrest after U.S. airstrikes killed at least two dozen Iran-backed fighters in Iraq.\nIraqi forces who guard the usually safe Green Zone where the embassy is located did little to stop the chaos.\nIran’s supreme leader, Ayatollah Ali Khamenei, criticized the U.S. airstrikes on the Iran-backed Iraqi militia on Sunday.\nThe Iranian-backed Iraqi militia vowed Monday to retaliate for the U.S. military strikes."}, {"url": "https://craigmedred.news/2018/03/19/florida-fresh/", "title": "Tasty salmon, Florida fresh", "authors": [], "date": "2018-03-19", "keywords": ["fresh", "growing", "market", "wild", "salmon", "fish", "farmed", "florida", "sapphire", "atlantic", "tasty", "water", "alaska"], "summary": "More potentially bad news for the Alaska commercial salmon fishing industry was Monday emanating from, of all places, South Florida.\n“Atlantic Sapphire salmon will never have contact with sea lice or be exposed to wild fish diseases.\nIn October, it announced the operation is now making a “modest profit,” and the company is “in discussions with potential investors for its land-based Atlantic salmon farm on northern Vancouver Island.”“The land-based Atlantic salmon industry is accelerating globally,” Eric Hobson, the chairman of Kuterra said in that statement.\nWashington state had five but has voted to phase them out after a net failure loosed a bunch of Atlantic salmon in Puget Sound.\nIt takes under a pound and a half to grow a pound of Atlantic salmon."}, {"url": "https://www.dailymail.co.uk/news/article-7234271/US-file-secret-evidence-against-Chinese-Mar-Lago-interloper.html", "title": "US can file secret evidence against Chinese Mar-a-Lago interloper", "authors": ["Emily Crane", "Emily Crane For Dailymail.Com", "Associated Press"], "date": "2019-07-10", "keywords": ["maralago", "interloper", "club", "chinese", "secret", "drive", "zhang", "evidence", "agents", "national", "service", "file", "told"], "summary": "A federal judge will let prosecutors file secret evidence in the trespassing case of a Chinese woman accused of sneaking into President Donald Trump's Mar-a-Lago club because it contains national security information.\nZhang, 33, is charged with illegally entering the president's Florida club in March and then lying to Secret Service agents when confronted.\nZhang, a Shanghai business consultant, allegedly told Secret Service agents she was a member.\nThey pointed to a receipt Zhang received from Charles Lee, a Chinese national who promotes such events at Mar-a-Lago, and a flyer she had promoting it.\n'I can work it out,' Zhang told the court."}, {"url": "https://www.sun-sentinel.com/local/broward/fl-ne-bso-swat-qanon-pence-20181130-story.html", "title": "Broward SWAT sergeant has unauthorized 'QAnon' conspiracy patch at airport with VP, report says", "authors": [], "date": "2018-11-30", "keywords": ["conspiracy", "spokeswoman", "sgt", "patten", "sergeant", "patch", "question", "told", "times", "report", "airport", "vp", "worn", "sheriffs", "saying", "swat", "qanon", "broward", "unauthorized"], "summary": "The patch worn by Sgt.\nMatt Patten, saying “Question the Narrative,\" is not authorized by the sheriff’s office and “will be addressed immediately,” a spokeswoman for the agency told the Miami New Times."}, {"url": "https://flaglerlive.com/122699/2018-valuations/", "title": "Flagler Property Values Rise 7.5%, Best Since Recession, But Government Revenue Faces Shock", "authors": ["Jim B", "Gary R", "Quido Poncini", "Michael Van Buren", "Maria Darcy", "Name", "Required"], "date": "2018-06-01", "keywords": ["flagler", "75", "governments", "gardner", "best", "shock", "million", "market", "rise", "county", "faces", "values", "tax", "increase", "recession", "revenue", "property"], "summary": "It’s good news: values countywide are up 7.45 percent, the best year-over-year increase since the Great Recession.\nIf the added exemption becomes law, it will have serious consequences for all local government budgets except schools (the exemption doesn’t apply to school tax values).\nIn Flagler County, County Administrator Craig Coffey is estimating a revenue reduction of $3.8 million.\nThe new tax law would become effective in October 2019, making this year’s new revenue potentially illusory–absent a tax increase.\nThe housing market, Gardner said, is showing a lower supply of homes, keeping builders and realtors busy."}, {"url": "https://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2018/12/23/ut-vols-1998-tennessee-football-national-championship-florida-state-fiesta-bowl/2301386002/", "title": "How the 1998 UT Vols beat Florida State in the Fiesta Bowl to cap the program's most storied season", "authors": ["Blake Toppmeyer", "Published P.M. Et Dec."], "date": "2018-12-23", "keywords": ["storied", "state", "fsus", "seminoles", "fiesta", "programs", "bowl", "game", "championship", "florida", "tennessee", "season", "cap", "ut", "play", "vols"], "summary": "1 in the Bowl Championship Series rankings and needed to beat Mississippi State in the SEC Championship to remain undefeated.\n2, followed by Kansas State and Florida State.\nBut who would Florida State play?\nDwayne Goodrich (23) runs back an interception for UT's second touchdown in the Fiesta Bowl against Florida State on Jan. 4, 1999.\nThe scoreboard shows the Vols' victory over Florida State in the Fiesta Bowl on Jan. 4, 1999."}, {"url": "https://section215.com/2019/01/22/philadelphia-phillies-significance-roy-halladays-hof/", "title": "Philadelphia Phillies: Significance of Roy Halladay’s Hall of Fame selection", "authors": ["Dan Parzych", "Cbs Denver"], "date": "2019-01-22", "keywords": ["way", "philadelphia", "hall", "fame", "significance", "halladay", "game", "selection", "2010", "blue", "roy", "phillies", "baseball", "halladays", "jays"], "summary": "PHILADELPHIA - OCTOBER 06: Roy Halladay #34 and Carlos Ruiz #51 of the Philadelphia Phillies celebrate Halladay's no-hitter and the win in Game 1 of the NLDS against the Cincinnati Reds at Citizens Bank Park on October 6, 2010 in Philadelphia, Pennsylvania.\n(Photo by Chris Trotman/Getty Images)Major league baseball announced the 2019 Hall of Fame class on Tuesday, and former Philadelphia Phillies ace Roy Halladay will be heading to Cooperstown.\nIncluded in that class was former Philadelphia Phillies ace, Roy Halladay.\nHe continued to dominate towards the end of the decade, but the Blue Jays began to fall off and enter a rebuild.\nHe will understandably sport a Blue Jays cap on his plaque, but no one will ever forget his Phillies tenure."}, {"url": "https://www.washingtontimes.com/news/2018/feb/1/how-amtrak-has-come-off-the-rails/", "title": "How Amtrak has come off the rails", "authors": ["The Washington Times Http", "Bruce K. Chapmann"], "date": "2018-02-01", "keywords": ["passenger", "competition", "private", "come", "infrastructure", "intercity", "amtrak", "rails", "rail", "safety", "train", "service"], "summary": "But, for the first time since the bankruptcy of the Penn Central railroad in 1970, private passenger rail is becoming feasible.\nSome states help subsidize Amtrak service now.\nFollowing the recent deadly Amtrak derailment near Tacoma, the Cascades service funded by Washington and Oregon is a logical next prospect for inter-city competition.\nPrivate commuter rail companies in a number of metropolitan areas already make successful private bids against Amtrak.\nYet for road freight haulers, and for bus and air carriers that use federally financed infrastructure, private competition predominates."}, {"url": "https://www.thewrap.com/ex-gawker-editor-almost-went-into-hiding-after-hulk-hogan-verdict/", "title": "Ex-Gawker Editor Almost Went Into Hiding After Hulk Hogan Verdict", "authors": ["Tim Molloy", "Brian Flood", "Reid Nakamura", "Ross A. Lincoln", "Daniel Goldblatt", "J. Clara Chan", "Brian Welk", "Margeaux Sippell"], "date": "2016-09-29", "keywords": ["lawyer", "sex", "million", "daulerio", "longform", "tape", "went", "editor", "exgawker", "hogans", "verdict", "gawker", "going", "hulk", "case", "hogan", "hiding"], "summary": "Former Gawker editor AJ Daulerio says he considered going into hiding after he was hit with a $140 million judgement in Hulk Hogan‘s lawsuit against Gawker for posting of an excerpt of his sex tape.\nBut I do still have a copy of the sex tape,” he told the Longform podcast in an episode that aired Tuesday.\nWhy don’t I do a post on Ratter that says ‘Here’s What a $140 Million Sex Tape Looks Like” and then just peace out.\nGawker and Daulerio had argued that the sex tape was newsworthy, and Daulerio was asked in a 2013 deposition if he could imagine a sex tape that wouldn’t be newsworthy.\nThe sex tape included Hogan using the N-word."}, {"url": "https://www.stampedeblue.com/2010/6/1/1491643/know-your-colts-history-former", "title": "Know Your Colts History: Former Colts quarterback and radio announcer Mark Herrmann elected to College Football Hall of Fame", "authors": ["Brad Wells", "Jun"], "date": "2010-06-01", "keywords": ["season", "mark", "radio", "fans", "know", "1992", "football", "herrmann", "hall", "fame", "george", "game", "player", "quarterback", "history", "colts", "team"], "summary": "Yep, back in the early 1990s, it was fun times for Colts fans.\nIn that '84 season, Herrmann started two games, completing 51.8% of his passes, throwing 1 TD and 6 INTs.\nAfter the game, Colts fans were flying high.\nUnlike Trudeau and George, Herrmann had played well in an opener and had delivered in the clutch.\nHis ten-year gameday radio job was given to former lineman (and 1992 Colts free agent acquisition) Will Wolford."}, {"url": "https://campussports.net/2016/09/25/video-espns-eduardo-perez-remembers-jose-fernandez/", "title": "Video: ESPN’s Eduardo Perez remembers Jose Fernandez", "authors": ["Caleb Bailey", "Please Enter Your Name Here"], "date": "2016-09-25", "keywords": ["marlins", "yearhttpsyoutubep7tgpp_2sqcperez", "way", "eduardo", "perez", "video", "age", "fernandez", "jose", "world", "young", "baseball", "espns", "remembers"], "summary": "Sunday morning, Miami Marlins star pitcher Jose Fernandez was tragically killed in a boating accident at age 24.\nThe news rocked the sports world and many have begun sharing their emotional tributesESPN baseball analyst Eduardo Perez was one who discussed Fernandez and his tragic passing on-air after the news broke.\nhttps://youtu.be/p7tgPP_2sQcPerez also had a close relationship with Fernandez as he was the Marlins’ hitting coach for two seasons while Fernandez was with the team.\nJose Fernandez had a huge impact on the Latino community after he attempted multiple times to defect from Cuba, which landed him in prison for a year at a young age.\nRest in peace, Jose Fernandez."}, {"url": "https://www.usatoday.com/in-depth/news/investigations/2019/10/30/security-contractor-g-4-s-plagued-years-international-scandal/4060171002/", "title": "The Pulse nightclub shooting and other G4S scandals", "authors": ["Brett Murphy", "Nick Penzenstadler", "Usa Today", "Gina Barton", "Milwaukee Journal Sentinel"], "date": "2019-10-30", "keywords": ["security", "lost", "shooting", "british", "pulse", "nightclub", "million", "scandals", "facility", "nuclear", "detention", "g4s", "guards", "company"], "summary": "G4S said it was “deeply shocked” by the Pulse shooting but has defended its hiring practices.\nUK prison death prompts outrageIn 2004, Gareth Myatt, 15, died of “positional asphyxia” at the United Kingdom's Rainsbrook Secure Training Centre, a youth detention facility G4S operated until 2016.\nRainsbrook was also cited for “inadequate” care in a government report in 2015 and G4S lost the next contract.\nThree G4S guards were involved in another in-custody death in 2010, when an Angolan man at Heathrow Airport died while being restrained.\nIn December of that year, South African government officials took over the maximum security facility after G4S “lost effective control,” the government told the BBC."}, {"url": "https://www.stateoftheu.com/2020/1/27/21083993/miami-hurricanes-football-manny-diaz-goals-deriq-king-culture-acc-coastal-fsu-rivalry-brevin-jordan", "title": "My 3 Biggest Goals For The Miami Hurricanes In 2020", "authors": ["Jan"], "date": "2020-01-27", "keywords": ["season", "biggest", "goals", "canes", "2020", "hurricanes", "win", "coming", "football", "acc", "coastal", "miami"], "summary": "We’re only a month into the offseason for the Miami Hurricanes, and currently sit at 222 days away from their 2020 opener against Temple, but it’s never too early to start setting goals for the upcoming season.\nWin the ACC CoastalIf the Hurricanes want to get back on track and become a force in college football once again, they must start winning the ACC Coastal.\nMiami officially eliminated from ACC Coastal.\nWith players like King, Brevin Jordan, Gregory Rousseau and several other playmakers, there’s no reason why Miami can’t win the division.\nThe Miami Hurricanes Football team should take culture lessons from the @MiamiHEATWhen the Heat organization talks about culture, it actually means something."}, {"url": "https://www.ncaa.com/news/football/article/2019-12-21/appalachian-state-vs-uab-new-orleans-bowl-prediction-time-tv", "title": "Appalachian State vs. UAB: New Orleans Bowl prediction, time, TV channel, preview", "authors": [], "date": "2019-12-21", "keywords": ["season", "conference", "vs", "state", "orleans", "uab", "bowl", "appalachian", "game", "app", "channel", "preview", "tv", "mountaineers", "prediction", "team"], "summary": "Appalachian State and UAB will descend on the Big Easy on Dec. 21 to take part in the New Orleans Bowl.\nNew Orleans Bowl: Time & How to watchThe New Orleans Bowl kicks off at 9 p.m.\nNew Orleans Bowl: Prediction, PreviewThe New Orleans Bowl is familiar territory for Appalachian State.\nExpect App State to roll and continue to bolster their pitch to make a New Year's Six bowl next year.\nThe Pick App State 48,UAB 20Appalachian State vs. UAB: Stats, how they compare"}, {"url": "https://www.news4jax.com/sports/2019/12/08/fsu-introduces-mike-norvell-as-new-head-football-coach/", "title": "Florida State introduces Mike Norvell as new head football coach", "authors": ["Justin Barney", "Mike Vasilinda"], "date": "2019-12-08", "keywords": ["coach", "right", "university", "state", "introduces", "norvell", "mike", "florida", "football", "opportunity", "head", "told"], "summary": "TALLAHASSEE, Fla. – Florida State University made it official on Sunday, announcing Mike Norvell as its new head football coach.\n“I’m humbled and honored for the opportunity to be the head coach at Florida State University, one of the iconic brands in college football,” Norvell said in a release from the university.\n“I’m so very excited for the future and the opportunity to return Florida State football to one of the nation’s elite.\n“This gentleman right here was the only person I offered the head coaching job at Florida State University,\" said Thrasher.\nNovell also left open the possibility of coaching in a bowl game -- either for Memphis or Florida State."}, {"url": "https://www.dailymail.co.uk/news/article-7884409/Mom-three-children-lived-Disney-resort-created-town-dead-home.html", "title": "Mom and three children who lived in Disney resort-created town 'are found dead in their home'", "authors": ["Lauren Edmonds", "Lauren Edmonds For Dailymail.Com"], "date": "2020-01-14", "keywords": ["bodies", "saw", "todts", "investigation", "town", "todt", "physical", "mom", "resortcreated", "dead", "disney", "children", "death", "lived", "megan", "family", "celebration"], "summary": "Anthony Todt( left), Megan Todt (right) and their three children, Alek, Tyler and Zoe were reported missing by relatives on January 6.\nAccording to the business' page, Family Physical Therapy, Megan was a physical therapy instructor at the family's business.\nAfter the family were feared missing, a Facebook group titled 'Looking for the Todt Family' was created where one family friend wrote: 'Worried sick!\nOsceola County Sheriff Russell Gibson said the death investigation was launched after authorities arrived to the home.\n'This is an isolated incident, and all parties involved with this death investigation are accounted for,' he told reporters."}, {"url": "https://www.al.com/auburnfootball/2019/10/florida-will-expose-auburns-ol-cover-as-home-underdog.html", "title": "Florida will expose Auburn’s OL, cover as home underdog", "authors": ["Christopher Smith", "Secfootballeditor Gmail.Com"], "date": "2019-10-01", "keywords": ["gators", "auburn", "mississippi", "underdog", "state", "week", "cover", "expose", "game", "offensive", "ol", "texas", "florida", "hes", "auburns"], "summary": "17 Texas A&M in Week 4 and embarrassed Mississippi State in Week 5.\nI went against the grain and told everyone to bet on Auburn against Texas A&M, and then leaned toward Auburn against Mississippi State but got scared off by a few trends.\nHe finally broke out against Mississippi State, completing 16 of 21 passes for 335 yards, with Schwartz and Seth Williams getting healthy.\nAuburn built first-quarter leads of 14-0 and 21-0 over Texas A&M and Mississippi State, respectively.\nThe Gators offensive line has regressed after losing four starters from the 2018 team."}, {"url": "https://grist.org/justice/for-caribbean-nations-climate-change-means-shrinking-populations/", "title": "For Caribbean nations, climate change means shrinking populations", "authors": ["Kenya Evelyn"], "date": "2019-12-16", "keywords": ["populations", "community", "means", "change", "shrinking", "vieques", "ricans", "hurricanes", "central", "climate", "caribbean", "nations", "florida", "puerto", "latona", "maria"], "summary": "One of the most noticeable things that’s changed since the hurricanes, Latona says, is that there are fewer familiar faces.\nPuerto Ricans had already been leaving in droves prior to Maria.\n“There’s a real sense of ‘what’s the point of coming back?’’’ Latona said, describing the perspective of Puerto Ricans who have left.\nBut some Puerto Ricans who have moved to the U.S. after the 2017 hurricanes have encountered hostility from some unexpected sources.\nWith a sustained uptick in Puerto Ricans moving to Central Florida after Maria, their Democratic-leaning votes are predicted to be a political force rivaling Republican-leaning Cuban-Americans."}, {"url": "https://www.cordcuttersnews.com/here-is-every-market-court-tv-is-relaunching-in-as-a-free-ota-tv-network-on-may-8th-2019/", "title": "Here is Every Market Court TV Is Relaunching In As a Free OTA TV Network on May 8th 2019", "authors": ["Luke Bouma"], "date": "2019-04-27", "keywords": ["ota", "tx", "free", "court", "market", "acentek", "relaunching", "2019", "network", "fl", "wi", "rapids", "ca", "coming", "tba", "8th", "tv"], "summary": "Back in December, it was announced that Katz Networks was relaunching the crime network Court TV.\nNow we have an exact launch date of May 8th 2019 for Court TV’s return as a free over the air TV network.\n“Court TV was a top-20 cable network and at the height of its popularity when the network was taken off the air in 2008,” said Jonathan Katz, CEO of Katz Networks.\nNevada:LAS VEGAS, NV KTNV 13.4 Coming May 2019 RENO, NV KREN 26.5 Coming May 2019New Hampshire:No OTA Affiliates.\nTennessee:NASHVILLE, TN WSMV 4.4 Coming May 2019 NASHVILLE, TN CDE LIGHTBAND TBA Coming May 2019 KNOXVILLE, TN WKNX 7.3 Coming May 2019 JACKSON, TN WYJJ 27.1 Coming May 2019Texas:HOUSTON, TX KEHO 32.2 Coming May 2019 SAN ANTONIO, TX KWEX 41.4 Coming May 2019 HARLINGEN, TX KNVO 49.5 Coming May 2019 EL PASO, TX KINT 25.5 Coming May 2019 WACO, TX KXXV 25.4 Coming May 2019 TYLER, TX KPKN 33.3 Coming May 2019 AMARILLO, TX KAUO 15.3 Coming May 2019 ODESSA, TX KUPB 18.5 Coming May 2019 LUBBOCK, TX KLBK 13.2 Coming May 2019 LAREDO, TX KLDO 19.5 Coming May 2019 DALLAS, TX KDAF 33.3 Coming November 2019 DALLAS, TX SPECTRUM (CHARTER) 1257 Coming November 2019 HOUSTON, TX KIAH 39.5 Coming November 2019Utah:SALT LAKE CITY, UT KUCW 30.4 Coming May 2019Vermont:No OTA Affiliates."}, {"url": "https://www.nationalobserver.com/2019/12/20/news/shrinking-populations-caribbean-due-climate-change", "title": "Shrinking populations in Caribbean due to climate change", "authors": [], "date": "2019-12-20", "keywords": ["populations", "community", "change", "shrinking", "vieques", "ricans", "hurricanes", "central", "climate", "caribbean", "florida", "puerto", "latona", "maria"], "summary": "One of the most noticeable things that’s changed since the hurricanes, Latona says, is that there are fewer familiar faces.\nPuerto Ricans had already been leaving in droves prior to Maria.\n“There’s a real sense of ‘what’s the point of coming back?’’’ Latona said, describing the perspective of Puerto Ricans who have left.\nBut some Puerto Ricans who have moved to the U.S. after the 2017 hurricanes have encountered hostility from some unexpected sources.\nWith a sustained uptick in Puerto Ricans moving to Central Florida after Maria, their Democratic-leaning votes are predicted to be a political force rivaling Republican-leaning Cuban-Americans."}, {"url": "https://www.sun-sentinel.com/news/florida/fl-ne-florida-daylight-savings-time-20181030-story.html", "title": "Permanent daylight saving time for Florida awaits Congress", "authors": ["Dan Sweeney"], "date": "2018-10-30", "keywords": ["protection", "permanent", "daylight", "state", "tallahassee", "senate", "support", "tourism", "reasons", "sunshine", "presumed", "awaits", "saving", "florida", "positive", "congress"], "summary": "The increased evening daylight hours in the Sunshine State and the presumed positive effect on the tourism industry were the top reasons to support the bill when it was debated in Tallahassee, where the law was given the glowing moniker the Sunshine Protection Act and passed with overwhelming, bipartisan support — 33-2 in the Senate and 103-11 in the House."}, {"url": "https://thespun.com/nfl/bryce-langston-2021s-no-3-de-announces-decommitment", "title": "Bryce Langston, 2021’s No. 3 DE, Announces Decommitment", "authors": ["Matt Hladik"], "date": "2019-05-10", "keywords": ["decommitment", "state", "signing", "fourstar", "2021s", "2021", "bryce", "end", "steele", "florida", "announces", "langston", "rankings", "class"], "summary": "Ocala (Fla.) Vanguard four-star defensive end Bryce Langston, one of the top prospects in the 2021 class, has reopened his recruitment as of this afternoon.\nLangston committed to Florida in early December, but has since also visited Florida State and picked up an offer from Auburn.\n“After the long days and nights of me thinking about the recruiting process, talking to my parents and coaches I will announce that will be de-committing from the University of Florida,” Langston wrote on Twitter.\nSteele was a top-50 recruit and the highest-rated member of the Gators’ 2019 signing class.\nFortunately, there’s plenty of time before the class of 2021 can begin signing, so perhaps Florida can reel Langston back in."}, {"url": "http://www.wruf.com/headlines/2020/03/09/five-teams-have-punched-their-ticket-to-march-madness/", "title": "Five Teams have punched their ticket to March Madness", "authors": [], "date": "2020-03-09", "keywords": ["conference", "madness", "state", "second", "punched", "game", "won", "tournament", "points", "clinch", "team", "teams", "ticket", "aggies"], "summary": "Selection Sunday is less than one week away and five teams have punched their ticket to March Madness.\nAggies Clinch on Buzzer BeaterIt started with Utah State stunning No.\nUtah State is a team that has shown they can beat top teams as they have already beaten LSU and Flordia earlier this season.\nThe Flames have allowed 57 points and entered the game allowing 53.7 points a game this season, second-lowest in D-1 behind Virginia.\nWho’s NextAnother team will clinch a spot to play in March Madness with East Tennessee State and Wofford playing for the Southern Conference Championship tonight."}, {"url": "https://rollingout.com/2019/12/04/trayvon-martins-family-responds-to-george-zimmermans-100-million-lawsuit/", "title": "Trayvon Martin’s family blasts George Zimmerman after he sues them for $100M", "authors": ["A.R. Shaw"], "date": "2019-12-04", "keywords": ["family", "lawsuit", "blasts", "george", "trayvon", "martin", "film", "100m", "eugene", "gilbert", "zimmerman", "diamond", "sues", "martins"], "summary": "Trayvon Martin’s family has responded to George Zimmerman’s $100 million lawsuit.\nThis tale defies all logic, and it’s time to close the door on these baseless imaginings.”After getting away with criminalizing and murdering Trayvon Martin, Zimmerman now seeks to sue Martin’s family members.\nAccording to the Chicago Defender, Zimmerman filed a lawsuit against Martin’s parents and Ben Crump.\nGilbert alleges that in March 2012, the Sanford Police Department investigated Trayvon Martin’s passing and initially closed the case as self-defense.\nAnd even if the claims were found to be true, it does not take away from the fact that Zimmerman harassed and followed Trayvon Martin."}, {"url": "https://withthefirstpick.com/2019/07/16/2020-nfl-draft-lamical-perine-makes-wise-move-cut-weight/", "title": "2020 NFL Draft: Lamical Perine makes wise move to cut weight", "authors": ["Bryan Perez", "Nicholas Mcgee"], "date": "2019-07-16", "keywords": ["lamical", "season", "cut", "best", "2020", "career", "come", "nfl", "wise", "draft", "florida", "makes", "weight", "looking", "perine"], "summary": "(Photo by Scott Cunningham/Getty Images)Lamical Perine has cut weight ahead of his final season at Florida, an astute move by the running back looking forward to the 2020 NFL Draft.\nLamical Perine will be looking to boost his stock for the 2020 NFL Draft with a strong senior season at Florida, and has taken steps in the offseason to ensure he is at his best for the Gators.\nPerine had his best season as a junior for Flordia last year, racking up 996 yards from scrimmage and eight touchdowns while playing at 5’11” and 227 pounds.\nLamical Perine says that he made a concerted effort to lose weight after deciding to come back to Florida.\n— Barrett Sallee (@BarrettSallee) July 15, 2019This is a wise move from Perine looking ahead to the start of his pro career."}, {"url": "https://www.thecut.com/2018/08/bettina-rodriguez-aguilar-flordia-more-than-just-an-alien-abductee.html", "title": "This Congressional Candidate Is More Than Just Her Alien Abduction, Okay?", "authors": ["Madeleine Aggeler"], "date": "2018-08-24", "keywords": ["floridas", "spaceship", "congressional", "alien", "interview", "candidate", "aguilera", "okay", "abduction", "herald", "office", "rodriguez", "congress", "miami"], "summary": "Bettina Rodriguez Aguilera.\nPhoto: Roberto Koltun/TNS via Getty ImagesBettina Rodriguez Aguilera is one of nine GOP candidates campaigning to represent Florida’s 27th Congressional District in Congress.\nAnd even before all that, when she was still a child, she says she was taken aboard an alien spaceship by tall, blond extraterrestrials.\nAs the Herald put it, however, she also has “boots-on-the-ground ideas and experience” that would serve her well in Congress.\nAnd who knows, with the new Space Force, having an in with some aliens might not be a bad thing."}, {"url": "http://www.wruf.com/headlines/2019/01/10/florida-lands-talented-linebacker-jon-greenard/", "title": "Florida lands talented linebacker Jon Greenard", "authors": [], "date": "2019-01-10", "keywords": ["gators", "linebacker", "loss", "twitter", "jon", "talented", "lands", "totaled", "greenard", "florida", "season", "tackles", "polite", "team"], "summary": "The Florida Gators have added Jon Greenard, a graduate transfer who is expected to strengthen the talent on the defense.\nhttps://twitter.com/jongreenard7/status/1083136468363763713Jon GreenardThe 6-foot-4, 263-pound linebacker did not play in the 2018 season due to a ligament injury in the wrist.\nIn 2017, Greenard led the team with 15.5 tackles for loss.\nCombined with high energy, it seems that he’ll add some needed depth to a Gators team that needs to fill in some spots on defense this offseason.\nGreenard is expected to make immediate contributions to the team and is enrolling at Florida this week."}, {"url": "https://www.usatoday.com/in-depth/news/investigations/2020/01/09/reporters-notebook-afghanistan/2820013001/", "title": "How we reported the deadly airstrike: A reporter's notebook from Afghanistan", "authors": ["Brett Murphy", "Usa Today"], "date": "2020-01-09", "keywords": ["security", "murphy", "brett", "aleem", "deadly", "usa", "reporters", "afghan", "told", "kabul", "airstrike", "children", "reported", "notebook", "afghanistan"], "summary": "Illustrations by Brett Murphy, USA TODAY“The thing is the walls,” Aleem told me as we drove.\nBrett Murphy, USA TODAYThere are few street lights in Herat.\nTwo Afghan children play with a kite on the outskirts of Herat, where infrastructure like paved roads become more rare.\nBrett Murphy, USA TODAYAt the local hospital, amputees, orphans and widows waited outside the director’s office.\nBrett Murphy, USA TODAYJust before I went to bed, there was a knock on the door to my room."}, {"url": "https://www.cleveland.com/browns/2019/11/browns-vs-bills-preview-5-things-to-know-about-clevelands-next-opponent.html", "title": "Browns vs. Bills preview: 5 things to know about Cleveland’s next opponent", "authors": ["Ellis Williams", "Ewilliams Cleveland.Com", "Ellis L. Williams"], "date": "2019-11-04", "keywords": ["clevelands", "buffalo", "vs", "cleveland", "know", "mayfield", "opponent", "allen", "win", "game", "browns", "games", "preview", "things", "bills", "yards"], "summary": "Since then Buffalo carries the inverse of Cleveland’s record and looks playoff-bound and the Browns may have a top 10 pick.\nHere are five things you need to know about the Browns’ upcoming opponent.\nBills will be a playoff teamUnlike Cleveland, the Bills look headed for the playoffs.\nAgain, unlike the Browns, Buffalo won the games it should have, affording them more margin of error during the final eight games.\nIn Buffalo, Mayfield faces an opportunity to prove he’s more than those other underachieving throwers the Bills have already beat."}, {"url": "https://www.latestly.com/lifestyle/fifa-womens-world-cup-2019-usa-teammates-and-lesbian-couple-ali-krieger-and-ashlyn-harris-to-get-married-in-december-check-instagram-post-986281.html", "title": "FIFA Women's World Cup 2019 USA Teammates and Lesbian Couple Ali Krieger and Ashlyn Harris to Get Married in December! (Check Instagram Post)", "authors": [], "date": "2019-07-05", "keywords": ["ashlyn", "teammates", "married", "usa", "harris", "instagram", "megan", "2019", "post", "womens", "ali", "vogue", "lesbian", "world", "football", "cup", "team", "krieger"], "summary": "Football players Ali Krieger and Ashlyn Harris to get married in December (Photo Credits: Getty Images)American football players Ali Krieger and Ashlyn Harris who represent the United States at the 2019 FIFA Women's World Cup may become the first professional sports teammates to get married.\nThey’re certainly the most high-profile, representing the U.S. at the World Cup, and slated to compete for the final this weekend.\nThe United States will play the Netherlands in the final of the 2019 Women's World Cup on Sunday.\nMegan Rapinoe Insists 'You Can’t Win Without Gays' After USA Beat France 2-1 to Enter 2019 FIFA Women's World Cup Semi-Finals.\nFollowing which, Trump took to Twitter inviting the US women's team to the White House."}, {"url": "https://dawnofthedawg.com/2019/08/15/commitment-watch-georgia-football/", "title": "Is Georgia football on commitment watch?", "authors": ["Richard Gnann", "Eric Taylor", "Savannah Leigh", "Jenna West"], "date": "2019-08-15", "keywords": ["dawgs", "commitment", "watch", "wren", "2020", "smith", "commit", "think", "247sports", "football", "georgia", "class", "van"], "summary": "Right now, Georgia football has 16 members in its 2020 recruiting class.\nWell, head coach Kirby Smart and his staff are saying, ‘ hey, yall watch this.’ and going to blow all of Dawg Nation’s mind with the 2020 class.\nGeorgia already has three 5-stars in this class, but I suspect it’ll be eight more to sign, and yes, I’m serious.\nZach Evans:Yes, I’m putting Zach Evans on commitment watch, and I believe it’s going to be Georgia at the end of it all.\nI don’t think he’s lost any interest from Georgia; I think that the staff’s told him to wait."}, {"url": "https://theintercept.com/2019/02/13/neoliberalism-or-death-the-u-s-economic-war-against-venezuela/", "title": "The U.S. Economic War Against Venezuela", "authors": [], "date": "2019-02-13", "keywords": ["aid", "economic", "venezuelan", "know", "venezuela", "president", "mean", "sanctions", "maduro", "united", "war", "states"], "summary": "And we’re going to talk about the economic warfare unleashed against Venezuela and who is really being harmed by these U.S.-led economic sanctions.\nI mean, in Venezuela, we do have an economic crisis, you know, but a country having economic problems doesn’t mean it’s in the middle of a humanitarian crisis.\nBut at the end of the day, you know, Venezuela has an armed force and besides the armed force Venezuela has, Venezuela has its people and they’re very proud people.\nWhat the United States did and what the United States had been doing for 20 years is increasing the pressure, increasing the economic war and then applying sanctions.\nAdZ: Well, the United States is trying anything to bring him down and the United States has miscalculated often enough."}, {"url": "https://www.wtvq.com/2018/05/08/woodford-co-woman-loses-money-bogus-loan-company/", "title": "Woodford Co. woman loses money to bogus loan company", "authors": [], "date": "2018-05-08", "keywords": ["loans", "loses", "money", "fees", "bogus", "loan", "credit", "woman", "florida", "woodford", "quick", "bbb", "company"], "summary": "LEXINGTON, Ky. (WTVQ)- A Versailles woman loses over a thousand dollars to a bogus loan company.\nOfficials at BBB say a company called Money Loans Quick with a Miami, Florida address, contacted her and approved the couple for a $3,000 loan.\nThe “loan” company asked the woman for various fees in advance for “bad credit insurance,” “processing fees,” etc.\nThe company required the money to be paid via Google Play cards.\n“This lady was never going to see a dime of that loan,” said Heather Clary, BBB Director of Communications."}, {"url": "https://www.jsonline.com/story/news/nation/2020/01/01/baghdad-embassy-attack-protesters-disperse-troops-fire-tear-gas/2789540001/", "title": "Protesters at US Embassy in Baghdad disperse as security personnel fire tear gas", "authors": ["Grace Hauck", "John Bacon", "Published A.M. Ct Jan."], "date": "2020-01-01", "keywords": ["iraqi", "security", "disperse", "airstrikes", "iranbacked", "forces", "trump", "gas", "military", "embassy", "personnel", "tear", "protesters", "killed", "militia", "baghdad"], "summary": "CLOSE A detachment of one hundred Marines are reinforcing the US Embassy in Baghdad after Iraqi protestors attempted to storm the compound.\n(Dec. 31) AP DomesticDemonstrators laying siege to the U.S. Embassy in Baghdad began to disperse as security personnel fired tear gas Wednesday in the second day of unrest after U.S. airstrikes killed at least two dozen Iran-backed fighters in Iraq.\nIraqi forces who guard the usually safe Green Zone where the embassy is located did little to stop the chaos.\nIran’s supreme leader, Ayatollah Ali Khamenei, criticized the U.S. airstrikes on the Iran-backed Iraqi militia on Sunday.\nThe Iranian-backed Iraqi militia vowed Monday to retaliate for the U.S. military strikes."}, {"url": "https://houston.sportsmap.com/top-10-trades-for-jadeveon-clowney", "title": "5 teams that could trade for Jadeveon Clowney", "authors": ["Jayson Braddock", "Joshua Jordan", "Sportsmap Staff"], "date": "2019-06-24", "keywords": ["positions", "jadeveon", "prospects", "texans", "need", "trade", "houston", "clowney", "teams"], "summary": "6 Prospects at positions of need for the Houston Texans"}, {"url": "https://campussports.net/2020/02/14/top-10-trade-contracts-in-mlb-history/", "title": "Top 10 Trade Contracts in MLB History", "authors": ["Cailyn Szelinski", "Please Enter Your Name Here"], "date": "2020-02-14", "keywords": ["season", "reached", "series", "million", "harper", "yankees", "mlb", "contract", "trade", "history", "contracts", "world", "stanton", "price"], "summary": "These are the top 10 contracts in MLB history that put players on the move:1.\nTo us, he'll always be a World Series champ.\nHowever, Price did well in Boston and helped the Red Sox win a World Series in 2018.\nAfter several contract extensions with the Brewers and a World Series run Fielder reached free agency.\nThe Detriot Tigers offered Fielder a $214 million contract for nine years."}, {"url": "https://www.spin.com/2017/06/kodak-black-released-from-jail-house-arrest/", "title": "Kodak Black Released From Jail to House Arrest", "authors": [], "date": "2017-06-05", "keywords": ["rapper", "carolina", "probation", "released", "south", "house", "florida", "days", "jail", "black", "octave", "kodak", "arrest"], "summary": "Kodak Black has left Flordia’s Broward County Jail 267 days ahead of schedule.\nAfter apparently completing a “life skills” course within the prison, the Florida rapper, born Dieuson Octave, has been released to house arrest after serving only a fraction of his sentence.\nOctave was put in jail in February for violating probation, and in May was charged with breaking house arrest and sentenced to 364 days in prison.\nThe rapper has been placed under a strict house arrest regimen.\nIn December, the rapper posted $100,000 in bail to return to Florida after being extradited to South Carolina to face those charges."}, {"url": "https://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2018/12/23/ut-vols-1998-tennessee-football-national-championship-florida-state-fiesta-bowl/2301386002/", "title": "How the 1998 UT Vols beat Florida State in the Fiesta Bowl to cap the program's most storied season", "authors": ["Blake Toppmeyer", "Published P.M. Et Dec."], "date": "2018-12-23", "keywords": ["storied", "state", "fsus", "seminoles", "fiesta", "programs", "bowl", "game", "championship", "florida", "tennessee", "season", "cap", "ut", "play", "vols"], "summary": "1 in the Bowl Championship Series rankings and needed to beat Mississippi State in the SEC Championship to remain undefeated.\n2, followed by Kansas State and Florida State.\nBut who would Florida State play?\nDwayne Goodrich (23) runs back an interception for UT's second touchdown in the Fiesta Bowl against Florida State on Jan. 4, 1999.\nThe scoreboard shows the Vols' victory over Florida State in the Fiesta Bowl on Jan. 4, 1999."}, {"url": "https://houston.sportsmap.com/the-11-worst-draft-picks-in-texans-history", "title": "The 11 worst draft picks in Texans history", "authors": ["Cody Stoots", "Joshua Jordan", "Sportsmap Staff"], "date": "2019-04-22", "keywords": ["worst", "remember", "doomed", "dont", "picks", "repeat", "past", "texans", "draft", "history", "11"], "summary": "If you don't remember the past you are doomed to repeat it"}, {"url": "https://section215.com/2019/01/22/philadelphia-phillies-significance-roy-halladays-hof/", "title": "Philadelphia Phillies: Significance of Roy Halladay’s Hall of Fame selection", "authors": ["Dan Parzych", "Cbs Denver"], "date": "2019-01-22", "keywords": ["way", "philadelphia", "hall", "fame", "significance", "halladay", "game", "selection", "2010", "blue", "roy", "phillies", "baseball", "halladays", "jays"], "summary": "PHILADELPHIA - OCTOBER 06: Roy Halladay #34 and Carlos Ruiz #51 of the Philadelphia Phillies celebrate Halladay's no-hitter and the win in Game 1 of the NLDS against the Cincinnati Reds at Citizens Bank Park on October 6, 2010 in Philadelphia, Pennsylvania.\n(Photo by Chris Trotman/Getty Images)Major league baseball announced the 2019 Hall of Fame class on Tuesday, and former Philadelphia Phillies ace Roy Halladay will be heading to Cooperstown.\nIncluded in that class was former Philadelphia Phillies ace, Roy Halladay.\nHe continued to dominate towards the end of the decade, but the Blue Jays began to fall off and enter a rebuild.\nHe will understandably sport a Blue Jays cap on his plaque, but no one will ever forget his Phillies tenure."}, {"url": "https://www.thekeyplay.com/content/2019/march/19/buzz-williams-and-texas-am-no-plan-b-thread-part-ii", "title": "Buzz Williams and Texas A&M, No Plan B (Thread Part II)", "authors": [], "date": "2019-03-19", "keywords": ["wide", "b", "virginia", "update", "zwerneman", "turns", "win", "college", "thread", "basketball", "texas", "plan", "williams", "ii", "buzz"], "summary": "Brent Zwerneman of the Houston Chronicle published an update on Texas A&M's coaching search and there's plenty of confidence the Aggies will land their man.\nOnce Williams, 46, is done with his season at Virginia Tech — and the Hokies are built to win at least a couple of games in the postseason — he's expected to pack bags and load up his family for College Station.\n\"The wide expectation among college basketball insiders is that Williams will be the next coach at Texas A&M,\" national college basketball columnist Seth Davis recently opined.\nIf Williams turns this down, a lot of folks around the sport will be quite surprised.\""}, {"url": "https://www.onlygators.com/03/02/2012/ran-carthon-i-never-run-away-from-competition/", "title": "Ran Carthon: \"I never run away from competition.\"", "authors": ["Adam Silverstein"], "date": "2012-03-02", "keywords": ["competition", "away", "play", "wanted", "run", "carthon", "game", "guys", "players", "florida", "im", "going", "ran", "hes", "team"], "summary": "RAN CARTHON: “Living in Key West was awesome and amazing; we had a lot of community support.\nHe had a monster game against Florida State and in the bowl game went over 200 yards.\nI definitely think he’s going to give it his all just to get back out on the field and prove people wrong.\nThe guys always give me crap and say that I’m biased towards the Florida players, but I love my guys.\nI’ve incorporated that into myself and my role as a parent.”AS: Now let’s talk about the brand new Florida Players Network."}, {"url": "https://www.express.co.uk/sport/nfl/1060951/Tom-Brady-Pro-Bowl-2019-New-England-Patriots-NFL-news", "title": "Tom Brady earns 14th Pro Bowl selection as Patriots only send two players", "authors": ["Lloyd Johnson", "Tom Brady"], "date": "2018-12-19", "keywords": ["14th", "sack", "send", "tom", "second", "bowl", "selection", "patriots", "brady", "nfl", "pro", "players", "season", "earns", "yards"], "summary": "The 41-year-old New England Patriots quarterback is joined by team-mate Stephon Gilmore in making the Pro Bowl roster.\nBrady’s selection as one of the two players for the Patriots to make the Pro Bowl roster, is the franchise’s lowest total since 2008 - which is the last time they did’t make it into the post-season.\nBrady’s selection to represent the Patriots in the Pro Bowl in Orlando, Flordia, marks his 10th consecutive selection to the all-star game.\nHe joins an elite group of NFL players on 14 Pro Bowl selections - Tony Gonzalez, Peyton Manning, Bruce Matthews and Merlin Olsen.\nIt shouldn’t happen Tom BradyPatriots cornerback Gilmore will be making his second career Pro Bowl - the first came in 2016 with the Buffalo Bills."}, {"url": "https://www.bet.com/music/2018/07/01/xxxtentacion-grave.html", "title": "Heartbreaking: See XXXTentacion's Final Resting Place", "authors": ["Renee Samuel", "Written Renee Samuel"], "date": "2018-07-01", "keywords": ["resting", "broward", "shot", "scared", "place", "south", "transferred", "final", "sheriffs", "heartbreaking", "williams", "xxxtentacion", "xxxtentacions", "flordia", "xxxtentacionon"], "summary": "XXXTentacion fans are still mourning the death of the 20-year-old rapper.\nOn June 18, XXXTentacion, whose real name was Jahseh Dwane Onfroy, was fatally shot while leaving a motorcycle dealer in South Flordia.\nHe was officially pronounced dead by the Broward County Sheriff’s Department after he was transferred to Broward Health North hospital.\nDedrick Williams has been charged with the murder of XXXTentacion.\nOn Thursday, June 26, XXXTentacion was laid to rest at a private funeral in Flordia."}, {"url": "https://www.washingtontimes.com/news/2018/feb/1/how-amtrak-has-come-off-the-rails/", "title": "How Amtrak has come off the rails", "authors": ["The Washington Times Http", "Bruce K. Chapmann"], "date": "2018-02-01", "keywords": ["passenger", "competition", "private", "come", "infrastructure", "intercity", "amtrak", "rails", "rail", "safety", "train", "service"], "summary": "But, for the first time since the bankruptcy of the Penn Central railroad in 1970, private passenger rail is becoming feasible.\nSome states help subsidize Amtrak service now.\nFollowing the recent deadly Amtrak derailment near Tacoma, the Cascades service funded by Washington and Oregon is a logical next prospect for inter-city competition.\nPrivate commuter rail companies in a number of metropolitan areas already make successful private bids against Amtrak.\nYet for road freight haulers, and for bus and air carriers that use federally financed infrastructure, private competition predominates."}, {"url": "https://campussports.net/2018/07/25/top-10-best-uniforms-in-college-football/", "title": "Top 10 Best Uniforms In College Football", "authors": ["Jonathan Abbott", "Please Enter Your Name Here"], "date": "2018-07-25", "keywords": ["best", "classic", "good", "white", "college", "uniforms", "jerseys", "combo", "football", "black", "gray", "look"], "summary": "College Football Saturdays are fast approaching, and you all know that can only mean one thing.\nNot only have the classic red/white uniforms been improved, but the recently unveiled all-black alternates are on a whole other level.\nHighlight that with one of the red, white, or black uniforms and you have some of the best looking jerseys in all of football.\n5: Miami (FL)The phrase “Look good, feel good, play good.” may apply more to the Universtiy of Miami more than any other team.\n3: TCUOne of the fresher looks in all of college football, TCU always brings the heat when it comes to uniforms."}, {"url": "https://www.cleveland.com/tv-blog/2013/09/former_cleveland_news_anchor_john_hambrick_dies_of_cancer.html", "title": "Former Cleveland news anchor John Hambrick dies of cancer", "authors": ["Mark Dawidziak", "Mdawidziak Plaind.Com", "The Plain Dealer"], "date": "2013-09-11", "keywords": ["cancer", "cleveland", "hambrick", "career", "night", "texas", "john", "dies", "anchor", "channel", "tv", "told"], "summary": "\"The years at WEWS were extremely important to my career,\" Hambrick told The Plain Dealer July 22, responding to questions by e-mail.\nFive years younger, Judd Hambrick, was an anchor in Cleveland at WKYC Channel 3 and WJKW (now WJW) Channel 8.\nJohn Hambrick and his son, Jack, teamed up to co-produce \"The Florida Highwaymen,\" a 2002 PBS documentary about African-American artists.\nDuring his tenure in Cleveland, Hambrick released a country-western album, \"Windmill in a Jet-Filled Sky,\" featuring songs he wrote and performed.\nWhen he died, Hambrick was finishing \"Thunderbolt Raiders,\" a script he was writing with former Cleveland TV news colleague Lee Bailey."}, {"url": "https://www.stampedeblue.com/2010/6/1/1491643/know-your-colts-history-former", "title": "Know Your Colts History: Former Colts quarterback and radio announcer Mark Herrmann elected to College Football Hall of Fame", "authors": ["Brad Wells", "Jun"], "date": "2010-06-01", "keywords": ["season", "mark", "radio", "fans", "know", "1992", "football", "herrmann", "hall", "fame", "george", "game", "player", "quarterback", "history", "colts", "team"], "summary": "Yep, back in the early 1990s, it was fun times for Colts fans.\nIn that '84 season, Herrmann started two games, completing 51.8% of his passes, throwing 1 TD and 6 INTs.\nAfter the game, Colts fans were flying high.\nUnlike Trudeau and George, Herrmann had played well in an opener and had delivered in the clutch.\nHis ten-year gameday radio job was given to former lineman (and 1992 Colts free agent acquisition) Will Wolford."}]