[{"url": "https://www.nytimes.com/2020/04/13/us/coronavirus-new-orleans-mardi-gras.html", "title": "Why New Orleans Pushed Ahead With Mardi Gras, Even as It Planned for Coronavirus", "authors": ["Richard Fausset", "Derek Kravitz"], "date": "2020-04-13", "keywords": ["pushed", "director", "orleans", "ahead", "suspected", "emergency", "city", "coronavirus", "suggesting", "medical", "travel", "suggested", "mardi", "citys", "gras", "planned", "told"], "summary": "William T. Salmeron, the chief of Emergency Medical Services for the city, told his colleagues that workers should take “routine exposure control precautions” as they would in dealing with any respiratory illness.\nThose included getting the travel history of anyone with symptoms, giving patients surgical masks, and moving up to gloves, gown, protective eyewear and an N95 mask “if travel history risk factors warrant.”“At this time the potential risk of infection in the US is LOW,” he wrote.\nCollin M. Arnold, director of the city’s homeland security office, sent an email to Dr. Avegno and other city officials on Jan. 27, suggesting they “should probably get together and discuss public safety concerns during Mardi Gras and on the parade route.”The New Orleans Police Department, he said, had been asking about personal protective equipment “and general concerns (they shake a lot of hands and come in contact with a lot of people on the route every day).” He suggested putting together a “guide sheet for all responders” that would offer them “common sense mitigation tasks.”That same day, Tyrell Morris, the executive director of the city’s 911 service, told city officials about a questionnaire and worksheet that the International Academies of Emergency Dispatch was suggesting they use for all suspected coronavirus patients.\nDr. Emily Nichols, the medical director for the city’s emergency medical services, suggested they add a question asking suspected carriers whether they had been within six feet of another person thought to be infected with the virus."}, {"url": "https://985thesportshub.com/2020/04/15/nfl-draft-felger-and-mazz-big-board-2020-cornerbacks/", "title": "Felger & Mazz Big Board 2020: Cornerbacks for the Patriots in NFL Draft", "authors": [], "date": "2020-04-15", "keywords": ["felger", "cornerbacks", "2020", "corner", "defensive", "big", "board", "patriots", "nfl", "draft", "outside", "hes", "mazz", "tackle"], "summary": "The Felger & Mazz Big Board continues with an expanded edition for the 2020 NFL Draft.\nMike & Tony are expanding the Big Board for 2020, breaking down positions like they've never done before.\nConsidering the Big Board's track record, it would be unwise to bet that at least one of the picks doesn't call himself a Patriot at the 2020 NFL Draft on April 23-25.\nThey've already dove into the defense with their picks at defensive end, defensive tackle, and both inside and outside linebacker.\nLISTEN: Felger & Mazz Big Board 2020 - Cornerbacks in the NFL DraftBIG BOARD 2020: Guard | Center | Tackle | Defensive Tackle | Defensive End | Inside Linebacker | Outside LinebackerThe Felger & Mazz Big Board continues Thursday, April 16."}, {"url": "https://www.nbcnews.com/news/us-news/new-orleans-epicenter-coronavirus-mardi-gras-could-be-blame-doctors-n1167741", "title": "New Orleans is a center of coronavirus. Mardi Gras could be to blame, doctors say.", "authors": ["Elisha Fieldstadt", "Elisha Fieldstadt Is A Breaking News Reporter For Nbc News."], "date": "2020-03-24", "keywords": ["sayas", "orleans", "blame", "louisianas", "center", "coronavirus", "deaths", "say", "doctors", "mardi", "gras", "states"], "summary": "New Orleans is a center of coronavirus.\nMardi Gras could be to blame, doctors say.\nAs of Tuesday afternoon, New Orleans had 567 of Louisiana's 1,388 cases of the coronavirus and 20 of the state's 46 deaths."}, {"url": "https://slate.com/news-and-politics/2020/04/new-orleans-mardi-gras-coronavirus.html", "title": "Stop Shaming New Orleans for Holding Mardi Gras", "authors": ["Jordan Hirsch"], "date": "2020-04-02", "keywords": ["orleans", "street", "shaming", "holding", "city", "federal", "lewis", "mardi", "covid19", "louisiana", "black", "stop", "gras"], "summary": "The traditional Skull and Bone Gang wake up residents of the Tremé neighborhood of New Orleans on Mardi Gras morning.\nThis year, as always, Mardi Gras Indians converged on the Sportsman’s Corner bar at Second and Dryades in Central City.\nTheresa Elloie and her family have hosted the Mardi Gras Indians at Sportsman’s Corner for generations.\nNo one on the street on Mardi Gras Day realized they were already facing an immediate threat.\nOn Thursday on The View, Meghan McCain told Cantrell she was “surprised the Mardi Gras celebrations continued” in February."}, {"url": "https://nypost.com/2020/03/26/coronavirus-cases-skyrocket-in-new-orleans-mardi-gras-likely-to-blame/", "title": "Coronavirus cases skyrocket in New Orleans, Mardi Gras likely to blame", "authors": ["March"], "date": "2020-03-26", "keywords": ["orleans", "blame", "state", "skyrocket", "coronavirus", "health", "likely", "told", "think", "denson", "louisiana", "mardi", "gras", "cases"], "summary": "Sign up for our special edition newsletter to get a daily update on the coronavirus pandemic.\nNew Orleans is likely to become the nation’s new coronavirus epicenter — and experts say Mardi Gras celebrations that attracted millions to the city may be partly to blame.\nTo date, Louisiana has seen nearly 1,800 coronavirus cases, with at least 65 reported deaths.\nNew Orleans is responsible for 800 of those cases and 37 deaths.\n“I think it came during Mardi Gras, given the timing of it,” the doctor said."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.politifact.com/factchecks/2020/apr/08/john-bel-edwards/louisiana-governor-right-there-was-no-suggestion-m/", "title": "Louisiana governor is right, there was no suggestion Mardi Gras had to be canceled", "authors": ["April"], "date": "2020-04-08", "keywords": ["public", "right", "community", "feb", "state", "spread", "governor", "health", "coronavirus", "louisiana", "suggestion", "mardi", "gras", "canceled"], "summary": "In retrospect, if you knew then what you know now, would you have canceled Mardi Gras?\"\n\"There was not a single suggestion by anyone, a doctor, a scientist, a political figure, that we needed to cancel Mardi Gras.\nPolitiFact wondered if it’s true that there were no suggestions back in January or February that mass gatherings like Mardi Gras be canceled.\nThe earliest suggestion we found from a federal agency saying that large events may need to be canceled came Feb. 26, after Mardi Gras celebrations.\nOn Lundi Gras, the day before Mardi Gras, he tweeted:The Coronavirus is very much under control in the USA."}, {"url": "https://www.shreveporttimes.com/story/sports/college/2020/04/14/louisiana-tech-konkol-lswa-coach-year-lsu-mays-all-louisiana/2992073001/", "title": "Konkol, Mays lead 2020 LSWA All-Louisiana college basketball honors", "authors": ["Staff Reports", "Published P.M. Ct April"], "date": "2020-04-14", "keywords": ["lsu", "sr", "2020", "ppg", "points", "konkol", "lead", "lswa", "mays", "louisiana", "college", "basketball", "jr", "team", "rpg", "alllouisiana", "honors", "g", "baton"], "summary": "CLOSELouisiana Tech's Eric Konkol was named Coach of the Year for the 2020 LSWA All-Louisiana Men's Basketball Team.\nSkylar Mays, LSU – G, Sr., Baton Rouge, La., 16.7 ppg., 5.0 rpg., 3.2 rpg.\nThird TeamKae'Ron Baker, Louisiana College – G, Jr., Navasota, Texas, 19.8 ppg., 5.3 rpg., 3.0 apg.\nJavonte Smart, LSU – G, Soph., Baton Rouge, La., 12.5 ppg., 3.5 rpg., 4.2 apg.\nChristion Thompson, Tulane – G, Sr., Gonzales, La., 14.1 ppg., 6.3 rpg., 2.8 apg."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["linebacker", "round", "2020", "usa", "today", "defensive", "2019", "credit", "options", "draft", "stadium", "falcons", "mandatory", "moreround", "nov"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://www.cnbc.com/2020/04/15/coronavirus-live-updates.html", "title": "LA mayor says large gatherings likely banned until 2021, US coronavirus cases top 630,000", "authors": ["Jennifer Elias Kif Leswing Patti Domm", "Jennifer Elias", "Kif Leswing", "Patti Domm", "In"], "date": "2020-04-15", "keywords": ["630000", "coronavirus", "banned", "la", "large", "million", "according", "2021", "mayor", "covid19", "public", "pandemic", "week", "world", "gatherings", "cases", "york", "health", "likely"], "summary": "Zoom has seen enormous growth as more and more workers have been instructed to stay at home during the coronavirus pandemic.\nCNBC Make It rounded up a list of insurance companies that have announced initiatives for drivers during the current coronavirus health crisis.\n—Megan Leonhardt12:02 pm: McDonald's relationship with US franchisees is fraying over coronavirus reliefThe coronavirus pandemic is straining McDonald's relationship with its U.S. franchisees once again.\n\"Halting funding for the World Health Organization during a world health crisis is as dangerous as it sounds,\" Gates said on Twitter early Wednesday morning.\nTrump said Tuesday the U.S. will suspend funding to the WHO while it reviews the agency's response to the Covid-19 pandemic."}, {"url": "https://uk.news.yahoo.com/white-house-corona-virus-advisor-021133247.html", "title": "White House coronavirus advisor Fauci suggests sports could restart under limited circumstances", "authors": [], "date": "2020-04-16", "keywords": ["fauci", "play", "restart", "advisor", "limited", "white", "nationals", "coronavirus", "soundbite", "think", "circumstances", "house", "washington", "season", "united", "baseball", "suggests", "states"], "summary": "VIDEO SHOWS: U.S. DIRECTOR OF THE NATIONAL INSTITUTE OF ALLERGY AND INFECTIOUS DISEASES AND MEMBER OF THE WHITE HOUSE CORONAVIRUS TASK FORCE DR. ANTHONY FAUCI BEING INTERVIEWED ON SNAPCHAT / SOUNDBITES ON RESUMING SPORT EVENTS / FILE OF COLLEGE FOOTBALL, WASHINGTON NATIONALS (BASEBALL)SHOWS: WASHINGTON, DC.UNITED STATES.\n(SOUNDBITE) (English) PETER HAMBY, SAYING\"Do you think those sports season are in jeopardy?\nyou have the world champion Washington Nationals I want to see them pay again.\"\nWEST PALM BEACH, FLORIDA, UNITED STATES (FILE) WASHINGTON NATIONALS-MUST COURTESY WASHINGTON NATIONALS)NATIONALS AT SPRING TRAINING5.\nyou have the world champion Washington, Nationals I want to see them pay again.\""}, {"url": "https://newslagoon.com/la-rams-pre-2020-nfl-draft-meetings-summary-by-position/18330/", "title": "LA Rams pre-2020 NFL Draft meetings summary by position", "authors": ["Team Newslagoon"], "date": "2020-04-16", "keywords": ["edge", "meetings", "position", "defensive", "meeting", "summary", "nfl", "rams", "draft", "team", "players", "pre2020", "la"], "summary": "LA Rams hold 7 picks in 2020 NFL Draft.\nLet’s revisit their pre-draft meetings by position for the answerThe LA Rams, like all NFL teams, were instructed to cease direct meetings with 2020 NFL Draft prospects as a precautionary measure to thwart the spread of the contagious COVID-19.\nAt the time, we had drawn up a rather detailed article analyzing who the Rams had held meetings with at or around the time of the 2020 NFL Scouting Combine.\nNext: LA Rams ST Coordinator John Bonamego starts off on right footThe time awaiting the 2020 NFL Draft is drawing to a close for the LA Rams.\nEntering the draft with seven picks will mean the team will be able to address some needs."}, {"url": "https://www.fox8live.com/2020/04/09/louisiana-state-rep-reggie-bagala-after-battle-with-covid-coronavirus/", "title": "Louisiana state Rep. Reggie Bagala dies after battle with COVID-19 coronavirus", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2020-04-09", "keywords": ["reggie", "rep", "battle", "served", "state", "bagala", "saddened", "coronavirus", "true", "representative", "servant", "say", "dies", "serve", "covid19", "louisiana", "yesterday"], "summary": "“We are all deeply saddened to learn the passing of State Representative Reggie Bagala, who just yesterday lost his battle with COVID-19.\nRep. Bagala served his community and state with passion and dedication, leaving behind a legacy that demonstrates the heart of a true public servant.\nI know I join all of my colleagues in the legislature when I say that it was an honor to serve beside him."}, {"url": "https://www.brproud.com/sports/geaux-black-and-gold/is-alvin-kamara-next-in-line-for-major-payday/", "title": "Is Alvin Kamara next in line for major payday?", "authors": ["Brian Holland", "Brooke Kirchhofer", "Jared Joseph"], "date": "2020-04-14", "keywords": ["rule", "clubsthe", "competition", "committee", "alvin", "payday", "kamara", "line", "changes", "released", "major", "nfl", "proposed", "suggested", "season"], "summary": "The NFL on Friday, April 10 released the proposed rule changes for the 2020 season suggested by the Competition Committee and clubs,The proposed rule changes from the Competition Committee:"}, {"url": "https://www.usatoday.com/story/money/2020/04/09/coronavirus-30-places-where-recession-could-hit-hardest/2964955001/", "title": "New York, Gilpin are among the places a COVID-19 recession will likely hit hardest", "authors": ["Samuel Stebbins", "Michael B. Sauter", "Published A.M. Et April"], "date": "2020-04-09", "keywords": ["workforce", "hit", "industries", "population", "area", "2020", "rate", "york", "metropolitan", "likely", "recession", "county", "hardest", "covid19", "gilpin", "places", "cases"], "summary": "To identify the places a COVID-19 recession will likely hit hardest, 24/7 Wall St. created an index comprising three measures: employment in highly-exposed industries, COVID-19 infection rates, and population density.\nAs of the end of March, there have been 45 confirmed cases of COVID-19 in Harrison County and one death.\nWe only considered counties and county equivalents that fall within a metropolitan area because metro areas are typically hubs of economic activity.\nData on COVID-19 cases and deaths by county and state came from the New York Times and are current as of March 31, 2020.\nCOVID-19 cases and death toll were adjusted for population using five-year estimates from the U.S. Census Bureau’s 2018 American Community Survey."}, {"url": "https://247wallst.com/special-report/2020/04/06/the-places-a-covid-19-recession-will-likely-hit-hardest/", "title": "The Places a COVID-19 Recession Will Likely Hit Hardest – 24/7 Wall St.", "authors": [], "date": "2020-04-06", "keywords": ["hit", "economic", "industries", "unemployment", "wall", "places", "coronavirus", "likely", "247", "hardest", "covid19", "st", "recession"], "summary": "The Places a COVID-19 Recession Will Likely Hit Hardest Samuel Stebbins, Michael B. SauterThere have been over 350,000 confirmed cases of COVID-19 and more than 10,000 related deaths in the United States to date.\nTo identify the places a COVID-19 recession will likely hit hardest, 24/7 Wall St. created an index comprising three measures: employment in highly-exposed industries, COVID-19 infection rates, and population density.\nThe bill, which will provide financial relief for families and businesses, has also calmed some investors after a historic sell-off on Wall Street.\nStill, the economic devastation wrought by the efforts to contain the spread of the coronavirus will likely be felt long after the pandemic ends.\nClick here to see the places a COVID-19 recession will likely hit hardestClick here to read our methodology"}, {"url": "https://newslagoon.com/la-chargers-why-drafting-jalen-hurts-is-more-realistic-than-you-think/17862/", "title": "LA Chargers: Why drafting Jalen Hurts is more realistic than you think", "authors": ["Team Newslagoon"], "date": "2020-04-15", "keywords": ["season", "quarterbacks", "fans", "drafting", "market", "think", "nfl", "quarterback", "draft", "realistic", "chargers", "going", "hurts", "jalen", "team", "la"], "summary": "The 2020 NFL Draft is deeper at quarterback than previous years and there was a robust quarterback free-agent market, although the Chargers were not active on that market.\nAs we head into the 2020 NFL Draft, there are three quarterbacks that fans are talking about as potential selections for the LA Chargers.\nIt might seem like a guarantee that the Chargers are going to get one of those three guys, but that is not the case.\nThe NFL Draft is always full of surprises and perhaps this first virtual NFL Draft could provide a big surprise for the Chargers: drafting Jalen Hurts.\nHurts was one of the biggest names in college football last season but is not a highly-touted quarterback like those three."}, {"url": "https://www.fox8live.com/2020/04/13/what-you-need-know-stimulus-payments-social-security-supplemental-security-income/", "title": "What you need to know: Stimulus payments for Social Security and Supplemental Security Income", "authors": ["Published At Pm"], "date": "2020-04-13", "keywords": ["survivors", "security", "supplemental", "stimulus", "know", "return", "social", "webpage", "tax", "need", "retirement", "payments", "receive", "wwwirsgovcoronaviruseconomicimpactpayments", "income", "waiting"], "summary": "People who receive Social Security retirement, survivors, or disability insurance benefits and who did not file a tax return for 2018 or 2019 and who have qualifying children under age 17 should now go to the IRS’s webpage at www.irs.gov/coronavirus/economic-impact-payments to enter their information instead of waiting for their automatic $1,200 Economic Impact Payment."}, {"url": "https://www.latimes.com/california/story/2020-04-12/coronavirus-attention-impeachment-primaries-kobe", "title": "Impeachment. Primaries. Kobe. Coronavirus rushed in while our focus was elsewhere", "authors": ["James Rainey Has Covered Multiple Presidential Elections", "The Media", "The Environment", "Mostly At The Los Angeles Times", "Which He First Joined In He Was Part Of Times Teams That Won Three Pulitzer Prizes.", "Kiera Feldman Joined The Los Angeles Times As An Investigative Reporter In She Came Propublica", "Where Her Reporting On New York City S Private Trash Industry Exposed Labor Abuses", "Corruption", "Leading To A Federal Investigation", "New City Laws. She Won The Livingston Award In For An Investigation Of College Sexual Assault Mishandling. A Longtime Magazine Journalist"], "date": "2020-04-12", "keywords": ["times", "primaries", "occasionally", "weeksign", "newsletter", "shaping", "sent", "impeachment", "coronavirus", "promotional", "kobe", "focus", "rushed", "receive", "upyou", "speed"], "summary": "Newsletter The stories shaping CaliforniaGet up to speed with our Essential California newsletter, sent six days a week.\nSign Me UpYou may occasionally receive promotional content from the Los Angeles Times."}, {"url": "https://news.clearancejobs.com/2020/04/15/raytheon-missile-systems-awarded-9-million-to-procure-digital-focal-plane-array-prototype-for-navy-and-air-force/", "title": "Raytheon Missile Systems Awarded $9 Million to Procure Digital Focal Plane Array Prototype for Navy and Air Force", "authors": [], "date": "2020-04-15", "keywords": ["raytheon", "2020", "procure", "focal", "contracting", "plane", "million", "force", "navy", "prototype", "fiscal", "systems", "performed", "missile", "funds", "contract", "support", "awarded", "work"], "summary": "Fiscal 2020 operations and maintenance (Navy) funds in the amount of $9,624,915; fiscal 2020 working capital (Navy) funds in the amount of $2,435,821; fiscal 2020 other procurement (Navy) funds in the amount of $1,410,800; and fiscal 2020 aircraft procurement (Navy) funds in the amount of $590,600 will be obligated at time of award, $9,624,915 of which will expire at the end of the current fiscal year.\nRaytheon Missile Systems, Tucson, Arizona, was awarded a $9,224,337 modification (P00074) to exercise an option to previously awarded cost-plus-fixed-fee contract N00019-15-C-0121 to procure a Digital Focal Plane Array prototype for the Navy and Air Force.\nAIR FORCEThe Boeing Co., Seattle, Washington, has been awarded an $84,000,000 firm-fixed-price contract modification (P00068) to previously awarded contract FA8625-16-C-6599 for VC-25B technical publications.\nFiscal 2020 civil construction funds in the amount of $15,885,000 were obligated at the time of the award.\nFiscal 2020 military construction, Army funds in the amount of $7,633,085 were obligated at the time of the award."}, {"url": "https://www.wdsu.com/article/new-orleans-louisiana-named-top-2020-destinations-to-visit-by-travel-website/30616072", "title": "New Orleans and Louisiana named top 2020 destinations to visit by travel website", "authors": ["Wdsu Digital Team", "Https", "Www.Facebook.Com"], "date": "2020-01-21", "keywords": ["website", "votes", "orleans", "state", "destinations", "2020", "overall", "according", "named", "cities", "visit", "travel", "discover", "louisiana", "websitetrips", "states"], "summary": "5 spot among the top 10 U.S. states with the most overall votes.\nHawaii was the top state and Denver was the top city.Check out more information from the website here.\nThe Big Easy and the Bayou State are being recognized as two top destinations in 2020 by a national travel website.\n5 spot among the top 10 U.S. states with the most overall votes.\n2 among U.S. cities with the most overall votes, according to the website."}, {"url": "https://www.wwltv.com/article/news/crime/27-people-have-been-killed-in-new-orleans-this-year-all-but-one-were-shot-to-death/289-1d5b5a93-f08e-45fa-b0ec-fa27c493326c", "title": "27 people have been killed in New Orleans through two months of 2020", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Pm Cst March", "Updated"], "date": "2020-03-02", "keywords": ["month", "suspect", "records", "orleans", "months", "murder", "jan", "2020", "murders", "information", "killed", "27", "nopd"], "summary": "NEW ORLEANS — Sixty days into the year, New Orleans has seen at least 27 people killed since Jan. 1.\nA vast majority of the time, police list no suspect information in their initial reports for the murder investigations.\nIn 14 of the 15 reports reviewed by WWL-TV, no suspect information was available after investigators finished their preliminary investigation into the murders.\nAccording to initial information released about the 11 killings, no suspect information was available for any of them.\nCrime analyst Jeff Asher's records show 120 people were killed in 2019 according to The Times-Picayune | The New Orleans Advocate."}, {"url": "https://www.fox8live.com/2020/01/16/orleans-city-council-approves-mardi-gras-schedule-route-changes-also-discussed/", "title": "Orleans city council approves 2020 Mardi Gras schedule, route changes also discussed", "authors": ["Josh Roberson", "Published At Pm"], "date": "2020-01-16", "keywords": ["sets", "city", "approves", "say", "moreno", "discussed", "route", "season", "members", "gras", "orleans", "motion", "ok", "changes", "parade", "mardi", "seconded", "council", "schedule"], "summary": "“Ok members this is an easy one, it does exactly what the clerk just said, it sets the parade schedule for the new season,” Moreno said.\n“So, I will make a motion to approve and it's been seconded by council member Guirusso.\nall in favor say eye.\""}, {"url": "https://www.fox8live.com/2020/01/10/new-orleans-gets-special-security-clearance-advance-trump-visit/", "title": "New Orleans gets special security clearance in advance of Trump visit", "authors": ["Rob Masson", "Published At Pm"], "date": "2020-01-10", "keywords": ["security", "urge", "orleans", "rock", "special", "clearance", "site", "vehicle", "restrictons", "remains", "try", "visit", "walk", "traffic", "advance", "gets", "st", "trump"], "summary": "One of the big issues, will be traffic.\nCanal St. remains closed around the Hard Rock site, and vehicle restrictons will go into place in the French Quarter Saturday night.\nOfficials urge everyone to allow themselves extra time, be patient, and try to walk to your destination, if possible."}, {"url": "https://www.wwltv.com/article/entertainment/events/what-to-know-for-new-years-sugar-bowl-2020-in-new-orleans/289-8683ce9a-0c8f-479d-8d16-54e10faf0197", "title": "What to know for New Year's, Sugar Bowl 2020 in New Orleans", "authors": ["Author", "Sean Brennan", "Eyewitess News", "Published", "Pm Cst December", "Updated"], "date": "2019-12-31", "keywords": ["canal", "orleans", "street", "know", "2020", "french", "bowl", "dumaine", "eve", "sugar", "streets", "service", "st", "quarter"], "summary": "The annual festivities will impact driving, parking and more around the French Quarter, Central Business District and the Marigny starting Monday night and lasting until Thursday.\nEvents:New Year's Eve (Tuesday, Dec. 31) firework shows are set for both New Orleans East and the French Quarter, according to Mayor LaToya Cantrell.\nThere are fan events around the Superdome and French Quarter leading up the game, including the Allstate Fan Fest and the Sugar Bowl Fan Jam, which kicks off at 4 p.m. in Champions Square on New Year's Day.\nTraffic and Parking Restrictions:City officials say to expect heavy vehicle and foot traffic around the Superdome and French Quarter.\nDuring the Sugar Bowl parade (2 p.m. to 5 p.m.), there will be no streetcar service between the riverfront and Carondelet Street."}, {"url": "https://www.fox8live.com/2020/01/29/what-is-next-new-orleans-east-deacon-frustrated-after-targeted-twice-month/", "title": "’What is next:’ New Orleans East Deacon frustrated after targeted twice in a month", "authors": ["Tiffany Wong", "Published At Pm"], "date": "2020-01-29", "keywords": ["month", "scene", "targeted", "let", "orleans", "frustrated", "dont", "father", "unfortunately", "wish", "twice", "oh", "identified", "deacon", "east", "victim", "came"], "summary": "\"Father came from the altar, and he said several cars have been broken into, and the police are on the scene.\nSo when we came out, I said, oh please don't let it be my car, but unfortunately, that was not the case,\" one victim, who did not wish to be identified, said."}, {"url": "https://www.klfy.com/community/festivals/jazz-fest-announces-2020-lineup/", "title": "New Orleans Jazz Fest announces 2020 lineup", "authors": ["Klfy Staff", "Nikki Henderson", "Caroline Marcello"], "date": "2020-01-16", "keywords": ["lineup", "orleans", "tribute", "puerto", "2020", "music", "rico", "brass", "john", "neville", "announces", "band", "fest", "jazz"], "summary": "The Who, Dead & Company, Stevie Nicks, Foo Fighters, Lizzo, Lionel Richie, The Lumineers, The Black Crowes, Lenny Kravitz, Brandi Carlile, The Avett Brothers, Norah Jones, Trombone Shorty, Erykah Badu, H.E.R., The Beach Boys, The Revivalists, Elvis Costello, Irma Thomas and more than 600 more to appear at the 2020 New Orleans Jazz Fest April 23 – April 26 & April 30 – May 3.\nNEW ORLEANS, La.\n(January 16, 2020)—The New Orleans Jazz & Heritage Festival announced the music lineup for the 2020 festival scheduled for April 23 – 26 and April 30 – May 3.\nWith 14 stages and more than 650 bands performing virtually “every kind of American music, Jazz Fest presents one of the world’s most diverse music festival lineups,” the announcement said today.\nTickets go on sale to the general public today at 12 p.m. via nojazzfest.com."}, {"url": "https://www.fox8live.com/2020/01/23/tech-companies-begin-installing-g-poles-new-orleans/", "title": "Tech companies begin installing 5G poles in New Orleans", "authors": ["Rilwan Balogun", "Published At Pm"], "date": "2020-01-23", "keywords": ["5g", "stick", "right", "sign", "orleans", "tech", "university", "radiation", "transmitter", "poles", "cellphone", "theres", "research", "world", "begin", "companies", "installing"], "summary": "“There’s been a lot of research and health agencies around the world have looked at the data and I don’t see any clear sign of a problem,” said University of Pennsylvania Bioengineer Professor Kenneth Foster.\n“A person’s largest exposure to cellphone radiation is when they use a cellphone, they stick the transmitter right to their head.”"}, {"url": "https://www.fox8live.com/2020/01/31/zurik-port-new-orleans-shells-out-thousands-painting-not-easily-accessible-by-public/", "title": "Zurik: Port of New Orleans shells out $50,000 for painting not easily accessible by the public", "authors": ["Lee Zurik", "Cody Lillich", "Published April", "At Pm", "Published March"], "date": "2020-01-31", "keywords": ["easily", "public", "rudelle", "orleans", "street", "port", "piece", "shells", "royal", "accessible", "river", "pierremarie", "zurik", "purchased", "50000", "painting", "mural"], "summary": "The piece of art, Mural of The Port of New Orleans circa 1850s by Pierre-Marie Rudelle, was purchased by the port in 2019 and installed this year on the fourth floor of their headquarters located on the edge of the Mississippi River.\nThe artist was commissioned by a New Orleans couple in 1993 to paint the mural in their Royal Street home."}, {"url": "https://710keel.com/are-film-and-tv-productions-coming-back-to-louisiana/", "title": "Are Film and TV Productions Coming Back to Louisiana?", "authors": ["Erin Mccarty"], "date": "2020-01-02", "keywords": ["productions", "starring", "orleans", "2020", "series", "projects", "night", "coming", "filming", "season", "louisiana", "tv", "film"], "summary": "CLAWS SEASON 4The series Claws starring Niecy Nash will film January 8 through May 15, 2020 in New Orleans.\nONE NIGHT IN MIAMIThe feature film One Night in Miami will film January 7 through February 19, 2020 in Laplace.\nNIGHT TEETHThe feature film Night Teeth will film February 3 through March 13, 2020 in New Orleans.\nDEEP WATERFeature film Deep Water starring Ben Affleck and Ana de Armas is filming through February 14, 2020 in New Orleans.\nNCIS: NEW ORLEANS SEASON 6Television series NCIS: New Orleans Season 6 starring Scott Bakula is filming through April 25, 2020 in New Orleans."}, {"url": "https://www.rollingstone.com/music/music-features/new-orleans-music-scene-bourbon-street-jazz-heritage-fest-944691/", "title": "Beyond Bourbon Street: How New Orleans is Pushing Musical Tradition into the Future", "authors": ["Jesse Will", "Jesse Will'S Most Recent Stories", "Beyond Bourbon Street", "How New Orleans Is Pushing Musical Tradition Into The Future", "How Denver S Live Music Scene Exploded", "The Mustang Grows Up", "And Goes Green", "View All"], "date": "2020-01-30", "keywords": ["orleans", "street", "pushing", "music", "future", "frenchmen", "tradition", "night", "bourbon", "musical", "spots", "youll", "mercurio", "jazz", "ball"], "summary": "New Orleans, where Bourbon Street is only the beginning.\nAny given night in NOLA you can catch traditional jazz, zydeco, swamp pop, funk, rap, and bounce — sometimes on the same bill.\n“When I come back to New Orleans, I go out to listen, to get fed,” she says.\nFind it on FrenchmenSome call Frenchmen Street “Baby Bourbon,” a handful of blocks in the Faubourg Marigny neighborhood that host a concentration of some of the best live-music venues in the city.\nThere’s the New Orleans Jazz & Heritage Festival (April 23rd-28th, May 2nd-3rd) with Lizzo, the Who, Foo Fighters, Stevie Nicks, and Dead & Company headlining."}, {"url": "https://www.225batonrouge.com/things-to-do/january-2020-calendar-events-baton-rouge", "title": "January 2020 calendar of events in Baton Rouge", "authors": [], "date": "2019-12-31", "keywords": ["rouge", "events", "calendar", "art", "theatre", "2020", "music", "local", "event", "night", "museum", "baton", "work"], "summary": "knockknockmuseum.orgJan. 11The 2020 Special Olympics State Bowling Tournament, to be held at All Star Lanes in Baton Rouge, is a one-day, state-level competition open to bowlers of multiple skill levels from across the state.\nbatonrougegallery.orgJan. 25-26Bar Crawl Unlimited comes to Baton Rouge for two bar crawl events—the Margarita Crawl and the Mimosa Crawl.\ndmae.lsu.eduMUSIC EVENTS: THIS MONTH’S BEST BETSJAN. 4New Orleans songwriter Kristin Diable’s sound comes to Baton Rouge at Dyson House Listening Room at Zeeland Street.\nlouisianastatemuseum.orgJAN. 23The Baton Rouge Symphony Orchestra presents its Mozart Birthday Bash!\nbrso.orgJAN. 27One of pop-surrealism’s top artists, Dan Quintana, hosts a lecture on his work at Baton Rouge Gallery."}, {"url": "https://www.wwltv.com/article/news/crime/17-people-killed-january/289-16285a53-3861-4afb-a7c9-b9728384822d", "title": "Counting the Dead: 16 people were murdered in New Orleans last month", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Pm Cst February", "Updated", "Am Cst February"], "date": "2020-02-01", "keywords": ["month", "murder", "orleans", "16", "killed", "city", "murders", "murdered", "dead", "data", "victims", "wwltv", "reported", "jan", "counting"], "summary": "NEW ORLEANS — New Orleans police reported at least 16 murders in January during 15 separate incidents, data compiled by WWL-TV shows.\nAnd from Jan. 23 through Jan. 27, police reported nearly one murder per day in New Orleans.\nThe data indicates there was an eight-day stretch from Jan. 12 through Jan. 19 where no murders were reported.\nThe last time New Orleans had a lower murder count was in 1971, when 116 homicides were reported in the city.\nNote: There were 16 murders in New Orleans in January, not 17."}, {"url": "https://www.fox8live.com/2020/03/01/violent-weekend-nola-represents-uptick-murder-rate/", "title": "Violent weekend in New Orleans could indicate uptick in murder rate for 2020", "authors": ["Josh Roberson", "Published At Pm"], "date": "2020-03-01", "keywords": ["violent", "murder", "orleans", "ward", "taken", "shot", "2020", "rate", "n", "tonti", "succumbed", "injuries", "separate", "men", "uptick", "shootings", "weekend", "indicate"], "summary": "Then, two separate shootings in the 7th Ward.\nThe first happened at the 2000 block of N. Tonti where three men were shot and taken to the hospital and one succumbed to his injuries."}, {"url": "https://www.fox8live.com/2020/01/20/martin-luther-king-day-reminds-people-new-orleans-dream/", "title": "Martin Luther King Day reminds people in New Orleans to dream", "authors": ["Chris Finch", "Published At Pm"], "date": "2020-01-20", "keywords": ["important", "orleans", "martin", "luther", "kids", "day", "long", "regards", "reminds", "realize", "opioid", "robert", "king", "midnight", "old", "dream", "ive"], "summary": "“It was very important.\nI’ve been here since 1968,” Robert Dawson of the Franklin Ave. Baptist Church said.\n“I have a grandson who is going to be 2 years old.\nHe must realize that his destiny fulfill for what God has for him.\nAs long as our kids see dope as hope as long as America is in midnight as regards to the opioid epidemic.”"}, {"url": "https://www.klfy.com/louisiana/5th-ward-weebie-new-orleans-rapper-and-bounce-music-pioneer-has-died/", "title": "5th Ward Weebie, New Orleans rapper and bounce music pioneer, has died", "authors": ["Klfy Staff", "Britt Lofaso"], "date": "2020-01-09", "keywords": ["5th", "ward", "pioneer", "orleans", "music", "bounce", "rib", "weebie", "died", "p", "jerome", "rapper", "came"], "summary": "5th Ward Weebie, whose given name is Jerome Cosey, came to prominence in the ’90s as Bounce music became popular in New OrleansNEW ORLEANS (WWL-TV) — 5th Ward Weebie, a rapper, actor and record producer who brought New Orleans bounce to the world, has died.\nOne of 5th Ward Weebie’s representatives confirmed his death to WWL-TV Thursday.\nAccording to New Orleans rapper P Town Moe, Weebie died of complications after having a heart attack.\n“I don’t know why God wanted him at this time, but my brother gone.”5th Ward Weebie, whose given name is Jerome Cosey, came to prominence in the 90s as Bounce music became popular in New Orleans.\n“It broke my heart to learn that Jerome Cosey — our 5th Ward Weebie — has passed."}, {"url": "https://www.katc.com/news/covering-louisiana/snap-demands-response-from-new-orleans-saints", "title": "SNAP demands response from New Orleans Saints", "authors": [], "date": "2020-01-28", "keywords": ["public", "orleans", "demands", "release", "saints", "victims", "football", "response", "team", "abuse", "archdiocese", "snap"], "summary": "— The Survivor Network of those Abused by Priests, or SNAP, wants answers from the New Orleans Saints football team.\nToday, SNAP says they are demanding that the Saints release the emails, and they're asking the NFL to intervene.\n\"SNAP is extremely alarmed by the news that the New Orleans Saints football team is refusing to release the emails between it and the Archdiocese of New Orleans,\" a release from SNAP reads.\n“The survivors, family members of victims, and children of Louisiana deserve a formal apology from the Archdiocese of New Orleans, the New Orleans Saints football organization, and the National Football League,” said Richard Windmann, SNAP Louisiana leader.\nIt seems very clear to SNAP that the New Orleans Archdiocese is willing to go to great lengths in order to massage public understanding of Catholic abuse in Louisiana.\""}, {"url": "https://www.fox8live.com/2020/01/17/mayor-new-orleans-will-now-implode-hard-rock-collapse-site/", "title": "Mayor: New Orleans will now implode Hard Rock collapse site", "authors": ["Chris Finch", "Published At Pm"], "date": "2020-01-17", "keywords": ["specific", "implode", "orleans", "rock", "early", "win", "site", "hard", "building", "come", "timeline", "mayor", "cantrell", "collapse", "midmarch", "collasped", "demolished"], "summary": "Cantrell did not give a specific timeline as to win the building will be demolished, but it could come down as early as mid-March.\nThe building collasped in October."}, {"url": "https://www.nytimes.com/2020/04/13/us/coronavirus-new-orleans-mardi-gras.html", "title": "Why New Orleans Pushed Ahead With Mardi Gras, Even as It Planned for Coronavirus", "authors": ["Richard Fausset", "Derek Kravitz"], "date": "2020-04-13", "keywords": ["pushed", "director", "orleans", "ahead", "suspected", "emergency", "city", "coronavirus", "suggesting", "medical", "travel", "suggested", "mardi", "citys", "gras", "planned", "told"], "summary": "William T. Salmeron, the chief of Emergency Medical Services for the city, told his colleagues that workers should take “routine exposure control precautions” as they would in dealing with any respiratory illness.\nThose included getting the travel history of anyone with symptoms, giving patients surgical masks, and moving up to gloves, gown, protective eyewear and an N95 mask “if travel history risk factors warrant.”“At this time the potential risk of infection in the US is LOW,” he wrote.\nCollin M. Arnold, director of the city’s homeland security office, sent an email to Dr. Avegno and other city officials on Jan. 27, suggesting they “should probably get together and discuss public safety concerns during Mardi Gras and on the parade route.”The New Orleans Police Department, he said, had been asking about personal protective equipment “and general concerns (they shake a lot of hands and come in contact with a lot of people on the route every day).” He suggested putting together a “guide sheet for all responders” that would offer them “common sense mitigation tasks.”That same day, Tyrell Morris, the executive director of the city’s 911 service, told city officials about a questionnaire and worksheet that the International Academies of Emergency Dispatch was suggesting they use for all suspected coronavirus patients.\nDr. Emily Nichols, the medical director for the city’s emergency medical services, suggested they add a question asking suspected carriers whether they had been within six feet of another person thought to be infected with the virus."}, {"url": "https://www.nytimes.com/2020/03/26/us/coronavirus-louisiana-new-orleans.html", "title": "New Orleans Faces a Virus Nightmare, and Mardi Gras May Be Why", "authors": ["Katy Reckdahl", "Campbell Robertson", "Richard Fausset"], "date": "2020-03-26", "keywords": ["really", "virus", "patients", "orleans", "know", "patient", "care", "think", "recording", "faces", "say", "im", "going", "mardi", "gras", "nightmare"], "summary": "And there’s always going to be somebody who says, you know that’s OK. And that especially happens during Mardi Gras.\nmichael barbaroToday: My colleague Megan Twohey speaks with a nurse on the front lines of the virus in New Orleans.\nmegan twoheyI really, really appreciate it.\nmegan twoheyAnd looking back, given everything that’s happened since then, given everything you’ve been through, how do you think about Mardi Gras now?\nBut I do think that Mardi Gras is going to be the Mardi Gras before the world changed."}, {"url": "https://www.fox8live.com/2020/03/28/video-new-orleans-mayor-cantrell-says-city-saw-no-reason-cancel-mardi-gras-needs-medical-supplies/", "title": "VIDEO: New Orleans Mayor Cantrell says city saw no reason to cancel Mardi Gras, needs medical supplies", "authors": ["Chris Finch", "Published At Pm"], "date": "2020-03-28", "keywords": ["protection", "supplies", "personnel", "offices", "relates", "ppe", "video", "mayor", "gras", "medical", "personal", "orleans", "saw", "reason", "mardi", "state", "needs", "need", "responders"], "summary": "“As for the need of PPE (personal protection equipment), it has been a need for New Orleans and the state since our first case on March 9.\nOur first responders, or medical personnel, even as it relates to our mortuaries, our coroner’s offices, our funeral homes, we’re all in need of PPE and that continues to grow,” Cantrell said."}, {"url": "https://nymag.com/intelligencer/2020/03/the-coronavirus-outbreak-devastates-new-orleans-louisiana.html", "title": "New Orleans Is Becoming a New Epicenter of the Coronavirus Outbreak", "authors": ["Adam K. Raymond"], "date": "2020-03-26", "keywords": ["spell", "virus", "orleans", "state", "dr", "coronavirus", "think", "outbreak", "louisiana", "epicenter", "mardi", "gras", "medical"], "summary": "We have not begun to flatten the curve.”Areas in and around New Orleans have been hit hardest.\nOrleans Parish now has the highest number of deaths per capita of any county in the country.\nLambeth House in New Orleans has seen 42 residents test positive for the virus and 11 die.\nThe Times reports:“I think it all boils down to Mardi Gras,” said Dr. F. Brobson Lutz Jr., a former health director of New Orleans and a specialist in infectious disease.\nIf Mardi Gras sparked the outbreak in Louisiana, Tony Spell may help ensure it keeps going."}, {"url": "https://www.thejakartapost.com/news/2020/03/27/mardi-gras-a-perfect-storm-for-virus-spread-in-new-orleans-.html", "title": "Mardi Gras a 'perfect storm' for virus spread in New Orleans", "authors": ["The Jakarta Post"], "date": "2020-03-27", "keywords": ["virus", "orleans", "street", "spread", "perfect", "coronavirus", "told", "throwing", "gee", "louisiana", "mardi", "storm", "gras", "cases"], "summary": "\"Mardi Gras was the perfect storm for the spread of this virus,\" said Rebekah Gee, Louisiana's former health secretary.\n\"Not only did we have people in floats, people in parties, but people from all over the world came here,\" Gee told the MSNBC network.\nLouisiana reported its first case of coronavirus on March 9, about two weeks after Mardi Gras culminated with its final street parades on February 25.\nArnold agreed that Mardi Gras was probably responsible for the fact that the number of virus cases in Louisiana is rising at a rate higher than anywhere else in the country.\nAmong those who have contracted coronavirus in Louisiana is Sean Payton, coach of the 2010 Super Bowl champion New Orleans Saints."}, {"url": "https://www.nbcnews.com/news/us-news/new-orleans-epicenter-coronavirus-mardi-gras-could-be-blame-doctors-n1167741", "title": "New Orleans is a center of coronavirus. Mardi Gras could be to blame, doctors say.", "authors": ["Elisha Fieldstadt", "Elisha Fieldstadt Is A Breaking News Reporter For Nbc News."], "date": "2020-03-24", "keywords": ["sayas", "orleans", "blame", "louisianas", "center", "coronavirus", "deaths", "say", "doctors", "mardi", "gras", "states"], "summary": "New Orleans is a center of coronavirus.\nMardi Gras could be to blame, doctors say.\nAs of Tuesday afternoon, New Orleans had 567 of Louisiana's 1,388 cases of the coronavirus and 20 of the state's 46 deaths."}, {"url": "https://www.nytimes.com/2020/04/15/us/essence-fest-canceled-coronavirus.html", "title": "Essence Festival Canceled Amid Coronavirus Outbreak in New Orleans", "authors": ["Sandra E. Garcia"], "date": "2020-04-15", "keywords": ["amid", "workshops", "unique", "orleans", "thousands", "spread", "coronavirus", "wellbeing", "statement", "festival", "essence", "outbreak", "weekend", "canceled"], "summary": "Essence magazine’s annual festival, which draws hundreds of thousands of people to New Orleans over the Fourth of July weekend to celebrate black culture, was canceled Wednesday to prevent the further spread of the coronavirus.\n“From the beginning, we have shared that the health, safety and well-being of our festivalgoers, local citizens and others who contribute to making the festival such a unique experience were our top concerns,” festival organizers said in a statement, “and would be the foremost considerations in our decision-making.”The festival hosts citywide events over the holiday weekend that include concerts and workshops on economic empowerment, advocacy and entrepreneurship.\nLast year, Mayor LaToya Cantrell of New Orleans and Essence magazine agreed that the city would host the festival for the next five years.\nThe festival has brought in around $280 million annually to New Orleans in recent years, a spokeswoman for Essence said."}, {"url": "https://www.nytimes.com/2020/04/08/opinion/coronavirus-new-orleans-mardi-gras.html", "title": "New Orleans’ Vibe Mid-Coronavirus, Post Mardi Gras - The New York Times", "authors": ["Maurice Carlos Ruffin"], "date": "2020-04-08", "keywords": ["volkswagen", "times", "orleans", "stay", "know", "id", "whove", "vibe", "york", "midcoronavirus", "post", "weeks", "covid19", "usually", "mardi", "gras", "worker"], "summary": "That I’ve lost count of the people I know who have Covid-19 — and know a couple of people who’ve died — doesn’t make it easier to take.\nMy mother, a retired health care worker, hasn’t been out of her apartment in almost three weeks.\nIn ordinary times, I’d pick her up and ferry her from the A.T.M.\nAnd usually, I’d stay in the car.\nBut this is the compromise, the only thing stopping her from calling a cab and doing it all herself."}, {"url": "https://slate.com/news-and-politics/2020/04/new-orleans-mardi-gras-coronavirus.html", "title": "Stop Shaming New Orleans for Holding Mardi Gras", "authors": ["Jordan Hirsch"], "date": "2020-04-02", "keywords": ["orleans", "street", "shaming", "holding", "city", "federal", "lewis", "mardi", "covid19", "louisiana", "black", "stop", "gras"], "summary": "The traditional Skull and Bone Gang wake up residents of the Tremé neighborhood of New Orleans on Mardi Gras morning.\nThis year, as always, Mardi Gras Indians converged on the Sportsman’s Corner bar at Second and Dryades in Central City.\nTheresa Elloie and her family have hosted the Mardi Gras Indians at Sportsman’s Corner for generations.\nNo one on the street on Mardi Gras Day realized they were already facing an immediate threat.\nOn Thursday on The View, Meghan McCain told Cantrell she was “surprised the Mardi Gras celebrations continued” in February."}, {"url": "https://www.politifact.com/factchecks/2020/apr/08/john-bel-edwards/louisiana-governor-right-there-was-no-suggestion-m/", "title": "Louisiana governor is right, there was no suggestion Mardi Gras had to be canceled", "authors": ["April"], "date": "2020-04-08", "keywords": ["public", "right", "community", "feb", "state", "spread", "governor", "health", "coronavirus", "louisiana", "suggestion", "mardi", "gras", "canceled"], "summary": "In retrospect, if you knew then what you know now, would you have canceled Mardi Gras?\"\n\"There was not a single suggestion by anyone, a doctor, a scientist, a political figure, that we needed to cancel Mardi Gras.\nPolitiFact wondered if it’s true that there were no suggestions back in January or February that mass gatherings like Mardi Gras be canceled.\nThe earliest suggestion we found from a federal agency saying that large events may need to be canceled came Feb. 26, after Mardi Gras celebrations.\nOn Lundi Gras, the day before Mardi Gras, he tweeted:The Coronavirus is very much under control in the USA."}, {"url": "https://www.marketplace.org/2020/04/01/the-economic-impact-of-covid-19-is-magnified-in-new-orleans/", "title": "The economic impact of COVID-19 is magnified in New Orleans", "authors": ["Rhodes Murphy"], "date": "2020-04-01", "keywords": ["impact", "economic", "orleans", "state", "gig", "magnified", "tourism", "city", "dependent", "economy", "covid19", "louisiana", "workers", "citys"], "summary": "The sudden and severe impact on the workforce surprised even those who know the city’s economy best, including Quentin Messer, president of the New Orleans Business Alliance.\nA view of empty Bourbon street in the French Quarter on March 27, 2020 in New Orleans, Louisiana.\nThe organization’s research found that about 16,000 to 20,000 New Orleanians depend on the gig economy.\nBut not all gig workers qualify under the stimulus package.\n“This is, in many ways, the perfect storm for disrupting the Louisiana economy,” Barnes said."}, {"url": "https://www.seatrade-maritime.com/ports-logistics/keeping-essential-maritime-businesses-working-us", "title": "Keeping essential maritime businesses working the US", "authors": [], "date": "2020-04-16", "keywords": ["businesses", "essential", "mississippi", "line", "maritime", "miles", "working", "rescues", "louisiana", "federal", "directives", "late", "keeping"], "summary": "The bottom line is that shipping and maritime activities, and the supply chains which feed them, are deemed to be “Essential Businesses”- which are allowed to stay open.\nOf course, the devil is in the details- with companies and trade associations seeking clarifications on who is essential.\nMaritime businesses clearly are.\nWhile the heavily attended parades and densely packed gatherings occurred during late February, Louisiana’s “stay at home” directives were only issued in late March, drawing on Federal governmental definitions of “Essential”.\nThe groups are providing rescues of a different sort than waterborne rescues- this time, gathering medical supplies and bringing them to front line health care workers."}, {"url": "https://profootballtalk.nbcsports.com/2020/04/14/new-orleans-mayor-i-dont-think-anyone-has-a-clue-when-saints-will-return/", "title": "New Orleans mayor: “I don’t think anyone has a clue” when Saints will return", "authors": ["Posted Michael David Smith"], "date": "2020-04-14", "keywords": ["right", "orleans", "dont", "clue", "opens", "cantrell", "think", "games", "mayor", "saints", "looking", "definitely", "data", "return"], "summary": "Getty ImagesNew Orleans Mayor LaToya Cantrell offered what may be the only correct answer to the question of when NFL games can be played again: No one knows.\nCantrell said today that the return of the Saints to the Superdome in September is simply not something that anyone is equipped right now to say definitely will happen, or definitely won’t happen.\n“I don’t think anyone has a clue right now,” Cantrell said, via NOLA.com.\nIt’s possible that pro football could return, but without fans in the stands.\n“It’ll all be factored into not only when New Orleans opens back up, but when the state and when the United States truly opens back up to where we are confident and comfortable but safe in going about our way,” she said."}, {"url": "https://www.kplctv.com/2020/04/14/latest-louisiana-news-sports-business-entertainment-am-cdt/", "title": "Latest Louisiana news, sports, business and entertainment at 9:20 p.m. CDT", "authors": ["Published April", "At Am"], "date": "2020-04-14", "keywords": ["business", "theres", "entertainment", "920", "jails", "immigration", "coronavirus", "say", "testing", "supplies", "weeks", "louisiana", "latest", "detainees", "cdt", "states"], "summary": "HOUSTON (AP) — The coronavirus is spreading in immigration detention, with more than 70 detainees in 13 states testing positive and hundreds of others under quarantine.\nU.S. Immigration and Customs Enforcement has started to lower its detainee population to reduce the risk of people getting sick.\nBut people held in immigration jails and their advocates say there’s still not enough protective gear, cleaning supplies or space that allows for social distancing.\nThey fear the number of coronavirus cases will sharply rise in the coming weeks as it has in jails and prisons nationwide.\nDetainees in at least four states say they have been denied masks."}, {"url": "https://www.columbian.com/news/2020/feb/25/after-tragedies-new-orleans-celebrates-end-of-carnival/", "title": "After tragedies, New Orleans celebrates end of Carnival", "authors": ["Rebecca Santana", "Janet Mcconnaughey", "Associated Press"], "date": "2020-02-25", "keywords": ["took", "tragedies", "hit", "orleans", "dressed", "zulu", "end", "carnival", "worried", "floats", "streets", "costumes", "celebrates", "tuesdayin"], "summary": "NEW ORLEANS (AP) — Revelers dressed in costumes and reaching for beads thrown from floats took to the streets as Carnival season reached its peak, their celebration tinged with grief after two paradegoers in New Orleans were hit and killed by floats in the run-up to Fat Tuesday.\nThousands of people lined the streets, dressed in the Mardi Gras colors of purple, green and gold, standing or sitting in lawn chairs, eating food and talking to friends and neighbors.\nIn front of Sadie’s Beauty Salon on Jackson Avenue, Keitra Boutan stood with her daughter.\nWhen asked if she had any concerns about safety in light of the two people who died after getting hit by floats, she said she was always worried about that.\n1 rule: Don’t run up to the floats,” she said while keeping an eagle eye on her daughter."}, {"url": "https://www.eunicetoday.com/news/jobless-rate-sees-steepest-over-month-drop-february-2006", "title": "Jobless rate sees steepest over-the-month drop since February 2006", "authors": [], "date": "2020-03-28", "keywords": ["jobless", "lost", "individuals", "sees", "2020", "number", "steepest", "rate", "2019", "jobs", "2006", "increased", "seasonally", "overthemonth", "gained", "adjusted", "drop"], "summary": "The state’s not seasonally adjusted unemployment rate dropped to 4.3% in February compared to 5.7% in January, according to statistics released Friday by the Bureau of Labor & Statistics.\nThis is the largest over-the-month drop in the not seasonally adjusted unemployment rate since February 2006.\nThe number of not seasonally adjusted employed individuals increased by 28,650 from 1,977,412 in January 2020 to 2,006,062 in February 2020.\nThis is the second highest not seasonally adjusted number of employed for the month of February in the series.\nLouisiana’s seasonally adjusted unemployment rate decreased from 5.3 percent in January 2020 to 5.2 percent in February 2020."}, {"url": "https://www.fox8live.com/2020/04/09/court-ruling-says-emails-between-saints-archdiocese-new-orleans-will-remain-confidential-church-sex-abuse-lawsuit/", "title": "Court recommendation says emails between the Saints and Archdiocese of New Orleans will remain confidential in church sex abuse lawsuit", "authors": ["Kimberly Curth", "Published At Pm"], "date": "2020-04-09", "keywords": ["lawsuit", "talking", "court", "church", "parties", "remain", "sex", "saints", "mary", "privacy", "public", "orleans", "press", "reason", "roy", "confidential", "recommendation", "means", "lot", "emails"], "summary": "“The law is very clear that if a lot of the information is already public and if the parties involved are talking about it in the public then that means there is less reason for privacy and confidentiality and there is more reason for disclosure to the public,” said Associated Press attorney, Mary Ellen Roy in February."}, {"url": "https://www.wafb.com/2020/03/30/supplemental-snap-benefits-response-covid-will-be-issued-many-louisiana-households/", "title": "Supplemental SNAP benefits in response to COVID-19 will be issued to many Louisiana households", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-03-30", "keywords": ["rule", "waiver", "issued", "supplemental", "households", "benefits", "temporarily", "suspended", "unless", "statewide", "requirements", "covid19", "louisiana", "federal", "response", "work", "snap"], "summary": "Also in response to the pandemic, the federal rule that limited Able-Bodied Adults Without Dependents (ABAWDs) to only three months of benefits unless they met federal work requirements has been temporarily suspended.\nThe rule would have gone into effect for 50 non-waived parishes in Louisiana on April 1, following the expiration of a previously obtained statewide waiver."}, {"url": "https://www.latimes.com/california/story/2020-04-15/did-people-take-stay-at-home-orders-seriously-new-cdc-study-suggests-they-did", "title": "People are leaving their homes a lot less. CDC numbers show how much", "authors": ["Staff Writer", "Nicole Santa Cruz Writes The"], "date": "2020-04-15", "keywords": ["cases", "homes", "closures", "spread", "lot", "york", "leaving", "numbers", "stayathome", "orders", "cdc", "data", "policies", "study"], "summary": "Then stay-at-home orders.\nThe data show that in February about 80% of people were leaving home, but by April 1, the percentage of people leaving home varied from 42% to 61%.\nResearchers also saw declines in people leaving home after state stay-at-home orders were issued.\nBy April in New York City, 42% of people were leaving home, compared with 47% of people in San Francisco.\nEthier said people were receiving a lot of information about the spread of the virus as stay-at-home orders were issued."}, {"url": "https://www.nybooks.com/daily/2020/04/11/pandemic-journal-april-6-12/", "title": "Pandemic Journal, April 6–12", "authors": ["Arthur Longworth", "Mira Kamdar", "Christopher Benfey", "Nathaniel Rich", "Ariel Dorfman", "Zoé Samudzi", "Dalia Hatuqa", "Hugh Eakin", "Verlyn Klinkenborg"], "date": "2020-04-11", "keywords": ["612", "live", "virus", "sewing", "pandemic", "state", "day", "social", "journal", "machine", "days", "weeks", "moose"], "summary": "I cut the pieces out of a couple of old cotton dress shirts, and I stitch them together on a sewing machine.\nAnd as the construction becomes more effortless, I begin, more and more, to admire the sewing machine I’m working at.\nMy mother’s sewing machine was a Singer.\nSince the first of those vintage machines entered my life, I’ve watched a lot of sewing machine videos on YouTube.\nThere are no surprises, only a methodical efficiency that comes from years of practice at actual sewing rather than sewing machine repair."}, {"url": "https://www.fox8live.com/2020/02/26/new-orleans-close-contact-with-state-over-coronavirus-concerns/", "title": "New Orleans in close contact with state over coronavirus concerns", "authors": ["Chris Finch", "Published April", "At Pm"], "date": "2020-02-26", "keywords": ["traveling", "right", "virus", "orleans", "state", "traveled", "sent", "coronavirus", "close", "samples", "testing", "place", "overseas", "concerns", "contact", "takes"], "summary": "Right now, testing for the virus only takes place if someone has traveled overseas or is in close contact with someone who has been traveling abroad.\nTesting is not done here locally instead samples are sent to the CDC in Atlanta."}, {"url": "https://www.theguardian.com/world/2020/apr/09/the-cluster-effect-how-social-gatherings-were-rocket-fuel-for-coronavirus", "title": "The cluster effect: how social gatherings were rocket fuel for coronavirus", "authors": ["Philip Oltermann", "Helen Davidson", "Oliver Laughland", "Rebecca Ratcliffe", "Kim Willsher", "Joanna Walters", "Lorenzo Tondo"], "date": "2020-04-09", "keywords": ["fuel", "virus", "worshippers", "rocket", "spread", "cluster", "social", "tested", "coronavirus", "later", "days", "covid19", "positive", "gatherings", "effect", "cases"], "summary": "A small cluster of coronavirus cases had broken out in the unfortunately named Contamines ski resort in the Alps, but most coronavirus cases were still confined to China.\nIt was only after the congregation at the Porte Ouverte had dispersed and several worshippers tested positive for the coronavirus that concerns were raised.\nBy 8 March, around 100 coronavirus cases had been linked to the church prayer week.\nAs a result, 110 people were quarantined, dozens of whom tested positive for coronavirus.\nDays after arriving back in Vietnam, she developed a cough and tested positive for coronavirus, becoming the country’s “patient 17”."}, {"url": "https://www.newsweek.com/mardi-gras-2020-deals-new-orleans-hotels-flights-packages-offers-1488463", "title": "Mardi Gras 2020 Travel Deals: Last Minute New Orleans Hotel and Flight Package Offers", "authors": [], "date": "2020-02-21", "keywords": ["departing", "package", "orleans", "street", "return", "offers", "french", "costs", "includes", "deals", "travel", "flight", "mardi", "gras", "hotel", "minute"], "summary": "Mardi Gras Travel DealsThree nights at the four-star Magnolia New Orleans hotel in the Central Business District costs from $765 (reduced from $879) on Travelocity.\nIncludes return flight from New Jersey to New Orleans departing on February 24.\nThe offer includes a return flight from Chicago to New Orleans departing on February 22,Read more New Orleans Mardi Gras Traditions in PicturesFour nights at the Old No.\nIncludes return flight departing Boston on February 23.\nThe offer includes a return flight departing New York City on February 23."}, {"url": "https://www.fox8live.com/2020/02/19/man-injured-new-orleans-east-shooting/", "title": "Man injured in New Orleans East shooting", "authors": ["Tiffany Baptiste", "Published At Pm"], "date": "2020-02-19", "keywords": ["information", "crimestioppers", "orleans", "shooting", "asked", "504", "injured", "8221111", "east", "man", "contact"], "summary": "If anyone has any information about the shooting, they are asked to contact Crimestioppers at (504) 822-1111."}, {"url": "https://www.wwltv.com/article/entertainment/events/mardi-gras/parade-schedule-for-feb-7-9/289-f6b01976-ecc0-491f-8b03-7bf9baad3757", "title": "Parade schedule for Feb. 7-9", "authors": ["Author", "Wwltv.Com Staff", "Published", "Pm Cst February", "Updated"], "date": "2020-02-05", "keywords": ["gps", "feb", "orleans", "routes", "schedule", "79", "tracking", "parade", "parades", "tracker", "mardi", "gras"], "summary": "WWL presents Mardi Gras Parade Tracker.\nHere's where to download the WWL-TV parade tracker for your phone:‎WWL Mardi Gras Parade Tracker ‎WWL presents Mardi Gras Parade Tracker.\nFeaturing: - The most comprehensive schedule and route information as well as real-time GPS...WWL Mardi Gras Parade Tracker - Apps on Google Play WWL presents Mardi Gras Parade Tracker.\nWith Mardi Gras Parade Tracker you can time your arrival to the parade route precisely with the parade's arrival.\nWe use scrollable and zoomable maps for our parade routes to provide you with the most precise and up-to-the-minute parade location."}, {"url": "https://nola.verylocal.com/event/mardi-gras-6/105856/", "title": "New Orleans", "authors": [], "date": "2019-12-20", "keywords": ["package", "orleans", "riverside", "2020", "person", "party", "mdw", "payment", "subject", "payments", "email"], "summary": "2020 MARDI GRAS PARTY New Orleans, LA FEBRUARY 25-28, 2020 Seen pictures and heard about the excitement of Mardi Gras in New Orleans?\nTour the city, watch the parades, cruise the Mississippi River, party on Bourbon Street, catch some beads, listen to live jazz and enjoy the Bayou cuisine.\n- No name changes are allowed - At check-in, one person in each room will be required to present a credit card for incidentals.\n-If you fail to make monthly payments, your reservations are subject to cancellation and all monies paid will be forfeited.\n-A $50 late fee will be imposed for all payments received after the final payment deadline (NO EXCEPTIONS)."}, {"url": "https://www.fox8live.com/2020/02/25/thousands-pack-parade-routes-final-day-carnival/", "title": "WATCH LIVE: Thousands to pack parade routes for Mardi Gras 2020", "authors": ["Published At Pm"], "date": "2020-02-25", "keywords": ["live", "thousands", "watch", "routes", "2020", "metairie", "elksjeff", "pack", "argus", "follows", "jefferson", "parade", "beginning", "mardi", "rolls", "gras", "krewe"], "summary": "Argus rolls through Metairie beginning at 10 a.m.. and the Elks-Jeff and Krewe of Jefferson follows."}, {"url": "https://www.fox8live.com/2020/03/01/violent-weekend-nola-represents-uptick-murder-rate/", "title": "Violent weekend in New Orleans could indicate uptick in murder rate for 2020", "authors": ["Josh Roberson", "Published At Pm"], "date": "2020-03-01", "keywords": ["violent", "murder", "orleans", "ward", "taken", "shot", "2020", "rate", "n", "tonti", "succumbed", "injuries", "separate", "men", "uptick", "shootings", "weekend", "indicate"], "summary": "Then, two separate shootings in the 7th Ward.\nThe first happened at the 2000 block of N. Tonti where three men were shot and taken to the hospital and one succumbed to his injuries."}, {"url": "https://www.fox8live.com/2020/02/09/nopd-investigating-shooting-new-orleans-east/", "title": "NOPD investigating shooting in New Orleans East", "authors": ["Jade Myers", "Published At Pm"], "date": "2020-02-09", "keywords": ["orleans", "shooting", "intersection", "north", "say", "occurred", "confirmed", "mayo", "i10", "east", "service", "nopd", "rd", "investigating"], "summary": "Police say the shooting occurred in the intersection of North I-10 Service Rd.\nat Mayo Boulevard around 11:23 p.m., and confirmed the shooting at 11:55 p.m."}, {"url": "https://nola.verylocal.com/weekend-picks-feb-7-9-parade-season-is-here/121145/", "title": "Weekend Picks (Feb. 7-9): Bamboula 2000, Rock 'n' Roll Marathon", "authors": ["Mary Staes"], "date": "2020-02-04", "keywords": ["marathon", "feb", "orleans", "rock", "quarter", "free", "art", "french", "n", "dont", "picks", "roll", "79", "bamboula", "click", "weekend", "2000"], "summary": "While the Uptown parades don’t start until next week, krewes roll through the French Quarter, New Orleans East and the Marigny this weekend.\nFeb. 8, 20202020 Humana Rock ‘n’ Roll New Orleans Marathon & 1/2 Marathon | 6 a.m. to Noon | Starts at Lafayette Square | $65 – $189 registration feeTime to put those New Year’s resolutions to the test!\nSaturday and Sunday will be the Rock ‘n’ Roll 5K, half and Full marathons throughout the city.\nThis Weekends ParadesFri. Feb. 7, 2020Krewe Bohéme | French Quarter | 7 p.m.\nFeb. 8, 2020Krewe du Vieux | French Quarter | 6:30 p.m.krewedelusion | French Quarter | followsSun."}, {"url": "https://www.wwltv.com/article/news/crime/27-people-have-been-killed-in-new-orleans-this-year-all-but-one-were-shot-to-death/289-1d5b5a93-f08e-45fa-b0ec-fa27c493326c", "title": "27 people have been killed in New Orleans through two months of 2020", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Pm Cst March", "Updated"], "date": "2020-03-02", "keywords": ["month", "suspect", "records", "orleans", "months", "murder", "jan", "2020", "murders", "information", "killed", "27", "nopd"], "summary": "NEW ORLEANS — Sixty days into the year, New Orleans has seen at least 27 people killed since Jan. 1.\nA vast majority of the time, police list no suspect information in their initial reports for the murder investigations.\nIn 14 of the 15 reports reviewed by WWL-TV, no suspect information was available after investigators finished their preliminary investigation into the murders.\nAccording to initial information released about the 11 killings, no suspect information was available for any of them.\nCrime analyst Jeff Asher's records show 120 people were killed in 2019 according to The Times-Picayune | The New Orleans Advocate."}, {"url": "https://www.fox8live.com/2020/02/20/new-orleans-postpones-all-uptown-parades-thursday-due-high-winds/", "title": "New Orleans postpones all Uptown parades on Thursday due to high winds", "authors": ["Published February", "At Pm"], "date": "2020-02-20", "keywords": ["related", "winds", "struck", "orleans", "nyx", "left", "high", "night", "say", "trying", "parades", "woman", "tandem", "throws", "uptown", "postpones"], "summary": "The city did not say the decision was related to the fatal accident at NYX that left a woman dead on Wednesday night.\nPolice say she was trying to get beads or throws from a tandem float when she was struck."}, {"url": "https://www.wdsu.com/article/its-here-2020-mardi-gras-parade-schedule/30419029", "title": "It's here! 2020 Mardi Gras parade schedule", "authors": ["Wdsu Digital Team", "Https", "Www.Facebook.Com"], "date": "2020-01-06", "keywords": ["22", "feb", "16", "12", "2020", "schedule", "25", "parade", "23", "630", "mardi", "11", "gras", "15", "14"], "summary": "It's the most wonderful time of year!The Mardi Gras 2020 parade schedule is here!\nThe Mardi Gras 2020 parade schedule is here!\nNemesis: Feb. 15, 1 p.m.Choctaw: Feb. 15, 1 p.m.Freret: Feb. 15, 3 p.m.Sparta: Feb. 15, 5:30 p.m.Aquarius: Feb. 15, 6 p.m.Pygmalion: Feb. 15, 6:15 p.m.\nMagical Krewe of Mad Hatters: Feb. 15, 5 p.mCenturions: Feb. 15, 6:30 p.m.Olympia: Feb. 15, 6 p.m.Titans: Feb. 15, 6:30 p.m.Femme Fatale: Feb. 16, 11 a.m.Hyacinthians: Feb. 16, 12 p.m.Titans-Houma: Feb. 16, 1 p.m.Carrollton: Feb. 16, 12 p.m.King Arthur-Merlin: Feb. 16, 1 p.m.Dionysus: Feb. 16, 1 p.m.Barkus: Feb. 16, 2:00 p.m.Krewe of Kings: Feb. 16, 5 p.m.Druids: Feb. 19, 6:15 p.m.Nyx: Feb. 19, 6:30 p.m.Babylon: Feb. 20, 5 p.m.\nChaos: Feb. 20, 6:15 p.m.Muses: Feb. 20, 6:30 p.m.Hermes: Feb. 21, 5:30 p.m.d'Etat: Feb. 21, 6:30 p.m.Morpheus: Feb. 21, 7 p.m.Selene: Feb. 21, 6:30 p.m.Aphrodite: Feb. 21, 6:30 p.m.NOMTOC: Feb. 22, 10:45 a.m.Iris: Feb. 22, 11 a.m.Tucks: Feb. 22, 12 p.m.Endymion: Feb. 22, 4:15 p.m.Isis: Feb. 22, 6 p.m.Mardi Gras: Feb. 22, 6:30 p.m.Okeanos: Feb. 23, 11 a.m.Mid-City: Feb. 23, 11 a.m.Thoth: Feb. 23, 12 p.m.Bacchus: Feb. 23, 5:15 p.m.Athena: Feb. 23, 5:30 p.m.Pandora: Feb. 23, 6:30 p.m.Terreanians: Feb. 23, 12:30 p.m.Cleophas: Feb. 23, 12:30 p.m.Proteus: Feb. 24, 5:15 p.m.Orpheus: Feb. 24, 6 p.m.Cleopatra: Feb. 24, 6:30 p.m.Zulu: Feb. 25, 8 a.m.Rex: Feb. 25, 10 a.m.Argus: Feb. 25, 10 a.m.Houmas: Feb. 25, 11 a.m.Krewe of Kajuns: Feb. 25, 12 p.m.Lions Club: Feb. 25, 1 p.m.Carnival time in southeast Louisiana means it's time to break out the Parade Tracker!"}, {"url": "https://nola.verylocal.com/event/mardi-gras-experience-2020-6/105780/", "title": "Mardi Gras Experience 2020", "authors": [], "date": "2020-06-10", "keywords": ["package", "single", "2020", "quad", "person", "experience", "triple", "payment", "payments", "coronation", "mardi", "gras", "ball", "balcony"], "summary": "Parades, beads, coronation balls, beignets, hand grenades, balcony parties and Bourbon Street.\nIt is sure to be an event to remember.\nAll guests will receive a gift bag.$100 per person deposit Prices listed are per personMonthly payment schedule (all payment due on 15th of the month)FINAL PAYMENT DUE 11/15/19Failure to make payments could result in the cancellation of your package and forfeiture of all payments madeAll payments are non refundable and non transferableTravel protection is recommended5 night Hotel Only$1725 Single (1 person)$863 per person Double (2 people)$575 per person Triple (3 people)$431 per person Quad (4 people)5 night Hotel & Events Package*$2225 Single (i person)$1363 per person Double (2 people)$1075 per person Triple (3 people)$931 per person Quad (4 people)*Events package includes Zulu Coronation Ball ticket & a Bourbon St Balcony Party, both events include food and beverages.\n(must be 21 to attend Balcony party)Zulu Coronation Ball is a Black Tie affair with a VERY STRICT dress code.\nBlack Tuxedos for the men and floor length ball gowns for the women (NO EXCEPTIONS)Call Leslie @ 302-722-7072 or Email Leslie@berryamazingtravel.com"}, {"url": "https://wgno.com/news/mardi-gras-2020-guide-to-success/", "title": "Mardi Gras 2020: Guide to Success", "authors": ["Sefenech Henok", "Wgno Web Desk", "Rachael O'Neil"], "date": "2020-02-19", "keywords": ["interactive", "guide", "orleans", "2020", "jessica", "success", "experience", "local", "mardi", "gras", "fender", "traveler"], "summary": "Please enable Javascript to watch this videoNEW ORLEANS, LA - Mardi Gras 2020 is less than a week away!\nIt's an interactive field guide created by 2 local women who have 30 Mardi Gras' under their belt!\nMARDI GRAS 2020 Interactive Guide\"I feel like a lot of people say, I want to go to New Orleans, but not during Mardi Gras!\nIf you come and experience Mardi Gras like a local, we want people to be participants, not observers.\nJessica Fender, Traveler BroadsTo download the 2020 Mardi Gras Guide, CLICK HERE"}, {"url": "https://www.wafb.com/2020/02/24/live-coverage-mardi-gras-day-parades-rex-zulu-will-air-wafbs-sister-station-wbxh/", "title": "Rex and Zulu parades roll in New Orleans", "authors": ["Nick Gremillion", "Published At Pm", "Published April", "At Pm"], "date": "2020-02-24", "keywords": ["gonna", "orleans", "pictwittercomoezazdezue", "mamou", "roll", "zulu", "wild", "wafb", "thinkin", "parades", "yall", "rex", "old", "stop", "mardigras"], "summary": "First stop here in Mamou, the old folks home.\nAnd don’t go thinkin they were gonna keep it calm for their elders!\nThis is wild y’all.\n#CajunMardiGras #MardiGras @WAFB pic.twitter.com/oEzAzdezuE"}, {"url": "https://www.fox8live.com/2020/02/21/endymion-preparations-underway/", "title": "Endymion ready to roll on a picture-perfect Saturday", "authors": ["Natasha Robin", "Published At Pm"], "date": "2020-02-21", "keywords": ["especially", "fence", "way", "stage", "endymion", "roll", "ready", "packed", "completely", "weston", "pictureperfect"], "summary": "“Up to the stage especially, it will be completely packed with people and then all the way up against the fence will be packed,” says Weston."}, {"url": "https://www.theatlantic.com/ideas/archive/2020/02/new-orleans-needs-better-way-do-mardi-gras/606817/", "title": "New Orleans Needs a Better Way to Do Mardi Gras", "authors": ["Anne Gisleson", "New Orleans-Based Author Of"], "date": "2020-02-20", "keywords": ["community", "orleans", "tourists", "way", "street", "better", "city", "social", "needs", "plastic", "orleanians", "streets", "mardi", "gras", "band", "tarp"], "summary": "The band, called the Human Jukebox, had been featured in her new video for “Good as Hell,” a moving, joyful celebration of community.\nThrough the pain, frustration, and work of individuals supporting one another comes the exultant communal payoff of an excellent band in action.\nIf New Orleanians don’t want tourists to openly trash our city, shouldn’t we commit to the same?\nAn initiative to redesign city streets is making them safer for people to move around in, without fear of being hit by cars.\nThis time, though, I’m struggling to reconcile the citywide extravaganza with that yellow tarp hanging over North Rampart Street."}, {"url": "https://www.fox8live.com/2020/01/16/orleans-city-council-approves-mardi-gras-schedule-route-changes-also-discussed/", "title": "Orleans city council approves 2020 Mardi Gras schedule, route changes also discussed", "authors": ["Josh Roberson", "Published At Pm"], "date": "2020-01-16", "keywords": ["sets", "city", "approves", "say", "moreno", "discussed", "route", "season", "members", "gras", "orleans", "motion", "ok", "changes", "parade", "mardi", "seconded", "council", "schedule"], "summary": "“Ok members this is an easy one, it does exactly what the clerk just said, it sets the parade schedule for the new season,” Moreno said.\n“So, I will make a motion to approve and it's been seconded by council member Guirusso.\nall in favor say eye.\""}, {"url": "https://www.fox8live.com/2020/02/29/nopd-male-shot-killed-st-roch-neighborhood/", "title": "NOPD: Male shot and killed in St. Roch neighborhood", "authors": ["Nicole Mumphrey", "Published At Pm"], "date": "2020-02-29", "keywords": ["happened", "killed", "shot", "abundance", "intersection", "male", "roch", "neighborhood", "limited", "frenchmen", "1130", "say", "streets", "st", "nopd", "details"], "summary": "Details are limited, but police say it happened around 11:30 a.m. at the intersection of Abundance and Frenchmen Streets."}, {"url": "https://www.forbes.com/sites/katiechang/2020/01/09/mardi-gras-2020-a-stylish-non-touristy-guide-to-new-orleans/", "title": "Mardi Gras 2020: A Stylish, Non-Touristy Guide To New Orleans", "authors": ["Katie Chang"], "date": "2020-01-09", "keywords": ["guide", "nontouristy", "orleans", "original", "2020", "restaurant", "stylish", "local", "bar", "food", "vintage", "mardi", "st", "gras", "hotel", "maison"], "summary": "Bourbon St, New Orleans, Louisiana, USA cityscape of bars and retaurants at twilight.\nWhile these will always be hallmarks of the Big Easy (and for good reason), there’s far more discover here.\nHere, and with Mardi Gras season in full swing as of January 6, King’s Day – this year, Fat Tuesday falls on February 25 – a stylish, non-touristy guide on how to make the most of a visit to New Orleans.\nThe spacious, light-flooded rooms exude a sense of subdued, sophisticated calm with high ceilings, hand-embroidered linens, and locally-sourced vintage furnishings.\nThough it’s just a few months old, Thalia has cemented its status as a restaurant for the local community."}, {"url": "https://www.clickorlando.com/health/2020/03/21/new-orleans-let-the-good-times-roll-now-wash-your-hands/", "title": "New Orleans' 'Let the good times roll' now 'Wash your hands'", "authors": ["Kevin Mcgill", "Associated Press"], "date": "2020-03-21", "keywords": ["let", "virus", "times", "orleans", "street", "good", "week", "way", "hands", "restaurant", "wash", "takeout", "health", "roll", "restaurants", "bourbon"], "summary": "FILE - In this Thursday, March 19, 2020, file photo, a view of the nearly deserted scene on Bourbon Street, which is normally bustling with tourists and revelers, in the French Quarter of New Orleans.\nIn the city here, the old saying Let the good times roll has given way to a new municipal maxim: Wash your hands.\nDue to the coronavirus outbreak, New Orleans has joined those places shutting down bars, eliminating restaurant dining and banning crowds.\n“Laissez les bon temps rouler” (\"Let the good times roll\") has given way to a new municipal maxim: “Wash your hands.” The New Orleans Jazz and Heritage Festival is postponed until fall.\nTourists are still around, said Evangeline Turner, who went to pick up a last paycheck this week on Bourbon Street."}, {"url": "https://www.cnn.com/2020/03/24/us/new-orleans-coronavirus-jefferson-orleans-parish-louisiana/index.html", "title": "New Orleans-area coronavirus cases spike alarmingly as governor requests major disaster declaration", "authors": ["Eliott C. Mclaughlin"], "date": "2020-03-24", "keywords": ["cases", "orleans", "state", "governor", "orleansarea", "coronavirus", "health", "requests", "major", "county", "jefferson", "edwards", "washington", "louisiana", "declaration", "alarmingly", "disaster", "spike"], "summary": "(CNN) Two days after announcing coronavirus cases were climbing at a frightening clip -- notably in two parishes that make up most of metro New Orleans -- Louisiana Gov.\n... We have the fastest growth rate of confirmed cases in the world in the first 13 days right here.\"\nTo be sure, Jefferson and Orleans parishes are much smaller than the counties with which they're being compared above.\nBreaking down the numbers by deaths per 100,000 residents -- again, using only counties with 100 or more cases -- Jefferson and Orleans parishes ranked No.\nET on Tuesday, only California, New Jersey, New York and Washington had more cases than Louisiana, which had almost 1,400."}, {"url": "https://wgno.com/news/health/coronavirus/covid-19-snapshot-how-new-orleans-and-louisiana-compare-to-the-rest-of-the-country/", "title": "COVID-19 snapshot: How New Orleans and Louisiana compare to the rest of the country", "authors": ["Wgno Web Desk", "Jacob Bradford", "Nexstar Media Wire", "Harrison Golden", "Wvla Wgmb"], "date": "2020-03-19", "keywords": ["orleans", "west", "states", "currently", "country", "reported", "snapshot", "station", "coronavirus", "covid19", "louisiana", "compare", "medical", "rest", "cases"], "summary": "NEW ORLEANS, LA – MARCH 17: Medical personnel talk at a drive-thru Coronavirus COVID-19 testing station at West Jefferson Medical Centeron March 17, 2020 in New Orleans, Louisiana.\n(Photo by Chris Graythen/Getty Images)NEW ORLEANS – With 347 confirmed cases of coronavirus, Louisiana began the day on March 19 among the states with the highest rates of infection in the country.\nIn fact, Louisiana currently ranks fifth among the 50 states, trailing only New York, Washington, California, and New Jersey, according to coronavirus tracking website worldometer.\nThe entire state of Texas currently has 222 reported cases of coronavirus among its over 28 million residents, nine fewer cases than New Orleans.\nThe number of reported cases is expected to continue rising by the hour for the foreseeable future."}, {"url": "https://www.myneworleans.com/the-new-orleans-jazz-heritage-foundation-establishes-relief-fund-for-louisiana-musicians-impacted-by-covid-19/", "title": "The New Orleans Jazz & Heritage Foundation Establishes Relief Fund for Louisiana Musicians Impacted by COVID-19", "authors": [], "date": "2020-03-30", "keywords": ["heritage", "establishes", "relief", "community", "orleans", "foundation", "fund", "music", "musicians", "support", "impacted", "louisiana", "jazz"], "summary": "The New Orleans Jazz & Heritage Foundation Establishes Relief Fund for Louisiana Musicians Impacted by COVID-19NEW ORLEANS (press release) — The New Orleans Jazz & Heritage Foundation, the nonprofit organization that owns the New Orleans Jazz & Heritage Festival presented by Shell, announced today that they have established the Jazz & Heritage Music Relief Fund – a statewide relief fund to support Louisiana musicians who have lost income amid the COVID-19 pandemic.\nThe Jazz & Heritage Music Relief Fund was created by the Foundation to support Louisiana musicians whose livelihoods have been adversely impacted by COVID-19.\nThe Jazz & Heritage Relief Fund is a natural extension of the work we have been doing for the community since 1979.\nThe Jazz & Heritage Foundation also owns radio station WWOZ 90.7-FM and the Jazz & Heritage Archive.\nFor more about the New Orleans Jazz & Heritage Foundation, please visit us online at www.jazzandheritage.org."}, {"url": "https://www.latimes.com/world-nation/story/2020-03-17/coronavirus-tests-new-orleans-resiliency-post-katrina", "title": "‘Your actions are jeopardizing public health!’: Last call in New Orleans as police disperse crowds", "authors": ["Houston Bureau Chief", "Molly Hennessy-Fiske Has Been A Staff Writer Since In Washington", "Los Angeles", "Texas", "Overseas. A Graduate Of Harvard College", "She Spent A Year As Middle East Bureau Chief Before Returning As Houston Bureau Chief."], "date": "2020-03-17", "keywords": ["public", "disperse", "actions", "orleans", "street", "bars", "week", "french", "restaurant", "health", "jeopardizing", "bar", "bourbon", "coronavirus", "crowds", "quarter"], "summary": "The Natchez riverboat set sail as usual from the French Quarter with loads of tourists.\n“Your actions are jeopardizing public health and we are directing you to clear the streets!”On Monday, smaller crowds returned to the French Quarter.\n“It’s stopping us from making the money to provide for our families.”AdvertisementNew Orleans’ Bourbon Street is empty as Louisiana Gov.\nPeople always come back.”But an eerie quiet enveloped Bourbon Street shortly before midnight as bars emptied and police cars rolled past.\nBy midnight, Bourbon Street had closed."}, {"url": "https://www.theguardian.com/us-news/2020/mar/26/new-orleans-surviving-katrina-battles-covid-19-coronavirus", "title": "'A nightmare all over again': after surviving Katrina, New Orleans battles Covid-19", "authors": ["Oliver Laughland"], "date": "2020-03-26", "keywords": ["ward", "orleans", "state", "street", "week", "battles", "surviving", "city", "katrina", "lewis", "ninth", "covid19", "louisiana", "lower", "nightmare"], "summary": "Ronald Lewis’s home was among the first to be rebuilt after Hurricane Katrina swept away much of New Orleans’s Lower Ninth ward.\nHe was full of love and concern.”jimmy and ninth ward Left: Jimmy Lewis has mostly stayed inside or on his front porch in the Lower Ninth ward of New Orleans.\nRight: Homes in the Lower Ninth ward.\nBurnell Cotlon Left: Burnell Cotlon in his small market in the Lower Ninth ward of New Orleans.\nRight: Miraculously, Cotlon, has supplies available unlike most stores such as masks, toilet paper, and hand sanitizer at the store Burnell’s Ninth Ward."}, {"url": "https://www.fox8live.com/2020/03/25/new-orleans-east-hospital-opens-drive-thru-covid-testing-site/", "title": "New Orleans East Hospital opens drive thru COVID-19 testing site", "authors": ["Published At Pm"], "date": "2020-03-25", "keywords": ["phone", "orleans", "symptom", "nose", "sore", "site", "opens", "screening", "testing", "drive", "throat", "covid19", "running", "east", "residents", "hospital", "urged"], "summary": "Before coming to the hospital, residents are urged to first call the LCMC Health COVID-19 Hotline at 504.962.6202 if you are experiencing fever, cough, body aches, sore throat, running nose, or any other cold-like symptom.\nAn over the phone screening will be conducted to evaluate if you need to come to the drive thru testing center."}, {"url": "https://www.ncronline.org/news/people/survival-ethos-marks-new-orleans-now-epicenter-covid-19", "title": "Survival ethos marks New Orleans, now an epicenter of COVID-19", "authors": ["Apr", "Nov", "Mar", "Sep"], "date": "2020-03-19", "keywords": ["orleans", "ethos", "music", "state", "mass", "dont", "social", "survival", "lambeth", "residents", "covid19", "epicenter", "st", "work", "marks"], "summary": "Lector Philip Alviar reads from the Book of Deuteronomy during a private Mass March 17, 2020, inside the empty, 950-seat St. Louis Cathedral in New Orleans.\nNew Orleans Archbishop Gregory Aymond canceled all public Masses in the archdiocese to slow the spread of coronavirus.\nThe deaths and 176 cases have been reported in New Orleans, the epicenter of a state that \"now has the third-highest rate per capita in the country,\" reports the Times-Picayune/Advocate .\nMany Lambeth residents come from prominent families and have active social lives, particularly at the winter Carnival balls; some travel abroad.\nBut a survival ethos marks New Orleans to its marrow."}, {"url": "https://www.fox8live.com/2020/03/27/new-orleans-jefferson-parish-have-highest-covid-death-rates-country/", "title": "New Orleans and Jefferson Parish have the highest COVID-19 death rates in the country", "authors": ["Kimberly Curth", "Published At Pm"], "date": "2020-03-27", "keywords": ["risk", "orleans", "rates", "highest", "simple", "country", "theyre", "things", "jefferson", "parish", "death", "need", "covid19", "going", "ventilators", "workers", "trouble", "cities"], "summary": "“It’s going to happen in many, many other cities.\nIt’s just happening first here but other cities across the country need to know they’re just as much at risk and if we as a nation can’t figure out how to get simple things like PPE and ventilators to the healthcare workers that need them to do their jobs than we are going to be in big trouble,” Kanter said."}, {"url": "https://www.shreveporttimes.com/story/news/local/louisiana/2020/03/30/the-day-music-died-coronavirus-tests-new-orleans/5086869002/", "title": "'The day the music died': Coronavirus tests New Orleans", "authors": ["Kevin Mcgill", "Rebecca Santana", "Associated Press", "Published A.M. Ct March"], "date": "2020-03-30", "keywords": ["orleans", "music", "ap", "tourists", "day", "city", "coronavirus", "herbert", "weather", "died", "history", "tests", "poor"], "summary": "(March 21) AP DomesticNEW ORLEANS (AP) — There were the great fires of 1788 and 1794 and the multiple yellow fever outbreaks of the 1800s.\nJackson Square, normally bustling with tourists, is seen deserted in the French Quarter of New Orleans, due to the new coronavirus pandemic, Friday, March 27, 2020.\nWhile rich in history and culture, New Orleans is economically poor, and the people here are not necessarily well-positioned to weather this latest storm.\nWhile rich in history and culture, New Orleans is economically poor, and the people here are not necessarily well-positioned to weather this latest storm.\n(AP Photo/Gerald Herbert) (Photo: Gerald Herbert, AP)\"People are handling it well and soldiering on,\" the nurse said."}, {"url": "https://www.fox8live.com/2020/03/20/zurik-new-orleans-area-has-hospital-beds-available-cases-continue-soar/", "title": "Zurik: Hospitals increase capacity ahead of expected increase of COVID-19 patients", "authors": ["Lee Zurik", "Cody Lillich"], "date": "2020-03-20", "keywords": ["capacity", "expected", "patients", "orleans", "ahead", "week", "spread", "city", "significant", "hospitals", "scouting", "test", "increase", "covid19", "zurik", "hospital", "sites"], "summary": "New Orleans Mayor LaToya Cantrell said at a Friday afternoon press conference, the concern over hospital capacity has them scouting out overflow hospital sites in the city, should they be needed.\nThe city’s health department director said the increase in positive test results being reported will continue to increase into the next week, further confirming that there is ‘significant’ community spread in the City of New Orleans."}, {"url": "https://www.fox8live.com/2020/03/19/new-orleans-among-top-cities-feel-greatest-covid-impact-report-suggests/", "title": "New Orleans among top 5 cities to feel greatest COVID-19 impact, report suggests", "authors": ["Rilwan Balogun", "Published At Am"], "date": "2020-03-19", "keywords": ["impact", "magnitude", "orleans", "report", "protocols", "hecht", "cities", "damage", "think", "greatest", "going", "weeks", "covid19", "restrictions", "suggests", "feel"], "summary": "\"There are going to be new restrictions,” Hecht said.\n“There are going to be new protocols.\nBut if we do that in four weeks, I think the damage is a magnitude less than if we do it in eight weeks.\""}, {"url": "https://www.fox8live.com/2020/03/16/zurik-new-orleans-is-one-areas-with-most-covid-cases-per-capita-country-analysis-shows/", "title": "Zurik: New Orleans continues to be one of the nation’s COVID-19 hot spots, analysis shows", "authors": ["Lee Zurik", "Cody Lillich", "Published April", "At Pm", "Published March"], "date": "2020-03-16", "keywords": ["shows", "orleans", "spread", "number", "analysis", "seeing", "covid19", "substantial", "rate", "press", "jennifer", "nations", "spots", "hot", "infection", "zurik", "resulted", "continues"], "summary": "“We continue to be and are increasingly concerned by the number of cases of COVID-19 that we’re seeing here in New Orleans,\" Dr. Jennifer Avegno, New Orleans Health Department Director, said at a Monday press conference.\n\"There is substantial community spread that has already resulted in two deaths and it continues to appear that the rate of infection here is increasing much faster than even other cities in the U.S.”"}, {"url": "https://nola.eater.com/2020/3/17/21183878/new-orleans-restaurants-delivery-takeout-by-neighborhood", "title": "New Orleans Restaurants Now Offering Delivery and Curbside Pickup, By Neighborhood", "authors": ["Clair Lorell", "Mar"], "date": "2020-03-17", "keywords": ["delivery", "menu", "orleans", "order", "offering", "takeout", "restaurant", "restaurants", "pickup", "curbside", "open", "neighborhood", "11"], "summary": "Here is Eater’s running list of our favorite New Orleans restaurants now offering delivery or takeout for the first time, broken down by neighborhood.\nBAYOU ST. JOHN1000 Figs — Mediterranean haven 1000 Figs is open for curbside pickup and delivery.\nLola’s — Curbside pickup and delivery from 4 to 9 p.m. for all you paella needs; call to order.\nEspíritu Mezcaleria — Mezcal hub Espíritu Mezcaleria and Cocina will be offering delivery through Waitr and pick up/take out through Ritual or call-in.\nToups Meatery — Chef Isaac Toups is offering curbside takeout from 11 a.m. to – 9 p.m. daily, and will soon be offering third party delivery with GrubHub."}, {"url": "https://www.bigeasymagazine.com/2020/04/01/contemplating-the-factors-shocking-covid-19-rates-in-louisiana/", "title": "Contemplating the Factors: Shocking COVID-19 Rates in Louisiana", "authors": [], "date": "2020-04-01", "keywords": ["stress", "shocking", "factors", "immune", "virus", "rates", "orleans", "health", "known", "system", "residents", "covid19", "louisiana", "contemplating"], "summary": "It is when the immune system fails to hold up its defenses that the respiratory system goes under siege.\nWhen someone is healthy, the immune system will quickly identify a threat, prepare for an attack and eliminate the pathogen naturally.\nAccording to researchers at John Hopkins University, a huge portion of the immune system is found in the GI Tract.\nFOOD AND UNHEALTHY HABITSThe health of Louisiana residents is heavily impacted by food traditions and access to fresh produce.\nStatistics show that nearly 30% of Louisiana residents smoke cigarettes daily, and they are most likely to make less than $25,000 a year."}, {"url": "https://www.fox8live.com/2020/03/17/covid-some-new-orleans-most-famous-restaurants-adapt-new-normal/", "title": "COVID-19: Some of New Orleans most famous restaurants adapt to new normal", "authors": ["Kimberly Curth", "Published At Pm"], "date": "2020-03-17", "keywords": ["adapt", "sunny", "times", "orleans", "spill", "situation", "care", "takeout", "famous", "restaurants", "tough", "normal", "trying", "working", "covid19", "thousand"], "summary": "“We’re working on takeout everywhere, trying to adapt to the situation we’re in and just keep moving, doing everything we can to take care of the people that are hurting and take care of the people who are here working.\nIt’s just tough, it’s just so overwhelming.\nI’ve been through Katrina, the oil spill, the recession and everything else, this is times a thousand, except it’s sunny,” said Link."}, {"url": "https://www.latimes.com/world-nation/story/2020-03-29/louisiana-church-defies-covid-19-order-holds-sunday-services", "title": "Louisiana church defies COVID-19 order, holds Sunday services", "authors": ["Houston Bureau Chief", "Molly Hennessy-Fiske Has Been A Staff Writer Since In Washington", "Los Angeles", "Texas", "Overseas. A Graduate Of Harvard College", "She Spent A Year As Middle East Bureau Chief Before Returning As Houston Bureau Chief."], "date": "2020-03-29", "keywords": ["services", "spell", "virus", "including", "order", "church", "central", "life", "churches", "service", "going", "covid19", "louisiana", "holds", "defies"], "summary": "A volunteer at Life Tabernacle Church outside Baton Rouge, La., checks a woman’s temperature before she can enter Sunday’s service.\n(Woody Jenkins / Central City News)On Sunday, 1,265 attended morning services at the church, said the Rev.\n“I’d rather die than kill the church,” Spell repeated, framing the pandemic as a test of faith.\nTony Spell of Life Tabernacle Church said during his sermon Sunday that the Louisiana governor should deem churches as essential services, like some retailers and clinics.\nSpell and church members said they do not believe COVID-19 is fake or that they can heal themselves, as some have reported."}, {"url": "https://www.nytimes.com/2020/03/28/dining/new-orleans-restaurants-coronavirus.html", "title": "New Orleans Restaurants, Used to Disasters, Reckon With Something Worse", "authors": ["Brett Anderson"], "date": "2020-03-28", "keywords": ["link", "virus", "orleans", "worse", "used", "ways", "restaurant", "restaurants", "disasters", "city", "cant", "variety", "reckon", "realization", "meals"], "summary": "That realization helped fuel the slow rebuilding of a dining and drinking scene that became more diverse, with a greater variety of restaurants performing at a high level.\nThe city attracted new residents, with different tastes, and ambitious chefs to cater to them.\nDonald Link, an award-winning chef, operates six New Orleans restaurants including Pêche Seafood Grill and Herbsaint.\nMr. Link and his remaining staff have been preparing free meals for unemployed former colleagues and their families.\n“It was really hard to get people to elbow instead of hug,” said JoAnn Clevenger, who has closed her restaurant, Upperline."}, {"url": "https://www.cbsnews.com/live-updates/coronavirus-disease-covid-19-latest-news-2020-03-29/", "title": "Coronavirus updates from March 29, 2020", "authors": ["Jordan Freiman", "Caroline Linton", "Melissa Quinn", "Stefan Becket", "Clare Hymes"], "date": "2020-03-29", "keywords": ["canceled", "2020", "updates", "coronavirus", "fall", "remote", "29"], "summary": "SAT canceled for June and it might be \"remote\" in the fall"}, {"url": "https://www.ammoland.com/2020/03/new-orleans-mayor-follows-law-on-gun-confiscation/", "title": "New Orleans Mayor follows Law on Gun Confiscation", "authors": ["Dean Weingarten", "Wild Bill", "Ej Harbet", "Xaun Loc", "Rick D", "Some Guy", "Gene Ralno"], "date": "2020-03-19", "keywords": ["confiscation", "orleans", "second", "proclamation", "emergency", "follows", "mayor", "plan", "cantrell", "gun", "law", "violence", "firearms"], "summary": "What mayor Cantrell did was to follow the law, nothing less, nothing more.\nThe 11 March emergency proclamation only stated the authority Mayor Cantrell had under statute RS 29:727.\nIn August of 2019, Mayor Cantrell came up with a three-part plan to deal with “gun violence”.\nWhile “gun violence” is used in Mayor Cantrell's plan, Mayor Cantrell's plan does not call for outlawing guns, gun registration, banning semi-automatics, or curtailing the exercise of Second Amendment rights.\nFirst, Mayor Cantrell's plan calls for the creation of a Gun Violence Prevention Collective, to study the issue, create pilot programs, and to determine what works to reduce gun violence."}, {"url": "https://thelensnola.org/2020/03/25/data-show-steep-declines-in-new-orleans-arrests-over-past-several-days/", "title": "Data show steep declines in New Orleans arrests over past several days", "authors": [], "date": "2020-03-25", "keywords": ["declines", "department", "memo", "orleans", "steep", "released", "calls", "past", "livaccari", "days", "office", "jail", "officers", "arrests", "data"], "summary": "On Monday, according to the data, nine people were arrested, the fewest in a single day this year.\n“There has been no change in arrest policy,” NOPD spokesman Gary Scheets said in a written statement.\nIt is not just a concern for the jail population that has people calling for fewer arrests.\n“I don’t think there is any need to have officers exposed to danger for reporting a property crime.\nLivaccari said he thought that the NOPD leadership was moving in the right direction, but that institutional adjustments tended to take place slowly."}, {"url": "https://www.wwltv.com/article/news/local/ronald-lewis-preserver-of-new-orleans-african-american-culture-has-died/289-95d3eda5-378a-48fb-a4ad-4afe4fafd9d6", "title": "Ronald Lewis, preserver of New Orleans African-American culture, has died", "authors": ["Author", "Dominic Massa", "Published", "Pm Cdt March", "Updated"], "date": "2020-03-20", "keywords": ["orleans", "africanamerican", "week", "local", "app", "lewis", "indian", "died", "museum", "mardi", "house", "cultural", "culture", "preserver", "ronald"], "summary": "NEW ORLEANS — Ronald Lewis, who earned national media attention for his work preserving New Orleans’ African-American cultural traditions, has died.\nMayor LaToya Cantrell issued a statement late Friday saying Lewis, founder of the House of Dance and Feathers, had died.\nHis cultural museum on Tupelo Street in the Lower Ninth Ward, the House of Dance and Feathers, was created in the early 2000s.\nDuring Lewis’ lifetime journey in New Orleans’ African-American cultural traditions, he hasn’t wavered in his dedication no matter his role.”His museum was originally designed to teach local children about New Orleans culture.\n‎New Orleans News from WWL ‎Stay up-to-date with the latest news and weather in the New Orleans area on the all-new free WWL TV app."}, {"url": "https://www.washingtontimes.com/news/2020/mar/22/john-bel-edwards-orders-louisiana-shelter-place-ru/", "title": "Louisiana governor orders statewide shelter in place rules", "authors": ["The Washington Times Http", "James Varney"], "date": "2020-03-22", "keywords": ["issued", "orleans", "rules", "state", "order", "governor", "york", "coronavirus", "place", "statewide", "shelter", "washington", "louisiana", "orders"], "summary": "NEW ORLEANS — Louisiana has joined New York, California and Illinois in issuing a statewide stay-at-home order to respond to the coronavirus outbreak.\nLouisiana has been hard hit by the coronavirus, which originated in Wuhan, China, last year and has since swept the globe.\nAfter New York and Washington states, Louisiana ranks third in the nation in per-capita infection rates.\nNew Orleans had issued a shelter in place order last Friday.\nGovernors in New York, California and Illinois had previously issued similar “stay at home” orders, while Ohio’s will go in place Monday."}, {"url": "https://kadn.com/list-of-curfews-by-parish/", "title": "List of Curfews by Parish - News15", "authors": [], "date": "2020-04-06", "keywords": ["wide", "department", "curfews", "information", "services", "public", "curfew", "issues", "news15", "city", "parish", "covid19", "list"], "summary": "Acadia Parish Issues CurfewACADIA PARISH – Effective tonight, April 2, 2020 Acadia Parish will start a parish wide curfew.\nIberia Parish President Issues Parish Wide CurfewLarry Richard, Iberia Parish President declared a parish wide curfew beginning April 1, 2020, from 10:00PM to 5:00AM for all of Iberia Parish, including the following municipalities: Delcambre, Jeanerette, Loreauville and New Iberia.\nSt. Martin Issues Parish Wide CurfewMayor Calais has issued a parish wide curfew effective tonight.\nAfter careful consultation with the Sheriff’s Department, Parish President Cedars has issued an executive order imposing a St. Martin Parish wide curfew… effective tonight (April 1st)… from 10:00 PM to 5:00 AM.\nParish wide curfew excludes persons traveling to or from work or an emergency."}, {"url": "https://www.fox8live.com/2020/03/27/container-ship-runs-aground-mississippi-river-near-belle-chasse/", "title": "Container ship runs aground on Mississippi River near Poydras", "authors": ["Tiffany Baptiste", "Published At Pm"], "date": "2020-03-27", "keywords": ["mississippi", "vessels", "near", "restrictions", "currently", "area", "remains", "open", "runs", "river", "ship", "aground", "poydras", "container", "pulled"], "summary": "The river remains open at this time with restrictions.\nVessels are currently being pulled through the area one at a time."}, {"url": "https://www.fox8live.com/2020/03/19/all-la-omv-locations-will-close-due-covid-precautions/", "title": "All La. OMV locations will close due to COVID-19 precautions", "authors": ["Wafb Staff", "Published At Pm"], "date": "2020-03-19", "keywords": ["wallet", "available", "suspend", "license", "drivers", "state", "omv", "searching", "close", "app", "precautions", "digital", "covid19", "locations", "la"], "summary": "Additionally, LA Wallet, the state of Louisiana's official digital driver's license, is now available to residents free of charge.\nThe all digital identification and driver's license app will suspend its fee in response to the COVID-19 pandemic.\nThe app is available to download on Apple and Android devices by searching LA Wallet."}, {"url": "https://www.washingtontimes.com/news/2020/mar/25/new-orleans-louisiana-compares-coronavirus-katrina/", "title": "'It's eerie': Big Easy sees coronavirus as slow-moving Katrina", "authors": ["The Washington Times Http", "James Varney"], "date": "2020-03-25", "keywords": ["easy", "eerie", "orleans", "street", "sees", "week", "blocks", "french", "city", "coronavirus", "big", "katrina", "bourbon", "quarters", "slowmoving", "quarter"], "summary": "“It’s kind of like Katrina, but Katrina whacked us and left,” said Ann Breaux, who lives on Orleans Avenue a couple of blocks from Bourbon Street.\nIn the aftermath of Katrina in 2005, soldiers of the Army’s 82nd Airborne Division patrolled the area around the French Quarter.\nMadison Orey, an operating room nurse, pedaled down Bourbon Street with her husband, David Dufour, on Tuesday.\nThe couple live in Treme, which abuts the French Quarter’s northeastern corner.\nThe French Quarter’s sprawling residential sections are also quiet despite the glorious spring weather."}, {"url": "https://neworleanscitybusiness.com/blog/2020/03/30/popular-coronavirus-loans-bring-challenge-for-local-banks/", "title": "Coronavirus loans bring challenge for local banks – New Orleans CityBusiness", "authors": ["Lance Traweek", "Managing Editor"], "date": "2020-03-30", "keywords": ["loans", "banks", "businesses", "protection", "orleans", "bring", "citybusiness", "business", "coronavirus", "local", "loan", "payroll", "challenge", "small", "sba", "bankers", "program"], "summary": "Local banks will be the initial point of contact for small businesses, particularly for the Paycheck Protection Program.\nThe Paycheck Protection Program provides eight weeks of cash flow assistance through 100% federally guaranteed loans to cover payroll, salaries, rent, utilities and other debt obligations.\nThis loan does not require SBA approval, making it easier for local banks to make credit decisions.\nBanks need guidelines to be issued by the SBA before the Paycheck Protection Program can begin.\nCarlson recommended business owners get the latest information for the U.S. Chamber of Commerce’s website or their Small Business Guide and Checklist."}, {"url": "https://kadn.com/new-orleans-bounce-deejay-black-n-mild-44-dies-after-coronavirus-infection/", "title": "New Orleans Bounce Deejay Black N Mild, 44, Dies After Coronavirus Infection - News15", "authors": [], "date": "2020-03-20", "keywords": ["pence", "stokes", "orleans", "deejay", "bounce", "news15", "n", "dj", "coronavirus", "facebook", "dies", "im", "pigott", "black", "infection", "mild"], "summary": "NOLA.com- Popular New Orleans bounce deejay and radio personality Oliver Stokes Jr., better known as Go DJ Black N Mild, was one of two coronavirus-related deaths in Louisiana on Thursday, the Orleans Parish Coroner’s Office confirmed.\nHis “Bounce 104.5” show was reportedly one of the first radio mix shows dedicated to New Orleans bounce music.\nIn 2008, Stokes founded the Louisiana chapter of Go DJ Global, an international federation of deejays, and took the stage name Go DJ Black N Mild.\n“For the ones who don’t know, they always had two ‘Black N Milds in New Orleans,” Pigott said in the video.\n“They had a Go DJ Black N Mild who was with the Go DJs."}, {"url": "https://www.timesfreepress.com/news/breakingnews/story/2020/mar/21/new-orleans-coronavirus-dread/518790/", "title": "New Orleans' 'Let the good times roll' now 'Wash your hands' amid coronavirus dread", "authors": ["Kevin Mcgill", "Associated Press"], "date": "2020-03-21", "keywords": ["amid", "virus", "coronavirus", "oberhelman", "good", "dread", "takeout", "wash", "roll", "public", "times", "orleans", "week", "hands", "restaurant", "restaurants", "let", "really", "health"], "summary": "\"Laissez les bon temps rouler\" (\"Let the good times roll\") has given way to a new municipal maxim: \"Wash your hands.\"\nThey have added phone lines to handle takeout business, but have laid off about half of their roughly 50 staffers.\nTourists are still around, said Evangeline Turner, who went to pick up a last paycheck this week on Bourbon Street.\nHe is the chairman of the Department of Global Community Health and Behavioral Sciences at Tulane University's School of Public Health and Tropical Medicine.\n___The Associated Press receives support for health and science coverage from the Howard Hughes Medical Institute's Department of Science Education."}, {"url": "https://www.katc.com/news/covering-louisiana/statewide-burn-ban-in-effect-tomorrow", "title": "Statewide burn ban in effect tomorrow", "authors": [], "date": "2020-03-24", "keywords": ["marshal", "agriculture", "department", "state", "order", "result", "statewide", "burning", "burn", "ban", "tomorrow", "shall", "forestry", "effect"], "summary": "State officials have issued a burn ban for the entire state that takes effect tomorrow at 8 a.m.State Fire Marshal H. “Butch” Browning, in collaboration with Agriculture and Forestry Commissioner Mike Strain, have issued a statewide cease and desist order for all private burning, pursuant to authority under R.S.\nPrivate burning shall only be allowed by permission of the local fire department or local government.\nThis order is effective as of 8 a.m., March 25, 2020 and shall remain in effect until rescinded, they say.\n“This burn ban is necessary to supplement the governor’s ‘stay home’ order aimed at mitigating the spread of COVID-19 due to the anticipation that there may be an increase in open burning occurring across the state as families look for ways to pass the time at home,” said State Fire Marshal H. “Butch” Browning, “This order will assist in preventing potential fire-related dangers that could result in unnecessary fire service response as well as diminish airborne irritants caused by burning.”This ban shall not apply to prescribed burns by the Department of Agriculture and Forestry, by those trained and certified by the Department of Agriculture and Forestry, or by those who conduct prescribed burning as a “generally accepted agriculture practice” as defined by the Louisiana Right to Farm Law.\nViolation of this Fire Marshal order could result in criminal and/or civil penalties."}, {"url": "https://www.cnn.com/world/live-news/coronavirus-outbreak-03-24-20-intl-hnk/index.html", "title": "March 24 coronavirus news", "authors": ["Jessie Yeung", "Helen Regan", "Adam Renton", "Emma Reynolds", "Mike Hayes", "Meg Wagner", "Cnn'S Priscilla Alvarez", "Cnn'S Andy Rose", "Cnn'S Natasha Chen", "Hilary Whiteman In Brisbane"], "date": "2020-03-24", "keywords": ["symptoms", "zealand", "probable", "wednesdaywhat", "testbloomfield", "coronavirus", "turnaround", "bloomfield", "24", "count", "cases"], "summary": "Greg Bowker/Getty ImagesNew Zealand has recorded a 30% jump in coronavirus cases as the country heads into lockdown by the end of day Wednesday, according to Ashley Bloomfield, the country's Director of Health.\nThere are 47 new confirmed cases and three new probable cases, bringing the Pacific nation's count up to 205, Bloomfield said at a news conference on Wednesday.\nWhat is a probable case?\nNew Zealand is including probable cases in its national count going forward, which includes people who present with coronavirus symptoms and have exposure history despite a negative test.\nBloomfield said the government will continue to see a rise for the next 10 days before a turnaround."}, {"url": "https://www.latimes.com/entertainment-arts/story/2020-03-20/movies-on-tv-this-week-sunday-mar-22-2020", "title": "Movies on TV this week: Sunday, Mar. 22, 2020", "authors": ["Television Listings Assistant Editor", "Ed Stockly Handles The Tv Listings", "Highlights For The L.A. Times", "Is The Resident Tv Skeptic", "Occasionally Writing About Tv Shows That Feature The Paranormal", "Bad Science", "Mermaids", "Big Foot", "Aliens"], "date": "2020-03-20", "keywords": ["ifc", "22", "pg13", "hrs", "thur", "week", "2020", "amc", "tues", "mar", "movies", "r", "pg", "hr", "tv", "nr"], "summary": "4 p.m.American Sniper (2014) ★★★ IFC Tues. 9 p.m. IFC Wed. 5 p.m.Anaconda (1997) ★ SUND Sun.\n1:30 p.m.Grindhouse Presents: Death Proof (2007) ★★★ IFC Tues. 8:45 a.m. IFC Wed. 6:15 a.m.AdvertisementGrindhouse Presents: Planet Terror (2007) ★★★ IFC Mon.\n10:45 a.m.AdvertisementMission: Impossible II (2000) ★★★ IFC Tues. 11:15 a.m. IFC Wed. 8:45 a.m.Mister Roberts (1955) ★★★ TCM Mon.\nSpeed (1994) ★★★ AMC Tues. 4:30 p.m. AMC Wed. 11:30 a.m.AdvertisementStand by Me (1986) ★★★★ SUND Sun.\n6:30 p.m. AMC Tues. 2 p.m.Total Recall (1990) ★★★ SHOW Fri. 2:30 p.m.Transformers: Age of Extinction (2014) ★★ FX Mon."}, {"url": "https://www.cnn.com/2020/03/24/health/us-coronavirus-updates-tuesday/index.html", "title": "New York hit hard but other states are suffering, too", "authors": ["Jason Hanna", "Steve Almasy", "Cheri Mossburg"], "date": "2020-03-24", "keywords": ["cases", "hit", "state", "week", "york", "hard", "told", "beds", "died", "ventilators", "suffering", "hospital", "states"], "summary": "In his request to the President, Edwards said Louisiana has more cases per capita than any state, except for New York and Washington.\nMichigan's total rose from just 65 cases about week ago to 1,791 on Tuesday afternoon, including 15 deaths.\nCuomo says New York may split ventilators 02:39The governor said his state was trying to address two other needs: more hospital beds and more medical staff.\nWorking in a hospital without that protective equipment, a nurse in a South Texas hospital told CNN, is like \"going to war with a water gun.\"\n\"Everything is limited,\" the nurse said, \"PPE, ventilators, beds, negative pressure rooms, nurses, etc.\""}, {"url": "https://www.sciencedaily.com/releases/2020/03/200323101354.htm", "title": "ACE inhibitors and angiotensin receptor blockers may increase the risk of severe COVID-19, paper suggests", "authors": [], "date": "2020-03-20", "keywords": ["risk", "aceis", "patients", "receptor", "inhibitors", "receptors", "infections", "paper", "angiotensin", "severe", "arbs", "increase", "covid19", "blockers", "respiratory", "disease", "suggests", "ace2"], "summary": "Research in experimental models has shown an increase in the number of ACE2 receptors in the cardiopulmonary circulation after intravenous infusions of ACE inhibitors.\nDiaz writes, this hypothesis is supported by a recent descriptive analysis of 1,099 patients with laboratory-confirmed COVID-19 infections treated in China during the reporting period, December 11, 2019, to January 29, 2020.\nThis study reported more severe disease outcomes in patients with hypertension, coronary artery disease, diabetes and chronic renal disease.\nAll patients with the diagnoses noted met the recommended indications for treatment with ACEIs or ARBs.\nHe recommends future case-control studies in patients with COVID-19 infections to further confirm chronic therapy with ACEIs or ARBs may raise the risk for severe outcomes."}, {"url": "https://www.nytimes.com/2020/03/28/world/coronavirus-live-news-updates.html", "title": "Trump Says a Quarantine ‘Will Not Be Necessary’", "authors": [], "date": "2020-03-28", "keywords": ["cases", "seven", "fema", "response", "necessary", "safety", "employees", "tested", "union", "agency", "quarantine", "positive", "trump"], "summary": "Union leaders last week had asked the agency, Federal Emergency Management Agency, how many employees had tested positive, and in which offices, so that workers who might have interacted with those people could decide whether to get tested as well.\nIn response to inquiries from The Times, the agency on Saturday said that seven employees had tested positive for the coronavirus.\n“Currently, FEMA has 11 total cases — seven employees have tested positive and four potential cases are pending,” Lizzie Litzow, a spokeswoman for FEMA, said in a statement.\nOver all, the agency has about 14,000 employees.\n“If we’re out there handing out masks and gloves, and we’ve got Covid, then they’re contaminated,” said Mr. Reaves, referring to the disease caused by the coronavirus."}, {"url": "https://www.theguardian.com/us-news/2020/mar/29/detainees-coronavirus-us-immigration-ice", "title": "Detainees in US immigration jails living in fear as coronavirus spreads", "authors": ["Alexandra Villarreal", "Oliver Laughland"], "date": "2020-03-29", "keywords": ["living", "husband", "spreads", "center", "detention", "coronavirus", "health", "immigration", "fear", "facilities", "ice", "louisiana", "detainees", "strike", "jails"], "summary": "Detainees at immigration detention centers across the American south have alleged heavy-handed crackdowns amid increasing panic and protest over the coronavirus pandemic, according to advocates and recordings of detainees obtained by the Guardian.\nTwo detainees in New Jersey Ice facilities and five employees at four facilities in Texas, Colorado and New Jersey have confirmed coronavirus cases, according to Ice.\nThe Trump administration has massively expanded the use of immigration detention facilities, with hardline policies that have driven the detention population to record highs.\nAt Ice’s South Louisiana center, a woman alleged she saw officers in hazmat suits feeding someone through a slot in a door, Cole said.\n“That’s not something people can do in detention.”Ice has said detainees’ “health, welfare and safety … is one of the agency’s highest priorities”."}, {"url": "https://www.newschannel6now.com/2020/03/26/gov-abbott-signs-self-isolation-executive-order-tri-state-area-travelers/", "title": "Gov. Abbott extends self-isolation executive order for new states and cities", "authors": ["Dakota Mize", "Published At Pm"], "date": "2020-03-26", "keywords": ["noon", "gov", "abbott", "state", "order", "cities", "power", "set", "extends", "texas", "virtue", "list", "vested", "executive", "selfisolation", "states"], "summary": "NOW, THEREFORE, I, Greg Abbott, Governor of Texas, by virtue of the power and authority vested in me by the Constitution and laws of the State of Texas, do hereby add the following states and cities, effective at noon on March 30, 2020, to the list set forth in Executive Order GA-11:"}, {"url": "https://www.cnn.com/world/live-news/coronavirus-outbreak-03-25-20-intl-hnk/index.html", "title": "March 25 coronavirus news", "authors": ["Helen Regan", "Joshua Berlinger", "Adam Renton", "Ivana Kottasová", "Meg Wagner", "Cnn Health S Jen Christensen", "Cnn'S Chuck Johnston", "Cnn'S Andy Rose", "Cnn'S Oliver Janney", "Ryan Browne"], "date": "2020-03-25", "keywords": ["tilden", "voluntarily", "way", "president", "pay", "25", "vice", "coronavirus", "company", "travel", "airline", "airlines"], "summary": "An Alaska Airlines Airbus 320 takes off from Los Angeles International Airport on February 6, 2020.\nIn a statement, the company says demand for its flights has fallen by more than 80%, forcing dramatic reductions.\nAlaska Airlines CEO Brad Tilden will forgo his pay through September 30, as will president Ben Minicucci, according to the airline.\nAdditional pay cuts will be made in the executive ranks — all the way down to vice president level — and the board of directors will receive no pay.\nThe moves are being made as the company actively lobbies the federal government to pass a relief package for the airline industry."}, {"url": "https://www.cbsnews.com/live-updates/coronavirus-disease-covid-19-latest-news-deaths-2020-03-25/", "title": "Coronavirus updates from March 25, 2020", "authors": ["Victoria Albert", "Mark Strassmann", "Jordan Freiman", "Camilo Montoya-Galvez", "Justin Carissimo", "Kate Smith", "Grace Segers", "Clare Hymes", "Sarah Lynch Baldwin", "Elaine Cobbe"], "date": "2020-03-25", "keywords": ["canceled", "updates", "2020", "25", "coronavirus", "remote", "fall"], "summary": "SAT canceled for June and it might be \"remote\" in the fall"}, {"url": "https://www.fox8live.com/2020/03/16/new-orleans-area-omv-locations-close-due-covid-precautions/", "title": "New Orleans area OMV locations to close due to COVID-19 precautions", "authors": ["Published At Pm", "Published At Am"], "date": "2020-03-16", "keywords": ["issued", "orleans", "area", "omv", "2020", "15", "suspended", "rs", "pursuant", "close", "notices", "default", "precautions", "notice", "covid19", "locations", "la"], "summary": "The notice of default issued pursuant to LA R.S.\n32:429.4 that would be issued on or after March 9, 2020 and before May 15, 2020 is suspended, and the notices will not be issued until after May 15, 2020."}, {"url": "https://www.motherjones.com/politics/2020/03/lung-fluids-coronavirus/", "title": "A Report From the Coronavirus Frontline: “They Are Essentially Drowning in Their Own Blood.”", "authors": ["Lizzie Presser", "Dan Spinelli", "Jackie Flynn Mogensen", "Julia Lurie", "Molly Schwartz", "Rebecca Leber", "Ali Breland", "Daniel King", "Laura Thompson", "Nathalie Baptiste"], "date": "2020-03-21", "keywords": ["lung", "blood", "ards", "patients", "little", "report", "dont", "coronavirus", "ventilator", "frontline", "air", "going", "lungs", "drowning", "essentially"], "summary": "He estimates that his hospital has admitted dozens of confirmed or presumptive coronavirus patients.\nWhen you breathe in, all of those little air sacs inflate, and they have capillaries in the walls, little blood vessels.\nWith all the coronavirus patients, we’ve had to restrain them.\nThe coronavirus patients with ARDS have been having a lot of secretions that are actually pink because they’re filled with blood cells that are leaking into their airways.\nThey are essentially drowning in their own blood and fluids because their lungs are so full."}, {"url": "https://nola.eater.com/2020/3/10/21172717/biggest-restaurant-openings-new-orleans-spring-2020", "title": "The Most Anticipated Restaurant Openings in New Orleans, Spring 2020", "authors": ["Clair Lorell", "Mar"], "date": "2020-03-10", "keywords": ["spring", "orleans", "2020", "restaurant", "chef", "2020who", "bar", "anticipated", "serve", "st", "ramen", "openings", "cuisine"], "summary": "The Most Anticipated Restaurant Openings in New Orleans, Spring 2020Share All sharing options for: The Most Anticipated Restaurant Openings in New Orleans, Spring 2020Since the last preview of New Orleans’s most anticipated restaurants, the city has seen the arrival of its first omakase sushi bar, a Chinese-American hotspot join the LGD’s booming dining scene, and a beloved Jazz Fest vendor open a restaurant Uptown.\nHere now, Eater’s roster of the most anticipated openings coming to New Orleans this spring.\nWhat: Vals is described as a casual, laid-back restaurant and bar with traditional and regional Mexican cuisine and a focus on agave spirits.\nWhen: Spring 2020The BowerWho: Mark and Candace Latter, who run Tujague’s and Bar Frances, and opened Claret Wine & Cocktail Bar last year.\nWhen: Spring 2020Do you have a hot restaurant tip?"}, {"url": "https://www.fox8live.com/2020/03/01/violent-weekend-nola-represents-uptick-murder-rate/", "title": "Violent weekend in New Orleans could indicate uptick in murder rate for 2020", "authors": ["Josh Roberson", "Published At Pm"], "date": "2020-03-01", "keywords": ["violent", "murder", "orleans", "ward", "taken", "shot", "2020", "rate", "n", "tonti", "succumbed", "injuries", "separate", "men", "uptick", "shootings", "weekend", "indicate"], "summary": "Then, two separate shootings in the 7th Ward.\nThe first happened at the 2000 block of N. Tonti where three men were shot and taken to the hospital and one succumbed to his injuries."}, {"url": "https://seniorhousingnews.com/2020/04/09/covid-19-news-bulletin-cases-appear-in-other-kirkland-communities-stocks-plummet/", "title": "Covid-19 News Bulletin: Assisted Living Covid-19 Cases Exceed 700; Occupancy Dipped Slightly Before Pandemic Struck", "authors": [], "date": "2020-04-09", "keywords": ["living", "slightly", "struck", "dipped", "pandemic", "care", "bulletin", "health", "company", "communities", "exceed", "providers", "residents", "covid19", "housing", "senior", "occupancy", "cases"], "summary": "The first $30 billion is being disbursed this week, and senior living providers are not receiving any of that money.\n“We really want to parallel what we did with self-storage 15 years ago … acquire them, understand them, brand them.”As of October, SSSHT had acquired four senior living properties, operated by Integral Senior Living (ISL) and MBK Senior Living.\nMany of the nation’s largest senior living providers — including Atria Senior Living, Sunrise Senior Living and Five Star Senior Living — are now responding to positive diagnoses of Covid-19 either among residents, staff or both.\nForty-three percent of respondents said their perspective of senior living has been negatively affected by this situation, but 14% said that they now have a more positive opinion of senior living than previously.\nAtlas Senior Living To Begin Testing in CommunitiesAtlas Senior Living might be the first senior living provider in the U.S. to offer its own Covid-19 testing to residents."}, {"url": "https://www.wwltv.com/article/news/health/coronavirus/new-orleans-prepares-coronavirus/289-bead0dd3-b87a-431c-93a9-981a7933b7b3", "title": "New Orleans preps for coronavirus, no Louisiana cases confirmed", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Pm Cst March", "Updated"], "date": "2020-03-06", "keywords": ["orleans", "business", "city", "sonnier", "coronavirus", "health", "preps", "confirmed", "travel", "louisiana", "disease", "cases"], "summary": "NEW ORLEANS — New Orleans city government leaders laid out how they were preparing for the coronavirus on Friday, even with no confirmed cases in Louisiana.\nAs of March 6, no cases of the disease officially known as COVID-19 have been confirmed in Louisiana.\nFour people have been tested in the state and three tests came back as negative, the Times-Picayune | New Orleans Advocate reports.\nMayor LaToya Cantrell stressed that there were no confirmed cases in the city and the government was taking steps to prevent the disease from spreading through tourist-heavy New Orleans.\nMore than 3,400 deaths have been reported worldwide and more than 100,000 cases of the disease have been confirmed."}, {"url": "https://www.fox8live.com/2020/03/15/new-orleans-cracks-down-restaurants-bars-coronavirus-cases-rise/", "title": "City of New Orleans release guidelines for restaurants and bars as coronavirus cases rise", "authors": ["Published At Am", "Published April", "At Pm"], "date": "2020-03-15", "keywords": ["temperature", "employers", "city", "servers", "coronavirus", "supplies", "bars", "rise", "post", "orleans", "continue", "release", "restaurants", "cases", "regularly", "processes", "employees", "guidelines", "signs"], "summary": "Employers will continue to monitor employees and ask employees to regularly take their own temperature.\nAs supplies allow, employers will also assist.\nThis goes for beverage/bar servers.\nThey will also continue to post signs for enhanced cleaning processes and how to maintain good health."}, {"url": "https://nola.eater.com/2020/2/4/21116395/new-orleans-restaurant-bar-closings-2020", "title": "These Are the Latest New Orleans Restaurant and Bar Closings of 2020", "authors": ["Clair Lorell", "Mar"], "date": "2020-02-04", "keywords": ["closed", "orleans", "cafe", "street", "closings", "2020", "restaurant", "opened", "owners", "bar", "nolacom", "pho", "latest", "toups"], "summary": "Welcome to Eater NOLA’s roundup of all the 2020 restaurant, bar, and cafe closures New Orleans diners need to know.\nMarchBon Ton Cafe — The last dinner service for New Orleans’s third-oldest restaurant as it currently exists is Friday, March 6.\nLa Mensa — The relatively new modern Italian restaurant closed the Saturday before Mardi Gras, after eight months as a promising addition to the French Quarter dining scene.\nAccording to NOLA.com, owners sold the space to Louisiana chain El Paso Mexican Grill.\nStar chef Isaac Toups and wife/business partner Amanda closed the restaurant inside Central City’s Southern Food & Beverage Museum (SoFab) after three years to focus on their other projects and restaurant, Toups Meatery."}, {"url": "https://www.fox8live.com/2020/03/14/people-taking-streets-new-orleans-despite-coronavirus-warnings/", "title": "People taking the streets of New Orleans despite coronavirus warnings", "authors": ["Katherine Mozzone", "Published At Pm"], "date": "2020-03-14", "keywords": ["taking", "shocking", "ines", "despite", "orleans", "lot", "theres", "minondo", "coronavirus", "place", "warnings", "visitor", "going", "streets", "tell", "reservation"], "summary": "“It’s shocking in a lot because you go into a place and it’s completely empty or they tell you have to have a reservation to going in and there’s no one around,” visitor Ines Minondo said."}, {"url": "https://www.fox8live.com/2020/04/09/court-ruling-says-emails-between-saints-archdiocese-new-orleans-will-remain-confidential-church-sex-abuse-lawsuit/", "title": "Court recommendation says emails between the Saints and Archdiocese of New Orleans will remain confidential in church sex abuse lawsuit", "authors": ["Kimberly Curth", "Published April", "At Pm"], "date": "2020-04-09", "keywords": ["lawsuit", "talking", "court", "church", "parties", "remain", "sex", "saints", "mary", "privacy", "public", "orleans", "press", "reason", "roy", "confidential", "recommendation", "means", "lot", "emails"], "summary": "“The law is very clear that if a lot of the information is already public and if the parties involved are talking about it in the public then that means there is less reason for privacy and confidentiality and there is more reason for disclosure to the public,” said Associated Press attorney, Mary Ellen Roy in February."}, {"url": "https://www.bigeasymagazine.com/2020/04/01/contemplating-the-factors-shocking-covid-19-rates-in-louisiana/", "title": "Contemplating the Factors: Shocking COVID-19 Rates in Louisiana", "authors": [], "date": "2020-04-01", "keywords": ["stress", "shocking", "factors", "immune", "virus", "rates", "orleans", "health", "known", "system", "residents", "covid19", "louisiana", "contemplating"], "summary": "It is when the immune system fails to hold up its defenses that the respiratory system goes under siege.\nWhen someone is healthy, the immune system will quickly identify a threat, prepare for an attack and eliminate the pathogen naturally.\nAccording to researchers at John Hopkins University, a huge portion of the immune system is found in the GI Tract.\nFOOD AND UNHEALTHY HABITSThe health of Louisiana residents is heavily impacted by food traditions and access to fresh produce.\nStatistics show that nearly 30% of Louisiana residents smoke cigarettes daily, and they are most likely to make less than $25,000 a year."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["linebacker", "round", "2020", "usa", "today", "defensive", "2019", "credit", "options", "draft", "stadium", "falcons", "mandatory", "moreround", "nov"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://finance.yahoo.com/news/shareholder-alert-former-louisiana-attorney-025010707.html", "title": "SHAREHOLDER ALERT BY FORMER LOUISIANA ATTORNEY GENERAL: KSF REMINDS HPQ, JELD, OXY, WWE INVESTORS of Lead Plaintiff Deadline in Class Action Lawsuits", "authors": [], "date": "2020-04-14", "keywords": ["foti", "shareholder", "jeld", "plaintiff", "motion", "learn", "deadline", "oxy", "reminds", "2020securities", "lawsuits", "wwe", "lead", "visit", "louisiana", "ksf", "period", "fraudto"], "summary": "If you wish to serve as a Lead Plaintiff in the class action, you must petition the Court on or before the Lead Plaintiff Motion deadline.\nAboutKSF, whose partners include former Louisiana Attorney General Charles C. Foti, Jr., is one of the nation’s premier boutique securities litigation law firms.\nKSF has offices in New York, California and Louisiana.\nTo learn more about KSF, you may visit www.ksfcounsel.com .\nContact:Kahn Swick & Foti, LLCLewis Kahn, Managing Partnerlewis.kahn@ksfcounsel.com1-877-515-18501100 Poydras St., Suite 3200New Orleans, LA 70163"}, {"url": "https://www.houmatoday.com/news/20200322/coronavirus-is-already-dealing-louisiana-economic-blow", "title": "Coronavirus is already dealing Louisiana an economic blow", "authors": ["Kristen Mosbrucker", "The Advocate", "Baton Rouge"], "date": "2020-03-22", "keywords": ["businesses", "economic", "dealing", "state", "unemployment", "week", "lafayette", "coronavirus", "jobs", "oil", "louisiana", "blow"], "summary": "\"This is one of the worst (economic forecasts) I’ve seen for Louisiana, where cases of coronavirus are spiking,\" Scott said.\nIn East Baton Rouge Parish, about 8,000 businesses employing 143,700 workers were impacted by the flooding, according to the Louisiana Economic Development department.\nIn Louisiana, the Louisiana Workforce Commission, though having website issues, has sped up its claims process and temporarily waived job search requirements.\nEnergy companies and related businesses comprised 29.4% of the more diversified Lafayette-area gross domestic product as of October 2019, according to the Lafayette Economic Development Authority’s analysis of federal data.\n\"All these changes will work their way through the Louisiana economy,\" Richardson said of the rock bottom oil price and impact from the coronavirus."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.texarkanagazette.com/news/sports/pro/story/2020/apr/16/sportstats/824436/", "title": "Sportstats", "authors": ["Associated Press"], "date": "2020-04-16", "keywords": ["sportstats", "vs", "series", "york", "game", "ncaa", "basketball", "classics", "final", "playoffs", "football"], "summary": "(LHORN) NCAA Football Classics Colorado at Texas.\n(LHORN) NCAA Football Classics Oklahoma vs. Texas.\n4 p.m.(LHORN) NCAA Football Classics Colorado at Texas.\n2016 Playoffs -- Final Game 1.\n2016 Playoffs -- Final Game 5."}, {"url": "https://www.myneworleans.com/southern-film-producers-convene-virtually-amidst-covid-19/", "title": "Southern Film Producers Convene Virtually Amidst Covid-19", "authors": [], "date": "2020-04-10", "keywords": ["virtually", "convene", "orleans", "producing", "producers", "filmmaker", "southern", "amidst", "producer", "documentary", "lab", "south", "covid19", "film"], "summary": "Southern Film Producers Convene Virtually Amidst Covid-19New Orleans Film Society’s 2020 Southern Producers Lab Participants AnnouncedNew Orleans, La.\nThe Southern Producers Lab launched in 2018 as an extension of New Orleans Film Society’s programs aimed at furthering the professional careers and artistic practices of emerging filmmakers.\nNew Orleans Film Society would also like to thank Sundance Institute and ITVS for their advisory support.\nSHORT BIOS OF SOUTHERN PRODUCERS LAB 2020 FELLOWSAbbey Hoekzema, GeorgiaAbbey Hoekzema is a documentary producer and educator based in Savannah, Georgia.\nABOUT THE NEW ORLEANS FILM SOCIETYThe New Orleans Film Society discovers, cultivates, and amplifies diverse voices of filmmakers who tell the stories of our time."}, {"url": "https://wtkr.com/2020/01/21/tarp-no-longer-covering-body-at-hard-rock-collapse-site-tmw/", "title": "Shifting tarp exposes dead body months after New Orleans Hard Rock collapse", "authors": [], "date": "2020-01-21", "keywords": ["photos", "body", "orleans", "rock", "months", "hard", "cantrell", "building", "dead", "shifting", "exposes", "collapse", "victims", "implosion", "tarp"], "summary": "NEW ORLEANS (WGNO) – Grisly photos surfaced on social media appearing to show the legs of a New Orleans Hard Rock collapse victim whose body was uncovered when a tarp shifted.\nThe condition of the building and the altitude above street level complicate efforts to replace the tarp, as they have prevented recovery thus far.\nThe recovery of the bodies would come after the implosion, which could happen as early as March, Cantrell said.\n“When you think about the bodies in there and that traditional picking-apart demolition seemed to be the best option, but it’s not.\nIt’s just not.”To ensure the safety of the implosion, the city plans to demolish three adjacent buildings as well."}, {"url": "https://www.fox8live.com/2020/03/01/violent-weekend-nola-represents-uptick-murder-rate/", "title": "Violent weekend in New Orleans could indicate uptick in murder rate for 2020", "authors": ["Josh Roberson", "Published At Pm"], "date": "2020-03-01", "keywords": ["violent", "murder", "orleans", "ward", "taken", "shot", "2020", "rate", "n", "tonti", "succumbed", "injuries", "separate", "men", "uptick", "shootings", "weekend", "indicate"], "summary": "Then, two separate shootings in the 7th Ward.\nThe first happened at the 2000 block of N. Tonti where three men were shot and taken to the hospital and one succumbed to his injuries."}, {"url": "https://www.fox8live.com/2019/10/26/over-without-power-louisiana/", "title": "VIDEO: Zack’s forecast; VIPIR RADAR; Over 44,000 without power in Louisiana", "authors": ["Jade Myers", "Published At Pm"], "date": "2019-10-26", "keywords": ["wind", "olgas", "passed", "orleans", "vipir", "rapidly", "zacks", "power", "video", "44000", "southeast", "north", "mph", "recorded", "louisiana", "radar", "forecast"], "summary": "Olga's circulation has passed New Orleans, it's now north of the lake.\nA wind gust to 59 mph was recorded at the airport.\nConditions will rapidly improve across Southeast Louisiana in the next few hours."}, {"url": "https://www.fox8live.com/2019/10/02/new-orleans-sets-new-all-time-hottest-october-temperature/", "title": "New Orleans sets new all-time hottest October temperature", "authors": ["Zack Fradella", "Published At Pm"], "date": "2019-10-02", "keywords": ["hottest", "sets", "orleans", "temperature", "records", "temperatures", "stream", "reporting", "multiple", "site", "highs", "alltime", "audubon", "longer", "park"], "summary": "Records at the airport go back to 1946 but records at Audubon Park go back to 1893 with multiple years reporting 96 or 97 for highs at that site.\nThe site at Audubon does not stream those temperatures on a continuous basis any longer."}, {"url": "https://www.fox8live.com/2019/10/06/president-trump-coming-louisiana-friday-eve-election-day/", "title": "President Trump coming to Louisiana Friday on eve of election day", "authors": ["Published At Pm"], "date": "2019-10-06", "keywords": ["election", "thrilled", "taxes", "president", "voters", "day", "wants", "struggling", "coming", "visit", "eve", "louisiana", "urged", "trump"], "summary": "U.S. Sen. John Kennedy released a statement regarding the president’s visit saying, “I urged President Trump to come to Louisiana and rally voters because this election is important to Louisiana’s future.\nUnder the current governor, taxes are sky high and families are struggling.\nPresident Trump cares about Louisiana, and he wants to help put this state on a better path.\nI am thrilled that he is coming back to Louisiana.”"}, {"url": "https://www.fox8live.com/2019/10/07/man-injured-new-orleans-east-shooting/", "title": "Man injured in New Orleans East shooting", "authors": ["Tiffany Baptiste", "Published At Pm"], "date": "2019-10-07", "keywords": ["scene", "orleans", "shooting", "wound", "male", "extent", "gunshot", "known", "injured", "injuries", "officers", "east", "suffering", "man", "responding"], "summary": "Officers responding to the scene found an adult male suffering from a gunshot wound.\nThe extent of his injuries are not known at this time."}, {"url": "https://www.wwltv.com/article/news/local/orleans/biggest-stories-of-2019/289-fcd21f21-3987-43c7-bd70-2e900f03361d", "title": "2019 in review: what happened this year", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Pm Cst December", "Updated"], "date": "2019-12-31", "keywords": ["happened", "officials", "pelicans", "canal", "orleans", "city", "game", "2019", "20", "car", "louisiana", "review"], "summary": "He didn't play a single game in 2019.\nNew Orleans officials say the chances of a missing worker's survival after the collapse are diminishing, and they have shifted their efforts from rescue to recovery mode.\nThe Tigers quarterback won numerous awards, including the 2019 Heisman Trophy, and graduated from LSU with his Master's degree.\nSome city services have reopened in the closing days of 2019, but many still have no recovery timeline.\nThe cyberattack was identified as ransomware — common malware that infects and locks up servers until a ransom is paid, but city officials say they never received a ransom request."}, {"url": "https://www.fox8live.com/2019/12/05/zurik-worker-hard-rock-hotel-site-describes-warning-signs-ahead-collapse-calls-job-rushed/", "title": "Zurik: Worker at Hard Rock Hotel site describes warning signs ahead of collapse, calls job ‘rushed’", "authors": ["Lee Zurik", "Cody Lillich", "Published April", "At Pm", "Published March"], "date": "2019-12-05", "keywords": ["job", "hard", "rushed", "tell", "wrong", "supervisor", "working", "hotel", "told", "youd", "rock", "site", "went", "boom", "weekend", "zurik", "came", "warning", "worker", "signs"], "summary": "“I remember one weekend we went up in there and we’re working and we’re knocking the pole shores down and we could tell something was wrong,\" he said.\n\"Everytime we would knock one down you’d hear another one go -- Boom!\n-- And so we stopped and we got a supervisor to go up there.\nThe supervisor came up and when he came up he told us it was a – he told us to stop."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisianas-constitutional-amendments-2019-explained/289-8d27f2f2-0531-4b7a-bf8c-0ddcadadb4d4", "title": "What do Louisiana's four proposed constitutional amendments mean?", "authors": ["Author", "Kevin Dupuy", "Published", "Pm Cdt September", "Updated", "Pm Cdt October"], "date": "2019-09-26", "keywords": ["public", "means", "orleans", "constitutional", "louisianas", "vote", "mean", "amendments", "board", "tax", "schools", "proposed", "louisiana", "property"], "summary": "NEW ORLEANS — When Louisiana voters go to the polls for October's gubernatorial primary election, they will decide on four constitutional amendments.\nWhat do those four constitutional amendments on Louisiana's 2019 ballot mean?\nA NO vote means: These three schools and public TV will not be added to a list of Education Excellence Fund recipients.\nA NO vote means: Only allow courts would be allowed to rule on constitutional questions in tax disputes.\nThe city is looking to create property tax exemptions for people who provide affordable housing."}, {"url": "https://www.fox8live.com/2019/10/03/vice-president-pence-headed-new-orleans-area-gop-rally/", "title": "Vice President Pence headed to New Orleans area for GOP rally", "authors": ["Chris Finch", "Published April", "At Pm", "Published March"], "date": "2019-10-03", "keywords": ["pence", "republicans", "really", "rally", "orleans", "important", "headed", "president", "gop", "area", "vice", "vote", "ralph", "great", "lead", "runoff", "louisiana", "rispone"], "summary": "REPUBLICANS of Louisiana, it is really important for you to go out and vote on October 12th for either Eddie Rispone or Ralph Abraham (both Great), which will lead to a runoff against...."}, {"url": "https://www.fox8live.com/2019/10/26/msy-airport-experiencing-power-outage/", "title": "Power restored at Louis Armstrong Airport for second time", "authors": ["Published At Pm"], "date": "2019-10-26", "keywords": ["second", "restored", "airport", "saw", "power", "instagrampower", "wild", "poweroutage", "post", "outage", "nolaweather", "louis", "view", "happen", "flyneworleans", "armstrong"], "summary": "View this post on InstagramPower outage at @flyneworleans.\nWas with @9thwardnelly and saw it happen.\n😳 #nolaweather #poweroutage"}, {"url": "https://www.225batonrouge.com/things-to-do/october-2019-calendar-events", "title": "October 2019 Calendar of Events", "authors": [], "date": "2019-09-27", "keywords": ["rouge", "events", "calendar", "music", "theatre", "art", "market", "2019", "event", "zoo", "hosts", "baton", "band"], "summary": "stgeorgefair.comOct. 19• The Baton Rouge Mini Maker Faire returns, highlighting creative projects from tech, arts and crafts makers.\n1031consortium.comOct. 19, 20 + 26-27The Baton Rouge Zoo hosts its yearly Boo at the Zoo event for “merry, not scary” Halloween fun.\nbrzoo.orgOct. 24Laura Siu Planning & Events hosts Table•Story, a culinary event series highlighting dishes from countries around the world.\ncytbatonrouge.orgOct. 20Contemporary ballet company BalletX travels from Philadelphia for two performances at Manship Theatre presented by Baton Rouge Ballet.\nbatonrougeballet.orgOct. 24The Baton Rouge Symphony Orchestra cycles through five fall-themed pieces with “Bachtoberfest” at the Capitol Park Museum."}, {"url": "https://nola.verylocal.com/best-of-2019-our-photos/109026/", "title": "Best of 2019: Our Photos", "authors": ["Clint Durrett"], "date": "2020-01-02", "keywords": ["photos", "orleans", "best", "second", "annual", "matthew", "quarter", "la", "2019", "saints", "michael", "krewe"], "summary": "We’ve pored over our albums and found photos that have won awards and resurfaced ones that made us pause.\nHere are our best photos of 2019.\n(Photo by Michael DeMocker)The first Krewe Bohème parades through the Marigny and continued through the French Quarter in New Orleans, La.\n(Photo by Matthew Hinton)Artist Ann Marie Auricchio with a rug she designed in an Old Metairie home on Friday, November 22, 2019.\n(Photo by Michael DeMocker)Members of the Roots of Music kickoff Satchmo SummerFest at the U.S. Mint in New Orleans, Friday, August 2, 2019."}, {"url": "https://www.fox8live.com/2019/10/04/new-orleans-sets-another-all-time-record-high-october/", "title": "New Orleans sets another all-time record high for October", "authors": ["Zack Fradella", "Published At Pm"], "date": "2019-10-04", "keywords": ["hit", "sets", "orleans", "thermometer", "temperature", "week", "originally", "high", "later", "alltime", "set", "old", "record"], "summary": "This breaks the old record which was set just earlier this week.\nOriginally the new record was set on Tuesday, October 1 when the thermometer hit 95.\nThat new record was broken just a day later on Wednesday when the high temperature hit 96."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisiana-elections-2019-your-voters-guide/289-d538b36a-1350-47ef-a134-d498eaba3e8e", "title": "Voter Guide for Louisiana's 2019 Election: Everything you need to know", "authors": ["Author", "Kevin Dupuy", "Melinda Deslatte", "Associated Press", "Published", "Pm Cdt September", "Updated", "Pm Cdt October"], "date": "2019-09-30", "keywords": ["guide", "election", "orleans", "state", "know", "louisianas", "term", "race", "court", "voter", "2019", "tax", "need", "office", "louisiana", "ballot", "states"], "summary": "NEW ORLEANS — Louisiana Gov.\nYou can register online through the Louisiana Secretary of State's website or in person at the Registrar of Voter's Office or Louisiana Office of Motor Vehicles.\nArdoin worked as a top deputy in the secretary of state's office before winning the job in last year's special election.\n4: Allow New Orleans to create property tax exemptions in exchange for affordable rentsRELATED: What do Louisiana's four proposed constitutional amendments mean?\nThe secretary of state's office said 665 elected positions are on the ballot, along with 58 local propositions."}, {"url": "https://www.forbes.com/sites/gabrielleigh/2019/11/13/new-orleans-ambitious-new-airport-is-open-but-does-it-measure-up/", "title": "New Orleans’ Ambitious New Airport Is Open, But Does It Measure Up?", "authors": ["Gabriel Leigh", "I'M A Writer", "Filmmaker", "Born In Manhattan", "Raised In Japan", "The Uk", "Now Based In Stockholm. In Between I'Ve Been To", "Countries", "Counting", "I Speak"], "date": "2019-11-13", "keywords": ["measure", "international", "orleans", "kenner", "airport", "louis", "does", "ambitious", "images", "24", "interior", "open", "louisiana", "view"], "summary": "KENNER, LOUISIANA - OCTOBER 24: A general view of the interior of the new airport at Louis Armstrong ... [+] New Orleans International Airport on October 24, 2019 in Kenner, Louisiana.\nKENNER, LOUISIANA - OCTOBER 24: A general view of the interior of the new airport at Louis Armstrong ... [+] New Orleans International Airport on October 24, 2019 in Kenner, Louisiana.\nKENNER, LOUISIANA - OCTOBER 24: A general view of the interior of the new airport at Louis Armstrong ... [+] New Orleans International Airport on October 24, 2019 in Kenner, Louisiana.\nKENNER, LOUISIANA - OCTOBER 24: A general view of the interior of the new airport at Louis Armstrong ... [+] New Orleans International Airport on October 24, 2019 in Kenner, Louisiana.\nKENNER, LOUISIANA - OCTOBER 24: A general view of the interior of the new airport at Louis Armstrong ... [+] New Orleans International Airport on October 24, 2019 in Kenner, Louisiana."}, {"url": "https://nola.eater.com/2019/10/29/20937037/best-halloween-events-day-of-the-dead-new-orleans", "title": "Where to Celebrate Halloween and Day of the Dead in New Orleans", "authors": ["Clair Lorell", "Oct"], "date": "2019-10-29", "keywords": ["celebrate", "orleans", "halloween", "music", "best", "day", "party", "night", "dead", "food", "voodoo"], "summary": "Everyone knows New Orleans is the best place to be for Halloween, making it all the more important to choose one’s stops discerningly.\nIt’s also a great place for Dia de los Muertos (Day of the Dead) revelry, what with the city’s affinity for the dead, and parties.\nBelow are Eater’s picks for the best spots to celebrate Halloween and Dia de los Muertos around New Orleans, with good food and drinks in mind.\nFriday, November 1Day of the Dead/Fet Gede at the New Orleans Healing Center: Hit the Bywater for another chance to learn about voodoo, Mexico’s Day of the Dead, and Haiti’s Fet Gede.\nCasa Borrega’s Batucada Day of the Dead Party: Central City Mexican joint Casa Borrega hosts Cinco de Mayo and Day of the Dead celebrations that are legendary, if you can squeeze inside for the party."}, {"url": "https://saintswire.usatoday.com/gallery/all-remaining-saints-free-agents-before-the-start-of-new-league-year/", "title": "All remaining Saints free agents before the start of new league year", "authors": ["John Sigler", "March", "Pm Et"], "date": "2020-03-18", "keywords": ["start", "orleans", "free", "today", "usa", "2019", "remaining", "credit", "saints", "agents", "tampa", "league", "mandatory", "nov", "la"], "summary": "The NFL’s fiscal year is set to roll over at 3 p.m. CT on Wednesday, March 18, but some New Orleans Saints free agents have already agreed to deals during the legal tampering window.\nHere’s the full list of Saints free agents who still don’t have new contracts:LG Andrus Peat Jan 13, 2019; New Orleans, LA, USA; New Orleans Saints offensive guard Andrus Peat (75) lines… Jan 13, 2019; New Orleans, LA, USA; New Orleans Saints offensive guard Andrus Peat (75) lines up against the Philadelphia Eagles during the third quarter of a NFC Divisional playoff football game at Mercedes-Benz Superdome.\nWilliams #26 of the New Orleans Saints reacts after… NEW ORLEANS, LA – NOVEMBER 22: P.J.\n(Photo by Patrick Smith/Getty Images) moreWR Austin Carr (RFA) Sep 16, 2018; New Orleans, LA, USA; New Orleans Saints wide receiver Michael Thomas (13) celebrates… Sep 16, 2018; New Orleans, LA, USA; New Orleans Saints wide receiver Michael Thomas (13) celebrates with wide receiver Austin Carr (80) after scoring a fourth quarter touchdown against the Cleveland Browns at Mercedes-Benz Superdome.\nGray (48) reacts after… Oct 13, 2019; Jacksonville, FL, USA; New Orleans Saints defensive back J.T."}, {"url": "https://www.fox8live.com/2020/03/28/city-new-orleans-launches-personal-protective-equipment-drive-first-responders/", "title": "City of New Orleans launches personal protective equipment drive for first responders", "authors": ["Published At Pm"], "date": "2020-03-28", "keywords": ["services", "security", "running", "personal", "orleans", "emergency", "city", "drive", "equipment", "protective", "world", "streets", "supply", "responders", "launches", "safe"], "summary": "“Our firefighters, police, and especially Emergency Medical Services (EMS) personnel are on the front lines of the COVID-19 crisis in New Orleans,” said New Orleans Homeland Security and Emergency Preparedness Director Collin Arnold.\n“Like many places around the world, orders of PPE equipment made back in November 2019 have yet to be filled and our supply is running low.\nAny additional equipment the public can donate at this time will help keep our first responders safe and out on the streets.”"}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.texarkanagazette.com/news/sports/pro/story/2020/apr/16/sportstats/824436/", "title": "Sportstats", "authors": ["Associated Press"], "date": "2020-04-16", "keywords": ["sportstats", "vs", "series", "york", "game", "ncaa", "basketball", "classics", "final", "playoffs", "football"], "summary": "(LHORN) NCAA Football Classics Colorado at Texas.\n(LHORN) NCAA Football Classics Oklahoma vs. Texas.\n4 p.m.(LHORN) NCAA Football Classics Colorado at Texas.\n2016 Playoffs -- Final Game 1.\n2016 Playoffs -- Final Game 5."}, {"url": "https://www.globenewswire.com/news-release/2020/04/14/2015315/0/en/SHAREHOLDER-ALERT-BY-FORMER-LOUISIANA-ATTORNEY-GENERAL-KSF-REMINDS-ANAB-MESA-INVESTORS-of-Lead-Plaintiff-Deadline-in-Class-Action-Lawsuits.html", "title": "SHAREHOLDER ALERT BY FORMER LOUISIANA ATTORNEY GENERAL: KSF REMINDS ANAB, MESA INVESTORS of Lead Plaintiff Deadline in Class Action Lawsuits", "authors": ["Kahn Swick", "Foti"], "date": "2020-04-14", "keywords": ["foti", "public", "shareholder", "learn", "mesa", "plaintiff", "motion", "period", "securities", "reminds", "lawsuits", "visit", "lead", "louisiana", "ksf", "general", "investors"], "summary": "If you wish to serve as a Lead Plaintiff in the class action, you must petition the Court on or before the Lead Plaintiff Motion deadline.\nAboutKSF, whose partners include former Louisiana Attorney General Charles C. Foti, Jr., is one of the nation’s premier boutique securities litigation law firms.\nKSF serves a variety of clients – including public institutional investors, hedge funds, money managers and retail investors – in seeking recoveries for investment losses emanating from corporate fraud or malfeasance by publicly traded companies.\nKSF has offices in New York, California and Louisiana.\nTo learn more about KSF, you may visit www.ksfcounsel.com ."}, {"url": "https://www.motherjones.com/politics/2020/04/voter-purges-wisconsin-republican-election/", "title": "Republicans Are Trying to Kick Thousands of Voters Off the Rolls During a Pandemic", "authors": ["Ari Berman", "Becky Z. Dernbach", "Julia Lurie", "Rebecca Leber", "Ali Breland", "Daniel King", "Laura Thompson", "Nathalie Baptiste", "Alexander C. Kaufman", "Naveena Sadasivam"], "date": "2020-04-14", "keywords": ["republicans", "election", "purge", "thousands", "pandemic", "voters", "kick", "state", "vote", "voter", "trying", "registration", "voting", "rolls", "states"], "summary": "Roll ReversalsBetween 2016 and 2018, more than 17 million names were taken off voter rolls nationwide.\nWisconsin: 14% of voters removed, 2016-18In 2017, Wisconsin officials mailed postcards to 340,000 registered voters thought to have moved, informing them that they would be removed from voter rolls if they did not respond.\nOklahoma: 11.7% of voters removed, 2016-18Oklahoma’s “use-it-or-lose-it” voter registration law means voters are purged if they don’t vote for several election cycles and don’t respond to a mailing.\nFrom 2016 to 2018, 17 million Americans—8 percent of the nation’s electorate—were taken off the voting rolls, according to the Brennan Center for Justice.\nLast year, Judicial Watch reached a settlement with California to reassess 1.5 million names on the voter rolls in Los Angeles County."}, {"url": "https://virtual-strategy.com/2020/04/15/shareholder-alert-claimsfiler-reminds-fitb-i-serv-zm-investors-of-lead-plaintiff-deadline-in-class-action-lawsuits/", "title": "SHAREHOLDER ALERT: CLAIMSFILER REMINDS FITB, I, SERV, ZM INVESTORS of Lead Plaintiff Deadline in Class Action Lawsuits", "authors": ["Skymedia"], "date": "2020-04-15", "keywords": ["shareholder", "fitb", "plaintiff", "motion", "deadline", "learn", "serv", "zm", "securities", "reminds", "lawsuits", "visit", "lead", "class", "action", "period", "investors", "fraudto"], "summary": "April 15, 2020 22: 50 ET| Source: SkyMedia, LLCNEW ORLEANS, April 15, 2020 (GLOBE NEWSWIRE) — ClaimsFiler, a FREE shareholder information service, reminds investors of pending deadlines in the following securities class action lawsuits:Fifth Third Bancorp (FITB)Class Period: 2/26/2016 – 3/6/2020Lead Plaintiff Motion Deadline: June 8, 2020SECURITIES FRAUDTo learn more, visit https://www.claimsfiler.com/cases/view-fifth-third-bancorp-securities-litigation-1Intelsat S.A. (I)Class Period: 11/5/2019 – 11/18/2019Lead Plaintiff Motion Deadline: June 8, 2020SECURITIES FRAUDTo learn more, visit https://www.claimsfiler.com/cases/view-silver-lake-group-llc-intelsat-sa-securities-litigationZoom Video Communications, Inc. (ZM)Class Period: 4/18/2019 – 4/6/2020Lead Plaintiff Motion Deadline: June 8, 2020SECURITIES FRAUDTo learn more, visit https://www.claimsfiler.com/cases/view-zoom-video-communications-inc-securities-litigationServiceMaster Global Holdings, Inc. (SERV)Class Period: 2/26/2019 – 11/4/2019Lead Plaintiff Motion Deadline: June 9, 2020SECURITIES FRAUDTo learn more, visit https://www.claimsfiler.com/cases/view-servicemaster-global-holdings-inc-securities-litigationIf you purchased shares of the above companies and would like to discuss your legal rights and your right to recover for your economic loss, you may, without obligation or cost to you, contact us toll-free (844) 367-9658 or visit the case links above.\nIf you wish to serve as a Lead Plaintiff in the class action, you must petition the Court on or before the Lead Plaintiff Motion deadline.\nAbout ClaimsFilerClaimsFiler has a single mission: to serve as the information source to help retail investors recover their share of billions of dollars from securities class action settlements.\nAt ClaimsFiler.com, investors can: (1) register for free to gain access to information and settlement websites for various securities class action cases so they can timely submit their own claims; (2) upload their portfolio transactional data to be notified about relevant securities cases in which they may have a financial interest; and (3) submit inquiries to the Kahn Swick & Foti, LLC law firm for free case evaluations."}, {"url": "https://www.nytimes.com/interactive/2019/11/16/us/elections/results-louisiana-general-elections.html", "title": "2019 Louisiana Election Results", "authors": ["The New York Times"], "date": "2019-11-16", "keywords": ["mr", "election", "making", "state", "president", "vulnerable", "edwards", "2019", "warned", "results", "louisiana", "rispone", "trump"], "summary": "John Bel Edwards of Louisiana has appealed to voters in his conservative state with his stances on abortion and guns.\nYet he is still a Democrat, making him vulnerable in a state where President Trump is popular.\nHe faces a challenge from Eddie Rispone, a Baton Rouge businessman who emerged as the second-place finisher in last month's nonpartisan primary.\nRead moreMr. Edwards has warned that his opponent would return Louisiana to the slashed services and budget deficits that were partly attributable to his Republican predecessor, Bobby Jindal, and that he helped correct.\nMr. Rispone has made his campaign largely about aligning himself with President Trump and his policies, effectively making the election a test of Mr. Trump's influence and the strength of partisan allegiances."}, {"url": "https://thelensnola.org/2019/11/06/compare-2019-new-orleans-school-ratings/", "title": "Compare 2019 New Orleans school ratings", "authors": ["More Marta Jewson", "Mjewson Thelensnola.Org"], "date": "2019-11-06", "keywords": ["district", "orleans", "ratings", "state", "charter", "received", "school", "2019", "scores", "schools", "compare", "f", "earned"], "summary": "Many New Orleans school grades were brought up somewhat by a new formula adopted last year that incorporates year-over-year academic growth.\nThis year, two charter schools up for renewal — Mary D. Coghill Charter School and Joseph A. Craig Charter School — received F’s and will likely not operate beyond the end of the school year when their contracts expire.\nOn ACT scores, it earned an F.Harney Elementary School school also had a difficult 2018-2019 school year.\nHarney’s last ever school performance grade is an F.Meanwhile, a very small state-run charter school Uptown, Noble Minds Institute, did not receive a letter grade.\n2019 New Orleans school ratings2019 New Orleans high school ratingsBecause high school scores are calculated differently than elementary schools, we’ve added a separate table with full high school data."}, {"url": "https://www.wwltv.com/article/news/health/survey-louisiana-among-the-worst-areas-in-us-for-flu-activity/289-a5ffca0c-9115-4d6a-aa9e-9de72571db4e", "title": "Survey: Louisiana among the worst areas in US for flu activity", "authors": ["Author", "Wwl Staff", "Published", "Am Cst November", "Updated"], "date": "2019-11-21", "keywords": ["rouge", "activity", "flu", "orleans", "mississippi", "worst", "walgreens", "texas", "survey", "louisiana", "areas", "la"], "summary": "NEW ORLEANS — Louisiana, Mississippi and Texas lead the nation in flu activity, according to a Walgreen's survey that ended last week.\nLafayette topped the list, but New Orleans, Baton Rouge and Biloxi all ranked in the top six areas in the United States with the highest incidence of flu, the Walgreens Flu Index reports.\nThe survey uses national retail prescription data for antiviral medicine used to treat the flu at Walgreens stores.\nTop 10 Designated Market Areas (DMAs) with Flu Activity (11/16/2019)Lafayette, La.\nNew Orleans, La."}, {"url": "https://nola.verylocal.com/event/wine-on-the-river-new-orleans-2019/72735/", "title": "Wine on the River New Orleans 2019", "authors": [], "date": "2019-08-28", "keywords": ["valid", "orleans", "beverage", "includes", "tickets", "2019", "event", "wine", "allowed", "food", "river", "glass", "admission"], "summary": "Join us at the 4th Annual Wine on the River New Orleans at the beautiful Audubon Aquarium Plaza Saturday, November 2nd, 2019 from 3pm-6pm.\nWith an “Around the World” theme focusing on cultural regions with wine and food in each selected area.\nTickets for the Wine on the River New Orleans include admission into the event, a souvenir glass, all beverage samples, and passport brochure.\nTICKETING INFO GENERAL ADMISSION: INCLUDES EVENT SOUVENIR TASTING GLASS, ALL BEVERAGE SAMPLES, A PASSPORT BROCHURE AND A DONATION TO LOUISIANA HOSPITALITY FOUNDATION.\nNON-DRINKING: INCLUDES ADMISSION INTO EVENT AND A BOTTLE OF WATER."}, {"url": "https://www.12newsnow.com/article/news/health/coronavirus/saturday-march-28-southeast-texas-covid19-updates/502-0c2593ac-75fd-4726-a07d-0c98930d4f62", "title": "Southeast Texas COVID-19 updates: CDC issues travel warning for New York, New Jersey, Connecticut", "authors": ["Author", "Kbmt", "Associated Press", "Published", "Am Cdt March", "Updated", "Pm Cdt March"], "date": "2020-03-28", "keywords": ["officials", "warning", "issues", "virus", "state", "updates", "york", "southeast", "covid19", "coronavirus", "deaths", "texas", "county", "travel", "health", "jersey", "connecticut", "trump"], "summary": "Italy’s COVID-19 deaths down slightly from previous day.\nMarch 28 12 p.m. - President Trump has been reportedly considering a two week quarantine for New York, as WNBC New York reports.\nIn addition to New York, New Jersey and Connecticut are also being considered as well as the number of COVID-19 cases in that tri-state area continue to rise.\nHealth officials have been warning for more than a decade about the dangers of epidemics in jails and prisons.\nThe 14 businesses shut down by the county included five liquor establishments, two smoke shops, two car washes, a furniture store, a shoe retailer, and a gym, county officials said."}, {"url": "https://www.thenewsstar.com/story/news/2019/12/30/here-louisiana-top-10-political-stories-2019-john-bel-edwards-donald-trump-lsu-new-orleans-saints/2773830001/", "title": "What were the Top 10 political stories in Louisiana in 2019?", "authors": ["Greg Hilburn", "Published A.M. Ct Dec."], "date": "2019-12-30", "keywords": ["gov", "state", "lsu", "president", "edwards", "2019", "bel", "john", "louisiana", "republican", "political", "trump"], "summary": "CLOSE Crowd cheers for Louisiana Gov.\nSo it's not surprising what political headline rose to the top in 2019, but can you name the rest of the Top 10 political stories of the year?\nJohn Bel Edwards secured a narrow second term victory to remain the only Democratic governor in the Deep South.\nLouisiana Gov.\n\"I love Louisiana,\" Trump said at every stop."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisiana-elections-2019-your-voters-guide/289-d538b36a-1350-47ef-a134-d498eaba3e8e", "title": "Voter Guide for Louisiana's 2019 Election: Everything you need to know", "authors": ["Author", "Kevin Dupuy", "Melinda Deslatte", "Associated Press", "Published", "Pm Cdt September", "Updated", "Pm Cdt October"], "date": "2019-09-30", "keywords": ["guide", "election", "orleans", "state", "know", "louisianas", "term", "race", "court", "voter", "2019", "tax", "need", "office", "louisiana", "ballot", "states"], "summary": "NEW ORLEANS — Louisiana Gov.\nYou can register online through the Louisiana Secretary of State's website or in person at the Registrar of Voter's Office or Louisiana Office of Motor Vehicles.\nArdoin worked as a top deputy in the secretary of state's office before winning the job in last year's special election.\n4: Allow New Orleans to create property tax exemptions in exchange for affordable rentsRELATED: What do Louisiana's four proposed constitutional amendments mean?\nThe secretary of state's office said 665 elected positions are on the ballot, along with 58 local propositions."}, {"url": "https://newslagoon.com/la-rams-biggest-gaffe-was-aqib-talib-not-cooks-nor-gurley/18185/", "title": "LA Rams biggest gaffe was Aqib Talib, not Cooks nor Gurley", "authors": ["Team Newslagoon"], "date": "2020-04-15", "keywords": ["biggest", "away", "2020", "traded", "gurley", "talib", "rams", "cooks", "gaffe", "nfl", "draft", "cornerback", "trading", "aqib", "la"], "summary": "The LA Rams clean-up of bad contracts has brought critics out of the woodwork.\nHe played for the LA Rams for eight games in 2018, and just 5 games in 2019.\nIn total, he took 722 defensive snaps for the LA Rams, at a salary cost of $14,764,706, or $20,450 per defensive snap.\nRams Get Miami Dolphins 2022 7th rd pick Dolphins Get CB Aqib Talib LA Rams 2020 5th rd pickIn short, the Rams traded picks to obtain, and then to shed, Talib.\nNext: LA Rams pre-2020 NFL Draft meetings summary by positionThe Rams have made some bone-headed moves recently, all intended to take a chance."}, {"url": "https://www.fox8live.com/2019/11/03/saturday-marks-highest-single-day-early-voter-turnout-louisiana-history/", "title": "Saturday marks highest single day early voter turnout in Louisiana history", "authors": ["Josh Roberson", "Published At Pm"], "date": "2019-11-03", "keywords": ["sherman", "right", "politics", "means", "state", "highest", "single", "early", "day", "voter", "set", "pitch", "paying", "washington", "history", "louisiana", "marks", "turnout"], "summary": "“We have two candidates with two very different directions they want to lead the state in.\nAnd with the fever pitch of politics in Washington D.C. set to the back drop of an impeachment inquiry, people are engaged right now and that means a lot of people paying attention to this election in Louisiana,\" said Sherman."}, {"url": "https://www.fox8live.com/2019/11/30/end-hurricane-season-look-final-numbers/", "title": "End of Hurricane Season 2019: A look at the final numbers", "authors": ["Zack Fradella", "Published At Pm"], "date": "2019-11-30", "keywords": ["orleans", "hurricane", "storms", "region", "2019", "local", "major", "numbers", "final", "end", "spared", "wvue", "season", "look", "la"], "summary": "NEW ORLEANS, La.\n(WVUE) - Another hurricane season has come to an end along the Gulf Coast and although our local region was spared from major storms, it was certainly an active season across the Atlantic."}, {"url": "https://www.wwltv.com/article/news/politics/elections/louisiana-2019-elections-results-recap/289-8796aa35-3989-43e8-975a-6dc2c3dd1c2f", "title": "Louisiana 2019 Elections Results recap", "authors": ["Author", "Melinda Deslatte", "Associated Press", "Published", "Pm Cdt October", "Updated"], "date": "2019-10-13", "keywords": ["election", "elections", "state", "term", "race", "orleans", "reelected", "edwards", "2019", "recap", "tax", "results", "louisiana", "face"], "summary": "Runoff elections are held among the top two vote-getters in each competition if no candidate reaches more than 50% of the vote.\nEdwards says Louisiana is rebounding from an economic recession and a decade of budget crises after a bipartisan tax deal ended the state's financial instability.\nRELATED: Jim Donelon re-elected as Louisiana insurance commissionerFew other opponents to the GOP incumbents had done significant fundraising.\nRELATED: Kyle Ardoin to face Gwen Collins-Greenup in Secretary of State run-offLouisiana Constitutional AmendmentsVoters decided four proposals to change the Louisiana Constitution.\nRELATED: Edwards will face Rispone in Louisiana's governor race runoffRELATED: Louisiana Election Results 2019► Get breaking news from your neighborhood delivered directly to you by downloading the new FREE WWL-TV News app now in the IOS App Store or Google Play."}, {"url": "https://www.fox8live.com/2019/11/21/new-orleans-city-council-approves-budget/", "title": "New Orleans City Council approves 2020 budget", "authors": ["Sabrina Wilson", "Published At Pm"], "date": "2019-11-21", "keywords": ["journalists", "orleans", "council", "2020", "winning", "city", "reporters", "approves", "recognized", "press", "mentored", "work", "national", "budget", "sabrina"], "summary": "An award winning journalist whose work as been recognized at both the national and local level, Sabrina has covered almost every story imaginable.\nSabrina is a member of the National Association of Black Journalists, Investigative Reporters and Editors, and the New Orleans Press Club and has mentored several aspiring journalists."}, {"url": "https://www.fox8live.com/2019/11/17/election-heres-what-you-need-know/", "title": "WATCH LIVE: FOX 8 Election 2019 coverage", "authors": ["Published At Pm"], "date": "2019-11-17", "keywords": ["voted", "live", "shows", "election", "watch", "voters", "vote", "number", "2019", "likely", "poll", "undecided", "fox", "latest", "respondents", "coverage"], "summary": "Couvillon’s latest poll shows 6 percent of voters are still undecided, though some of those respondents voted early and did not disclose who they cast ballots for and others he says are not likely to vote.\nHe says the actual number of undecided voters is likely closer to 2 percent."}, {"url": "https://www.fox8live.com/2019/11/21/boil-water-advisory-issued-parts-new-orleans-east/", "title": "S&WB lifts boil water advisory for New Orleans East", "authors": ["Published At Pm"], "date": "2019-11-21", "keywords": ["using", "swb", "boil", "orleans", "plumbing", "lifts", "minutes", "inside", "system", "advisory", "outside", "residents", "running", "east", "water"], "summary": "S&WB says residents should flush their plumbing inside and outside by running water through their system for several minutes before using the water in their homes again."}, {"url": "https://www.wdsu.com/article/new-map-shows-new-orleans-crime-camera-locations-after-city-loses-fight-to-keep-info-secret/32095394", "title": "New map shows New Orleans crime camera locations after city loses fight to keep info secret", "authors": ["Wdsu Digital Team", "Https", "Www.Facebook.Com"], "date": "2020-04-10", "keywords": ["shows", "public", "month", "loses", "orleans", "crime", "map", "fight", "city", "secret", "louisiana", "info", "office", "information", "law", "locations"], "summary": "Hide Transcript Show TranscriptSULA: NEW ORLEANIANS CAN NOW ACCESS A MAP SHOWING WHERE MORE THAN 400 OF THE CITY’S CRIME CAMERAS ARE LOCATED.\nTHE LOCATIONS WERE KEPT SECRET UNTIL COURTS RULED IN FAVOR OF A DEFENSE ATTORNEY WHO ARGUED THE CITY SHOULD SHARE THE LOCATIONS WITH THE PUBLIC.\nThe American Civil Liberties Union of Louisiana, which represented Orleans Public Defenders Office lawyer Laura Bixby in the suit, said in an update on Thursday the map is now publicly accessible.\nThe city in 2018 denied Bixby's request for a map showing the cameras’ locations.\nHer attorneys argued the New Orleans Office of Homeland Security did not qualify for an exemption from the public records law because it was not an intelligence or law enforcement agency."}, {"url": "https://www.ncronline.org/news/people/survival-ethos-marks-new-orleans-now-epicenter-covid-19", "title": "Survival ethos marks New Orleans, now an epicenter of COVID-19", "authors": ["Apr", "Nov", "Mar", "Sep"], "date": "2020-03-19", "keywords": ["orleans", "ethos", "music", "state", "mass", "dont", "social", "survival", "lambeth", "residents", "covid19", "epicenter", "st", "work", "marks"], "summary": "Lector Philip Alviar reads from the Book of Deuteronomy during a private Mass March 17, 2020, inside the empty, 950-seat St. Louis Cathedral in New Orleans.\nNew Orleans Archbishop Gregory Aymond canceled all public Masses in the archdiocese to slow the spread of coronavirus.\nThe deaths and 176 cases have been reported in New Orleans, the epicenter of a state that \"now has the third-highest rate per capita in the country,\" reports the Times-Picayune/Advocate .\nMany Lambeth residents come from prominent families and have active social lives, particularly at the winter Carnival balls; some travel abroad.\nBut a survival ethos marks New Orleans to its marrow."}, {"url": "https://www.wdsu.com/article/new-orleans-must-disclose-locations-of-400-crime-cameras-courts-find/31789748", "title": "New Orleans must disclose locations of 400 crime cameras, courts find", "authors": ["Wdsu Digital Team", "Https", "Www.Facebook.Com"], "date": "2020-03-19", "keywords": ["public", "security", "information", "orleans", "ruling", "crime", "city", "office", "disclose", "cameras", "400", "louisiana", "courts", "locations"], "summary": "Advertisement New Orleans must disclose locations of 400 crime cameras, courts find Share Shares Copy Link CopyThe City of New Orleans must provide the locations of its 400 crime cameras, courts in Louisiana have ruled.\nThe Louisiana Supreme Court this week declined to consider the city’s appeal of a lower court’s ruling ordering officials to reveal where the cameras are located, the American Civil Liberties Union of Louisiana said Thursday.\nThe city in 2018 denied request from an Orleans Public Defender attorney, Laura Bixby, for a map showing the cameras’ locations.\nRepresentatives from the City of New Orleans did not immediately respond to a request for comment on Thursday.\nLisa Graybill, deputy legal director for the Southern Poverty Law Center, noted the homeland security office had already shared the information about the camera locations with law enforcement and prosecutors."}, {"url": "https://neworleanscitybusiness.com/blog/2020/04/15/st-tammany-parish-office-market-saw-growth-in-2019/", "title": "St. Tammany Parish office market saw growth in 2019 – New Orleans CityBusiness", "authors": ["Andrew Valenti"], "date": "2020-04-15", "keywords": ["tammany", "realty", "orleans", "corporate", "report", "saw", "citybusiness", "market", "covington", "2019", "parish", "office", "square", "growth", "st"], "summary": "The St. Tammany Parish office submarket continued to show steady growth in 2019, with multiple companies making announcements to either expand or build new corporate headquarters heading into 2020.\nThat’s according to a recent year-end report from Corporate Realty, which offers a snapshot of the current market and analyzes trends for the metro area.\nAmpirical officials said last year it will consolidate its existing St. Tammany Parish locations into the new three-story office building.\n“Subsequent Corporate Realty email blasts and future Corporate Realty reports will address our thoughts on this important topic.”The Class A office market in St. Tammany Parish had a 98.6% occupancy rate in 2019 with an average price per square foot of $25.80, down from $26.60 in 2018.\nThe Cypress Bend Office Building at 1001 Ochsner Boulevard is 94% occupied and commands the highest rents in St. Tammany Parish at $28 per square foot, the report says."}, {"url": "https://www.cnbc.com/2020/04/15/coronavirus-live-updates.html", "title": "LA mayor says large gatherings likely banned until 2021, US coronavirus cases top 630,000", "authors": ["Jennifer Elias Kif Leswing Patti Domm", "Jennifer Elias", "Kif Leswing", "Patti Domm", "In"], "date": "2020-04-15", "keywords": ["630000", "coronavirus", "banned", "la", "large", "million", "according", "2021", "mayor", "covid19", "public", "pandemic", "week", "world", "gatherings", "cases", "york", "health", "likely"], "summary": "Zoom has seen enormous growth as more and more workers have been instructed to stay at home during the coronavirus pandemic.\nCNBC Make It rounded up a list of insurance companies that have announced initiatives for drivers during the current coronavirus health crisis.\n—Megan Leonhardt12:02 pm: McDonald's relationship with US franchisees is fraying over coronavirus reliefThe coronavirus pandemic is straining McDonald's relationship with its U.S. franchisees once again.\n\"Halting funding for the World Health Organization during a world health crisis is as dangerous as it sounds,\" Gates said on Twitter early Wednesday morning.\nTrump said Tuesday the U.S. will suspend funding to the WHO while it reviews the agency's response to the Covid-19 pandemic."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.latimes.com/california/story/2020-04-12/coronavirus-attention-impeachment-primaries-kobe", "title": "Impeachment. Primaries. Kobe. Coronavirus rushed in while our focus was elsewhere", "authors": ["James Rainey Has Covered Multiple Presidential Elections", "The Media", "The Environment", "Mostly At The Los Angeles Times", "Which He First Joined In He Was Part Of Times Teams That Won Three Pulitzer Prizes.", "Kiera Feldman Joined The Los Angeles Times As An Investigative Reporter In She Came Propublica", "Where Her Reporting On New York City S Private Trash Industry Exposed Labor Abuses", "Corruption", "Leading To A Federal Investigation", "New City Laws. She Won The Livingston Award In For An Investigation Of College Sexual Assault Mishandling. A Longtime Magazine Journalist"], "date": "2020-04-12", "keywords": ["times", "primaries", "occasionally", "weeksign", "newsletter", "shaping", "sent", "impeachment", "coronavirus", "promotional", "kobe", "focus", "rushed", "receive", "upyou", "speed"], "summary": "Newsletter The stories shaping CaliforniaGet up to speed with our Essential California newsletter, sent six days a week.\nSign Me UpYou may occasionally receive promotional content from the Los Angeles Times."}, {"url": "https://www.cnbc.com/2019/12/13/new-orleans-reports-cyberattacks-after-other-attacks-in-louisiana.html", "title": "New Orleans shuts off computers after cyberattack, following two big incidents in Louisiana this year", "authors": ["Kate Fazzini"], "date": "2019-12-13", "keywords": ["services", "department", "ransom", "orleans", "state", "attacks", "emergency", "city", "cyberattack", "big", "ransomware", "computers", "incidents", "louisiana", "following", "shuts", "told"], "summary": "In this Sept. 22, 2017 file photo, New Orleans mayoral candidate LaToya Cantrell listens to donors at the home of Robert Ripley in New Orleans.\nThe city said emergency services like 911 and the fire department were still up and running, and didn't specify any agencies that had been shut down.\nAccording to the New Orleans Times-Picayune, the new series of attacks, which have not yet been confirmed as ransomware, were affecting city services.\nAn announcement at City Hall on Friday told workers, including those at the police department, to unplug computers, according to the report.\nA spate of ransomware attacks hit 23 Texas towns in a coordinated fashion in August."}, {"url": "https://www.theadvertiser.com/story/news/local/louisiana/2019/12/02/new-orleans-shooting-french-quarter/2588171001/", "title": "New Orleans shooting stemmed from feud outside city, police say", "authors": ["Andrew J. Yawn", "Published P.M. Ct Dec."], "date": "2019-12-02", "keywords": ["edge", "orleans", "shooting", "street", "french", "city", "stemmed", "say", "ferguson", "working", "outside", "victims", "wounded", "feud", "quarter"], "summary": "CLOSEThe Canal Street shooting that injured 10 over the weekend was not a domestic terrorism attack, New Orleans officials said at a press conference Monday.\nNew Orleans Police Department Superintendent Shaun Ferguson said the investigation has shown the shooting stemmed from a feud between individuals who are believed to be from Louisiana but from outside the New Orleans metropolitan area.\n“They openly, brazenly and cowardly decided to fire their weapons.”More: 10 wounded in shooting at New Orleans French QuarterThe 10 victims included five women and five men.\nOne of the victims was 16 years old; the other victims were over the age of 21, Ferguson said.\nOne person, who was detained early Sunday morning minutes after the shooting, has been released after being cleared by video evidence, Ferguson said."}, {"url": "https://www.fox8live.com/2019/12/03/video-alarm-fire-burns-down-popular-marigny-bar-new-orleans/", "title": "VIDEO: 2-alarm fire burns down popular Marigny bar in New Orleans", "authors": ["Chris Finch", "Published At Pm"], "date": "2019-12-03", "keywords": ["burns", "2alarm", "orleans", "alerted", "used", "units", "operations", "video", "bar", "neighbor", "personnel", "incident", "house", "residents", "nofd", "marigny", "popular"], "summary": "One of the residents in the duplex said she was alerted by her cat that house was on fire and she then alerted the downstairs neighbor.\nFifteen NOFD units carrying forty Fire Operations personnel were used to bring this incident under control at 1:34 a.m."}, {"url": "https://www.texarkanagazette.com/news/sports/pro/story/2020/apr/16/sportstats/824436/", "title": "Sportstats", "authors": ["Associated Press"], "date": "2020-04-16", "keywords": ["sportstats", "vs", "series", "york", "game", "ncaa", "basketball", "classics", "final", "playoffs", "football"], "summary": "(LHORN) NCAA Football Classics Colorado at Texas.\n(LHORN) NCAA Football Classics Oklahoma vs. Texas.\n4 p.m.(LHORN) NCAA Football Classics Colorado at Texas.\n2016 Playoffs -- Final Game 1.\n2016 Playoffs -- Final Game 5."}, {"url": "https://www.realclearpolitics.com/video/2020/04/14/watch_live_trump_coronavirus_task_force_hold_white_house_briefing_tuesday_april_14.html", "title": "Watch: Trump, Coronavirus Task Force Hold White House Briefing (Tuesday, April 14)", "authors": [], "date": "2020-04-14", "keywords": ["white", "task", "coronavirus", "briefing", "know", "thats", "hold", "force", "house", "going", "14", "ventilators", "trump", "watch", "president", "health", "thank", "think", "great", "states"], "summary": "President Trump and Coronavirus Task Force hold their daily White House press briefing on Tuesday.\nTHE PRESIDENT: Thank you very much.\nTHE PRESIDENT: Thank you.\nAscension Health, CommonSpirit Health, Community Health Systems, Trinity Health, Cardinal Health, McKesson, 3M.\nYou look at Javits Center — a great, great job that the Army Corps of Engineers did; FEMA got involved."}, {"url": "https://www.wwltv.com/article/news/crime/number-of-murders-in-new-orleans-near-1971-low/289-cda316d5-2784-4bdc-8742-66ab4b096195", "title": "New Orleans sees lowest murder total in nearly 50 years for 2019", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Am Cst December", "Updated", "Pm Cst December"], "date": "2019-12-31", "keywords": ["total", "murder", "orleans", "sees", "crime", "number", "city", "rate", "2019", "murders", "50", "reduce", "nearly", "violence", "lowest"], "summary": "This is the third year in a row the city's total number of murders has declinedThe low number of murders in New Orleans doesn't come as a surprise.\nThe murder rate of a city indicates how many people per 100,000 residents are murdered every year.\nIn 2018, the murder rate for New Orleans was roughly 37 murders per 100,00 people.\nThe last time New Orleans' murder rate was around 30 per 100,000 residents was in 1986.\nAsher tweeted that the 2019 murder rate was comparable to Kansas City and Memphis, meaning the Crescent City could drop out of the top five cities in the U.S. for the unfavorable statistic."}, {"url": "https://www.nola.gov/nofd/news-updates/2019/20191202-fire-with-fatality-at-2726-o%E2%80%99reilly-street/", "title": "20191202 Fire with Fatality at 2726 O’Reilly Street", "authors": [], "date": "2019-12-02", "keywords": ["department", "woodframed", "minutes", "street", "orleans", "units", "oreilly", "fatality", "working", "nofd", "2726", "unidentified", "firefighter", "1138", "20191202"], "summary": "On Monday, December 2, 2019 at 11:38 a.m. the New Orleans Fire Department (NOFD) was dispatched to 2726 O’Reilly Street.\nFire companies arrived within 4 minutes to find a single-story, wood-framed shotgun double with flames coming from the rear of the house.\nFirefighters extinguished the fire within minutes and found a 76 year old male burned beyond recognition in the kitchen of the home.\nThe New Orleans Police Department (NOFD), and the Louisiana State Fire Marshal’s Office are currently working to investigate this incident.\nUnder Control: 11:55 a.m.NOFD Units: 8NOFD Personnel: 24Injuries: One Firefighter, ankleFatalities: One unidentified maleCause: Under Investigation-30-"}, {"url": "https://www.fox8live.com/2019/12/23/woman-shot-new-orleans-east-area/", "title": "Woman shot in New Orleans East area", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2019-12-23", "keywords": ["orleans", "shot", "street", "area", "morrison", "press", "woman", "source", "east", "road", "neighborhood", "leg"], "summary": "A woman was shot in the leg at the intersection of Morrison Road and Alabama Street in the New Orleans East neighborhood.\n(Source: Associated Press)"}, {"url": "https://www.fox8live.com/2019/12/03/new-video-shows-chaos-after-canal-st-mass-shooting/", "title": "New video shows chaos after New Orleans mass shooting", "authors": ["Published At Pm"], "date": "2019-12-03", "keywords": ["shows", "chaos", "detectives", "shooting", "orleans", "mass", "believe", "shooter", "video", "injured", "say", "reason", "louisiana", "hospital"], "summary": "Ten people were injured in the shooting, two are still in the hospital.\nDetectives say they have reason to believe the shooter is from Louisiana, but not New Orleans."}, {"url": "https://www.fox8live.com/2019/12/14/boil-water-advisory-issued-algiers/", "title": "Boil water advisory lifted for West Bank area", "authors": ["Tiffany Baptiste", "Published At Pm"], "date": "2019-12-14", "keywords": ["boil", "west", "report", "used", "area", "plumbing", "minutes", "bank", "system", "advisory", "residents", "running", "lifted", "water", "tests", "safe"], "summary": "After tests, they have confirmed that the water is now safe to use.\nResidents who have not used their water during the course of the advisory are asking to flush internal and external plumbing by running water through their system for several minutes, according to the report."}, {"url": "https://www.fox8live.com/2019/12/17/nopd-seeking-two-suspects-responsible-two-new-orleans-burglaries/", "title": "NOPD seeking suspects responsible for two New Orleans burglaries", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2019-12-17", "keywords": ["orleans", "tchoupitoulas", "street", "dec", "south", "17", "occurred", "burglaries", "suspects", "incidents", "responsible", "seeking", "block", "rampart", "nopd", "3000"], "summary": "One of the incidents occurred in the 3000 block of Tchoupitoulas Street on Dec. 16 and the other in the 1200 block of South Rampart on Dec. 17."}, {"url": "https://www.fox8live.com/2019/12/19/watch-nopd-searching-suspect-south-rampart-street-shooting/", "title": "WATCH: NOPD searching for suspect in South Rampart Street shooting", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2019-12-19", "keywords": ["suspect", "shooting", "street", "watch", "shot", "searching", "run", "complied", "south", "dog", "demanded", "leg", "victim", "rampart", "nopd", "walking"], "summary": "At around 2 a.m., the victim was walking his dog when the shooting suspect approached him and demanded his belongings.\nAlthough the victim complied, the suspect shot him in the back of the leg as he attempted to run away."}, {"url": "https://www.bigeasymagazine.com/2019/11/26/new-orleans-youth-will-strike-for-the-climate-on-dec-6/", "title": "New Orleans Youth will Strike for the Climate on Dec 6", "authors": [], "date": "2019-11-26", "keywords": ["orleans", "university", "relocation", "youth", "xavier", "vice", "dec", "organized", "climate", "gordon", "young", "plaza", "strike"], "summary": "On December 6th, young people from all over the New Orleans Metro Area will strike, walking out of their classrooms and workplaces.\nResidents of Gordon Plaza and the #NoGasPlant Coalition will also be joining in.\nSpeakers include:Ida Schenck , a 12-year-old climate activist, who has organized multiple climate strikes for students in her school.\n, a 12-year-old climate activist, who has organized multiple climate strikes for students in her school.\nThe event is being organized by the Sunrise Moment, which has worked diligently to change the national conversation on climate change and climate policy."}, {"url": "https://www.wwltv.com/article/news/local/orleans/biggest-stories-of-2019/289-fcd21f21-3987-43c7-bd70-2e900f03361d", "title": "2019 in review: what happened this year", "authors": ["Author", "Chris Mccrory", "Wwl", "Published", "Pm Cst December", "Updated"], "date": "2019-12-31", "keywords": ["happened", "officials", "pelicans", "canal", "orleans", "city", "game", "2019", "20", "car", "louisiana", "review"], "summary": "He didn't play a single game in 2019.\nNew Orleans officials say the chances of a missing worker's survival after the collapse are diminishing, and they have shifted their efforts from rescue to recovery mode.\nThe Tigers quarterback won numerous awards, including the 2019 Heisman Trophy, and graduated from LSU with his Master's degree.\nSome city services have reopened in the closing days of 2019, but many still have no recovery timeline.\nThe cyberattack was identified as ransomware — common malware that infects and locks up servers until a ransom is paid, but city officials say they never received a ransom request."}, {"url": "https://www.katc.com/news/covering-louisiana/new-orleans-saenger-theater-to-reopen-in-december", "title": "New Orleans' Saenger Theatre to reopen in December", "authors": [], "date": "2019-11-25", "keywords": ["community", "closure", "orleans", "continue", "worked", "theatre", "opening", "reopen", "entertainment", "theater", "saenger"], "summary": "The Saenger Theatre in New Orleans will be opening next month following its closure because of the partial collapse of the Hard Rock Hotel.\nA CHRISTMAS STORY, THE MUSICAL as part of the 2019-2020 Hancock Whitney Broadway in New Orleans season from December 17-22.\n\"We are grateful to the New Orleans community for their patience and understanding as we worked through the temporary closure.\nThe Saenger Theatre has been a beloved part of our city since 1927 and will continue to be for years to come.\nWe are thrilled to welcome the community back to the theater and are ready to continue providing incredible live entertainment to the Gulf Region,\" The Saenger said."}, {"url": "https://www.fox8live.com/2019/12/24/carjackings-armed-robbery-occurred-within-minutes-each-other-new-orleans-east-area/", "title": "2 carjackings, 1 armed robbery occurred within minutes of each other in New Orleans East area", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2019-12-24", "keywords": ["refused", "sitting", "minutes", "orleans", "street", "fled", "robbery", "area", "dorothea", "carjackings", "vehicle", "occurred", "keys", "victims", "suspects", "armed", "east", "inside"], "summary": "The victims were sitting inside of the vehicle on the 5900 block of Dorothea Street before being approached by the armed suspects at around 9:11 p.m.\nThey demanded the keys, but the victims refused and then fled from the suspects."}, {"url": "https://www.fox8live.com/2019/12/25/louisiana-hit-hard-with-flu-rsv-this-holiday-season/", "title": "Louisiana hit hard with flu and RSV this holiday season", "authors": ["Kimberly Curth", "Published At Pm"], "date": "2019-12-25", "keywords": ["hit", "flu", "means", "vaccine", "late", "theres", "hard", "holiday", "rsv", "preventing", "severity", "lessen", "season", "louisiana", "tends"], "summary": "“There is still benefit to getting the flu vaccine even though we’re late in the season.\nIt’s still efficacious to go ahead and get it if you haven’t done so yet.\nIt does a good job at preventing the flu and people that still get the flu, it tends to lessen the severity of that illness which means there’s less of a chance of landing in the hospital,” said Kanter."}, {"url": "https://www.bigeasymagazine.com/2019/12/20/parents-join-step-up-louisiana-rally-and-march-to-opsb-to-demand-better-schools/", "title": "Parents Join Step Up Louisiana Rally and March to OPSB to Demand Better Schools", "authors": [], "date": "2019-12-20", "keywords": ["services", "demand", "community", "rally", "step", "orleans", "model", "better", "success", "school", "health", "join", "schools", "students", "louisiana", "opsb", "parents"], "summary": "One way parents want to rectify this situation is by returning to a Sustainable Community School model.\nWhile the corporate charter school model closes failing schools rather than working to improve them, the Sustainable Community School model focuses on expanding supports for local schools.\nWrap-around community supports such as access to health and eye care and mental health services that are often overlooked in poorer communities.\nsuch as access to health and eye care and mental health services that are often overlooked in poorer communities.\nParent and community engagement recognizing that the success of a community school is tied to that community’s development."}, {"url": "https://www.fox8live.com/2019/12/18/watch-two-robbed-gunpoint-new-orleans-east-store/", "title": "WATCH: Two robbed at gunpoint in New Orleans East store", "authors": ["Meg Gatto", "Published At Pm"], "date": "2019-12-18", "keywords": ["orleans", "university", "watch", "originally", "meg", "robbed", "store", "pennsylvania", "reporter", "fox", "seen", "east", "parents", "team", "gunpoint"], "summary": "Meg Gatto is an Emmy-nominated reporter and anchor.\nShe joined the FOX 8 team in March 2011 and can be seen on FOX 8 Morning Edition.\nOriginally from Pennsylvania, Meg followed in the footsteps of her parents, moving to New Orleans to attend college.\nShe graduated from Loyola University with a degree in Broadcast Journalism."}, {"url": "https://www.fox8live.com/2019/12/09/nopd-four-males-shot-shooting-washington-avenue/", "title": "Five victims shot, one dead in Washington Avenue shooting", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2019-12-09", "keywords": ["hospital", "shot", "shooting", "dead", "victims", "washington", "wvue", "avenue", "source", "victim", "fox", "spokesperson", "nopd", "investigating"], "summary": "NOPD is currently investigating a shooting in the 3800 block of Washington Avenue.\nOne victim died in the hospital, according to a spokesperson.\n(Source: WVUE Fox 8)"}, {"url": "https://www.wwltv.com/article/entertainment/events/what-to-know-for-new-years-sugar-bowl-2020-in-new-orleans/289-8683ce9a-0c8f-479d-8d16-54e10faf0197", "title": "What to know for New Year's, Sugar Bowl 2020 in New Orleans", "authors": ["Author", "Sean Brennan", "Eyewitess News", "Published", "Pm Cst December", "Updated"], "date": "2019-12-31", "keywords": ["canal", "orleans", "street", "know", "2020", "french", "bowl", "dumaine", "eve", "sugar", "streets", "service", "st", "quarter"], "summary": "The annual festivities will impact driving, parking and more around the French Quarter, Central Business District and the Marigny starting Monday night and lasting until Thursday.\nEvents:New Year's Eve (Tuesday, Dec. 31) firework shows are set for both New Orleans East and the French Quarter, according to Mayor LaToya Cantrell.\nThere are fan events around the Superdome and French Quarter leading up the game, including the Allstate Fan Fest and the Sugar Bowl Fan Jam, which kicks off at 4 p.m. in Champions Square on New Year's Day.\nTraffic and Parking Restrictions:City officials say to expect heavy vehicle and foot traffic around the Superdome and French Quarter.\nDuring the Sugar Bowl parade (2 p.m. to 5 p.m.), there will be no streetcar service between the riverfront and Carondelet Street."}, {"url": "https://nola.verylocal.com/best-of-2019-our-photos/109026/", "title": "Best of 2019: Our Photos", "authors": ["Clint Durrett"], "date": "2020-01-02", "keywords": ["photos", "orleans", "best", "second", "annual", "matthew", "quarter", "la", "2019", "saints", "michael", "krewe"], "summary": "We’ve pored over our albums and found photos that have won awards and resurfaced ones that made us pause.\nHere are our best photos of 2019.\n(Photo by Michael DeMocker)The first Krewe Bohème parades through the Marigny and continued through the French Quarter in New Orleans, La.\n(Photo by Matthew Hinton)Artist Ann Marie Auricchio with a rug she designed in an Old Metairie home on Friday, November 22, 2019.\n(Photo by Michael DeMocker)Members of the Roots of Music kickoff Satchmo SummerFest at the U.S. Mint in New Orleans, Friday, August 2, 2019."}, {"url": "https://www.workboat.com/news/workboat-show-news/the-resilient-workboat-industry/", "title": "The resilient workboat industry", "authors": ["David Krapf"], "date": "2020-04-15", "keywords": ["customers", "workboat", "support", "industry", "offshore", "tough", "coronavirus", "senner", "service", "resilient", "work"], "summary": "As I wrote in my April 9 WorkBoat Watch blog, some attendees at December’s International WorkBoat Show said that 2020 was beginning to look promising for the offshore energy sector.\nTough times will be mastered by the tough people of the offshore service industry.”It’s not hard to find these tough people that make up the workboat industry.\nIn our plants and for our service technicians in the field, we have implemented increased personal protection measures and are taking special precautions for service work performed in close quarters.\nCoronavirus updates are posted daily on WorkBoat.com to keep the industry apprised of the situation.\nWe hear it every day from our customers,” said Denielle Christensen, event director for the International Workboat Show."}, {"url": "https://www.fox8live.com/2019/12/15/nopd-man-injured-downtown-shooting/", "title": "NOPD: Man injured in Downtown shooting", "authors": ["Jade Myers", "Published At Pm"], "date": "2019-12-15", "keywords": ["downtown", "shooting", "orleans", "shot", "la", "injured", "wvue", "man", "nopd", "leg"], "summary": "NEW ORLEANS, La.\n(WVUE) -One man was shot in the leg during a shooting in Downtown, New Orleans police said."}, {"url": "https://www.fox8live.com/2019/12/24/nopd-injured-west-bank-shooting/", "title": "NOPD: 4 injured in a West Bank shooting", "authors": ["Kendra Smith-Parks", "Published At Pm"], "date": "2019-12-24", "keywords": ["transported", "wounds", "hospital", "shooting", "west", "multiple", "private", "gunshot", "local", "injured", "bank", "victims", "sustained", "victim", "nopd"], "summary": "A third victim sustained multiple gunshot wounds to body and victim four was grazed.\nSome of the victims were transported via EMS to a local hospital and some via private conveyance."}, {"url": "https://thelensnola.org/2020/04/14/convention-center-officials-send-clear-message-that-they-will-move-ahead-with-over-1-billion-in-developments-despite-community-opposition/", "title": "Convention Center officials send clear message that they will move ahead with over $1 billion in developments despite community opposition", "authors": ["More Michael Isaac Stein", "Mstein Thelensnola.Org"], "date": "2020-04-14", "keywords": ["officials", "send", "community", "clear", "despite", "message", "orleans", "million", "center", "board", "leger", "plan", "contract", "convention", "developments", "hotel", "opposition"], "summary": "On Tuesday, the Convention Center board’s finance committee advanced a $5.4 million contract to hire an executive architect for the center’s five-year, $557 million capital plan.\nLeger and Sawaya’s comments on Tuesday were consistent with messaging from Convention Center officials over the past several weeks.\n“Hospitality workers in this city are telling the Convention Center what they need right now,” said an emailed statement from the group.\n“Failing to do so would be an imprudent leap of faith for Convention Center officials who have been talking so much about the importance of avoiding risk.”Days after that report was released, the Convention Center sent out a press release clarifying how it saw its role in the recovery from the coronavirus crisis.\nThe Convention Center has already chosen the development team for the hotel and is currently in negotiations with them over final contract language."}]