[{"url": "https://gopsusports.com/news/2020/4/15/wrestling-every-journey-worth-taking-begins-with-one-small-step.aspx", "title": "Every Journey Worth Taking Begins with One Small Step", "authors": [], "date": "2020-04-15", "keywords": ["taking", "penn", "wrestling", "sandersons", "step", "worth", "state", "win", "big", "ncaa", "went", "begins", "sanderson", "small", "season", "journey"], "summary": "Retrospectacle…\"Every journey worth taking begins with one small step…\"It's simple to say it but putting the words into action can be daunting…unless everything comes together.\nPenn State had gone 8-12-2 the year before.\nPenn State downed the Illini 24-11 and went on to go 5-3 in Sanderson's first full Big Ten dual season.\nIn his first season wrestling for Sanderson, Molinaro led Penn State in wins going 33-7.\n31.-- Penn State went 13-6-1 in dual meets, much improved from the prior year's 8-12-2, and a strong finish to return to the Top 10 (No."}, {"url": "https://thereader.com/news/covid-19-pandemic-in-omaha/direct-payments-expanded-benefits-and-new-business-loans-your-guide-to-the-2-2-trillion-federal-stimulus-package", "title": "Direct payments, expanded benefits and new business loans: Your guide to the $2.2 trillion federal stimulus package", "authors": [], "date": "2020-04-01", "keywords": ["loans", "trillion", "package", "guide", "direct", "injury", "stimulus", "2020", "benefits", "business", "payroll", "loan", "30", "expanded", "payments", "federal", "receive", "disaster"], "summary": "On March 27, the federal government unanimously approved a $2.2 trillion stimulus package that includes funds to grease the cogs of an American economy halted by the coronavirus pandemic.\nIf you receive social security but do not file tax returns, you will be asked to file a “simple” return.\nAnyone that tried to initially apply for a SBA Disaster Loan endured an online system crashing, only to be replaced by a file upload feature for PDF documents without any quick response or follow-up.\nBy completing this application, you have also started the process for an Economic Injury Disaster Loan.\nAdditional funding for education will defer student loan payments until Sept. 30 without penalty to the borrower."}, {"url": "https://www.3newsnow.com/news/local-news/a-look-at-conditions-in-the-region", "title": "A look at conditions in the region", "authors": [], "date": "2020-01-10", "keywords": ["nestatepatrol", "information", "state", "region", "conditions", "slow", "snow", "i80", "iowa", "omaha", "look", "responding"], "summary": "Here's a look at conditions throughout.\nLeft 2 lanes blocked https://t.co/cfOriS7NfY — Omaha Hwy Conditions (@NDOTomaha) January 10, 2020Here are some views of I-80 between Lincoln and Omaha as we near the afternoon drive.\npic.twitter.com/awVeL5DBQ1 — NEStatePatrol (@NEStatePatrol) January 10, 2020I-80 at the Missouri RiverI-80 at 72nd StreetI-80 at I-480A Bellevue Police officer shared this:Visibility is significantly reduced in @CityofBellevue.\n(Minor injuries)Road conditions are expected to deteriorate quickly.\npic.twitter.com/7P2pyMOX6E — Iowa State Patrol (@iowastatepatrol) January 10, 2020Closing and cacellation information: https://www.3newsnow.com/news/local-news/closings-early-dismissals-and-cancellations-due-to-weatherYou can find our latest forecast at https://www.3newsnow.com/weather/forecast/todays-forecast/daily-omaha-forecasts"}, {"url": "https://www.3newsnow.com/news/local-news/omaha-police-investigating-friday-night-homicide", "title": "Omaha Police investigating Friday night homicide", "authors": [], "date": "2020-01-25", "keywords": ["unmc", "transported", "suffering", "suspect", "stoppers", "wound", "weapon", "victim", "night", "homicide", "officers", "omaha", "investigating"], "summary": "OMAHA, Neb.\n(KMTV) — Omaha Police officers located a male victim suffering from a stab wound on Friday night.\nThe victim, 22-year-old LaZell Hampton, was transported to UNMC where he later died from his injuries, according to OPD.\nTwenty-four year old suspect Ahmed Ismaeil was arrested and booked for 1st degree murder and use of a weapon to commit a felony.\nAnyone with more information is asked to contact Omaha Crime Stoppers at 402-444-STOP."}, {"url": "https://www.3newsnow.com/news/local-news/two-people-sentenced-for-meth-distribution-charges-in-omaha", "title": "Two people sentenced for meth distribution charges in Omaha", "authors": [], "date": "2020-01-07", "keywords": ["distribution", "shared", "sentenced", "release", "meth", "charges", "omahas", "regarding", "p", "omaha", "prisonunited", "yesterday", "states"], "summary": "OMAHA, Neb.\n(KMTV) — Yesterday in Omaha's federal court, two people were sentenced for intent to distribute and deliver methamphetamine.\nOne of them will also face deportation after more than 11 years in prison.\nUnited States Attorney Joseph P. Kelly's office shared the following release regarding the two cases:"}, {"url": "https://www.3newsnow.com/news/local-news/unexplained-mystery-drones-spotted-in-multiple-parts-of-nebraska", "title": "Unexplained mystery drones spotted in multiple parts of Nebraska", "authors": [], "date": "2020-01-07", "keywords": ["unexplained", "multiple", "parts", "nebraska", "flying", "drone", "drones", "theres", "agricultural", "federal", "spotted", "things", "mystery", "enos", "huang"], "summary": "— There's been multiple reports in Colorado, western Nebraska and now some parts of eastern Nebraska of giant unexplained drones swarming the night sky.\nOne Sarpy County resident reported several drones flying in unison last week.\n\"Most interesting part is that the drones were flying in the night.\nEnos believes if it's agricultural information the people behind the drones are after, the general public shouldn't be too worried.\n\"I think people are concerned, especially people that aren't familiar with drones and the technology,\" Enos said."}, {"url": "https://www.3newsnow.com/news/local-news/residents-displaced-after-friday-night-house-fire", "title": "Residents displaced after Friday night house fire", "authors": [], "date": "2020-01-25", "keywords": ["scene", "stoppers", "short", "situationopd", "night", "tine", "house", "residents", "sprague", "reported", "omaha", "smoke", "displaced"], "summary": "(KMTV) — Residents of a home near 41st & Sprague are displaced following a fire Friday night.\nAround 9:30 p.m., the Omaha Fire Department was called to the home where Omaha Police were already on scene for a domestic situation.\nOPD reported smoke in the house.\nAfter a short tine, the fire was extinguished.\nAnyone with information is asked to contact the arson hotline at 402-444-FIRE or Crime Stoppers at 402-444-STOP."}, {"url": "https://ktiv.com/2020/01/10/health-officials-in-omaha-ne-confirm-2-pediatric-flu-deaths/", "title": "Health officials in Omaha, NE, confirm 2 pediatric flu deaths", "authors": ["Associated Press"], "date": "2020-01-10", "keywords": ["officials", "department", "flu", "week", "pediatric", "health", "douglas", "deaths", "county", "adult", "died", "confirm", "children", "omaha", "ne"], "summary": "OMAHA, Neb.\n(AP) -- Health officials in Omaha have confirmed that two children have died of complications from influenza this flu season.\nThe Douglas County Health Department said Friday in a news release that both deaths were in people under 18.\nThe department says it is prohibited by privacy laws from identifying the two children who died and would not give their exact ages or where they lived in Douglas County.\nThe pediatric deaths follow the department's report earlier this week that two adult flu-related adult deaths in people over 65 years have been reported in Douglas County."}, {"url": "https://www.3newsnow.com/news/local-news/opd-front-desk-officer-reassigned-after-video-posted-online", "title": "OPD front-desk officer reassigned after video posted online", "authors": [], "date": "2020-01-07", "keywords": ["officer", "headquarters", "youtube", "dept", "investigation", "video", "frontdesk", "internal", "working", "opd", "omaha", "online", "reassigned", "posted", "omahapolice"], "summary": "(KMTV) — On Sunday, a YouTube user posted a video of an Omaha Police officer working at the front desk of their downtown headquarters.\nToday, the officer has been reassigned and an internal investigation has been opened by Omaha Police Chief Todd Schmaderer.\n— Omaha Police Dept (@OmahaPolice) January 7, 20202/3The videos capture the citizen interacting with officers either outside of Omaha Police Central Headquarters or working at the Front Desk.\n— Omaha Police Dept (@OmahaPolice) January 7, 20203/3The Omaha Police Department expects professional conduct from our officers at all times.\nThe officer displaying his flashlight during one of the encounters has been reassigned pending the outcome of the internal investigation."}, {"url": "https://www.3newsnow.com/news/local-news/two-adults-displaced-by-afternoon-house-fire", "title": "Two adults displaced by afternoon house fire", "authors": [], "date": "2020-01-23", "keywords": ["structure", "street", "residential", "twostory", "say", "afternoon", "house", "adults", "residence", "omaha", "smoke", "displaced", "responded"], "summary": "OMAHA, Neb.\n(KMTV) — Just after noon, Omaha firefighters responded to a two-story residential fire at 222 North 118th Street.\nUpon arrival, they observed heavy smoke coming from the structure and two adults outside.\nThey say the fire occurred in the garage and it was quickly extinguished.\nTwo adults were displaced from the residence and there were no injuries reported."}, {"url": "https://www.ketv.com/article/matchbox-twenty-to-bring-tour-to-omaha/30496976", "title": "Matchbox Twenty to bring tour to Omaha", "authors": [], "date": "2020-01-13", "keywords": ["starting", "summer", "yearthe", "rock", "matchbox", "tour", "bring", "sale", "stops", "omaha", "sept"], "summary": "Matchbox Twenty announced Monday morning it's bringing its \"2020\" tour to Omaha this year.The pop rock band is kicking off a summer tour with more than 50 stops planned from July to September.\nMatchbox Twenty will be in Omaha on Sept. 8 to perform at the CHI Health Center Omaha.Tickets go on sale to the general public starting Jan. 17 at livenation.com.This is the band's first tour since 2017.\nMatchbox Twenty announced Monday morning it's bringing its \"2020\" tour to Omaha this year.\nThe pop rock band is kicking off a summer tour with more than 50 stops planned from July to September.\nMatchbox Twenty will be in Omaha on Sept. 8 to perform at the CHI Health Center Omaha."}, {"url": "https://www.3newsnow.com/news/local-news/nebraska-police-cruisers-using-electronic-ticketing-software-in-2020", "title": "Nebraska police cruisers using electronic ticketing software in 2020", "authors": [], "date": "2020-01-04", "keywords": ["using", "grummert", "nebraska", "used", "state", "2020", "technology", "violation", "software", "ticketing", "office", "officers", "computer", "electronic", "data", "cruisers"], "summary": "(KMTV) — Police cruisers across Nebraska are now required to use electronic ticketing, effective at the start of the new year.\n\"It's easier to track data, get data and use data if we need to, it's easier to compile stats for click it or ticket,\" said Officer Shaun Manning of the Bellevue Police Department.\n\"Basically the citation is inside of the computer,\" said Lieutenant Mike Grummert of the Nebraska State Patrol.\nGrummert said the technology simplifies the process and gets rid of any errors that happen from bad handwriting.\nWhile the new technology may take time for some of the officers to get used to, Grummert, who has been using the electronic ticketing technology for eight years, said officers will see its benefits."}, {"url": "https://patch.com/nebraska/omaha/calendar/event/20191228/729667/life-times-2020-commitment-day-celebration", "title": "Life Time's 2020 Commitment Day Celebration", "authors": [], "date": "2019-12-24", "keywords": ["times", "28", "commitment", "2020", "day", "yoga", "life", "dec", "workout", "jan", "family", "celebration"], "summary": "It happens every year - New Year's Resolutions with local health clubs filling up.\nBut for the eighth year, Life Time has a different take, kicking off the New Year with its Commitment Day celebration.\nFor 2020, the Commitment Day Movement is challenging people in a new way - to commit to taking One Positive Action toward a healthier, happier life.\nIn support of this goal, Life Time locations across the country will be open to everyone from December 28 through January 5 with a broad array of healthy and motivating events for all levels and abilities.In another first, the company is also supporting Make-A-Wish in its mission to grant the wishes of children facing critical illnesses and the Life Time Foundation in its work to remove artificial and processed ingredients from school food.\nAdditional information and registration is available online at CommitmentDay.comCommitment Day 2020 Schedule of EventsSaturday, Dec. 28: Family DaySunday, Dec. 29: Discover Yoga ExperienceTuesday, Dec. 31: Kid's New Year's EveWednesday, Jan. 1: Commitment Day 5KThursday, Jan. 2: Group TrainingSaturday, Jan. 4: Family Workout EventsSunday, Jan. 5: Indoor Triathlons*Events and activities may vary by location"}, {"url": "https://www.3newsnow.com/news/local-news/topgolf-looks-to-fill-400-positions-at-new-location-in-omaha", "title": "Topgolf looks to fill 400 positions at new location in Omaha", "authors": [], "date": "2020-01-21", "keywords": ["looks", "upcoming", "positions", "viewers", "street", "today", "location", "interested", "venueprevious", "looking", "topgolf", "400", "omaha", "ground"], "summary": "OMAHA, Neb.\n(KMTV) — Last June, news that Topgolf was breaking ground in Omaha stirred up a lot of excitement among our viewers.\nToday, the company announced it is looking to hire on roughly 400 full and part-time employees to staff the new 55,000 square-foot venue.\nPrevious story: Topgolf breaks ground in OmahaThe new location, coming soon to 908 North 102nd Street, is looking for interested parties to \"audition at an upcoming MISSION: Ambition event.\"\nTopgolf set up the following site for people interested in attending the hiring events: https://events-topgolf.icims.com/jobs/search?ss=1&searchLocation=12781-12811-Omaha"}, {"url": "https://www.constructiondive.com/news/construction-dives-mini-megacities-to-watch-omaha-nebraska/570308/", "title": "Construction Dive's 'mini megacities' to watch: Omaha, Nebraska", "authors": ["Jenn Goodman", "Share It"], "date": "2020-01-15", "keywords": ["labor", "petsch", "university", "nebraska", "mini", "watch", "area", "million", "programs", "construction", "looking", "megacities", "omaha", "dives"], "summary": "This article is part of a five-part series looking at the most up-and-coming U.S. markets for commercial construction.\nJean Petsch, executive director of the Associated General Contractors' Nebraska Building Chapter has a saying about what's made Omaha such a desirable place to do business.\nSome top Omaha construction firms Charles Vrana and Sons Hausmann Construction JE Dunn Construction Kiewit McCarthy MCL Construction Sampson Construction Turner ConstructionAvailability of reasonably priced land, low labor costs and inexpensive electricity rates help make Omaha ideal for companies looking to build offices, data centers and warehouses, Petsch told Construction Dive.\nThe search for workersFinding labor to fuel all of this construction has been AGC members’ biggest challenge, Petsch said.\nA number of state and local initiatives in recent years have been aimed at boosting workforce development, according to the Omaha World Herald, and for young people interested in construction, the Nebraska area and Omaha in general offer a wealth of career development options."}, {"url": "https://www.nytimes.com/2020/03/18/us/coronavirus-nebraska-biocontainment.html", "title": "A Nebraska Hospital Aimed to Contain the Virus. But It Had Already Spread.", "authors": ["Mitch Smith"], "date": "2020-03-18", "keywords": ["aimed", "works", "virus", "patients", "nebraska", "spread", "dr", "trial", "kalil", "coronavirus", "twice", "united", "science", "contain", "doctors", "hospital"], "summary": "The first casesThe call came on a Monday morning last month around 3 a.m. A plane chartered by the federal government would be landing soon.\nIts cargo: one of the largest groups of coronavirus patients this hemisphere had seen.\nAs the days passed in Nebraska, most evacuees never developed serious symptoms, and those who did were stabilized.\nNeither Dr. Andre Kalil, who is overseeing their treatment, nor the patients know whether they received the actual drug or a placebo.\n“If you don’t do the right science, we’re never going to find what works.”"}, {"url": "https://www.nytimes.com/reuters/2020/04/15/business/15reuters-berkshire-buffett-arbitration-award.html", "title": "Berkshire Hathaway Unit Wins 643 Million Euro Award Over 'Fraudulent' German Pipemaker Purchase", "authors": [], "date": "2020-04-15", "keywords": ["precision", "hathaway", "euros", "arbitration", "million", "german", "euro", "castparts", "fraudulent", "wins", "pipemaker", "berkshire", "unit", "award", "purchase", "panel", "maker"], "summary": "NEW YORK — Precision Castparts Corp, a unit of Warren Buffett's Berkshire Hathaway Inc, has been awarded 643 million euros ($700 million) in arbitration for having been fraudulently induced to buy a German maker of pipes and fittings.\nThe award against Schulz Holding GmbH, whose U.S. and German businesses were purchased by Precision Castparts for 800 million euros ($870 million) in February 2017, was made on April 9 by a panel of the American Arbitration Association's International Centre for Dispute Resolution.\n\"The evidence strongly points to fraud, and there is little in the record to suggest otherwise.\"\nPrecision Castparts, a maker of aircraft and industrial parts, asked a federal judge in Manhattan on Tuesday night to confirm the award.\nBerkshire paid $32.1 billion for Precision Castparts in January 2016, its largest acquisition."}, {"url": "https://thereader.com/news/covid-19-pandemic-in-omaha/direct-payments-expanded-benefits-and-new-business-loans-your-guide-to-the-2-2-trillion-federal-stimulus-package", "title": "Direct payments, expanded benefits and new business loans: Your guide to the $2.2 trillion federal stimulus package", "authors": [], "date": "2020-04-01", "keywords": ["loans", "trillion", "package", "guide", "direct", "injury", "stimulus", "2020", "benefits", "business", "payroll", "loan", "30", "expanded", "payments", "federal", "receive", "disaster"], "summary": "On March 27, the federal government unanimously approved a $2.2 trillion stimulus package that includes funds to grease the cogs of an American economy halted by the coronavirus pandemic.\nIf you receive social security but do not file tax returns, you will be asked to file a “simple” return.\nAnyone that tried to initially apply for a SBA Disaster Loan endured an online system crashing, only to be replaced by a file upload feature for PDF documents without any quick response or follow-up.\nBy completing this application, you have also started the process for an Economic Injury Disaster Loan.\nAdditional funding for education will defer student loan payments until Sept. 30 without penalty to the borrower."}, {"url": "https://cagesidepress.com/2020/04/12/video-emerges-suspect-anthony-smith-home-invasion-previous-charged-domestic-assault/", "title": "Video Emerges of Suspect in Anthony Smith Home Invasion, Previously Charged with Domestic Assault", "authors": ["Jay Anderson", "Editor At Cageside Press", "Jay Has Been Covering The Sport Of Mixed Martial Arts For Several Years. His Work Has Appeared On The Mma Corner", "What Culture", "Cage Pages", "Mma News", "Today'S Knockout", "Fox Sports", "Via Fansided . Jay Holds An Honours Bachelor Of Arts Degree In English The University Of Guelph", "A Certificate In Leadership Skills Humber College. When Not Slaving At The Keyboard"], "date": "2020-04-12", "keywords": ["haberman", "wrestling", "suspect", "domestic", "fight", "previously", "smith", "video", "invasion", "school", "charged", "incident", "ufc", "anthony", "smiths", "emerges", "assault"], "summary": "Former high school wrestling standout was charged with domestic assault in February; video emerges of second break-in attempt.\nMore details have begun to trickle out regarding the identity of the suspect in UFC fighter Anthony Smith’s home invasion incident.\nThis is video for the suspect after he allegedly broke into another man's home before going to Smith's.\nAccording to a report by 3KMTV, who also released the video above, Haberman is being investigated for breaking into area vehicles as well.\nHaberman, 21, was also a member of the Bishop Neuman High School wrestling team in Nebraska, with 128 career wins following the 2017-18 season."}, {"url": "https://www.hutchnews.com/ZZ/obituaries/20200415/harold-starkey", "title": "Harold Starkey", "authors": [], "date": "2020-04-15", "keywords": ["friends", "dakota", "harold", "church", "smith", "hager", "north", "wellsford", "starkey", "pratt"], "summary": "Pratt -- Harold Dwayne Starkey, 98, passed away Tuesday, April 14, 2020 at Pratt Rehabilitation and Residence Center.\nHe was a previous member of Pleasant Plain Friends Church where he was very active until they closed and he became a member of Pratt Friends Church.\nHarold is preceded in death by his parents; wife, Luetta; brothers, Clifton Starkey and Nevin Starkey; and sisters, Lucille Rose and Donna Bogner-Current.\nHarold StarkeyPratt -- Harold Dwayne Starkey, 98, passed away Tuesday, April 14, 2020 at Pratt Rehabilitation and Residence Center.\nHarold is preceded in death by his parents; wife, Luetta; brothers, Clifton Starkey and Nevin Starkey; and sisters, Lucille Rose and Donna Bogner-Current."}, {"url": "https://www.bostonglobe.com/2020/04/15/nation/welcome-crazy-town-aka-grocery-delivery/", "title": "Welcome to crazy town: AKA grocery delivery", "authors": [], "date": "2020-04-15", "keywords": ["services", "delivery", "times", "welcome", "order", "shop", "town", "aka", "store", "grocery", "crazy", "days", "workers", "instacart"], "summary": "“My greatest victories are now snagging grocery delivery windows for the few seconds they are available,” scientist @rossfederman tweeted on April 11.\nNow, demand is so high that Amazon has stopped accepting new grocery delivery customers and is asking aspiring eaters to sign up for a wait list.\nHe tried to grab one, he said, but, spoiler alert: No delivery times were available.\nWith gig delivery and grocery store workers striking and protesting over a lack of health protection and hazard pay, many people who use delivery services — but certainly not all — feel conflicted.\n“Almost every order is a full grocery shop — a week of groceries at a time,” Forcellati said."}, {"url": "https://gopsusports.com/news/2020/4/15/wrestling-every-journey-worth-taking-begins-with-one-small-step.aspx", "title": "Every Journey Worth Taking Begins with One Small Step", "authors": [], "date": "2020-04-15", "keywords": ["taking", "penn", "wrestling", "sandersons", "step", "worth", "state", "win", "big", "ncaa", "went", "begins", "sanderson", "small", "season", "journey"], "summary": "Retrospectacle…\"Every journey worth taking begins with one small step…\"It's simple to say it but putting the words into action can be daunting…unless everything comes together.\nPenn State had gone 8-12-2 the year before.\nPenn State downed the Illini 24-11 and went on to go 5-3 in Sanderson's first full Big Ten dual season.\nIn his first season wrestling for Sanderson, Molinaro led Penn State in wins going 33-7.\n31.-- Penn State went 13-6-1 in dual meets, much improved from the prior year's 8-12-2, and a strong finish to return to the Top 10 (No."}, {"url": "https://finance.yahoo.com/news/recession-why-stay-course-mutual-151718054.html", "title": "Recession: Why You Should Stay the Course With Your Mutual Funds", "authors": ["Paulina Likos"], "date": "2020-04-14", "keywords": ["risk", "stay", "funds", "market", "sell", "asset", "mutual", "investment", "course", "recession", "fund", "investors", "volatility"], "summary": "Until the economy rebounds, some investors will be wary of how to treat their mutual fund investments.\nHere's what a disciplined mutual fund investor needs to know to manage risk while generating growth:-- The advantages of mutual funds.\nMutual fund diversification is the best way to succeed in a recession.\nOffering a mix of hundreds and even up to thousands of securities to manage risk makes mutual funds an inherently stable investment in a volatile environment.\nSell or Stay the Course in a RecessionMutual funds are known as a type of investment to buy and hold, so it's standard practice to not sell your mutual fund during a bear market."}, {"url": "https://www.3newsnow.com/news/local-news/coronavirus-could-impact-omahas-big-events", "title": "Coronavirus could impact Omaha's big events", "authors": [], "date": "2020-02-27", "keywords": ["impact", "events", "china", "weekend", "big", "omahas", "coronavirus", "visitors", "travel", "zhang", "world", "omaha", "scheduled", "wise"], "summary": "(KMTV) — The coronavirus outbreak, half a world away, could have a big impact on one of Nebraska's premiere events.\nWarren Buffett has said on CNBC this week that the virus could impact the meeting.\nThe Nebraska Representative to China, Jennifer Zhang, says visitors from China will likely be limited.\nVisit Omaha says visitors’ mindsets are different when it comes to travel so it's hard to predict what will happen.\nUSA Swimming isn't planning any changes to the swim trials in June and the Tokyo Olympics are still as scheduled."}, {"url": "https://www.dailyinterlake.com/news/2020/apr/15/phillip-r-iversen-96-6/", "title": "Phillip R. Iversen, 96", "authors": [], "date": "2020-04-15", "keywords": ["phillip", "war", "wife", "school", "phil", "utah", "iversen", "spent", "r", "national", "park", "family", "96"], "summary": "April 15, 2020 1:00 AMPhillip R. Iversen, 96, passed away on April 7, 2020, at his home in Kalispell with his family by his side.\nAfter the war, Phil attended Dana College and Iowa State University, working for a degree in architectural engineering.\nDuring the summer months he worked as a seasonal park ranger at Zion National Park, Utah, and this experience changed his career plans.\nPhil was eventually successful in obtaining a permanent job with the National Park Service in Carlsbad Caverns National Park in New Mexico.\nFirst, was “Ripples On The Water,” a history of the Iversen family including the genealogy."}, {"url": "https://www.nytimes.com/2020/02/18/us/coronavirus-omaha-nebraska-medical-center.html", "title": "First Ebola, Now Coronavirus. Why an Omaha Hospital Gets the Toughest Cases.", "authors": ["Sarah Mervosh"], "date": "2020-02-18", "keywords": ["ebola", "patients", "ward", "stay", "gets", "nebraska", "rooms", "special", "coronavirus", "outside", "unit", "toughest", "evacuees", "omaha", "quarantine", "hospital", "cases"], "summary": "The groups landed in Omaha on Monday morning and traveled in passenger buses to the hospital, along with a police escort.\nHe said some of them had been in interior rooms of the cruise ship and had not been outside for many days.\nAt least two of the more seriously ill evacuees were being monitored in the hospital’s biocontainment unit, a special ward on the seventh floor where the three Ebola patients were treated in 2014.\nBut each room also comes with exercise equipment, like a stationary bike or a treadmill, to help patients stay active if they are feeling well enough.\nPatients will stay in quarantine for 14 days if they continue to test negative, and as long as necessary if they have the virus."}, {"url": "https://www.cnn.com/2020/04/09/politics/coronavirus-testing-cdc-fda-red-tape-invs/index.html", "title": "How the government delayed coronavirus testing", "authors": ["Bob Ortega", "Scott Bronstein", "Curt Devine", "Drew Griffin"], "date": "2020-04-09", "keywords": ["public", "fda", "delayed", "coronavirus", "health", "labs", "testing", "lab", "test", "tests", "cdc"], "summary": "\"We really were... basically on a pause for a few weeks within the public health system,\" said Scott Becker, executive director of the Association of Public Health Laboratories.\nJUST WATCHED CNN reporter on early coronavirus testing: We blew it Replay More Videos ... MUST WATCH CNN reporter on early coronavirus testing: We blew it 02:03The CDC's 2018 plan, created following the Zika outbreak two years earlier, was meant to prevent the very testing shortfalls and obstacles that have been unfolding since Covid-19 arrived in the US.\nWithin days, her laboratory would dive into developing its own coronavirus test.\nOfficials in South Korea gave permission just a week later for their commercial labs to develop coronavirus tests.\nOn March 13, when the total number of US coronavirus tests finally cracked 10,000, South Korea was doing that many tests daily."}, {"url": "https://www.ketv.com/article/national-coronavirus-updates-april-15/32153457", "title": "National coronavirus updates: President says new coronavirus guidelines will be announced Thursday", "authors": ["National Desk Staff", "Https", "Www.Facebook.Com"], "date": "2020-04-16", "keywords": ["cases", "national", "state", "president", "updates", "social", "coronavirus", "distancing", "testing", "youre", "going", "guidelines", "reopening", "announced", "states"], "summary": "Mississippi, the latest state to close schools for the remainder of the academic year as experts predict the virus will return.\nWe take the time now to really improve our testing capacity, expand our public health capacity to do early case recognition.\nUh, this is going to be making a change, testing it, modeling it and then seeing whether it works.\nWe’re going to be announcing guidelines and we’ll be talking about various states and it's very exciting,” Trump said.\nChan School of Public Health who published findings Tuesday that projected the U.S. may have to endure social distancing measures — such as stay-at-home orders and school closures — until 2022, unless a vaccine becomes available."}, {"url": "https://ktiv.com/2020/02/13/14-year-old-suspected-of-shooting-to-death-omaha-teen/", "title": "UPDATE: Omaha teen shooting believed to be accidental, according to prosecutors", "authors": ["Ktiv Staff"], "date": "2020-02-13", "keywords": ["update", "suspicion", "omaha", "shooting", "teen", "15yearold", "according", "accidental", "youth", "douglas", "county", "believed", "sylas", "14yearold", "lieb", "prosecutors"], "summary": "(AP) -- Douglas County's top prosecutor says investigators believe the shooting of a 15-year-old Omaha boy was accidental.\nA 14-year-old is suspected of shooting to death 15-year-old Sylas Lieb inside a northeast Omaha home on Wednesday night.\nThe 14-year-old was arrested and booked into the Douglas County Youth Center on suspicion of manslaughter.\nPolice say 15-year-old Sylas Lieb was found dead Wednesday night by officers called to the scene around 7:15 p.m.\nThe 14-year-old was booked into the Douglas County Youth Center on suspicion of manslaughter."}, {"url": "https://www.3newsnow.com/news/local-news/nebraska-residents-prep-for-2020-flooding-my-pumps-are-running-and-its-only-february", "title": "Nebraska residents prep for 2020 flooding: 'My pumps are running and it's only February'", "authors": [], "date": "2020-02-05", "keywords": ["flooding", "fremont", "nebraska", "area", "prep", "2020", "high", "snow", "ice", "pearson", "residents", "river", "running", "water", "jams", "pumps"], "summary": "(KMTV) — As the snow melts and ice breaks apart, those who experienced historic flooding last spring worry about what's to come.\nThe Elkhorn River is experiencing ice jams and area fields already so saturated, creating growing fears for this spring.\n\"We are watching things like the soil moisture, which is pretty high,\" Pearson said.\nHundreds gathered in Fremont on Tuesday, Feb 4 to stay up-to-date on current river levels, as well as prepare for when flooding hits.\nThey were also reminded to report any ice jams that could create an issue."}, {"url": "https://www.3newsnow.com/news/local-news/omaha-police-investigating-homicide", "title": "Omaha Police arrest suspect in Sunday night homicide", "authors": [], "date": "2020-02-24", "keywords": ["sundaypolice", "suspect", "street", "second", "weapon", "victim", "night", "homicide", "say", "degree", "warrant", "assault", "omaha", "arrest"], "summary": "OMAHA, Neb.\n(KMTV) - Omaha Police are investigating a homicide that claimed the life of a 74-year-old man on Sunday.\nPolice say they responded to an assault call just after 11 p.m. at 2233 North 20th Street.\nOmaha Police Investigators arrested 25-year-old Anthony Donald on Monday in connection to the homicide.\nDonald is charged with second degree murder, second degree assault, three counts of use of a weapon and an outstanding outside agency warrant."}, {"url": "https://www.3newsnow.com/news/local-news/two-dead-in-wrong-way-head-on-collision-on-the-jfk-freeway", "title": "Two dead in wrong way head-on collision on the JFK Freeway", "authors": ["Courtesy", "Sgt. Jason Menning"], "date": "2020-02-18", "keywords": ["phone", "wrong", "way", "freeway", "headon", "menning", "sgt", "minivan", "dead", "pronounced", "driver", "jason", "jfk", "omaha", "collision"], "summary": "Both were pronounced dead on scene.\nJason Menning said crews received a phone call at around 2:10 a.m. about a driver going the wrong way on the JFK.\nJust two minutes later, another phone call came in about a head-on collision at the intersection of the JFK and F Street.\nJason Menning, OPD Two dead in head-on collision on JFK FreewayThe female driver of a Mazda sedan struck a minivan head on, according to Sgt.\nShe and the male drive of the minivan were pronounced dead on scene."}, {"url": "https://www.desmoinesregister.com/story/news/health/2020/02/20/11-cruise-ship-evacuees-test-positive-coronavirus-omaha/4828442002/", "title": "11 people evacuated to Omaha test positive for coronavirus", "authors": ["Associated Press", "Published P.M. Ct Feb."], "date": "2020-02-20", "keywords": ["national", "nebraska", "tested", "coronavirus", "passengers", "test", "evacuated", "ship", "unit", "positive", "results", "omaha", "quarantine", "princess", "11"], "summary": "CLOSE Two charter flights carrying Diamond Princess passengers from Japan landed at military bases in California and Texas.\n— Federal experts confirmed that 11 of 13 people evacuated to an Omaha hospital from a cruise ship in Japan have tested positive for COVID-19, Nebraska officials announced Thursday night.\nThe University of Nebraska Medical Center said the Centers for Disease Control and Prevention had verified test results completed Monday by the Nebraska Public Health Lab.\nAll 13 people were passengers of the Diamond Princess cruise ship who were evacuated to the U.S. on Feb. 17.\nSeparately on Thursday, 57 U.S. evacuees were released from their quarantine at a Nebraska National Guard training base just southwest of Omaha."}, {"url": "https://ktiv.com/2020/02/14/evacuee-quarantined-in-nebraska-undergoing-evaluation-for-coronavirus/", "title": "Evacuee quarantined in Nebraska for coronavirus testing does not have the disease", "authors": ["Associated Press"], "date": "2020-02-14", "keywords": ["nebraska", "patient", "tests", "day", "evacuee", "does", "coronavirus", "testing", "say", "disease", "unit", "quarantined", "quarantine", "rest"], "summary": "(KTIV) - Saturday, Nebraska Medicine announced on twitter that the woman who was brought in to the National Quarantine Unit Friday for coronavirus testing.\nThey say she does not have the disease and has returned to Camp Ashland to finish the rest of the quarantine period.\nWe have an update on the woman brought to our National Quarantine Unit yesterday for #coronavirus testing.\nShe does not have the disease and has returned to Camp Ashland to finish the rest of the quarantine period.\nThe patient will be taken to the University of Nebraska Medical Center campus' federally funded National Quarantine Unit to be tested for COVID-19, also known as coronavirus."}, {"url": "https://www.3newsnow.com/news/local-news/coronavirus-continues-to-bring-concerns", "title": "Coronavirus continues to bring concerns", "authors": [], "date": "2020-02-02", "keywords": ["really", "virus", "nebraska", "bring", "coronavirus", "influenza", "okeefe", "concerns", "adds", "season", "omaha", "cdc", "continues"], "summary": "(KMTV) — The coronavirus has infected thousands of people across the world, including eight in America--and if more people become sick, could Nebraska help out?\nThe CDC adds more than 250 people have died from the virus, with all of those fatalities reported within China.\nAlthough it seems new, O'Keefe said coronavirus has been around for a while and has evolved.\nO’Keeffe adds that although coronavirus should be taken seriously, U.S. citizens should be more aware of a more common sickness--the flu.\nIn fact, we are right in the middle of really big influenza season,” said O’Keefe."}, {"url": "https://businessfacilities.com/2020/04/food-processing-the-good-and-the-bad-of-it/", "title": "Food Processing: The Good And The Bad Of It", "authors": ["Dominique Cantelme", "Business Facilities Is A Leading Full-Service Media Brand Specializing In The Site Selection Marketplace. Through A Bi-Monthly Magazine", "E-Mail Newsletters", "A News Portal", "Its Livexchange Event", "Business Facilities Has Created A Dynamic Community For C-Level Executives", "Economic Development Organizations."], "date": "2020-04-15", "keywords": ["good", "offers", "business", "county", "bad", "food", "oswego", "vineland", "development", "clinton", "processing", "company"], "summary": "Food Processing: The Good And The Bad Of ItBy Dominique CantelmeFrom the March/April 2020 IssueThe food processing industry is in the midst of what could be two temporary trends upward: a move toward plant-based proteins, and the need people feel to stockpile food in the wake of the Coronavirus (COVID-19) scare.\nA well-trained workforce, skilled in food processing, is available with a labor market from a seven-county radius.\nJefferson County’s newest food processing plant is Cornerstone Processing.\niFreeze, a frozen food warehousing company, has co-located at the facility to meet the needs of the growing food processing sector.\nTogether, at full capacity, these three projects represent 480,000-square-feet of food processing space with 440 new food processing workers employed in Oswego County."}, {"url": "https://www.3newsnow.com/money/workers-wanted/job-fair-planned-in-omaha-on-feb-5", "title": "Job fair planned in Omaha on Feb. 5", "authors": [], "date": "2020-02-01", "keywords": ["census", "workforce", "w", "feb", "job", "fair", "hotel", "youre", "youll", "youve", "omaha", "work", "planned"], "summary": "OMAHA, Neb.\n(KMTV) — If you're looking for work, you'll want to go to the Comfort Inn & Suites at 7007 Grover Street on February 5.\nA job fair with many different employers will be held at the hotel from 1-4 p.m.\nParking at the hotel will be free.\nIf you've never attended a job fair before, click here for some tips."}, {"url": "https://www.3newsnow.com/news/local-news/18-year-old-omaha-woman-killed-in-overnight-wreck", "title": "18-year-old Omaha woman killed in overnight wreck", "authors": [], "date": "2020-02-18", "keywords": ["times", "rolled", "overnight", "18yearold", "shoulder", "wreck", "say", "pronounced", "woman", "treepolice", "omaha", "killed", "responded", "scenean"], "summary": "OMAHA, Neb.\n(KMTV) - An Omaha woman was killed early Tuesday after police say she lost control of her car and rolled several times before hitting a tree.\nPolice responded to 16th and Cornish around 1:25 a.m. Alexis McCormick, 18, was pronounced dead at the scene.\nAn 18-year-old passenger was brought to Nebraska Medicine with a shoulder injury.\nPolice say alcohol is being investigated as a factor in the crash."}, {"url": "https://thereader.com/the-buzz/where-to-celebrate-mardi-gras-in-omaha", "title": "Where to Celebrate Mardi Gras in Omaha", "authors": [], "date": "2020-02-11", "keywords": ["celebrate", "live", "shucks", "long", "party", "specials", "fat", "mardi", "omaha", "gras", "festivities"], "summary": "I have been to The Big Easy before, but unfortunately never during Mardi Gras season.\nMy Februaries have been spent in good ol’ Nebraska, where I have passed the time by figuring out where the best Mardi Gras parties are.\nAdding to the atmosphere, Mardi Gras partyers can expect free beads, my personal favorite and a staple of any Mardi Gras celebration, and festivities that kick off at 7 p.m. and run to midnight.\nBoasting three locations in Omaha, Shucks brings the Mardi Gras party to all three restaurants on Fat Tuesday.\nBottoms up: If you have the chance to celebrate Mardi Gras in New Orleans, I highly suggest you jump on that opportunity; but if you’ll be in Omaha for the biggest party in February, check out these places because Mardi Gras only comes once a year."}, {"url": "https://www.3newsnow.com/news/local-news/man-dies-following-shooting-in-omaha", "title": "Man dies following shooting in Omaha", "authors": [], "date": "2020-02-20", "keywords": ["suspect", "stoppers", "shooting", "street", "wwwp3tipscom", "wound", "suffered", "dies", "died", "urged", "omaha", "man", "following"], "summary": "OMAHA, Neb.\n(KMTV) - Omaha Police say a man shot on Wednesday has died from his injuries.\nPolice responded to 3073 S. 36th Street just after 12:30 p.m. and found a man who had suffered a gunshot wound.\nThe man was identified by Omaha Police as 32-year-old Howard Meemer.\nTips leading to an arrest of a homicide suspect are eligible for a reward of up to $25,000."}, {"url": "https://www.ttnews.com/articles/nebraska-dot-unveils-omaha-transportation-study", "title": "Nebraska DOT Unveils Omaha Transportation Study", "authors": ["Eleanor Lamb", "Staff Reporter"], "date": "2020-02-14", "keywords": ["downtown", "nebraska", "transportation", "area", "projects", "bluffs", "dot", "route", "miles", "unveils", "system", "omaha", "study"], "summary": "Omaha, Neb., with Interstate 480, a 5-mile auxiliary route that links downtown Omaha to Council Bluffs, Iowa, visible on the right.\nThe Nebraska Department of Transportation released the Metro Area Travel Improvement Study, which is meant to guide road improvements in the Omaha area for the next few decades.\nAnnounced Feb. 13, the study considers Omaha and Council Bluffs, Iowa, which lies just across the Missouri River.\nThe study area encompasses a sprawl that includes 83 miles of interstate highway, 180 miles of state routes, 176 miles of local roads and 39 miles of other freeways and expressways.\nAccording to the study, the previous freeway master plan for the Omaha area was completed in 1985."}, {"url": "https://www.3newsnow.com/news/local-news/two-people-sentenced-for-meth-distribution-charges-in-omaha", "title": "Two people sentenced for meth distribution charges in Omaha", "authors": [], "date": "2020-01-07", "keywords": ["distribution", "shared", "sentenced", "release", "meth", "charges", "omahas", "regarding", "p", "omaha", "prisonunited", "yesterday", "states"], "summary": "OMAHA, Neb.\n(KMTV) — Yesterday in Omaha's federal court, two people were sentenced for intent to distribute and deliver methamphetamine.\nOne of them will also face deportation after more than 11 years in prison.\nUnited States Attorney Joseph P. Kelly's office shared the following release regarding the two cases:"}, {"url": "https://www.mccookgazette.com/blogs/1466/entry/74547", "title": "Additional Nebraska Boys High School Basketball Heroes from 2019/2020.", "authors": [], "date": "2020-03-22", "keywords": ["heroes", "nebraska", "high", "school", "additional", "basketball", "20192020", "boys"], "summary": ""}, {"url": "https://www.ketv.com/article/as-the-us-struggles-through-covid-19-response-nebraska-is-unique-place/31764951", "title": "As the U.S. struggles through COVID-19 response, Nebraska is 'unique place'", "authors": ["David Earl", "Https", "Www.Facebook.Com Davidearlketv"], "date": "2020-03-19", "keywords": ["unmc", "supply", "unique", "nebraska", "struggles", "clinical", "david", "barriers", "place", "testing", "working", "covid19", "remove", "response", "states"], "summary": ">> I DON’T KNOW WHAT THE MAGIC IS, BUT NEBRASKA IS A UNIQUE PLACE.\nDAVID: CONGRESSMAN DON BACON WAS ON THE CALL, WHERE HE ADDRESSED CORONAVIRUS TESTING SHORTAGES FROM COAST TO COAST, INCLUDING HERE IN NEBRASKA.\nDAVID: BACON ALSO ADMITTED THE UNITED STATES’ SUPPLY OF MEDICAL EQUIPMENT, ESPECIALLY FACE MASKS, ISN’T WHERE IT NEEDS TO BE.\n\"I don't know what the magic is,\" said UNMC Chancellor Dr. Jeffrey Gold, \"But Nebraska is a unique place.\n\"Gold outlined the state's initial response, bringing evacuated Americans to UNMC for quarantine from the Diamond Princess cruise ship."}, {"url": "https://www.cbsnews.com/news/scientists-rush-to-develop-novel-coronavirus-vaccine-60-minutes-2020-03-22/", "title": "In clinical trials and laboratories, the hunt is on to find vaccines and drugs to treat, prevent novel coronavirus", "authors": [], "date": "2020-03-22", "keywords": ["virus", "prevent", "coronavirus", "hoge", "laboratories", "angela", "hunt", "vaccines", "drugs", "trials", "drug", "hewlett", "medical", "whitaker", "vaccine", "clinical", "broderick", "novel", "treat"], "summary": "Dr. Angela Hewlett is the medical director of the bio-containment unit, equipped to care for patients with highly contagious, dangerous diseases.\nDr. Angela Hewlett: We have 10 regional treatment centers with those capabilities.\nDr. Angela Hewlett: I will say this is the fastest clinical trial that I've ever seen come to-- to fruition in this amount of time.\nStephen Hoge CBS NewsThe National Institutes of Health is collaborating with Moderna to accelerate the development of a coronavirus vaccine.\nDr. Angela Hewlett: We wanna make sure that, you know, we're not giving-- drugs to people that could have side effects."}, {"url": "https://www.ketv.com/article/numerous-metro-area-school-districts-offering-free-meals-while-classes-are-cancelled/31712438", "title": "Numerous metro area school districts offering free meals while classes are cancelled", "authors": ["Dalaun Dillard", "Https", "Www.Facebook.Com Dalaundillardtv", "Anchor Reporter"], "date": "2020-03-19", "keywords": ["public", "metro", "breakfast", "elementary", "cancelled", "free", "area", "offering", "high", "meal", "lunch", "school", "picked", "students", "districts", "classes", "numerous", "meals"], "summary": "As thousands of metro area students are out of school due to the coronavirus, school districts are stepping in to make sure they are still receiving meals.\nMeals can be picked up Ralston High School and Ralston Middle School.\nAll meals can be picked up at Abraham Lincoln High School, Bloomer Elementary, Carter Lake Elementary, Crescent Elementary, Edison Elementary, Franklin Elementary, Lewis & Clark Elementary, Longfellow Elementary and Roosevelt Elementary.\nMeals can be picked up Ralston High School and Ralston Middle School.\nAll meals can be picked up at Abraham Lincoln High School, Bloomer Elementary, Carter Lake Elementary, Crescent Elementary, Edison Elementary, Franklin Elementary, Lewis & Clark Elementary, Longfellow Elementary and Roosevelt Elementary."}, {"url": "https://www.ketv.com/article/some-grocery-stores-to-create-elderly-hours-for-geriatrics-to-get-supplies-early-before-crowds/31703015", "title": "Some stores creating 'elderly hours' for seniors to get groceries, supplies before crowds", "authors": ["Https", "Www.Facebook.Com", "National Desk Staff"], "date": "2020-03-19", "keywords": ["shoppers", "customers", "paper", "restock", "hour", "toilet", "seniors", "store", "supplies", "groceries", "shelves", "creating", "elderly", "crowds", "hours", "stores"], "summary": "Inside the store, shoppers could be seen lining up at the registers as workers directed traffic and helped hand out some of the most popular items.\nNotably missing, however, was toilet paper, which has mostly been wiped out at stores all across the country.\nNo toilet paper whatsoever in any stores.\nThis stop and shop in Smithtown had plenty of food but no toilet paper.\nAdvertisement Some stores creating 'elderly hours' for seniors to get groceries, supplies before crowds Share Shares Copy Link CopyThis article will be updated as stores announce these policies."}, {"url": "https://www.3newsnow.com/list-of-closings-cancellations-due-to-coronavirus", "title": "List of closings and cancellations due to coronavirus", "authors": [], "date": "2020-03-13", "keywords": ["public", "cancellations", "closed", "community", "closings", "chi", "church", "center", "health", "coronavirus", "county", "covid19", "list", "omaha"], "summary": "Services at the Lincoln-Lancaster County Health Department, 3131 “O” St. will be conducted by appointment only.\n3/29/20Nebraska Brass - Canceled3/27/20Union Omaha Soccer - No game - Subject to changeMercy Me at CHI Health Center - Resscheduled for Sunday, October 4.\nNebraska Games and Parks- Closed public crane viewing blind at North River Wildlife Management Area north of Hershey.\nCHI HealthStarting Monday morning, you will see changes at CHI Health hospitals across Nebraska and southwest Iowa.\nCHI Health will now restrict visitor access, limit some entry points and screen all visitors at its 15 hospitals."}, {"url": "https://www.dtnpf.com/agriculture/web/ag/news/farm-life/article/2020/03/19/craft-distillers-put-spirits-work", "title": "Craft Distillers Put Their Spirits to Work as Hand Sanitizer", "authors": [], "date": "2020-03-19", "keywords": ["oaks", "whiskey", "distillery", "distillers", "spirits", "bottles", "snyder", "craft", "hand", "walter", "world", "work", "sanitizer"], "summary": "Walter has not been able to secure aloe vera, an ingredient used to make a gel form of hand sanitizer, so the product will be a spray.\nEight Oaks Farm Distillery in New Tripoli, Pennsylvania, is another distillery entering the highly in-demand world of hand sanitizers.\nBottles for the hand sanitizer were one challenge for Eight Oaks Farm.\n\"I was surprised it was short of sanitizer,\" Snyder said.\nYou can make a donation to the Eight Oaks Hand Sanitizer Project at: www.eightoaksdistillery.com."}, {"url": "https://www.3newsnow.com/news/local-news/omaha-performing-arts-announces-2020-2021-season", "title": "Omaha Performing Arts announces 2020-2021 season", "authors": [], "date": "2020-03-03", "keywords": ["730", "season", "performing", "pmholland", "orpheum", "16", "2020", "performances", "pmorpheum", "2021", "arts", "announces", "20202021", "omaha", "broadway"], "summary": "OMAHA, Neb.\n(KMTV) — Omaha Performing Arts (O-pa) announced their upcoming season on Monday, which includes Broadway performances like Frozen and Mean Girls.\nO-pa is bringing seven Broadway performances to Omaha in their 2020-2021 season.\n“The list of Broadway tours includes some of the highest caliber and most sought-after shows selling out on Broadway today.\nSeason subscribers can start renewing their subscription packages immediately at TicketOmaha.com, by calling (402) 345-0606 or in person at the Ticket Omaha Box Office located inside the Holland Performing Arts Center (1200 Douglas Street)."}, {"url": "http://unothegateway.com/through-the-lens-omaha-womens-day-march-2020/", "title": "Through the lens: Omaha Women’s Day March 2020", "authors": [], "date": "2020-03-08", "keywords": ["month", "2020", "day", "stands", "special", "meganmonismith", "instagramhappy", "post", "womens", "lens", "picking", "issue", "view", "omaha"], "summary": "View this post on InstagramHappy Women's History Month!\nCelebrate by picking up the Gateway's special gender issue, on stands now.\n✨ Cover by: @meganmonismith"}, {"url": "https://www.ketv.com/article/coronavirus-covid19-nebraska-omaha-latest/31213658", "title": "Coronavirus in Nebraska, Iowa: The latest headlines and resources to keep you informed", "authors": ["Ketv Staff Report", "Https", "Www.Facebook.Com"], "date": "2020-04-16", "keywords": ["informed", "issued", "nebraska", "resources", "counties", "coronavirus", "health", "county", "headlines", "dhm", "applies", "covid19", "iowa", "latest", "effect", "cases"], "summary": "Latest Headlines The Department of Health and Human Services said Wednesday evening that there are 952 confirmed cases of COVID-19 in Nebraska, and a total of 21 people in Nebraska have died from the coronavirus.Gov.\nFour more people have died for a total of 53 deaths.On Wednesday, the Douglas County Health Department reported eight new positive cases of COVID-19 in Douglas County.\nOn Wednesday, Pottawattamie County Public Health reported four new positive COVID-19 cases in Pottawattamie County.\nThe total number of COVID-19 cases for Pottawattamie County is now eighteen, eleven of which have recovered.\nThe money will provide resources to metro organizations helping communities impacted by the economic consequences of the Coronavirus concern."}, {"url": "https://www.washingtontimes.com/news/2020/mar/18/china-threatens-electronic-strikes-on-navy/", "title": "China threatens electronic strikes on Navy", "authors": ["The Washington Times Http", "Bill Gertz"], "date": "2020-03-18", "keywords": ["threatens", "strikes", "missile", "forces", "china", "operations", "force", "weapons", "military", "navy", "uss", "electronic", "space", "strike"], "summary": "China has called for using electromagnetic attacks on U.S. warships transiting the South China Sea, according to a state-run Chinese outlet.\nSPACE FORCE DEPLOYS FIRST WEAPONThe new Space Force has deployed the military’s first offensive space weapon, a jamming device for disrupting satellite communications.\nIt was the first time the Space Force disclosed the existence of any of its weaponry.\nBy contrast, both China and Russia have an array of space weapons, including different types of anti-satellite missiles, ground-based laser dazzlers and electronic jammers, and maneuvering killer robot satellites.\n“Achieving IOC for this upgrade puts the ‘force’ in Space Force and is critical to space as a warfighting domain,” he said."}, {"url": "https://www.3newsnow.com/news/local-news/officials-nebraskan-tests-positive-for-the-coronavirus", "title": "Douglas County woman is Nebraska's first positive case of coronavirus", "authors": [], "date": "2020-03-06", "keywords": ["officials", "patient", "methodist", "pete", "coronavirus", "douglas", "went", "county", "health", "working", "woman", "case", "ricketts", "positive", "nebraskas"], "summary": "Officials are working to get more information on other places the patient went before being hospitalized.\n(KMTV) - Nebraska has its first positive case of the coronavirus, officials said Friday afternoon.\nThe woman went to the Methodist ER on Thursday, where she was tested for coronavirus.\nThese people will be self-isolated and actively monitored twice daily by public health officials for fever and respiratory symptoms.\nNebraska Governor Pete Ricketts' office provided the following release:"}, {"url": "https://www.3newsnow.com/schools-and-colleges-impacted-by-coronavirus", "title": "Schools and colleges impacted by coronavirus", "authors": [], "date": "2020-03-12", "keywords": ["public", "learning", "community", "colleges", "continue", "staff", "coronavirus", "school", "health", "schools", "students", "information", "impacted"], "summary": "Fremont Public SchoolsFremont Public Schools is announcing the Continuation of Learning Plan to be implemented during the indefinite closure of schools out of an abundance of caution to mitigate the spread of COVID-19.\nLincoln Public Schools3/31/20 UPDATE:With the latest information about the Coronavirus COVID-19, Lincoln Public Schools officials announce they will continue with Remote Learning until at least May 6.\nLincoln Public Schools Nutrition Services will provide a sack lunch and breakfast for the next day to any LPS student at any of the five locations beginning Monday, March 16.\nRalston Public SchoolsRalston Public Schools Families,Ralston Public Schools has spent the past few weeks researching and monitoring the rapidly-changing COVID-19 (coronavirus) health issue in our community and across the world.\nTo be proactive and limit possible exposure with regards to COVID-19, Ralston Public Schools will be closed beginning Saturday, March 14 through the week of March 16th-21st."}, {"url": "https://www.dailymail.co.uk/news/article-8128963/Las-Vegas-looks-like-ghost-town-Nevada-orders-closure-casinos.html", "title": "Las Vegas looks like a ghost town after Nevada orders closure of all casinos", "authors": ["Valerie Edwards", "Valerie Edwards For Dailymail.Com"], "date": "2020-03-19", "keywords": ["looks", "closure", "order", "town", "closed", "bars", "takeout", "ghost", "las", "public", "restaurants", "nevada", "state", "casinos", "vegas", "schools", "ordered", "shut", "orders"], "summary": "All restaurant dining areas and gyms in the state shut March 20 with immediate effect.\nThe guidelines also call for not eating or drinking in bars, restaurants and food courts, but to use drive-thru or pickup options.\nKim Reynolds ordered restaurants, bars, fitness centers, theaters and casinos to close for two weeks.\nMISSOURIRestaurants, bars and movie theaters ordered shut for 15 days in Kansas City metro from TuesdayMONTANAPublic schools closed for two weeks.\nTENNESSEEAll bars closed in Nashville; restuarants ordered to operate at no more than 50 per cent capacity."}, {"url": "https://www.3newsnow.com/news/national/coronavirus/nebraska-coronavirus-exposure-map", "title": "Nebraska/Iowa coronavirus exposure map", "authors": [], "date": "2020-03-11", "keywords": ["exposure", "send", "patients", "nebraska", "neb", "nebraskaiowa", "map", "coronavirus", "tracking", "missed", "omaha", "locations", "ongoing"], "summary": "OMAHA, Neb.\n(KMTV) — Locations where confirmed coronavirus patients have been continue to come in throughout Iowa and Nebraska.\nWe're tracking the locations here on this map.\nSee a location we missed?\nClick here for our ongoing coverage of the coronavirus."}, {"url": "https://riabiz.com/a/2020/4/14/schwabs-merger-with-td-ameritrade-was-sterling-until-the-covid-19-pandemic-and-financial-collapse-took-some-of-the-shine-off-the-deal", "title": "", "authors": [], "date": "2020-04-14", "keywords": [], "summary": ""}, {"url": "https://www.3newsnow.com/news/local-news/victim-shot-near-benson-hs-in-extremely-critical-condition", "title": "Three arrested in connection with Monday shooting", "authors": [], "date": "2020-03-10", "keywords": ["conspiracy", "discharge", "shooting", "lea", "arrested", "douglas", "connection", "county", "corrections", "victim", "jade", "booked"], "summary": "(KMTV) — UPDATE: 3/13/20The Omaha Police Department says the victim, 24-year-old Jade Lea, has died from his injuries.\nUPDATE: 3/12/20Police say an additional arrest has been made in connection to the shooting of Jade Lea.\n3/10/20 update:Omaha Police Investigators have arrested three in connection with a shooting that left 24-year-old Jade Lea in extremely critical condition Monday.\nTrevian Harris, 19, was booked into Douglas County Corrections for Conspiracy to Discharge FirearmJordon Miller, 24, was booked into Douglas County Corrections for Conspiracy to Discharge Firearm.\nOriginal story:On Monday night, police located a shooting victim in \"extremely critical condition\" near 49th and Maple Streets."}, {"url": "https://www.3newsnow.com/news/coronavirus/coronavirus-community-resource-guide", "title": "Coronavirus community resource guide", "authors": [], "date": "2020-03-16", "keywords": ["services", "guide", "community", "omaha", "coronavirus", "health", "school", "families", "food", "students", "covid19", "resource", "meals"], "summary": "School Food MarketsAt this time, Food Markets will temporarily take place outside the school building during the school’s regularly scheduled day and time.\nWestside Community SchoolsOf note: we will again be handing out free meals to students in need at THREE sites on Monday.\nAlso of note, here is the link to the Westside Resource Guide we put together to help families.\nCommunity Meals will be distributed throughout the week for families with school age children.\nThe cost of meals is Free for all children in the Riverside Community School District ages birth to 18 years of age ."}, {"url": "http://shortgo.co/this-is-me-podcast-featuring-guest-first-lady-jennie-gordon/", "title": "This is Me Podcast Featuring Guest, First Lady Jennie Gordon", "authors": [], "date": "2020-04-15", "keywords": ["lady", "wyoming", "muir", "served", "best", "jennies", "wife", "guest", "initiative", "jennie", "gordon", "ranch", "featuring", "podcast"], "summary": "Jennie (Muir) Gordon currently serves as First Lady of Wyoming.\nJennie’s father, Senior Master Sergeant Robert Muir, served in the Navy, Army and the Air Force.\nGovernor Gordon and his wife Jennie have four grown children, Anne, Aaron with wife Megan, Bea with fiancé Austen, and Spencer with wife Sarah and their son Everett.\nIn October 2019 Jennie launched the Wyoming Hunger Initiative, whose mission is to end childhood hunger in Wyoming.\n-First Lady Jennie GordonLISTEN NOW THIS IS ME*biography courtesy of the Office of the First LadyThis episode was recorded prior to the coronavirus pandemic."}, {"url": "https://www.ncronline.org/news/theology/francis-creates-new-women-deacons-commission-naming-entirely-different-membership", "title": "Francis creates new women deacons commission, naming entirely different membership", "authors": ["Apr", "Jan", "May", "Dec"], "date": "2020-04-08", "keywords": ["theology", "creates", "naming", "francis", "university", "women", "served", "group", "church", "pope", "commission", "different", "deacons", "members", "entirely", "membership"], "summary": "In his May 2019 meeting with the umbrella group of women religious, Francis said the original women deacons commission had disagreed about the role of those early women deacons.\nSome on the original commission, he said, thought the church \"must go forward\" and reinstitute an order of women deacons.\nAn abstract of that paper, available online, describes the author concluding that women deacons in the early centuries of the church were \"ontologically different\" than male deacons.\nFrancis first promised to study the issue of women deacons in a May 2016 meeting with the women religious group, known formally as the International Union of Superiors General.\nAn NCR columnist, theologian Phyllis Zagano, served on the pope's first women deacons commission."}, {"url": "https://www.ketv.com/article/nancy-pelosi-visits-omaha-this-october/29246949", "title": "Nancy Pelosi visits Omaha this October", "authors": [], "date": "2019-09-26", "keywords": ["right", "visiting", "visits", "set", "womens", "pelosi", "votethe", "serve", "plans", "nancy", "omaha", "purchased", "speaker"], "summary": "House Speaker Nancy Pelosi will be visiting Omaha in October, according to the Nebraska Democratic Party.Pelosi will serve as the keynote speaker at the party's annual Morrison Exon fundraiser.The event plans to celebrate the 100-year anniversary of women's right to vote.The dinner is set for Oct. 26.Tickets can be purchased at NebraskaDemocrats.org.\nHouse Speaker Nancy Pelosi will be visiting Omaha in October, according to the Nebraska Democratic Party.\nPelosi will serve as the keynote speaker at the party's annual Morrison Exon fundraiser.\nAdvertisementThe event plans to celebrate the 100-year anniversary of women's right to vote.\nTickets can be purchased at NebraskaDemocrats.org."}, {"url": "https://www.3newsnow.com/news/local-news/ofd-battling-two-separate-apartment-building-fires-b", "title": "OFD battles two separate apartment building fires", "authors": [], "date": "2019-10-17", "keywords": ["woods", "omaha", "106th", "apartment", "battles", "n", "building", "fires", "apartments", "17", "sprinkler", "separate", "kensington", "ofd", "1306", "systems"], "summary": "(KMTV) — The Omaha Fire Department battled apartment complex fires at two separate locations Thursday afternoon.\nExisting buildings may be required to meet current codes, including automatic fire sprinkler systems, due to a substantial remodel or rebuild.\nCrews are actively working at the Kensington Woods apartment complex.\nThe second blaze is happened at Kensington Woods apartments, located at:Video of the fire from Twitter:Another user's picture.\nOmaha (@mudomahane) October 17, 2019More pictures from Kensington Woods from by 3 News Now Photojournalist Tapiwa Muchegwa:Kensington Woods Apartments Fire at 1306 N 106th CtKensington Woods Apartments Fire at 1306 N 106th CtKensington Woods Apartments Fire at 1306 N 106th CtKensington Woods Apartments Fire at 1306 N 106th CtMultiple agencies are on-scene lending aid:"}, {"url": "https://www.3newsnow.com/news/local-news/two-people-stabbed-at-omaha-apartment-complex", "title": "Two people stabbed at Omaha apartment complex", "authors": [], "date": "2019-10-31", "keywords": ["scene", "transported", "complex", "suspect", "luetzen", "saw", "apartment", "stabbed", "window", "say", "victims", "kent", "omaha"], "summary": "(KMTV) — The Omaha Police Department says two people suffered stabbing/cutting wounds in an incident at an Omaha apartment complex.\nA witness at the scene said he saw a woman and a baby, both covered in blood, taken from the scene.\n3 News Now Reporter Kent Luetzen shared these Tweets from the complex.\npic.twitter.com/0eDENQgy4L — Kent Luetzen (@KentLuetzen) October 31, 2019A resident, Detwone Smith, who lives in the building tells us he saw a man jump from the third story window of his apartment.\n— Kent Luetzen (@KentLuetzen) October 31, 2019Police have identified the victims as 64-year-old Ma NU and one-year-old Lily HTAW."}, {"url": "https://www.3newsnow.com/news/local-news/national-weather-service-issuing-storm-tornado-warnings-otoe-nemaha", "title": "National Weather Service issuing storm/tornado warnings", "authors": [], "date": "2019-10-01", "keywords": ["metro", "producing", "storms", "passes", "heavy", "wait", "soon", "stormtornado", "issuing", "weather", "warnings", "pictwittercomve1nkt5xza", "omahacb", "national", "service", "rain"], "summary": "Heavy rain will move into the Omaha/CB metro very soon.\nThese storms have been producing very heavy rain.\nThis will make driving over the next hour or so very hazardous.\nWait to drive until this passes if you can.\npic.twitter.com/VE1NKt5xZA"}, {"url": "https://www.constructiondive.com/news/construction-dives-mini-megacities-to-watch-omaha-nebraska/570308/", "title": "Construction Dive's 'mini megacities' to watch: Omaha, Nebraska", "authors": ["Jenn Goodman", "Share It"], "date": "2020-01-15", "keywords": ["labor", "petsch", "university", "nebraska", "mini", "watch", "area", "million", "programs", "construction", "looking", "megacities", "omaha", "dives"], "summary": "This article is part of a five-part series looking at the most up-and-coming U.S. markets for commercial construction.\nJean Petsch, executive director of the Associated General Contractors' Nebraska Building Chapter has a saying about what's made Omaha such a desirable place to do business.\nSome top Omaha construction firms Charles Vrana and Sons Hausmann Construction JE Dunn Construction Kiewit McCarthy MCL Construction Sampson Construction Turner ConstructionAvailability of reasonably priced land, low labor costs and inexpensive electricity rates help make Omaha ideal for companies looking to build offices, data centers and warehouses, Petsch told Construction Dive.\nThe search for workersFinding labor to fuel all of this construction has been AGC members’ biggest challenge, Petsch said.\nA number of state and local initiatives in recent years have been aimed at boosting workforce development, according to the Omaha World Herald, and for young people interested in construction, the Nebraska area and Omaha in general offer a wealth of career development options."}, {"url": "https://www.3newsnow.com/news/local-news/traffic-backing-up-on-680-due-to-crash", "title": "Traffic backing up on 680 due to crash", "authors": [], "date": "2019-10-18", "keywords": ["680", "expect", "street", "transportation", "consider", "long", "lanes", "crash", "wreck", "route", "traffic", "omaha", "backing"], "summary": "OMAHA, Neb.\n(KMTV) — The Nebraska Department of Transportation says traffic is backing up on 680 northbound near Center Street due to a wreck.\nThey say drivers should consider an alternate route and expect long delays.\n#omaha crash 680nb south of pacific st right 3 lanes blocked (# 2, 3 & 4 lanes) expect long delays CONSIDER ALT ROUTE pic.twitter.com/BDlZ0MV0uh — Omaha Hwy Conditions (@NDOTomaha) October 18, 2019"}, {"url": "https://www.3newsnow.com/news/community/vista-semanal/local/omaha-police-respond-to-cutting-shooting-incidents", "title": "Omaha Police respond to cutting, shooting incidents", "authors": [], "date": "2019-10-26", "keywords": ["scene", "suspect", "shooting", "nebraska", "respond", "located", "victim", "vehicle", "leaving", "cutting", "incidents", "officers", "omaha", "medical", "responded"], "summary": "(KMTV) — Officers responded to a separate shooting and cutting incidents overnight Saturday.\nAt 2:25 a.m. Saturday, officers responded to a walk in cutting victim at Nebraska Medical Center.\nPolice responded to a call of shots fired near the 2500 block of N. 48th Ave at 2:12 a.m. Saturday.\nOfficers learned of a white SUV leaving the scene and located it as the vehicle that was driven to Nebraska Medical Center.\nAuthorities located 29-year-old victim, in a vehicle, who was suffering from a superficial gunshot wound that is not considered to be life-threatening."}, {"url": "https://www.3newsnow.com/news/local-news/henry-doorly-zoo-announces-new-halloween-event", "title": "Henry Doorly Zoo announces new Halloween event", "authors": [], "date": "2019-10-01", "keywords": ["lantern", "halloween", "zoos", "doorly", "vultures", "event", "zoo", "witches", "lighting", "announces", "henry", "weekend", "themed"], "summary": "(KMTV) — Omaha's Henry Doorly Zoo has announced a new Halloween themed event throughout October.\nGhouls and Glow will feature about 400 larger than life lantern displays as part of an all-new Halloween event.\nThe event debuted last weekend, and will run every weekend throughout October, ending on the 27th.\nVisitors will encounter dancing skeletons, candy monsters, jack-o-lanterns, ghosts, and witches as well as other halloween-themed characters.\nOutside of the lantern display, hundreds of hand-carved pumpkins will glisten along the Zoo’s pathways, as well as a 14'6\" pumpkin tree and themed lighting and décor provided by the Zoo’s holiday lighting partner, Holidynamics."}, {"url": "https://www.3newsnow.com/news/local-news/traffic-deaths-at-six-year-high-in-nebraska-b", "title": "Traffic deaths at six-year high in Nebraska", "authors": [], "date": "2019-10-14", "keywords": ["toll", "report", "nebraska", "transportation", "state", "high", "average", "deaths", "previousfiveyear", "sixyear", "traffic", "totalso", "tops"], "summary": "(KMTV) — The Nebraska Department of Transportation has released a report of traffic fatalities across the state.\nThis year tops both the previous-five-year average and past-five-year total.\nSo far, there have been 195 traffic deaths.\nThe previous-five-year average was 178 and the monthly average was six.\nYou can read the full report here: Nebraska Traffic Fatality Toll Comparison Friday, October 11, 2019"}, {"url": "https://9to5mac.com/2019/10/25/verizon-5g-coverage/", "title": "Verizon 5G coverage comes to (parts of) Dallas and Omaha", "authors": ["Apple Watch Series"], "date": "2019-10-25", "keywords": ["5g", "omaha", "parts", "verizons", "city", "cities", "wideband", "ultra", "dallas", "comes", "verizon", "coverage"], "summary": "Verizon 5G coverage is now live in Dallas and Omaha, Nebraska, says the carrier.\nThat brings the network’s 5G service to a total of 15 US cities…The announcement does, of course, come with the usual 5G caveat (our emphasis):You can now access Verizon’s 5G Ultra Wideband network in parts of Dallas and Omaha […] With Verizon’s 5G Ultra Wideband network, you can enjoy near real-time experiences with high throughput, ultra-low latency and massive capacity.\nAs for specifics, the carrier says Verizon 5G coverage should be found in the following parts of Dallas:Knox/Henderson, Downtown Dallas, Uptown, Medical Center Area, Deep Ellum; and around such landmarks as Parkland Memorial Hospital, Children’s Medical Center, Jade Waters Pool, Dallas Comedy House, The Curtain Club, Dallas Theological Seminary and Turtle Creek Park.\nVerizon’s 5G Ultra Wideband service is available in Chicago, Minneapolis, Denver, Providence, St. Paul, Atlanta, Detroit, Indianapolis, Washington, DC, Phoenix, Boise, Panama City, New York City.\nAdditional 5G Ultra Wideband cities will be announced later this year."}, {"url": "https://www.3newsnow.com/news/local-news/traffic-being-impacted-due-to-wrecks-on-i-80-and-elsewhere", "title": "Traffic being impacted due to wrecks on I-80", "authors": [], "date": "2019-10-07", "keywords": ["expect", "right", "hwy", "wrecks", "blocked", "i80", "conditions", "crash", "ndotomaha", "traffic", "omaha", "st", "impacted", "2019omaha"], "summary": "OMAHA, Neb.\n(KMTV) — The Nebraska Department of Transportation says two wrecks have occurred on I-80 which is causing traffic to back up.\nAdditional wrecks are impacting drivers in other parts of the Metro as well.\nOPD on scene left lane blocked keep right expect delays pic.twitter.com/GHMPKVSSy7 — Omaha Hwy Conditions (@NDOTomaha) October 7, 2019#omaha crash L st wb @ 108th st right shoulder blocked pic.twitter.com/RsuyLtYYco — Omaha Hwy Conditions (@NDOTomaha) October 7, 2019Troopers are working a crash on interstate 80 eastbound at mile marker 447.4.\nroute pic.twitter.com/6LAuYIAnUp — Omaha Hwy Conditions (@NDOTomaha) October 7, 2019We will continue to update this story as more traffic reports come in."}, {"url": "https://www.ketv.com/article/omaha-is-named-fastest-growing-construction-job-market/29893475", "title": "Omaha is named fastest-growing construction job market", "authors": ["Waverle Monroe", "Https", "Www.Facebook.Com", "Anchor Reporter"], "date": "2019-11-22", "keywords": ["right", "turmail", "job", "market", "named", "lot", "theres", "school", "high", "fastestgrowing", "construction", "waverle", "omaha"], "summary": "Omaha is named fastest-growing construction job market Associated General Contractors credits robust local economy Share Shares Copy Link CopyHide Transcript Show TranscriptTHE JOBS.\nIN THE LAST YEAR, 5900 NEW CONSTRUCTION JOBS WERE ADDED, WHICH IS A 20% INCREASE -- PLACING OMAHA AS THE FASTEST GROWING CONSTRUCTION JOB MARKET IN THE COUNTRY.\nWAVERLE: EVEN THOUGH THE GROWTH SETS OMAHA APART FROM ANY OTHER CONSTRUCTION MARKET IN THE COUNTRY, THERE’S STILL A LOT OF WORK TO DO.\nWAVERLE: METRO COMMUNITY COLLEGE DEAN OF CONSTRUCTION NATE BERRY SAYS ABOUT 70 HIGH SCHOOL STUDENTS VISIT THE COMMUNITY COLLEGE’S CONSTRUCTION PROGRAM DAILY.\nWAVERLE: TURMAIL HOPES TO BRING EDUCATIONAL CHANGES TO SCHOOL DISTRICTS TO INCENTIFY THEM TO OFFER MORE CONSTRUCTION CAREER -- MORE CONSTRUCTION CAREER CHOICES TO THEIR STUDENT MEANING YES, MORE CONSTRUCTION."}, {"url": "https://www.3newsnow.com/news/local-news/major-curling-announcement-happening-at-baxter-arena", "title": "\"Major curling announcement\" happening at Baxter Arena", "authors": [], "date": "2019-10-16", "keywords": ["arena", "curling", "announcement", "2018", "baxter", "usa", "2021", "olympic", "event", "major", "world", "omaha", "happening", "team"], "summary": "OMAHA, Neb.\n(KMTV) — Today, the Omaha Sports Commission is holding a press event regarding a curling event planned at Baxter Arena.\nOmaha selected as the host site for the 2021 USA Curling Olympic Team Trials.\nThe event will be held at Baxter Arena from November 13-21, 2021. pic.twitter.com/RRmZAVjjxZ — Phil Bergman (@PhilBergmanTV) October 16, 2019Baxter hosted the 2018 US Olympic team trials for curling, the 2018 Curling World Cup and the 2017 Curling Night in America.\nA number of local officials and members of the 2018 gold-medal-winning curling team are expected to be on hand."}, {"url": "https://www.3newsnow.com/news/local-news/four-people-arrested-in-connection-body-found-in-bellevue", "title": "Four people arrested in connection to body found in Bellevue", "authors": [], "date": "2019-10-23", "keywords": ["skeletal", "bellevue", "body", "wound", "substance", "arrested", "connection", "charged", "sarpy", "possession", "tampering", "bpd", "physical"], "summary": "(KMTV) — On Sunday, the Bellevue Police Department (BPD) responded to a call for a body found at Faulkland Park.\nThe body, identified as 19-year-old Matthew Brendan, had one gunshot wound to the head.\nToday, BPD says they've arrested four people in connection to the case.\n18-year-old Nolan Carpenter has been charged with: Human skeletal remains or burial goods; prohibited acts, Tampering with physical evidence.\n18-year-old Alyssa Edmisten has been charged with tampering with physical evidence."}, {"url": "https://www.3newsnow.com/news/local-news/alleged-omaha-home-invasion-and-assault-leaves-15-year-old-girl-badly-bruised", "title": "Teen says Omaha home invasion left her shaken", "authors": [], "date": "2019-10-14", "keywords": ["happened", "suspect", "morning", "teen", "left", "father", "attacked", "invasion", "reports", "shaken", "omaha", "getting", "windowannalenas"], "summary": "The Omaha Police Department is investigating and has no comment at this time.\nShe says she then started getting dressed when the intruder jumped out of her sister's closet and attacked her for nearly 10 minutes.\nThe suspect then left the home.\nThe incident left her very shaken up.\nAccording to the police report the suspect reportedly left the home by possibly jumping out of a second-floor window."}, {"url": "https://www.3newsnow.com/news/local-news/extra-enforcement-along-highway-370", "title": "Extra enforcement along Highway 370", "authors": [], "date": "2019-10-08", "keywords": ["vista", "370", "highway", "enforcement", "task", "extra", "force", "county", "traffic", "safety", "officers", "sarpy"], "summary": "The Sarpy County Traffic Safety Task Force says law enforcement will pay extra attention to the Highway 370 corridor.\nOfficers from Bellevue, Papillion, and La Vista will join Sarpy County deputies and the Nebraska State Patrol as part of the effort.\nThe Traffic Safety Task Force will be conducting an enforcement operation tomorrow, 10/08/19.\nYou will see officers from @SarpySheriff @NSP_TroopA @papillionpolice @BellevuePolice @lavistapolice across Sarpy County at various times and locations.\n#DriveSafeSarpy pic.twitter.com/c5915RPZcN — Sarpy County Traffic Safety Task Force (@SarpyTraffic) October 7, 2019The effort will focus on speeders and those who ignore traffic signals."}, {"url": "https://www.ketv.com/article/teen-accused-in-omaha-murder-now-charged-with-shooting-a-second-man/29443125", "title": "Teen accused in Omaha murder now charged with shooting a second man", "authors": [], "date": "2019-10-12", "keywords": ["box", "murder", "shooting", "teen", "second", "emily", "terry", "altairi", "night", "charged", "say", "accused", "omaha", "man", "prosecutors"], "summary": "Prosecutors: Omaha teen accused of killing one man, injuring another in two shootings on the same nightHide Transcript Show TranscriptEMILY?\nEMILY: PROSECUTORS SAY THE ROBBERY ENDED IN THE DEADLY SHOOTING OF BAHY ALTAIRI WHO WAS -- OF BAHY ALTAIRI, WHO WAS WORKING HIS FAMILY’S STORE THAT NIGHT.\nPROSECUTORS SAY AFTER THE SHOOTING, HE GOT BACK IN THE CAR WITH 16-YEAR-OLD MARSHAUN BOX, WHO DROVE THEM TO THEIR NEXT STOP.\nAdvertisement Teen accused in Omaha murder now charged with shooting a second man Prosecutors: Omaha teen accused of killing one man, injuring another in two shootings on the same night Share Shares Copy Link CopyDouglas County prosecutors allege the 17-year-old accused of murdering an Omaha tobacco store clerk also took part in a shooting two hours later that seriously injured a man in Northwest Omaha.\nBox reportedly drove the getaway car in the murder of Altairi and set up the meeting of the man, whom they tried to rob, according to Douglas County prosecutors."}, {"url": "https://www.3newsnow.com/news/local-news/available-locations-for-national-drug-take-back-day", "title": "Available locations for National Drug Take Back Day", "authors": [], "date": "2019-10-23", "keywords": ["department", "available", "s", "ave", "nebraska", "walgreens", "day", "county", "sheriffs", "drug", "office", "national", "omaha", "st", "locations"], "summary": "(KMTV) — This Saturday is National Drug Take Back day.\nYou can dispose of your unused or unwanted prescription drugs safely and anonymously, with no questions asked.\nThe Drug Enforcement Administration holds two of these events every year, in April and October.\nDuring April's event, the Nebraska DEA collected over 5,500 pounds of prescription drugs from more than 47 locations throughout the state.\nTo date, Nebraska has collected over 94,000 pounds of prescriptions in DEA-related take-back efforts since the initiative was implemented."}, {"url": "https://www.3newsnow.com/news/local-news/magic-johnson-coming-to-omaha-next-year", "title": "Magic Johnson coming to Omaha next year", "authors": [], "date": "2019-10-30", "keywords": ["american", "took", "leadership", "taking", "conference", "african", "place", "magic", "coming", "omaha", "johnson"], "summary": "OMAHA, Neb.\n(KMTV) — This year's African American Leadership Conference in Omaha took place last Friday and organizers are already planning something Magic for next year.\nThey say NBA great and entrepreneur Earvin \"Magic\" Johnson Jr. will be coming to Omaha.\nAccording to a post on Facebook by the Empowerment Network, Johnson will be in Omaha for the 9th Annual African American Leadership Conference, taking place at the CHI Health Center on September 25, 2020."}, {"url": "https://weather.com/news/weather/news/2019-09-24-missouri-river-flooding-record-days-above-flood-stage-wet-pattern", "title": "Parts of the Missouri River Are Smashing Records for Days Above Flood Stage and More Rain Is Ahead", "authors": [], "date": "2019-09-24", "keywords": ["records", "rainfall", "parts", "ahead", "nebraska", "stage", "smashing", "river", "days", "precipitation", "gauges", "missouri", "rain", "flood"], "summary": "Records are being smashed on portions of the Missouri River for the number of days above flood stage and with more rain ahead many river gauges will extend these records.\nFour river gauges on the Missouri River south of Omaha, Nebraska, have crushed records for number of days above flood stage , according to the National Weather Service.\nNebraska City, Brownville and Rulo have all experienced 194 days above flood stage, smashing previous records by at least 24 days.\n<img class=\"styles__noscript__2rw2y\" src=\"https://s.w-x.co/util/image/w/missouri_river_flood.jpg?v=at&w=485&h=273\" srcset=\"https://s.w-x.co/util/image/w/missouri_river_flood.jpg?v=at&w=485&h=273 400w, https://s.w-x.co/util/image/w/missouri_river_flood.jpg?v=ap&w=980&h=551 800w\" > Days select river gauges have been above flood stage, as of September 23.\nAll this rainfall will continue making its way downstream, keeping flood gauges above flood stage in Nebraska in the days ahead."}, {"url": "https://www.3newsnow.com/news/local-news/one-person-found-dead-in-morning-house-fire-says-ofd", "title": "Services planned for man who died in Thursday morning house fire", "authors": [], "date": "2019-10-24", "keywords": ["services", "family", "morning", "near", "support", "page", "set", "say", "died", "house", "stec", "cady", "omaha", "man", "planned", "st"], "summary": "(KMTV) — 10/26/2019 update:Eric Stec, 48, died Thursday morning in a house fire at his home near 173rd St and Cady Circle.\nA GoFundMe page set up in support of the family says Stec leaves behind his wife and two children.\nFuneral services are planned for 10:30 a.m. Wednesday at St. Wenceslaus Church, according to our partners at the Omaha World-Herald.\nPrevious story:This morning, the Omaha Fire Department battled a fire in West O and say one person was found dead.\nEric Stec, 48, died in a fire at his home near 173rd Street and Cady Circle, according to a GoFundMe page set up in support of the family."}, {"url": "https://www.3newsnow.com/news/local-news/season-greeting-fall-snowstorm-pushing-through-great-plains", "title": "Season greeting: Fall snowstorm pushing through Great Plains", "authors": [], "date": "2019-10-10", "keywords": ["greeting", "western", "pushing", "storm", "dakota", "chadron", "plains", "snow", "hintz", "south", "weather", "great", "inches", "travel", "season", "snowstorm", "fall"], "summary": "(KMTV) — A powerful winter-like storm moving through the Great Plains was closing schools and causing travel headaches in several states, authorities said Thursday.\nWinter storm warnings and watches stretched from Wyoming and Montana through western Nebraska and into the Dakotas and Minnesota.\nBlowing and drifting snow were making travel hazardous, with wind gusts approaching 40 mph (64.4 kph) in some areas.\nDozens of school districts canceled classes or started late in South Dakota and western Nebraska, including Chadron State College in Chadron, Nebraska.\nSnow reached 55 inches (1.4 meters) deep in the South Dakota community of Lead."}, {"url": "https://www.3newsnow.com/news/local-news/fall-foliage-is-on-the-way-peak-times-to-expect-it", "title": "Fall foliage is on the way - Peak times to expect it", "authors": [], "date": "2019-09-24", "keywords": ["expect", "times", "change", "way", "places", "foliage", "changes", "zinnia", "leaves", "peak", "pigments", "omaha", "begin", "fall"], "summary": "(KMTV) — Yesterday was the first day of fall and with that comes fall-related staples.\nThings like pumpkin-spiced everything, gathering for football and fall foliage.\nSo when will the leaves begin to change and when will they peak around the Metro?\nWith its absence, other pigments which already exist in the leaves begin to show through.\nAt the same time, they say other chemical changes and further development of other pigments cause the leaves to change more."}, {"url": "https://www.ketv.com/article/nebraska-medicine-data-breach-records-accessed-by-former-employee/30107687", "title": "Nebraska Medicine 'aware' of data breach, records accessed by former employee", "authors": ["Ketv Staff Report", "Https", "Www.Facebook.Com", "Emily Tencer"], "date": "2019-12-04", "keywords": ["records", "nebraska", "emily", "access", "medicine", "breach", "thanks", "accessed", "aware", "letter", "information", "casillas", "data", "employee"], "summary": "ROB: NEBRASKA MEDICINE REPORTEDLY FIRED THE WORKER TH DAY AFTER, BUT VICTIM SAYS THE ONE HOSPITAL FELL SHORT IN ITS RESPONSE.\nTHE LETTER ADDS NEBRASKA MEDICINE DISCOVERED THE BREACH IN OCTOBER DURING AN AUDIT OF THE ITS RECORDS.\nI ALREADY HAVE THAT, THANKS BUT NO THANKS -- THANKS BUT NO THANKS.\nAdvertisement Nebraska Medicine 'aware' of data breach, records accessed by former employee Share Shares Copy Link CopyNebraska Medicine has issued a statement, saying it is aware of a data breach.\nThanks, but no thanks,\" Casillas said.Casillas moved from Texas to be treated at Nebraska Medicine."}, {"url": "https://www.3newsnow.com/news/2019-flood/army-corps-shares-details-about-upcoming-releases-flood-potential", "title": "Army Corps shares details about upcoming releases/flood potential", "authors": [], "date": "2019-09-16", "keywords": ["corps", "army", "potential", "upcoming", "flood", "cfs", "reservoir", "week", "shares", "basin", "releases", "river", "releasesflood", "levee", "forecast", "missouri", "details"], "summary": "(KMTV) — Today, the United States Army Corps of Engineers released details about flood concerns, dam release levels and record rains in the Missouri River Basin area.\nKevin Low from the NWS’s Missouri Basin River Forecast Center provided a status of river gages and a weather and hydrologic outlook for the Missouri Basin.\nThe Corps’ Missouri River Water Management Division shares all release forecasts with the National Weather Service for incorporation into their forecast products.\nThrough the first two weeks of September very heavy precipitation has fallen over a large portion of the upper Missouri River Basin.\nMissouri River Levee StatusR616-613 - A construction contract was awarded on Aug. 7 with a contract completion date of Sept. 30."}, {"url": "https://www.3newsnow.com/news/local-news/opd-holding-drug-take-back-day", "title": "OPD holding drug take back day", "authors": [], "date": "2019-10-09", "keywords": ["public", "unused", "enforcement", "prescription", "day", "holding", "health", "drugs", "drug", "opd", "omaha", "abuse", "sites"], "summary": "(KMTV) — If you have old medications in your house and you don't know what to do with them, the Omaha Police Department and the U.S. Drug Enforcement Administration want to help.\nThey'll be holding a drug drop off day later this month.\nThis initiative addresses a vital public safety and public health issue.\nRates of prescription drug abuse in the United States are alarmingly high, as are the number of accidental poisonings and overdoses due to these drugs.\nFor more information about the disposal of prescription drugs or about the October 26 Take Back Day event, go to www.DEATakeBack.com [police.cityofomaha.org]."}, {"url": "https://www.gazettenet.com/Briefs-Hockey-East-names-associate-commissioner-Mount-Washington-Road-Race-on-schedule-33819975", "title": "Briefs: Hockey East names associate commissioner; Mount Washington Road Race on schedule", "authors": ["Dusty Christensen -", "Michael Connors -", "Jerrey Roberts", "Carol Lollis", "Kevin Gutting -", "Jerrey Roberts -"], "date": "2020-04-10", "keywords": ["commissioner", "postponed", "mcafee", "race", "briefs", "schedule", "hockey", "kate", "ncaa", "tournament", "womens", "ice", "washington", "mount", "road", "names", "east"], "summary": "Hockey East tabs Kate McAfeeThe Hockey East Association announced Friday that Kate McAfee has been named associate commissioner.\nShe was appointed a member of the NCAA Women’s Ice Hockey Committee in November 2019.\nShe brings great experience with all facets of college hockey as well as strong relationships throughout the league and the entire NCAA,” incoming Hockey East Commissioner Steve Metcalf said in a statement.\n“I’m excited to utilize my passion of the game for the betterment of Hockey East, its member institutions, and especially the student-athletes, and to have the opportunity to continue to make impactful changes in the college hockey landscape.”McAfee will begin her Hockey East duties later this spring.\nWashington Race on targetThe 60th Mount Washington Road Race is currently schedule to be held June 20 at 9 a.m. at Pinkham Notch, New Hampshire."}, {"url": "https://riabiz.com/a/2020/4/14/schwabs-merger-with-td-ameritrade-was-sterling-until-the-covid-19-pandemic-and-financial-collapse-took-some-of-the-shine-off-the-deal", "title": "", "authors": [], "date": "2020-04-14", "keywords": [], "summary": ""}, {"url": "https://www.3newsnow.com/news/community/vista-semanal/local/omaha-fall-cleanup-event-starts-saturday", "title": "Omaha Fall Cleanup event starts Saturday", "authors": [], "date": "2019-10-19", "keywords": ["starts", "accepted", "trash", "tires", "2019", "event", "items", "fall", "omaha", "nov", "cleanup"], "summary": "OMAHA, Neb.\nThe City of Omaha is holding fall cleanup events over the next four Saturdays, providing residents with the opportunity to recycle or dispose of items that aren't accepted through curbside trash and recycling services.\nThe 2019 Omaha Fall Cleanup event takes place over four Saturdays--Oct. 19, Nov. 9, Nov. 16 and Nov. 23--from 9:00 a.m. to 2 p.m.A map of the 2019 Omaha Fall Cleanup locations can be found at this link.\nLearn more about the cleanup event here.\nCall the Omaha Fall Cleanup hotline at 402-444-4636 with questions."}, {"url": "https://finance.yahoo.com/news/andrew-h-campbell-omaha-nebraska-185500897.html", "title": "Andrew H Campbell of Omaha, Nebraska to Speak at Peace and Conflict Resolution Conference 2019", "authors": [], "date": "2019-11-06", "keywords": ["international", "conflict", "campbell", "omaha", "conference", "nebraska", "leadership", "dr", "speak", "h", "andrew", "resolution", "peace"], "summary": "OMAHA, NE / ACCESSWIRE / November 6, 2019 / Dr. Andrew Campbell, the director of the International Peace and Leadership Institute, is proud to announce his role as the featured speaker at the 2019 International Conference on Peace and Resolution.\nThis year's topics include peace building, peace leadership, conflict resolution, current political trends, and best practices in international relations.\nFor more information about the International Conference on Peace and Conflict Resolution or to purchase a seat at the event, visit: https://www.pcrconference.org/.\nAbout Andrew H CampbellDr. Andrew H Campbell of Omaha, NE is the Director of the International Peace and Leadership Institute.\nCONTACT:Andrew H Campbell402-871-0160info@andrewhcampbellomahane.comandrew.h.campbell3@gmail.comSOURCE: Andrew H CampbellView source version on accesswire.com:https://www.accesswire.com/565548/Andrew-H-Campbell-of-Omaha-Nebraska-to-Speak-at-Peace-and-Conflict-Resolution-Conference-2019"}, {"url": "https://www.cnn.com/2019/11/09/us/omaha-rock-crash-meme-trnd/index.html", "title": "A rock in Omaha became an overnight attraction thanks to the cars that can't seem to avoid it", "authors": ["Fernando Alfonso Iii"], "date": "2019-11-09", "keywords": ["avoid", "omaha", "rock", "wedged", "overnight", "lot", "cant", "facebook", "vehicles", "untold", "fan", "weeks", "attraction", "cars", "crashed", "vibrant", "thanks"], "summary": "(CNN) A boulder has become a bit of a rock star in Nebraska after an untold number of vehicles crashed on top of it recently, sparking an unexpected fan base.\nThe rock, which rests inconspicuously in a parking lot median at N 156th St., has become Omaha's hottest new tourist attraction thanks to a vibrant Facebook group Reddit community , and a 5-star Google Maps rating that features photos of cars, trucks, and SUVs wedged on its perch.\n\"I personally think it's one of those things that everybody gets a chuckle out of,\" said Facebook fan Matt Roberts.\nHe was on his lunch break on Monday when he drove by and saw a hopeless black SUV.\nOver the past six weeks, Arrow Towing has responded to at least six calls of vehicles that have crashed into the rock, manager Steve Rains told CNN."}, {"url": "https://www.3newsnow.com/weather/winter-weather-forecast", "title": "Winter weather forecast", "authors": [], "date": "2019-11-19", "keywords": ["temperatures", "la", "average", "snow", "nada", "weather", "winter", "inches", "snowfall", "season", "forecast", "meteorologists"], "summary": "(KMTV) — For several weeks, our 3 News Now Weather Alert Team meteorologists have been working on their winter forecast.\nLast year brought us record cold and an unusually snowy winter season with over 50 inches of snow.\nThis winter, when looking at a long-term forecast, we have to start with the bigger picture.\nWhile the uncertainty makes forecasting for this upcoming winter season a little more challenging, we've already seen some arctic outbreaks like in October and a larger one in November.\nOur meteorologists will continue to monitor any possible changes to the winter forecast in the coming months."}, {"url": "https://patch.com/nebraska/omaha/calendar/event/20191110/634530/for-king-countrys-burn-the-ships-world-tour", "title": "for King & Country's 'burn the ships' World Tour", "authors": [], "date": "2019-09-05", "keywords": ["thrilling", "tour", "country", "twotime", "winning", "countrys", "burn", "king", "world", "bow", "ticket", "ships"], "summary": "Two-time GRAMMY® award winning duo for KING & COUNTRY is heading back out on the road bringing their burn the ships | world tour: North America to your area this fall.\nThe extensive run will see for KING & COUNTRY bring the bow of the proverbial “ship” to life with a thrilling new stage and lighting setup.\nSelect ticket holders will be able to experience the performance from the ships bow."}, {"url": "https://www.3newsnow.com/news/local-news/no-school-for-ops-students-on-2020-election-day", "title": "No school for OPS Students on 2020 Election Day", "authors": [], "date": "2019-11-05", "keywords": ["election", "ops", "2020", "day", "polling", "school", "worldherald", "schools", "students", "serve", "omaha", "places"], "summary": "(KMTV) — There will be no school for OPS students on Election Day 2020, according to our partners at the Omaha World-Herald.\nSchools serve as polling places, and the off day will make it easier to vote.\nDistrict officials said 13 elementary schools, four middle schools and three high schools serve as polling places.\nOne in three students are affected by the polling places.\nNo school on Election Day 2020 for OPS students: https://t.co/PIOLB2mWnO pic.twitter.com/f46uhWHzbx — OMAHA WORLD-HERALD (@OWHnews) November 5, 2019The Millard and Westside School Districts have no plans of canceling classes on Election Day next year even though some of their schools also serve as polling places, spokeswomen for the district said."}, {"url": "https://www.3newsnow.com/news/local-news/oppd-warns-of-spoofing-scam", "title": "OPPD warns of spoofing scam", "authors": [], "date": "2019-11-04", "keywords": ["oppd", "omaha", "warn", "scam", "sent", "warns", "regarding", "numberthey", "spoofing", "service", "wants"], "summary": "OMAHA, Neb.\n(KMTV) — OPPD wants to warn you of a spoofing scam going around regarding their customer service number.\nThey sent out this tweet explaining the scam and what to do should you get a call from that number."}, {"url": "https://www.3newsnow.com/news/local-news/fall-foliage-is-on-the-way-peak-times-to-expect-it", "title": "Fall foliage is on the way - Peak times to expect it", "authors": [], "date": "2019-09-24", "keywords": ["expect", "times", "change", "way", "places", "foliage", "changes", "zinnia", "leaves", "peak", "pigments", "omaha", "begin", "fall"], "summary": "(KMTV) — Yesterday was the first day of fall and with that comes fall-related staples.\nThings like pumpkin-spiced everything, gathering for football and fall foliage.\nSo when will the leaves begin to change and when will they peak around the Metro?\nWith its absence, other pigments which already exist in the leaves begin to show through.\nAt the same time, they say other chemical changes and further development of other pigments cause the leaves to change more."}, {"url": "https://www.3newsnow.com/news/local-news/omaha-nebraska-ranked-first-for-flu-activity-by-walgreens", "title": "Omaha/Nebraska ranked first for flu activity by Walgreens", "authors": [], "date": "2019-12-19", "keywords": ["omahanebraska", "activity", "flu", "121420191", "worth", "walgreens", "area", "yakimapascorichlandkennewick", "texas4", "wash7", "omaha", "ranked"], "summary": "According to Walgreens, Nebraska and the Omaha area top their list of regions with flu activity.\nFrom Walgreens flu-tracking site:Top 10 Designated Market Areas (DMAs) with Flu Activity (12/14/2019)1.\nDallas-Ft. Worth, Texas4.\nYakima-Pasco-Richland-Kennewick, Wash.7.\nBeaumont-Port Arthur, TexasTop 10 States/Territories with Flu Activity (12/14/2019)1."}, {"url": "https://www.kirklandreporter.com/obituaries/obituary-lester-lowell-sutherlin/", "title": "Obituary: Lester Lowell Sutherlin", "authors": [], "date": "2020-04-14", "keywords": ["worked", "phillips", "kirkland", "lowell", "south", "grandchildren", "great", "lester", "omaha", "sutherlin", "obituary"], "summary": "Lester Lowell SutherlinSutherlin, Lester Lowell.\nSurvived bydaughters, Monica Phillips, Lindy (Russell) Gillis, brother Tommy Sutherlin, 6 grandchildren and 8 great grandchildren.\nHe grew up in South Omaha and attended Omaha South High School.\nLowell worked at the Union Stockyards in South Omaha for 10 years before moving to Kirkland, WA in 1963.\nHe lived out his remaining years in Kirkland enjoying his daughters, grandchildren and great grandchildren, and the Nebraska Cornhuskers."}, {"url": "https://www.click2houston.com/news/local/2020/04/07/how-did-we-get-here-a-detailed-timeline-of-the-coronavirus-outbreak/", "title": "How did we get here? A detailed timeline of the coronavirus outbreak", "authors": [], "date": "2020-04-07", "keywords": ["cases", "virus", "state", "2020", "china", "coronavirus", "health", "timeline", "wuhan", "outbreak", "announces", "detailed"], "summary": "Coronavirus Outbreak Timeline Fast Facts(CNN) -- Here’s some information about the spread of the coronavirus outbreak, declared a pandemic by the World Health Organization.\nJanuary 22, 2020 - Wuhan says it will \"temporarily\" close its airport and railway stations for departing passengers following news that the death toll from the Wuhan Coronavirus has risen to 17.\nOn the same day, a team of international experts from WHO arrives in China to assist with containing the coronavirus outbreak.\nMarch 11, 2020 - The WHO declares the novel coronavirus outbreak to be a pandemic.\nGlobally, the total number of coronavirus cases surpasses 1 million, according to Johns Hopkins University's tally."}, {"url": "https://www.3newsnow.com/disturbance-at-westroads-mall", "title": "Disturbance at Westroads Mall", "authors": [], "date": "2019-12-27", "keywords": ["mall", "westroads", "street", "shot", "male", "bm", "released", "say", "19yearold", "disturbance", "old", "yr"], "summary": "They say a 15-year-old female was speaking to a 19-year-old male when he \"started talking smack.\"\nThen, the girl's brother ending up fighting the 19-year-old male.\nDuring the chaos, the girl said the 19-year-old male punched her in the mouth.\nIn addition, police say other teens at the scene will face charges:16 yr old B/M street released for Disorderly Conduct and 3rd Degree Assault13 yr old B/M street released for Failure to Disperse16 yr old B/M street released for Disorderly Conduct16 yr old B/M street released for Request to LeavePrevious Story:Video shot inside the Westroads Mall Thursday evening shows a large disturbance and mall security guards and police attempting to stop fights and get people out of the mall.\nOther videos on YouTube show police attempting to break up fights in the mall parking lot."}, {"url": "https://www.3newsnow.com/news/local-news/omaha-police-investigate-friday-night-homicide", "title": "Omaha Police investigate Friday night homicide", "authors": [], "date": "2019-12-14", "keywords": ["took", "suffering", "omaha", "stoppers", "shootingupon", "second", "night", "homicide", "woundsthirtyyearold", "investigate", "victim", "toles", "st"], "summary": "OMAHA, Neb.\n(KMTV) — Omaha Police are investigating a homicide that took place at 18th and Emmet St on Friday night.\nUpon arrival, police located a male victim suffering from gunshot wounds.\nA second victim, 23-year-old Kameron Jones, was injured by gunfire.\nAnyone with information is asked to contact Omaha Crime Stoppers at 444-STOP."}, {"url": "https://www.3newsnow.com/news/local-news/omaha-police-officer-shot-near-24th-evans", "title": "OPD Chief: NY Eve Shooting justified", "authors": [], "date": "2020-01-01", "keywords": ["wells", "officer", "shooting", "justified", "apartment", "ny", "chief", "door", "released", "eve", "opd", "gun", "officers", "omaha", "hudson", "witness"], "summary": "(KMTV) — Update 1/4/2020The Omaha police department on Saturday interviewed the 3 officers involved in the New Year's Eve shooting incident that left the suspect dead and a OPD officer shot and injured.\nIn the statement released by OPD on Saturday, Police Chief Todd Schmaderer is quoted as saying,\"My deepest condolences to the family of Ms. Dana Wells.\nAfter no one opened the door, officers kicked in the door and then reported on their radios that shots were fired and they moved away from the door.\nAnother witness heard and saw HUDSON and WELLS arguing in the hallway, during which HUDSON placed WELLS into a chokehold.\nThe witness tried to calm HUDSON when HUDSON pointed the gun at the witness and then at WELLS."}, {"url": "https://www.ccjdigital.com/tank-carrier-liquid-freight-growth-coronavirus/", "title": "Tank carrier using 'liquidity' advantage during COVID crisis", "authors": ["Commercial Carrier Journal"], "date": "2020-04-15", "keywords": ["using", "crisis", "tank", "drivers", "advantage", "pay", "liquidity", "covid", "trucking", "covid19", "carriers", "wash", "carrier", "liquid", "schmidt", "driver"], "summary": "As a tank carrier, Liquid Trucking is “powering through” the COVID-19 crisis, said General Manager Josh Schmidt.\nAs freight in this sector declined, Liquid Trucking shifted capacity to food-grade products and chemicals.\nSo far, disruption from the COVID-19 crisis has been minimal compared to a larger crisis that happened one year ago.\nDuring the COVID-19 crisis, driver time has become more valuable as carriers have been seeing detention times increase.\nDuring the COVID-19 crisis, management has seen an influx of changes to locations, such as posters, banners and handmade signs with delivery instructions, noted Eisenmann."}]