[{"url": "https://www.rgj.com/story/news/money/business/2020/03/23/new-unemployment-claims-triple-nevada-coronavirus-covid-19-work-closures/2900211001/", "title": "Nevada jobless claims triple from COVID-19 closures, largest weekly jump in decades", "authors": ["Jason Hidalgo", "Published P.M. Pt March"], "date": "2020-03-23", "keywords": ["closures", "numbers", "jump", "weekly", "state", "ending", "unemployment", "week", "triple", "claims", "insurance", "nevada", "jobless", "decades", "reno", "covid19", "largest"], "summary": "Nevada just saw its largest percentage jump in weekly unemployment claims in more than three decades as the impact of COVID-19 starts to make its presence felt across a wide range of industries.\nInitial weekly claims for unemployment insurance nearly tripled to 6,356 during the second week of March, according to the Nevada Department of Employment, Training and Rehabilitation.\nThe sharp increase in the weekly numbers was seen during the week ending on March 14.\nContinuing or existing unemployment insurance claims saw a slight decrease during the same week ending March 14 at 19,475.\nEmployer contribution and wage reports are used to help establish benefit claims made by employees who are filing for unemployment insurance."}, {"url": "https://lasvegassun.com/news/2020/mar/25/a-timeline-of-the-coronavirus-crisis-in-las-vegas/", "title": "A timeline of the coronavirus crisis in Las Vegas", "authors": ["Unlv Photo Services"], "date": "2020-03-25", "keywords": ["county", "district", "sisolak", "steve", "timeline", "clark", "announces", "las", "vegas", "coronavirus", "nevada", "crisis"], "summary": "Steve Sisolak announces that the federal government approved testing for the virus at two commercial labs, joining two public labs.\n• March 10: MGM Resorts International announces that it is temporarily closing buffets at its Las Vegas Strip properties.\nIt’s a major blow to Las Vegas, which counts the opening weekend of the men’s tournament as one of its busiest of the year.\n• March 14: Cirque du Soleil, creator of many of the most popular shows in Las Vegas, says it is temporarily suspending its productions in Las Vegas and around the world.\n• March 16: The Roman Catholic Diocese of Las Vegas cancels Mass at least through the April 5 weekend, a week before Easter."}, {"url": "https://www.mwcconnection.com/2020/4/16/21222996/nevada-basketball-2019-20-season-review-guards", "title": "Nevada basketball 2019-20 season review: Guards", "authors": ["Apr"], "date": "2020-04-16", "keywords": ["rebounds", "guard", "games", "game", "basketball", "conference", "201920", "assists", "harris", "west", "guards", "season", "review", "nevada", "points"], "summary": "Each Thursday for the next few weeks, we will be reviewing an aspect from this 2019-20 season for the Nevada Wolf Pack.\nNotable players:Gabe Bansuelo:Bansuelo, a local walk-on, appeared in just nine games in his freshman season with Nevada.\nHarris dominated in conference play, leading the Mountain West at 25.3 points per game in 18 conference games.\nCambridge sat out last season due to NCAA’s transfer rules, but will have two years of eligibility remaining beginning next season.\nCambridge tallied 17 games with 20-plus points, 12 games with 25-plus points and five games with 30-plus points in his collegiate — yes, he can definitely score."}, {"url": "https://247wallst.com/special-report/2020/04/06/the-places-a-covid-19-recession-will-likely-hit-hardest/", "title": "The Places a COVID-19 Recession Will Likely Hit Hardest – 24/7 Wall St.", "authors": [], "date": "2020-04-06", "keywords": ["st", "hit", "recession", "247", "industries", "economic", "places", "unemployment", "coronavirus", "likely", "hardest", "wall", "covid19"], "summary": "The Places a COVID-19 Recession Will Likely Hit Hardest Samuel Stebbins, Michael B. SauterThere have been over 350,000 confirmed cases of COVID-19 and more than 10,000 related deaths in the United States to date.\nTo identify the places a COVID-19 recession will likely hit hardest, 24/7 Wall St. created an index comprising three measures: employment in highly-exposed industries, COVID-19 infection rates, and population density.\nThe bill, which will provide financial relief for families and businesses, has also calmed some investors after a historic sell-off on Wall Street.\nStill, the economic devastation wrought by the efforts to contain the spread of the coronavirus will likely be felt long after the pandemic ends.\nClick here to see the places a COVID-19 recession will likely hit hardestClick here to read our methodology"}, {"url": "https://www.usatoday.com/story/money/2020/04/09/coronavirus-30-places-where-recession-could-hit-hardest/2964955001/", "title": "New York, Gilpin are among the places a COVID-19 recession will likely hit hardest", "authors": ["Samuel Stebbins", "Michael B. Sauter", "Published A.M. Et April"], "date": "2020-04-09", "keywords": ["county", "workforce", "population", "2020", "cases", "york", "hit", "recession", "industries", "metropolitan", "places", "rate", "likely", "hardest", "gilpin", "area", "covid19"], "summary": "To identify the places a COVID-19 recession will likely hit hardest, 24/7 Wall St. created an index comprising three measures: employment in highly-exposed industries, COVID-19 infection rates, and population density.\nAs of the end of March, there have been 45 confirmed cases of COVID-19 in Harrison County and one death.\nWe only considered counties and county equivalents that fall within a metropolitan area because metro areas are typically hubs of economic activity.\nData on COVID-19 cases and deaths by county and state came from the New York Times and are current as of March 31, 2020.\nCOVID-19 cases and death toll were adjusted for population using five-year estimates from the U.S. Census Bureau’s 2018 American Community Survey."}, {"url": "https://www.rgj.com/story/news/2020/01/01/reno-welcomes-first-baby-2020/2790369001/", "title": "Reno welcomes first baby of 2020, a healthy girl", "authors": ["Benjamin Spillman", "Published A.M. Pt Jan."], "date": "2020-01-01", "keywords": ["2020", "marys", "st", "welcomes", "girl", "judith", "pfaff", "renosparks", "regional", "healthy", "medical", "born", "reno", "baby"], "summary": "CLOSEJudith Pfaff, born to Kathleen and Joel Pfaff at 2:33 a.m. on Jan. 1, 2020, is the first Reno-Sparks baby of the year.\n(Photo: St. Mary's Regional Medical Center)Reno's first baby of 2020 is healthy and ready to head home with her family.\nThe early morning arrival makes Judith the first baby born in 2020 in the Reno-Sparks area.\nKathleen and Joel Pfaff with baby Judith, who is the first baby born in the Reno-Sparks area in 2020.\n(Photo: St. Mary's Regional Medical Center)Read or Share this story: https://www.rgj.com/story/news/2020/01/01/reno-welcomes-first-baby-2020/2790369001/"}, {"url": "https://www.nevadabusiness.com/2020/02/rsar-releases-january-2020-existing-home-sales-report/", "title": "RSAR Releases January 2020 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2020-02-11", "keywords": ["homes", "sales", "existing", "2020", "report", "singlefamily", "renosparks", "median", "releases", "rsar", "2019", "price", "increase"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its January 2020 report on existing home sales in Reno/Sparks and Fernley, including median sales price and number of home sales in the region.\nDuring January 2020, the report showed Reno/Sparks had 377 sales of existing single-family homes; with a 16 percent increase from last year and a 27 percent decrease from one month ago.\nThe median sales price of an existing condominium/townhome in Reno/Sparks in January 2020 was $246,000; an increase of 33 percent from a year ago.\nThe existing condominium/townhome median sales price for January 2020 in Reno was $255,750; a 46 percent increase from last year.\nThe existing condominium/townhome median sales price for January 2020 in Sparks was $215,000; a 12 percent increase from last year."}, {"url": "https://www.rgj.com/story/news/2020/03/06/coronavirus-update-vegas-reno-nevada-timeline/4975498002/", "title": "Coronavirus in Nevada: Timeline of virus' presence in Reno, statewide", "authors": ["Nate Chute", "Published P.M. Pt March"], "date": "2020-03-06", "keywords": ["county", "washoe", "presence", "cases", "timeline", "state", "health", "statewide", "virus", "coronavirus", "nevada", "reported", "close", "reno"], "summary": "For a timeline of known coronavirus cases in Nevada, click here.\nMarch 5: Washoe County man first in county to test positive for coronavirusAccording to the Washoe County Health District, the man was linked to the Grand Princess cruise ship outbreak.\nMarch 7: Washoe County Emergency response elevated to Level 2The Washoe County Health District addressed the virus at a press conference, confirming the single case in the county.\nThe University of Nevada, Reno announced it will move to online classes on March 22, the Monday after spring break.\nMarch 16: First Nevada coronavirus deathThe first death from the virus in the state was reported, according to the Southern Nevada Health District."}, {"url": "https://www.rgj.com/story/news/local/mason-valley/2020/04/13/funeral-services-limited-social-distancing/2983913001/", "title": "No hugs, no handshakes: Lyon County's sole funeral home alters practices amid pandemic", "authors": ["Amy Alonzo", "Mason Valley News", "Published P.M. Pt April"], "date": "2020-04-13", "keywords": ["cant", "alters", "service", "kimber", "crabtree", "services", "la", "lyon", "practices", "funeral", "countys", "sole", "pandemic", "handshakes", "gary", "family", "hugs", "amid", "virus"], "summary": "CLOSEThe Crabtree family watched the burial of Gary Crabtree from afar.\n(Photo: Courtesy Kimber LA Crabtree)Veteran Gary Crabtree of Smith Valley died Jan. 25.\nWe had to watch from afar,” said Kimber LA Crabtree, Gary’s wife, who likened the funeral to sitting in bleachers and watching a football game.\n(Photo: Courtesy Kimber LA Crabtree)Freitas Rupracht handles an average of 10 deaths per month.\n(Photo: Courtesy Kimber LA Crabtree)“Only five of us were allowed."}, {"url": "https://www.rgj.com/story/news/2020/01/19/thousands-pack-reno-fourth-womens-march/4519213002/", "title": "Women's March in Reno brings a mix of empowerment and Anti-Trump sentiments", "authors": ["Marcella Corona", "Published P.M. Pt Jan."], "date": "2020-01-19", "keywords": ["brings", "women", "change", "local", "rose", "empowerment", "womens", "mix", "trump", "antitrump", "marched", "burril", "nevada", "sentiments", "reno"], "summary": "On Saturday, thousands descended upon downtown Reno for the fourth annual Women’s March.\nA call to actionThis year was the first time participants met for a community gathering and action-oriented event following the march.\n“Two years ago, we stood on this stage at the Women’s March in Reno, and we put forth a call to action,” Benitez-Thompson told a crowd on Saturday.\n“And you brought down the house.”Images of the Women's March taken on Saturday, Jan. 18, 2020.\n“That involves protest, petitions, and activists who show up constantly.”Her biggest concern is sparking local change."}, {"url": "https://www.rgj.com/story/news/crime/2020/01/09/james-upton-reno-nevada-teen-shooting-prison/2850947001/", "title": "Former Nevada Guard captain gets 2-6 years in prison for shooting teen in 2017", "authors": ["Marcella Corona", "Published A.M. Pt Jan."], "date": "2020-01-09", "keywords": ["teen", "served", "gets", "washoe", "sentenced", "26", "captain", "2017", "neighbor", "juveniles", "shooting", "nevada", "prison", "guard", "upton", "twice"], "summary": "CLOSEJames Upton, 42, was sentenced on Monday, Jan. 6, 2020, to two to six years in prison for shooting a teenager twice in the leg in 2017.\n(Photo: Provided by the Washoe County Sheriff's Office)A former captain in the Nevada Air National Guard was sentenced to two to six years in prison for shooting an unarmed teenager twice in the leg near Huffaker Park in 2017.\nHe was sentenced on Monday by Chief Judge Scott Freeman, who credited Upton 78 days for time served, according to court records.\nUpton’s conviction and sentence stemmed from a shooting reported the afternoon of Sept. 24, 2017, in the 7500 block of Offenhauser Drive.\nThe neighbor parked his vehicle in front of the car with the juveniles, while Upton stopped behind it to block it in."}, {"url": "https://www.rgj.com/story/news/2020/01/31/reno-jreno-just-experienced-third-warmest-january-on-recust-experienced-third-warmest-january-record/4601363002/", "title": "Reno sees third-warmest January on record, Tahoe snowpack diminishing", "authors": ["Benjamin Spillman", "Published A.M. Pt Jan."], "date": "2020-01-31", "keywords": ["california", "thirdwarmest", "warm", "snow", "storms", "tahoe", "average", "sees", "snowpack", "diminishing", "temperatures", "record", "nevada", "reno", "normal"], "summary": "And the hotter-than-normal temperatures are depleting the Sierra Nevada snowpack.\nThe average temperature in Reno was 40.4 degrees Fahrenheit, making it the third-warmest January on record in the Biggest Little City.\npic.twitter.com/VJfhZSpTwE — Dan McEvoy (@hydromet_man) January 29, 2020\"We have quickly fallen from above normal to below normal snowpack in the area,\" said Dan McEvoy, a climatologist at Desert Research Institute in Reno.\nThe high temperature in Reno could reach the upper 60s on Saturday and warm temperatures are expected throughout California and Nevada.\n\"The warm temperatures, obviously, are not good for the existing snowpack,\" McEvoy said."}, {"url": "https://www.rgj.com/story/news/2020/01/30/reno-sparks-nv-homeless-population/2858743001/", "title": "'Needs higher than ever': Homeless count expected to surpass 2019", "authors": ["Marcella Corona", "Published P.M. Pt Jan."], "date": "2020-01-30", "keywords": ["streets", "surpass", "saidthe", "expected", "volunteers", "higher", "annual", "needs", "2019", "humbert", "truckee", "total", "count", "reno", "homeless"], "summary": "CLOSE Reno undertakes the annual Point-in-Time count of homeless people early Thursday morning, Jan. 30, 2020.\nA group of government officials and volunteers combed the streets of Reno in the annual Point-in-Time count of homeless people early Thursday.\nWhile the final total has not been released, the number is expected to be higher than last year's, said Reno spokesman Jon Humbert.\nThe annual count includes both sheltered and unsheltered homeless residents.\nLast year, the count reached a total of 1,256 people, according to the Reno Area Alliance for the Homeless."}, {"url": "https://www.nevadabusiness.com/2020/01/nevada-business-indicators-january-2020/", "title": "Business Indicators January 2020", "authors": ["Stephen Miller"], "date": "2020-01-01", "keywords": ["business", "sales", "2020", "jobs", "indicators", "yearoveryear", "economic", "investment", "real", "spending", "signals", "nevada", "seasonally"], "summary": "The upward revisions reflected less negative business investment, including inventory investment and more positive consumer spending than previously thought, which were partly offset by smaller state and local government spending than initially reported.\nIn addition, residential investment, inventory investment and government spending also contributed positively to the real GDP expansion, while continued weaker business investment and net exports contributed negatively to the economic expansion.\nSeasonally adjusted employment gained 700 jobs in October, showing its slowest yearly growth of 1.3 percent in nearly eight years.\nSeptember taxable sales also climbed robustly by 7.4 percent year-over-year, while gasoline sales (in gallons) remained flat over the same period.\nWashoe County displayed favorable economic signals."}, {"url": "https://thisisreno.com/2020/01/community-invited-to-30th-annual-reno-mlk-dinner/", "title": "Community invited to 32nd annual Reno MLK dinner (updated)", "authors": ["Don Dike Anukam"], "date": "2020-01-17", "keywords": ["event", "speaker", "nevada", "general", "ondra", "nnbcas", "invited", "annual", "32nd", "dinner", "berry", "president", "community", "updated", "keynote", "mlk", "reno"], "summary": "The public is invited to attend, joining community and civic leaders at the event.\nA silent auction kicks off the evening at 5 p.m., followed by the dinner featuring keynote speaker Adjutant General Ondra Berry of the Nevada Air National Guard.\nGen. Berry is a local favorite selected because of his ability to “challenge us to be the best we can for our community and ourselves,” according to event organizer and NNBCAS president Rob Jackson.\nFor more information visit https://www.nnbcas.org/events-programs/mlk-celebration-dinner/Correction: The dinner’s original keynote speaker Dr. Jamie R. Riley had to be rescheduled.\nThe new keynote speaker is Adjutant General Ondra Berry."}, {"url": "https://www.rgj.com/story/news/money/business/2019/12/23/reno-named-one-15-hottest-new-places-live-next-decade/2680672001/", "title": "Housing: Reno named one of the 15 'hottest' real estate markets for the next decade", "authors": ["Jason Hidalgo", "Published A.M. Pt Dec."], "date": "2019-12-23", "keywords": ["market", "markets", "estate", "real", "hottest", "renos", "city", "housing", "list", "15", "named", "area", "reno", "decade"], "summary": "Reno Gazette JournalReno’s hot housing market is expected to continue sizzling in the coming decade, according to a new real estate ranking.\nThe ranking is based on feedback by real estate agents from across the U.S. who were asked to predict the most popular real estate markets for the next 10 years.\n“Reno will surely be the hottest real estate market in the US for 2020 and beyond.”Inside Reno's housing crisis: Why aren’t more affordable homes being built?\nThis has fueled concerns that Reno’s housing market would start seeing the same affordability issues plaguing California markets such as the Bay Area if housing supply isn’t addressed.\nFor more details on the rankings, here is Business Insider’s list of the top 15 hottest real estate markets in the next decade."}, {"url": "https://www.rgj.com/story/news/money/business/2020/02/24/franchise-business-opportunities-reno-nevada-market/4832652002/", "title": "Report: More franchise stores and chains continue to eye Nevada market, including Reno", "authors": ["Jason Hidalgo", "Published A.M. Pt Feb."], "date": "2020-02-24", "keywords": ["stores", "market", "sector", "report", "growth", "continue", "states", "including", "recession", "chains", "haller", "franchise", "eye", "nevada", "reno", "services"], "summary": "In 2017, Nevada ranked third in the country with 2.8% franchise growth, according to the IFA.\nEven as other states have leapfrogged Nevada, however, it continues to be a top target among franchisees.\nHere are the 18 largest restaurant chains nowhere near Reno-SparksMeanwhile, the number of franchise businesses in 2020 is expected to top 785,000.\n“When people are investing these days and really looking into the franchise sector, the service business is on fire right now,” McQuillan said.\n“A recession would be a concern as it certainly would have an impact on franchise lending … and consumer spending,” Haller said."}, {"url": "https://www.krtv.com/news/great-falls-news/body-of-amy-harding-recovered-from-river", "title": "Body of Amy Harding recovered from river", "authors": [], "date": "2020-04-09", "keywords": ["amy", "family", "slaughter", "sheriffs", "think", "harding", "volunteers", "great", "recovered", "community", "river", "search", "body"], "summary": "GREAT FALLS — The search for Amy Harding-Permann has come to an end, as authorities confirmed that her body was found on Wednesday evening.\nA homeowner found her body along the shoreline and reported it to the Sheriff's Office; deputies found the body just before 5:30 p.m. on Wednesday.\nDeputies also found a hole in the ice the next day that led them to focus their search efforts on the river.\nAmy's family shared the following message with KRTV:It is with great remorse that we confirm that the body of our beloved daughter, Amy Harding-Permann has been recovered.\nJANUARY 27: Great Falls woman reported missingJANUARY 28: Volunteers needed to help search for AmyJANUARY 29: Volunteers help search for Amy HardingJANUARY 30: \"Multiple agencies\" working to find Amy HardingJANUARY 31: Sheriff: the search for Amy Harding continuesFEBRUARY 10: Search for Amy Harding enters third week"}, {"url": "https://thisisreno.com/2020/01/7-events-to-check-out-this-week-in-reno/", "title": "7 events to check out this week in Reno", "authors": [], "date": "2020-01-07", "keywords": ["dance", "attendees", "comedy", "ages", "events", "week", "check", "summit", "panda", "reno", "details"], "summary": "There is plenty to do in the greater Reno area this week.\nHere is a roundup of some events to check out.\nDetails: https://thisisreno.com/calendar/the-play-that-goes-wrong/Dead Panda Comedy Night at Reno Improv: Luke Westberg of Dead Panda Comedy hosts this monthly show.\nDetails: https://thisisreno.com/calendar/nia-youth-summit-nevada-interfaith-association/For more details or other events, check out our events page.\nIf you are hosting an event, submit events to our events page."}, {"url": "https://thisisreno.com/2020/01/edawn-to-unveil-fresh-look-at-regions-economy/", "title": "EDAWN to unveil fresh look at region’s economy Jan. 23", "authors": ["John Seelmeyer"], "date": "2020-01-16", "keywords": ["event", "unveil", "edawn", "population", "state", "study", "23", "fresh", "economic", "look", "region", "pace", "jan", "economy", "regions"], "summary": "Leaders of the region’s headlong rush into its economic future will stop to take a breath and share their outlook for the region’s economy at a major event on Thursday.\nThose new jobs, the study predicts, will result in additional population of more than 54,000.\nMike KazmierskiKazmierski also is expected to spotlight some of the challenges faced by the region’s economy — including, almost certainly, the need to address a housing crisis that worsens with every new family that comes to town to fill a job in the rapidly growing economy.\nSeveral people will be recognized for their work in support of EDAWN and economic development in the region.\nThe noontime event, which sold out last year, will be at the Tuscany Ballroom of the Peppermill Resort Spa Casino."}, {"url": "https://www.rgj.com/story/news/crime/2020/01/16/washoe-medical-examiner-identifies-teen-killed-south-reno-shooting/4491153002/", "title": "Teenager shot, killed in south Reno is identified as Sparks resident", "authors": ["Marcella Corona", "Published A.M. Pt Jan."], "date": "2020-01-16", "keywords": ["county", "victims", "sparks", "washoe", "shot", "resident", "teenager", "lopez", "medical", "killed", "south", "tip", "street", "identified", "reno", "murder"], "summary": "USA TODAYThe Washoe County Medical Examiner’s Office identified the teenager who was shot and killed over the weekend in south Reno.\nJonathan Lopez Lopez, 17, of Sparks, died shortly after arriving at Renown Regional Medical Center, according to a news release from the medical examiner’s office.\nThe shooting was reported at 2:21 a.m. Sunday, Jan. 12 in the 3600 block of South Virginia Street.\nWill Mendoza-Paniagua, 18, was booked on Monday, Jan. 13, 2020, into the Washoe County jail on a charge of open murder and attempted murder, both with a deadly weapon.\nOne of the victims, identified as Lopez Lopez, died at the hospital."}, {"url": "https://www.ktnv.com/news/new-nevada-laws-set-to-take-effect-in-2020", "title": "New Nevada laws set to take effect in 2020", "authors": [], "date": "2019-12-29", "keywords": ["family", "effect", "2020", "set", "state", "law", "gun", "provide", "private", "required", "laws", "nevada", "employees", "vaping", "speed"], "summary": "LAS VEGAS (KTNV) — With the new year coming in just days, some changes and additions to state laws regarding guns, marijuana and vaping will soon take effect.\nThis requires almost all private gun sales be run through a state background check, by a federally licensed firearm dealer.\nPAID LEAVEPrivate sector employees with 50 or more employees are now required to provide their employees with up to 40 hours of paid leave per benefit year.\nPRE-EXISTING CONDITIONSNevada must fully incorporate the federal Affordable Care Act's protections for patients with pre-existing conditions into state law and help consumers navigate and resolve problems with their insurers.\nHOUSING ASSISTANCEMedicaid will provide more money to help vulnerable populations such as seniors and the disabled to obtain affordable housing."}, {"url": "https://finance.yahoo.com/news/nevada-exploration-commences-2020-drilling-134510547.html", "title": "Nevada Exploration Commences 2020 Drilling Program at South Grass Valley Carlin-Type Gold Project", "authors": [], "date": "2020-01-07", "keywords": ["valley", "gold", "commences", "drilling", "nge", "2020", "team", "project", "south", "nevada", "company", "program", "exploration", "grass"], "summary": "RENO, Nev., Jan. 07, 2020 (GLOBE NEWSWIRE) -- Nevada Exploration Inc. (“NGE” or the “Company”) (TSX-V: NGE; OTCQB: NVDEF) is pleased to announce that it has commenced its 2020 drilling program at its South Grass Valley Project (the “Project”).\nThe Company expects to complete the drilling program by way of two cycles through the four target areas.\nDiscussing the drilling program, Wade Hodges, CEO: “We are very pleased to keep the momentum building at the Project.\nNGE’s team has spent the last decade integrating the use of hydrogeochemistry with conventional exploration tools to develop a Nevada-specific regional-scale geochemistry exploration program.\nWith new proprietary technology, NGE has completed the world’s largest groundwater sampling program for gold exploration, collecting approximately 6,000 samples to evaluate Nevada’s covered basins for new gold exploration targets."}, {"url": "https://www.rgj.com/story/news/politics/2020/01/27/trump-buttigieg-nevada-campaigns-feud-over-reno-parking-spots/4591732002/", "title": "In Reno, Trump, Buttigieg campaign staffers go toe-to-toe over … office parking spots", "authors": ["James Dehaven", "Published P.M. Pt Jan."], "date": "2020-01-27", "keywords": ["campaign", "pete", "buttigieg", "space", "parking", "democratic", "toetotoe", "sticker", "presidential", "office", "trump", "nevada", "spots", "reno", "staffers"], "summary": "CLOSE Democratic presidential candidate Pete Buttigieg was mayor of South Bend, Indiana, from 2012-2019.\nThen, on Friday, a Buttigieg volunteer found an unsigned note printed on Trump campaign letterhead tacked to her car’s windshield.\nBuy Photo A photo of a Trump campaign letter, and bumper sticker, left on a Buttigieg campaign volunteer's windshield on Thursday night.\n(Photo: James DeHaven/RGJ)The Reno Gazette Journal could find no signage designating assigned parking spaces in or around either campaign office.\n“Clearly, the Trump campaign knows that, and is trying to intimidate our volunteers."}, {"url": "https://www.rgj.com/story/news/2020/01/02/reno-midtown-virginia-street-reconstruction-project-update-january/2789770001/", "title": "January 2020 Virginia Street reconstruction update: Midtown Reno project moves north", "authors": ["Benjamin Spillman", "Published A.M. Pt Jan."], "date": "2020-01-02", "keywords": ["2020", "sidewalks", "nevada", "moves", "north", "project", "reconstruction", "midtown", "update", "street", "construction", "reno", "virginia", "work"], "summary": "CLOSE Midtown's main transportation corridor between Plumb Lane and Liberty Street is slated to get a refresh from RTC's Virginia Street Project.\nReno Gazette JournalThe reconstruction of Virginia Street in Reno's Midtown will move north in the New Year.\nThe remaining schedule is as follows:Winter 2019 through spring 2020: Work on Virginia Street sidewalks and paving from Mt.\nMORE: Midtown Reno construction: Virginia Street Project hits milestoneCLOSE Here's a timeline of road closures and alternate routes during the Virginia Street Project construction.\nThe event is Friday, January 3, any time from 10:30 a.m. to 1:30 p.m. at Truckee Bagel, 538 S. Virginia Street, Reno."}, {"url": "https://www.rgj.com/story/news/crime/2020/01/18/reno-police-search-witnesses-deadly-teens-shooting/4513619002/", "title": "Reno police search for witnesses to the fatal shooting of Sparks teenager", "authors": ["Marcella Corona", "Published P.M. Pt Jan."], "date": "2020-01-18", "keywords": ["fatal", "sparks", "victims", "witness", "information", "open", "teenager", "lopez", "tip", "shooting", "witnesses", "search", "reno", "murder"], "summary": "CLOSEWill Mendoza-Paniagua, 18, was booked on Monday, Jan. 13, 2020, into the Washoe County jail on a charge of open murder and attempted murder, both with a deadly weapon.\n(Photo: Provided by the Reno Police Department)Detectives are searching for witnesses who may have information about the events leading to the fatal shooting of a teenage boy in Reno.\nAlthough investigators arrested a suspect in the shooting, 18-year-old Will Mendoza-Paniagua, they are still looking to talk to witnesses, according to a news release from the Reno Police Department.\nMendoza-Paniagua faces a charge of open murder for the death of 17-year-old Sparks resident Jonathan Lopez Lopez.\nBoth victims were taken to a hospital, and one of the victims — Lopez Lopez — died there."}, {"url": "https://www.rgj.com/story/news/money/business/2020/01/20/nevada-jobconnect-hold-job-fair-veterans-reno-va-jan-24/4523021002/", "title": "Nevada JobConnect to hold job fair for veterans at Reno VA on Friday, Jan. 24", "authors": ["Jason Hidalgo", "Published A.M. Pt Jan."], "date": "2020-01-20", "keywords": ["va", "event", "nevada", "fair", "technology", "veterans", "24", "job", "seekers", "jobconnect", "jan", "reno", "hold", "work"], "summary": "CLOSEBuy Photo The Reno Veterans Administration Medical Center on Kirman St. (Photo: Tim Dunn/RGJ )Veterans who are looking for work can take part in an upcoming job fair in Reno.\nNevada JobConnect will hold the event at the Reno VA Medical Center from 10 a.m. to 2 p.m. on Friday, Jan. 24.\nThe positions available at the job fair include full-time, permanent work that starts at $15 an hour and covers a wide range of industries.\nThey include:Aerion SupersonicAllied UniversalAZZ GalvanizingCintasHamilton CompanyKeolisMSC Industrial Supply Co.Pacific CheesePanasonicSierra Army DepotThe RowThe State of Nevada, Department of Administration-Veterans ProgramTransport RefrigerationWalmart Distribution CenterUS Census BureauEmployers who want to take part can reach out to Northern Nevada JobConnect Job Bank at 775-284-9660.\nJob seekers who want more information about the event can contact their local Northern Nevada JobConnect center."}, {"url": "https://www.rgj.com/story/news/2020/02/10/murdered-navy-vet-fought-all-nevada-veterans/4695809002/", "title": "Reno-Sparks remembers slain Navy vet: She was 'a fighter' for all veterans", "authors": ["Marcella Corona", "Published A.M. Pt Feb."], "date": "2020-02-10", "keywords": ["support", "family", "vigil", "veterans", "jana", "renosparks", "slippers", "simons", "vet", "slain", "holliday", "fighter", "mcelhaney", "navy", "remembers", "veteran"], "summary": "CLOSEBuy Photo A photo of 54-year-old U.S. Navy veteran Jana McElhaney is displayed at her vigil on Feb. 6, 2020.\nBuy Photo Wendy Simons, 69, speaks at a vigil held Feb. 6, 2020, for slain U.S. Navy veteran, Jana McElhaney, 54, who died of head injuries from a reported attack.\n(Photo: Marcella Corona/RGJ)“They were really gorgeous, nice slippers,” Simons said.\n“She was actually going to the (U.S. Department of Veterans Affairs) herself and picking up these flags for these veterans,” he said.\n“My family is very grateful for that.”Buy Photo Attendees gather for a vigil for slain U.S. Navy veteran, Jana McElhaney, 54, on Feb. 6, 2020."}, {"url": "https://www.rgj.com/story/news/2020/03/12/coronavirus-updates-latest-covid-19-reno-sparks-las-vegas/5031666002/", "title": "Coronavirus updates: Latest on COVID-19 in Reno-Sparks Las Vegas", "authors": ["Sam Gross", "Ed Komenda", "Jenny Kane", "Siobhan Mcandrew", "Published A.M. Pt March"], "date": "2020-03-12", "keywords": ["county", "cases", "state", "renosparks", "updates", "latest", "vegas", "las", "health", "city", "coronavirus", "emergency", "tent", "nevada", "patients", "covid19", "respiratory"], "summary": "-- Anjeanette DamonCarson City-area reports first presumptive positive caseA person has tested presumptive positive for COVID-19 in the Carson City area, the Carson City Health and Human Services said Thursday.\nDemocrats cancel upcoming county, state conventions in NevadaThe Nevada State Democratic Party announced it is canceling its county and state conventions in a statement sent Thursday afternoon.\n3 new presumptive positive cases in Clark County —LAS VEGAS – The Southern Nevada Health District has received reports of three new \"presumptive positive cases\" in Clark County.\nThursday's update brings the total number of cases Nevada to 10: Two in Washoe County and eight in Clark County.\nShe had had been exhibiting symptoms of COVID-19 during her travels to Las Vegas, according to the Southern Nevada Health District."}, {"url": "https://www.rgj.com/story/news/money/business/2020/02/03/reno-freight-house-project-demolition-plans-aces-baseball/4626647002/", "title": "Reno Aces boss shoots down talk of Freight House building demolition as ‘rumor-mongering’", "authors": ["Jason Hidalgo", "Published A.M. Pt Feb."], "date": "2020-02-03", "keywords": ["downtown", "aces", "edelstein", "house", "built", "building", "talk", "weve", "freight", "shoots", "boss", "demolition", "according", "construction", "reno", "rumormongering"], "summary": "Buy Photo The Freight House building in downtown Reno on Jan. 30, 2020.\n(Story continues below)The location of the old Freight House building in downtown Reno.\nThe same equation will be in play when deciding what to do with the Freight House building.\nBuy Photo The Freight House building in downtown Reno on Jan. 30, 2020.\nThe good news is that the momentum for development remains strong in downtown Reno, according to Edelstein."}, {"url": "https://www.rgj.com/story/news/2020/01/03/nevada-guard-deploys-soldiers-year-mission-eastern-europe-poland-baltic/2809845001/", "title": "Nevada Guard to deploy 70 soldiers to Poland on a year-long mission", "authors": ["Marcella Corona", "Published P.M. Pt Jan."], "date": "2020-01-03", "keywords": ["soldiers", "logistical", "support", "yearlong", "national", "deploy", "reese", "provide", "mission", "help", "70", "poland", "nevada", "guard"], "summary": "CLOSEThe Nevada Army National Guard is sending about 70 soldiers on a year-long mission to provide support to overseas troops in eastern Europe.\nThe Guard’s 757th Combat Sustainment Support Battalion will deploy its soldiers on Sunday to Poland and nearby Baltic countries.\nThe goal is to provide logistical support to the U.S. and other ally nations, according to Lt. Col. David Evans.\n“That’s probably helped in preparation for the kids, as well.”Her husband, Chad Reese, also serves in the Nevada Army National Guard as a construction engineer technician.\n“We can move personnel and equipment from one location to another.”Related: Nevada Guard soldier receives OK to sport Norse pagan beardThe soldiers have been preparing for the mission for 18 months."}, {"url": "https://www.reviewjournal.com/local/local-nevada/178-coronavirus-cases-in-nevada-nursing-homes-prisons-2005745/", "title": "178 coronavirus cases in Nevada nursing homes, prisons", "authors": ["Bill Dentzer", "Michael Scott Davidson Las Vegas Review-Journal"], "date": "2020-04-13", "keywords": ["homes", "facilities", "2020", "cases", "state", "nursing", "health", "deaths", "vegas", "coronavirus", "residents", "nevada", "staff", "178", "prisons", "covid19"], "summary": "Exterior of the Horizon Health and Rehab which has 38 coronavirus cases involving 14 residents and 24 staff on Monday, April 13, 2020 in Las Vegas.\nBaskow/Las Vegas Review-Journal) @Left_Eye_ImagesNevada has reported 178 COVID-19 cases and 18 deaths from the disease occurring in nursing homes, assisted living centers and other institutional settings, including prisons, according to a new tracking tool unveiled Monday.\nStatewide, Nevada on Monday had recorded more than 3,000 COVID-19 cases and 120 deaths.\nThe U.S. government rates thousands of Medicare- and Medicaid-certified nursing homes nationwide and provides searchable inspection reports and a grading system.\nGrades for the 17 such facilities in Nevada with COVID-19 outbreaks tracked in the new state data range from best to worst."}, {"url": "https://www.rgj.com/story/news/2020/03/27/nevada-coronavirus-updates-donald-trump-covid-19/2923155001/", "title": "Coronavirus: 86 more positive cases reported in Nevada for a total of 621 confirmed statewide", "authors": ["Anjeanette Damon", "Ed Komenda", "Sam Gross", "Benjamin Spillman", "Siobhan Mcandrew", "Marcella Corona", "Published A.M. Pt March"], "date": "2020-03-27", "keywords": ["county", "number", "positive", "confirmed", "cases", "86", "reported", "state", "health", "tested", "statewide", "coronavirus", "621", "nevada", "total", "covid19"], "summary": "In Nevada, 86 more people tested positive for coronavirus on Friday, according to the Nevada Health Alliance dashboard.\nWashoe cases total 75The Washoe County Health District is reporting eight additional positive cases of COVID-19 bringing the total number of cases to 75.\nThe number of known COVID-19 cases in Nevada jumped by triple-digits on Thursday night, according to the Nevada Health Alliance dashboard.\n(Photo: Andy Barron/RGJ)Southern Nevada Health District update comingLAS VEGAS – The Southern Nevada Health District will provide a COVID-19 update today at 11:30 a.m. Friday.\nA total of 10 people have died from coronavirus in Nevada, according to new figures reported on the Nevada Health Response dashboard."}, {"url": "https://www.rgj.com/story/news/money/business/2020/03/21/nevada-coronavirus-shutdown-update-businesses-fear-covid-19-surprises/2887829001/", "title": "What happens after 30-day shutdown? Nevada businesses fear more COVID-19 surprises", "authors": ["Jason Hidalgo", "Published A.M. Pt March"], "date": "2020-03-21", "keywords": ["casino", "30day", "business", "fear", "papezberg", "baumohl", "businesses", "surprises", "sheltra", "guinasso", "dental", "employees", "nevada", "shutdown", "reno", "happens", "covid19"], "summary": "Today, orange safety cones greet prospective visitors at the Bonanza’s shuttered doors, just one of the many businesses forced to close by COVID-19.\n“With the governor ordering our closure for a month, we have no choice but to reduce the hours and lay off employees,” Sheltra added.\nThe Bonanza is but a small piece of a much larger pie that counts 206,000 casino employees across the state.\nSome businesses that were already struggling prior to the shutdown might just keep their doors closed for good.\n“Let’s just hope (the shutdown) just lasts a month,” said Jason Guinasso, a lawyer who represents several businesses in the state."}, {"url": "https://kslsports.com/432572/espns-fpi-projects-five-wins-by-utah-state-football-in-2020/", "title": "ESPN’s FPI Projects Five Wins By Utah State Football In 2020", "authors": ["Kyle Ireland", "Ksl Sports"], "date": "2020-04-15", "keywords": ["aggies", "play", "espns", "fpi", "2020", "state", "teams", "utah", "season", "win", "according", "wins", "projects", "football"], "summary": "LOGAN, Utah – ESPN’s Football Power Index (FPI) projects five wins by the Utah State Aggies in the upcoming 2020 college football season.\nUtah State owns a -7.8 FPI rating which ranked No.\nFPI gives Utah State nearly a 70 percent advantage in the late October game.\nUtah State is projected to pick up the win according to FPI.\nUtah State finished the regular season as a bowl-eligible team and ended the year with a 7-6 record."}, {"url": "https://www.rgj.com/story/news/money/business/2020/03/24/reno-housing-market-crisis-coronavirus-real-estate-covid-19/2912037001/", "title": "Real estate: COVID-19 concerns could cool Reno-Sparks’ record-breaking housing market", "authors": ["Jason Hidalgo", "Published P.M. Pt March"], "date": "2020-03-24", "keywords": ["market", "concerns", "recordbreaking", "house", "showings", "estate", "real", "renosparks", "buyers", "sellers", "housing", "cool", "showing", "reno", "covid19", "lamb"], "summary": "After a record-setting run that saw its housing market post several new highs in recent years, Reno-Sparks real estate sector is facing its first significant challenge since the Great Recession: COVID-19.\nThe organization, however, is already bracing for a dip as the state sees a significant drop in house showings.\n(Photo: Andy Barron/RGJ)More sellers showing anxiety from COVID-19In recent years, the Reno-Sparks housing market has grown hotter by the year, with median prices hovering around the $400,000 range.\nNevada’s latest numbers also put it in select company alongside states that have seen decreases of more than 50% in house showings.\n“It was a lovely home but it, unfortunately, didn’t help to sell their house,” Lamb said."}, {"url": "https://www.rgj.com/story/news/2020/03/22/reno-nevada-coronavirus-updates-new-cases-washoe-county/2893840001/", "title": "Coronavirus live updates: Former MGM Resorts CEO to lead Nevada COVID-19 task force", "authors": ["Benjamin Spillman", "Marcella Corona", "Sam Gross", "Published A.M. Pt March"], "date": "2020-03-22", "keywords": ["county", "task", "trail", "washoe", "sisolak", "mono", "force", "updates", "announced", "spread", "medical", "coronavirus", "live", "covid19", "nevada", "mgm", "resorts", "lead"], "summary": "The person who recovered was a man in his 60's, the Washoe County Health District announced on Sunday afternoon.\nThe total number of people who have tested positive for the virus in Washoe County remains at 25, though testing will continue throughout the evening.\nIn other developments Sunday, the Silver State's governor announced a new COVID-19 task force and outdoor recreation destinations up and down the Sierra told people to stay away.\nSteve Sisolak announced at a Facebook Live press conference that former MGM Resorts CEO Jim Murren would chair the state's COVID-19 Response, Relief and Recovery Task force.\nThe Mono County order, which covers Mammoth Lakes, reiterates statewide restrictions put in place by California Gov."}, {"url": "https://www.rgj.com/story/news/2020/04/02/late-season-storms-bring-half-miracle-reno-tahoe-snowpack/5115606002/", "title": "Late season storms add up to a welcome 'half a miracle' for Reno-Tahoe snowpack", "authors": ["Benjamin Spillman", "Published P.M. Pt April"], "date": "2020-04-02", "keywords": ["welcome", "basin", "nevada", "water", "storms", "tahoe", "snowpack", "better", "add", "season", "late", "lake", "miracle", "river", "renotahoe", "half"], "summary": "(Photo: Sam Gross and Benjamin Spillman)With communities across the Sierra Nevada and Great Basin desperate for good news, half a miracle is better than no miracle at all.\nOn March 1, following a drier-than-normal January and historically dry February, snowpack in the Lake Tahoe Basin was just 48 percent of normal.\nThe Carson River Basin was at 56 percent and Walker River Basin was at 42 percent.\nThe late season boost likely won't be enough to top off storage in Lake Tahoe and other reservoirs, but given how winter started it's better than expected.\nThat's because snow that falls in March and April is more likely to make its way into Lake Tahoe than January snow."}, {"url": "https://www.rgj.com/story/news/politics/2020/04/06/coronavirus-nevada-covid-19-candidates-campaigns-face-challenge/2944386001/", "title": "Campaigning during coronavirus: Nevada candidates shift tone, tactics during statewide shutdown", "authors": ["James Dehaven", "Published A.M. Pt April"], "date": "2020-04-06", "keywords": ["campaign", "party", "primary", "voters", "candidate", "candidates", "tactics", "campaigning", "statewide", "reno", "online", "tone", "coronavirus", "help", "nevada", "shutdown", "shift"], "summary": "Candidates seek new ways to reach voters in the era of social distancingPolitics as usual has never been so unusual on the Northern Nevada campaign trail.\nBuy Photo Clint Koble, Democratic congressional candidate running against Mark Amodei, speaks with the RGJ in Reno on Sept. 6, 2018.\n“Instead of asking voters how they can help us, we’re asking how we can help them,” Koble told the Reno Gazette Journal on Friday.\nKeith Schipper, a spokesman for Trump’s Nevada campaign team, said the state GOP reached 100,000 residents in a single day last month.\nBuy Photo Votes register for the Nevada cuacus at Hug High in Reno, Nevada on Feb. 22, 2020."}, {"url": "https://khn.org/news/lost-on-the-frontline-health-care-worker-death-toll-covid19-coronavirus/", "title": "Lost On The Frontline", "authors": ["Melissa Bailey", "Alastair Gee", "The Guardian", "Christina Jewett", "Danielle Renwick", "Sarah Varney", "Kaiser Health News"], "date": "2020-04-15", "keywords": ["lost", "va", "hospital", "died", "health", "day", "medical", "coronavirus", "nurse", "frontline", "care", "covid19"], "summary": "Lost On The FrontlineAmerica’s health care workers are dying.\n“Lost on the Frontline” is a collaboration between The Guardian and Kaiser Health News that aims to document the lives of health care workers in the U.S. who die from COVID-19, and to understand why so many are falling victim to the pandemic.\nLost On The Frontline America’s health care workers are dying.\nThis story is part of “Lost on the Frontline,” a project from The Guardian and Kaiser Health News that aims to document the life of every health care worker in America who dies from COVID-19 during the pandemic.\nThis story is part of “Lost on the Frontline,” a project from The Guardian and Kaiser Health News that aims to document the life of every health care worker in America who dies from COVID-19 during the pandemic."}, {"url": "https://www.capradio.org/articles/2020/02/22/its-caucus-day-in-nevada-heres-what-you-need-to-know/", "title": "In Nevada, Democratic Presidential Caucus Voting Avoided Iowa's Mistakes. Here’s How It Went Down.", "authors": ["Bert Johnson"], "date": "2020-02-22", "keywords": ["union", "iowas", "voting", "avoided", "party", "culinary", "democratic", "went", "voters", "early", "presidential", "health", "sanders", "state", "caucus", "mistakes", "nevada", "heres"], "summary": "In Nevada, Sen. Bernie Sanders had a very strong showing — especially among young voters at the University of Nevada, Reno.\nNevada also has high rates of unionized labor, including the 60,000-member Culinary Union, which represents casino workers across the state.\nThe Nevada State Democratic Party had been planning to use two mobile apps designed by Shadow Inc., the developer responsible for the unreliable caucus reporting app in Iowa.\n“Let me be very clear to my good friends in the Culinary Union, a great union.\nKristie Strejc has been a member of the Culinary Union in Reno for 15 years."}, {"url": "https://www.rgj.com/story/news/2020/03/25/washoe-covid-19-team-prepares-surge-patients/5085202002/", "title": "Washoe County health officials prepare for a surge in coronavirus patients", "authors": ["Marcella Corona", "Published P.M. Pt March"], "date": "2020-03-25", "keywords": ["county", "washoe", "positive", "prepare", "officials", "cases", "protective", "require", "health", "team", "tests", "coronavirus", "nevada", "patients", "surge", "covid19"], "summary": "That includes finding “alternative care sites” for medical use, said Kevin Dick, health officer for the Washoe County Health District.\nStatewide, the Nevada Health Alliance reported 321 known positive cases.\nStill, Pandori said tests require a doctor’s order and cannot be given to just anybody.\nHe urged nonessential businesses to close and residents to stay home to help flatten the growing curve of positive cases.\nTests require a doctor’s order and cannot be administered to just anybody."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/03/nevada-caucus-2020-democratic-presidential-nominee-guide-voting-app/4613531002/", "title": "Here's everything you need to know about Nevada’s upcoming presidential caucus", "authors": ["James Dehaven", "Published A.M. Pt Feb."], "date": "2020-02-03", "keywords": ["supporters", "democratic", "voters", "candidate", "presidential", "candidates", "nominating", "feb", "caucus", "nevada", "upcoming", "nevadas", "heres", "need", "know"], "summary": "CLOSE Turnout overwhelmed caucus sites at Smithridge Elementary leading to a hectic caucus experience for some.\nNevada's third-in-the-nation presidential nominating contest, explainedNevada’s caucus process isn’t nearly as scary as you think.\nNevada Caucus live results: See real-time data for the Democratic presidential primaryDear readers: We’re providing our 2020 election coverage for free.\nA scene from the Democratic caucus on the University of Nevada, Reno campus on Feb. 20, 2016.\n(Photo: Andy Barron/RGJ file)Step One: Know what you’re in forCaucuses are a party-run, community-based approach to nominating a presidential candidate."}, {"url": "https://www.rgj.com/story/news/2020/03/06/coronavirus-update-vegas-reno-nevada-timeline/4975498002/", "title": "Coronavirus in Nevada: Timeline of virus' presence in Reno, statewide", "authors": ["Nate Chute", "Published P.M. Pt March"], "date": "2020-03-06", "keywords": ["county", "washoe", "presence", "cases", "timeline", "state", "health", "statewide", "virus", "coronavirus", "nevada", "reported", "close", "reno"], "summary": "For a timeline of known coronavirus cases in Nevada, click here.\nMarch 5: Washoe County man first in county to test positive for coronavirusAccording to the Washoe County Health District, the man was linked to the Grand Princess cruise ship outbreak.\nMarch 7: Washoe County Emergency response elevated to Level 2The Washoe County Health District addressed the virus at a press conference, confirming the single case in the county.\nThe University of Nevada, Reno announced it will move to online classes on March 22, the Monday after spring break.\nMarch 16: First Nevada coronavirus deathThe first death from the virus in the state was reported, according to the Southern Nevada Health District."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/17/rgj-blog-live-coverage-nevadas-early-caucus/4786838002/", "title": "Live caucus updates: In Reno stop, Sisolak says Nevada could soon consider dropping caucus", "authors": ["James Dehaven", "Published A.M. Pt Feb."], "date": "2020-02-17", "keywords": ["voting", "sisolak", "consider", "biden", "party", "democratic", "state", "early", "updates", "presidential", "soon", "caucus", "live", "nevada", "stop", "reno", "dropping"], "summary": "CLOSE Early caucus voters at the University of Nevada and the Washoe County Democratic headquarters share their experience with the RGJ on Feb. 15, 2020.\nWe'll also keep an eye on early caucusing locations, voter turnout and any other updates provided by the Nevada State Democratic Party.\nSisolak on Monday heard more than one complaint about that decision while shaking hands with a long line of early caucusgoers at Washoe County Democratic Party headquarters in Reno.\nSmithson said he had enough iPads to accommodate even more early caucus volunteers, and potentially even more caucusgoers.\nBiden suffered a further blow last week, when Las Vegas’ politically powerful Culinary Union decided to stay out of the Democratic presidential primary race."}, {"url": "https://www.theguardian.com/us-news/2020/feb/21/nevada-caucus-voters-democratic-health-heat-deportations", "title": "Health, heat and deportations: the issues driving Nevada caucus voters", "authors": ["Sam Levin"], "date": "2020-02-21", "keywords": ["warren", "heat", "children", "issues", "state", "voters", "democratic", "health", "reno", "vegas", "las", "driving", "caucuses", "caucus", "nevada", "race", "deportations"], "summary": "As Nevada prepares for the caucuses that could reshape the US presidential race, Democratic voters here remained divided on who is the best candidate to end the tumultuous presidency of Donald Trump.\nBut across the state, Democratic primary voters agreed that making Trump a one-term president is a priority – and that their daily struggles looked very different than the experiences of voters in Iowa and New Hampshire.\n'She was a warrior': Warren supporters ebullient in Las Vegas after debate Read more“Nevada really is representative of the rest of the country,” said Deb Lomando, a 70-year-old Las Vegas resident and retired geologist.\nWhile the first two states are 90% white, Nevada is nearly 30% Latino, 10% black and has a growing Asian American population.\nThat makes the “first in the west” caucuses a pivotal test of the diversity of each campaign’s supporters."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/28/election-2020-nevada-democratic-caucus-bernie-sanders-biden-buttigieg/4907168002/", "title": "RGJ analysis: Four takeaways from Washoe County's Democratic caucus results", "authors": ["James Dehaven", "Published P.M. Pt Feb."], "date": "2020-02-28", "keywords": ["analysis", "support", "washoe", "nevada", "voting", "biden", "democratic", "voters", "states", "sanders", "caucus", "results", "rgj", "countys", "takeaways"], "summary": "CLOSE Nevadans gathered on Saturday Feb. 22, 2020 to caucus for the next Democratic nominee for president.\nHere are four big takeaways from caucus results tallied in Nevada’s second largest county:Bernie's blowoutThe numbers behind Sanders’ victory are stark.\nEntrance polls show he prevailed statewide with white voters, Latino voters and voters under the age of 65.\nMore: 'Nothing broke': Nevada Caucus voting goes smoothly despite math headachesIf Buttigieg had not run up the score in those Northern Nevada voting districts, he might have walked away without a single state delegate to the party’s national convention in July.\nNevada’s last Democratic caucus?"}, {"url": "https://www.rgj.com/story/news/crime/2020/02/21/reno-police-respond-reports-gunfire/4834134002/", "title": "UPDATE: Reno police investigate shooting on Stardust; find shell casings from a handgun", "authors": ["Sam Gross", "Marcella Corona", "Published P.M. Pt Feb."], "date": "2020-02-21", "keywords": ["reporter", "updatereno", "gunfire", "investigate", "seen", "casings", "stoker", "weapons", "shooting", "area", "shell", "update", "street", "stardust", "reno", "handgun"], "summary": "CLOSEBuy Photo Law enforcement officers are seen holding their weapons as they respond to a report of gunfire Friday, Feb. 21, 2020, on Stardust Street and Stoker Avenue in Reno.\n(Photo: Sam Gross/RGJ)1:28 p.m. update:Reno police are investigating a shooting that may have stemmed from a fight in the area near Stardust Street and Stoker Avenue.\nThe incident prompted authorities to temporarily close Stardust Street, which has since been reopened.\n12:54 p.m. update:Reno police are responding to reports of gunfire on Stardust Street and Stoker Avenue.\n(Photo: Sam Gross/RGJ)Sam Gross is a breaking news reporter for the Reno Gazette Journal who covers wildfires, emergencies and more."}, {"url": "https://www.clickorlando.com/news/politics/2020/04/14/the-latest-app-could-be-used-by-eu-to-relax-restrictions/", "title": "CORONAVIRUS UPDATES: Some shops allowed to reopen in Italy", "authors": ["The Associated Press", "Associated Press"], "date": "2020-04-14", "keywords": ["cases", "sinn", "updates", "health", "deaths", "allowed", "president", "italy", "coronavirus", "patients", "number", "reopen", "shops", "infections", "covid19"], "summary": "—Trump meets with former coronavirus patients.\nAmong the former COVID-19 patients meeting with Trump at the White House is Michigan state lawmaker Karen Whitsett.\nThe Navy also says the number of coronavirus cases among the Roosevelt crew is now 589, with 3,922 negative test results.\n___LOS ANGELES — The number of COVID-19 cases among crewmembers of the Navy hospital ship Mercy has risen to seven.\nHe’s worried that puts the state at risk for a new spike in coronavirus infections after appearing to make strides in stemming the outbreak."}, {"url": "https://www.rgj.com/story/news/2020/02/01/firefighters-battle-brush-fire-peavine/4635985002/", "title": "UPDATE: Firefighters battle 30-acre brush fire on Peavine Mountain", "authors": ["Marcella Corona", "Published P.M. Pt Feb."], "date": "2020-02-01", "keywords": ["winter", "brush", "battle", "snow", "scene", "crews", "renofiredept", "firefighters", "residents", "update", "30acre", "reno", "mountain", "hupp", "peavine"], "summary": "CLOSEBuy Photo Smoke is seen billowing from a hillside near Peavine Mountain on Saturday, Feb. 1, 2020.\n(Photo: Marcella Corona/RGJ)Firefighters were still battling a 30-acre brush fire Saturday evening that sparked on Peavine Mountain earlier in the day.\nThe fire was reported just before 4 p.m. Saturday five miles up Peavine Mountain.\nCrews from the Truckee Meadows Fire Protection District and Reno Fire Department were on the scene and awaiting help from federal resources.\nRelated: Winter makes a comeback: Storm to bring chilly temps, gusty winds, snow on SundayHard to believe it is February 1st, @RenoFireDept and @TMFPD on scene of a brush fire in Peavine."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/15/trump-rally-supporters-las-vegas-next-week/4772971002/", "title": "Trump to rally in Las Vegas on eve of Nevada's crucial Democratic presidential caucus", "authors": ["James Dehaven", "Published P.M. Pt Feb."], "date": "2020-02-15", "keywords": ["crucial", "trumps", "eve", "jobs", "democratic", "rally", "presidential", "feb", "las", "vegas", "president", "trump", "caucus", "nevada", "reno", "nevadas"], "summary": "CLOSE President Donald Trump went after the Democratic candidates running for his office the day before the New Hampshire's first-in-the-nation presidential primary.\n(Feb. 11) AP DomesticThe event coincides with Vice President Mike Pence's planned appearance in RenoPresident Donald Trump is headed to Las Vegas next week.\nTrump’s re-election campaign on Saturday announced a “Keep America Great” rally at noon on Friday, Feb. 21, at the Las Vegas Convention Center, 3150 Paradise Road in Las Vegas.\nThe Nevada GOP canceled its own caucus in September, effectively throwing all of the state’s Republican delegates to Trump more than a year ahead of the election.\nMike Pence to rally in RenoNext week’s event coincides with Vice President Mike Pence’s planned appearance at a similar rally in Reno."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/16/warren-buttigieg-make-pre-caucus-push-reno/4782125002/", "title": "Warren, Buttigieg make final push through Northern Nevada ahead of closely watched caucus", "authors": ["James Dehaven", "Published P.M. Pt Feb."], "date": "2020-02-16", "keywords": ["warren", "campaign", "running", "buttigieg", "ahead", "northern", "watched", "democratic", "supporters", "presidential", "high", "president", "final", "caucus", "closely", "nevada", "reno", "push"], "summary": "CLOSE Early caucus voters at the University of Nevada and the Washoe County Democratic headquarters share their experience with the RGJ on Feb. 15, 2020.\nBuy Photo Democratic candidate for president Elizabeth Warren campaigns at Reno High School on Feb. 16, 2020.\n(Photo: JASON BEAN/RGJ)“I’m not running a campaign crafted by a bunch of consultants,” Warren concluded.\n\"I'm ready to go toe-to-toe with this president,\" Buttigieg told more than 1,200 supporters at Sparks High School.\nPollsters predict Warren is running out of time to jumpstart her once-promising bid for the White House."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/10/heres-where-go-caucus-washoe-county/4717997002/", "title": "Here's your guide to all 71 places where Democrats can caucus this month in Washoe County", "authors": ["James Dehaven", "Published P.M. Pt Feb."], "date": "2020-02-10", "keywords": ["county", "washoe", "elementary", "st", "drive", "guide", "18", "month", "democrats", "places", "71", "feb", "middle", "caucus", "high", "15", "school", "heres"], "summary": "CLOSE Three things led to a disastrous caucus night for Democrats.\nEven as Nevada State Democratic Party officials scramble to replace their maligned Caucus Day vote-reporting technology, they have committed to retaining an expanded, four-day early caucusing period set to start on Feb. 15.\nThey’ve also made no changes to the 57 voting locations set to open on Caucus Day in Washoe County.\n#MyReno #OurTown #NVCaucus #reno #nvdems #Reno365 (Photo: Anjeanette Damon/RGJ)Caucus Day locationsAlyce Taylor Elementary School, 252 Egyptian Drive, SparksB.D.\nBillinghurst Middle School, 6685 Chesterfield Lane, RenoBernice Mathews Elementary School, 2750 Elementary Drive, RenoBrown Elementary School, 13815 Spelling Court, RenoCaughlin Ranch Elementary School, 4885 Village Green Parkway, RenoClayton Middle School, 1295 Wyoming Ave., RenoCold Springs Middle School, 18235 Cody Court, RenoCorbett Elementary School, 1901 Villanova Drive, RenoDarrel C Swope Middle School, 901 Keele Drive, RenoDepoali Middle School, 9300 Wilbur May Parkway, RenoDesert Heights Elementary School, 13948 Mt."}, {"url": "https://www.nevadabusiness.com/2020/03/rsar-releases-february-2020-existing-home-sales-report/", "title": "RSAR Releases February 2020 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2020-03-10", "keywords": ["homes", "sales", "existing", "2020", "report", "singlefamily", "renosparks", "median", "month", "releases", "rsar", "price", "increase"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its February 2020 reports on existing home sales in Reno/Sparks and Fernley, including median sales price and number of home sales in the region.\nReno/SparksDuring February 2020, the report showed Reno/Sparks had 446 sales of existing single-family homes; an increase of 23 percent from January 2020 and an increase of 14 percent from February 2019.\nThe median sales price of an existing condominium/townhome in Reno/Sparks in February 2020 was $249,500; an increase of 12 percent from last year.\nThe existing condominium/townhome median sales price for February 2020 in Reno was $255,000; an increase of 12 percent from last year.\nThe existing condominium/townhome median sales price for February 2020 in Sparks was $227,500; an increase of 16 percent from last year."}, {"url": "https://www.ktnv.com/news/bernie-sanders-to-visit-las-vegas-leading-up-to-nevada-caucuses", "title": "Bernie Sanders to visit Las Vegas leading up to Nevada caucuses", "authors": [], "date": "2020-02-12", "keywords": ["leading", "event", "visit", "rally", "sanders", "las", "vegas", "caucuses", "open", "feb", "encouraged", "entrance", "bernie", "nevada", "sen"], "summary": "LAS VEGAS (KTNV) — Sen. Bernie Sanders will be in Las Vegas in the days leading up to the Nevada caucuses for a \"Bernie 2020’s Get Out the Caucus\" multi-day event, his campaign says.\nHe will be in Las Vegas on Saturday before heading up to northern Nevada for a few days.\nThen, his campaign says Sanders will be back in Las Vegas again for a rally at UNLV on Feb. 18 and another ally the day before the caucuses on Feb. 21.\nAfter the Senator finishes his remarks he and Make the Road members will lead a march to the polling location at IBEW Local 357, 808 N Lamb Blvd, Las Vegas, NV 891107 p.m. -- Clark County Democratic Party Kick-Off to Caucus 2020 GalaTropicana Hotel, 3801 South Las Vegas Blvd, Las Vegas, NV 89109This event requires a ticket which can be purchased here.\nFRIDAY, FEB. 217 p.m. -- Las Vegas rally with Sen. Bernie SandersSprings Preserve Amphitheater, 333 S Valley View BoulevardThis event is free and open to the public."}, {"url": "https://www.capradio.org/articles/2020/02/22/take-a-look-reno-democrats-turn-out-for-2020-nevada-caucus/", "title": "Take A Look: Reno Democrats Turn Out For 2020 Nevada Caucuses", "authors": ["Andrew Nixon"], "date": "2020-02-22", "keywords": ["unrandrew", "2020", "nixon", "party", "watched", "voters", "presidential", "democrats", "caucuses", "turn", "look", "capradioandrew", "caucus", "weigh", "nevada", "reno"], "summary": "Nevada Democrats came together Saturday for the state’s presidential caucus.\nThe third-in-the-nation nominating contest is the first time a diverse electorate will weigh in this election season.\nThe caucus was closely watched after the issues that plagued the Democratic party in Iowa earlier this month.\nAt the University of Nevada, Reno, voters lined up to support their candidates and push them closer to the party presidential nomination.\nHere's the process looked at UNR:Andrew Nixon / CapRadioAndrew Nixon / CapRadioAndrew Nixon / CapRadioAndrew Nixon / CapRadioAndrew Nixon / CapRadioAndrew Nixon / CapRadioAndrew Nixon / CapRadioAndrew Nixon / CapRadio"}, {"url": "https://www.rgj.com/story/news/politics/2020/02/10/elizabeth-warren-stump-reno-sunday/4715202002/", "title": "Elizabeth Warren hopes to fire up Nevada supporters during Sunday campaign stop in Reno", "authors": ["James Dehaven", "Published A.M. Pt Feb."], "date": "2020-02-10", "keywords": ["warren", "elizabeth", "campaign", "event", "2020", "supporters", "democratic", "presidential", "feb", "nevada", "stop", "reno", "hopes"], "summary": "CLOSE The RGJ interviewed Senator Elizabeth Warren moments before her campaign rally in Carson City on Oct. 2, 2019.\nReno Gazette JournalThe 2020 Democratic presidential hopeful announced a 'get-out-to-caucus' event at Reno High SchoolTop Democratic presidential hopeful and U.S. Sen. Elizabeth Warren plans to return to Reno this weekend.\nWarren’s campaign on Monday announced a “get-out-to-caucus” event set to begin 3 p.m. Sunday at Reno High School, 395 Booth St. in Reno.\nWarren last visited Northern Nevada in December, when she hosted a town hall at Truckee Meadows Community College.\nEarly caucusing in Nevada begins on Feb. 15 at any one of 80 locations around the state."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/15/reno-democrats-brave-long-lines-caucus-early/4772425002/", "title": "Big turnout, slim staffing blamed for long lines on first day of early caucusing in Reno", "authors": ["James Dehaven", "Published P.M. Pt Feb."], "date": "2020-02-15", "keywords": ["state", "long", "democratic", "volunteers", "lines", "caucus", "nevada", "slim", "washoe", "blamed", "turnout", "early", "day", "democrats", "caucusing", "party", "feb", "staffing", "reno"], "summary": "Buy Photo Caucusgoers form a line at Washoe County Democratic Party headquarters on Saurday, Feb. 15, 2020.\nKaren McClenahan, an-ex Republican participating in her first Democratic caucus, said long lines at Washoe Democrats’ headquarters prompted her to drive out to the UNR precinct.\nThat should offer some solace to on-site organizers who had earlier convened in the aptly named “Blue Fish Bowl” room for a tense-sounding conference call with the Nevada State Democratic Party.\nOn the call, state Democratic officials advised precinct volunteers to “go slow” and avoid mistakes, even if that meant adding to the long lines forming outside.\nNevada Democrats have taken several steps to avoid a similar debacle, including dropping plans to use the same software developer hired in Iowa."}, {"url": "https://www.theguardian.com/us-news/2020/feb/19/nevada-democratic-debate-sanders-bloomberg-klobuchar", "title": "'Gloves will be off': Nevada debate could be pivotal for Bloomberg", "authors": ["Sam Levin"], "date": "2020-02-19", "keywords": ["pivotal", "warren", "strong", "nevada", "buttigieg", "biden", "voters", "bloomberg", "candidates", "mayor", "caucuses", "gloves", "debate"], "summary": "The Democratic presidential debate in Nevada will bring together six candidates days before the state’s caucuses and could be a make-or-break moment for some campaigns.\nThe state also has a strong record of supporting women in office, which could factor into the dynamics of the debate and caucuses.\nFor Warren, the debate is a critical opportunity to rebuild the momentum she has lost after surging in polls last year.\nAnd the gaffe-prone Biden, who is hoping for a rebound in Nevada and South Carolina, is in a particularly precarious position.\nThe debate, hosted by NBC News and MSNBC, is at the Paris Theater and starts at 6pm local time."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/22/sanders-tops-field-early-returns-nevada/4796573002/", "title": "Final vote tally is in: Sanders wins Nevada Caucuses with 47 percent of the vote", "authors": ["James Dehaven", "Ed Komenda", "Published P.M. Pt Feb."], "date": "2020-02-22", "keywords": ["tally", "2020", "took", "democratic", "states", "presidential", "sanders", "vote", "caucuses", "final", "caucus", "47", "came", "nevada", "wins"], "summary": "CLOSE Nevada caucus results are not about numbers, but momentum, and making a case that a candidate can win the national Democratic base.\nMonday Update: U.S. Sen. Bernie Sanders has officially won the Nevada Caucuses, garnering 47 percent of the vote.\nThe Nevada State Democratic Party completed counting 100 percent of the caucus results Monday morning.\nBernie Sanders won Nevada’s closely watched Democratic presidential caucus after securing about 54 percent of the delegates counted in the Silver State as of Saturday evening.\nInstead, the pair suffered major blows to their presidential prospects after combining to secure fewer than one-third of the state’s vote tally."}, {"url": "https://www.dailynews.com/2020/04/15/racketeering-charges-dropped-against-men-tied-to-vagos-biker-gang-including-4-californians/", "title": "Racketeering charges dropped against men tied to Vagos biker gang, including 4 Californians", "authors": ["The Associated Press"], "date": "2020-04-15", "keywords": ["siemer", "san", "federal", "vagos", "men", "including", "attorney", "las", "racketeering", "tied", "dropped", "biker", "vegas", "charges", "californians", "trial", "voll", "gang"], "summary": "“Witnesses recanted and their racketeering theory was flawed,” defense attorney Kathleen Bliss said Tuesday of the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives and federal prosecutors.\nOne defendant, Jeremy Halgat, still faces trial in June on drug and weapon charges that he has been fighting since 2013.\nWashoe County District Attorney Chris Hicks could prosecute Gonzalez again, but would face double-jeopardy legal challenges following Gonzalez’s acquittal in federal court.\nGonzalez’s attorney, Michael Kennedy, said Tuesday that his client saved lives by stopping two Hells Angels from shooting others.\nWhen indicted, Palafox was identified by the government as a Beaumont resident, Gonzalez was listed as being from San Francisco and Halgat was said to be from North Las Vegas."}, {"url": "https://www.8newsnow.com/weird-news/no-one-to-vote-nevada-democrats-puzzle-over-empty-precinct/", "title": "No one to vote? Nevada Democrats puzzle over empty precinct", "authors": ["Wayne Parry", "Associated Press"], "date": "2020-02-27", "keywords": ["county", "park", "registered", "washoe", "puzzle", "state", "precinct", "voters", "democrats", "vote", "precincts", "nevada", "reno", "areas"], "summary": "The park owned by Washoe County comprises the entire county’s voting Precinct 7321 where only one person, a park employee lives.\nUnbeknownst to many, 108 of Washoe County’s 555 precinct have no registered voters.\nHaving few or no registered voters in precincts is not as unusual as it sounds in sparsely populated Nevada.\nUnbeknownst to many, state election law caps the maximum number of active registered voters per precinct at 3,000, but there is no minimum.\nIn fact, 108 of Washoe County’s 555 precincts have no registered voters, county Registrar of Voters Deanna Spikula said Wednesday."}, {"url": "https://www.rgj.com/story/news/2020/02/10/murdered-navy-vet-fought-all-nevada-veterans/4695809002/", "title": "Reno-Sparks remembers slain Navy vet: She was 'a fighter' for all veterans", "authors": ["Marcella Corona", "Published A.M. Pt Feb."], "date": "2020-02-10", "keywords": ["support", "family", "vigil", "veterans", "jana", "renosparks", "slippers", "simons", "vet", "slain", "holliday", "fighter", "mcelhaney", "navy", "remembers", "veteran"], "summary": "CLOSEBuy Photo A photo of 54-year-old U.S. Navy veteran Jana McElhaney is displayed at her vigil on Feb. 6, 2020.\nBuy Photo Wendy Simons, 69, speaks at a vigil held Feb. 6, 2020, for slain U.S. Navy veteran, Jana McElhaney, 54, who died of head injuries from a reported attack.\n(Photo: Marcella Corona/RGJ)“They were really gorgeous, nice slippers,” Simons said.\n“She was actually going to the (U.S. Department of Veterans Affairs) herself and picking up these flags for these veterans,” he said.\n“My family is very grateful for that.”Buy Photo Attendees gather for a vigil for slain U.S. Navy veteran, Jana McElhaney, 54, on Feb. 6, 2020."}, {"url": "https://www.rgj.com/story/news/politics/2020/02/18/trump-postpones-planned-pence-event-reno/4799996002/", "title": "Trump campaign postpones planned Reno rally with Vice President Mike Pence", "authors": ["James Dehaven", "Published P.M. Pt Feb."], "date": "2020-02-18", "keywords": ["pence", "campaign", "trumps", "vice", "rally", "mike", "las", "president", "vegas", "trump", "planned", "nevada", "reno", "postpones"], "summary": "CLOSE Vice President Mike Pence talked about the recent impeachment acquittal of President Trump and State of the Union Address at a Women For Trump Rally.\nYork Daily RecordThe vice president had been scheduled to speak at the Atlantis on FridayVice President Mike Pence's planned Friday appearance in Reno has been postponed, according to a Sunday statement from President Donald Trump's re-election campaign.\nThe campaign did not offer an explanation for the delay, beyond noting that it was \"due to President Trump’s recently announced Keep America Great rally\" in Las Vegas.\nTrump's team has not announced any changes to the Southern Nevada rally, which is set to start at noon on Friday, Feb. 21, at the Las Vegas Convention Center, 3150 Paradise Road in Las Vegas.\nBuy Photo Vice President Mike Pence, Dean Heller and Adam Laxalt speak at the Carson City Airport on Oct. 27, 2018."}, {"url": "https://thisisreno.com/2020/01/7-events-to-check-out-this-week-in-reno/", "title": "7 events to check out this week in Reno", "authors": [], "date": "2020-01-07", "keywords": ["dance", "attendees", "comedy", "ages", "events", "week", "check", "summit", "panda", "reno", "details"], "summary": "There is plenty to do in the greater Reno area this week.\nHere is a roundup of some events to check out.\nDetails: https://thisisreno.com/calendar/the-play-that-goes-wrong/Dead Panda Comedy Night at Reno Improv: Luke Westberg of Dead Panda Comedy hosts this monthly show.\nDetails: https://thisisreno.com/calendar/nia-youth-summit-nevada-interfaith-association/For more details or other events, check out our events page.\nIf you are hosting an event, submit events to our events page."}, {"url": "https://www.rgj.com/story/news/money/business/2020/02/24/franchise-business-opportunities-reno-nevada-market/4832652002/", "title": "Report: More franchise stores and chains continue to eye Nevada market, including Reno", "authors": ["Jason Hidalgo", "Published A.M. Pt Feb."], "date": "2020-02-24", "keywords": ["stores", "market", "sector", "report", "growth", "continue", "states", "including", "recession", "chains", "haller", "franchise", "eye", "nevada", "reno", "services"], "summary": "In 2017, Nevada ranked third in the country with 2.8% franchise growth, according to the IFA.\nEven as other states have leapfrogged Nevada, however, it continues to be a top target among franchisees.\nHere are the 18 largest restaurant chains nowhere near Reno-SparksMeanwhile, the number of franchise businesses in 2020 is expected to top 785,000.\n“When people are investing these days and really looking into the franchise sector, the service business is on fire right now,” McQuillan said.\n“A recession would be a concern as it certainly would have an impact on franchise lending … and consumer spending,” Haller said."}, {"url": "https://www.rgj.com/story/news/2020/02/28/yesco-young-electric-company-signs-las-vegas-reno-nevada/4882187002/", "title": "Inside YESCO, the company behind the most iconic signs in Las Vegas, Reno", "authors": ["Ed Komenda", "Published A.M. Pt Feb."], "date": "2020-02-28", "keywords": ["komenda", "young", "inside", "las", "yesco", "vegas", "iconic", "city", "shop", "gazette", "company", "sign", "reno", "signs"], "summary": "While the company is based in Salt Lake City, the iconic Reno Arch and more than a dozen signs along the Las Vegas Strip came from a shop in Southern Nevada.\nBuy Photo Jeff Young points to a photo of his grandfather, Thomas Young, Sr. (Photo: Ed Komenda / Reno Gazette Journal.)\n“The race in Las Vegas started for us at the Boulder Club sign.”Today, a walk down the Las Vegas Strip is an unannounced YESCO tour.\nYESCO's biggest project at this moment is signage for Allegiant Stadium – the Las Vegas Raiders home opening later this year.\nEd Komenda writes about Las Vegas for the Reno Gazette Journal and USA Today Network."}, {"url": "https://thisisreno.com/2020/01/nevada-democratic-caucus-announces-presidential-candidate-lineup/", "title": "Nevada Democrats announce caucus presidential candidate lineup", "authors": ["Don Dike Anukam"], "date": "2020-01-02", "keywords": ["party", "2020", "democratic", "state", "candidate", "presidential", "democrats", "candidates", "west", "announce", "caucus", "nevada", "senator", "lineup"], "summary": "By Don Dike-AnukamThe Nevada Democratic Party formally announced today who had made the cut for the February 22 First in the West caucus.\nThe Democratic presidential field started in early 2019 with 20-plus candidates.\nThat number narrowed to 13 as the Nevada State Democratic Party gave the following statement on who would appear on the February 22 preferences card.\n“Today, the Nevada State Democratic Party announced the Democratic presidential candidates who will appear on our 2020 First in the West Caucus preference card,“ the dems said in a media statement.\nWe’re beyond excited to have an incredible and diverse slate of candidates competing in our First in the West Caucus in 2020.”"}, {"url": "https://www.rgj.com/story/news/politics/2020/02/22/nevada-caucus-smooth-primary-vote-tallying-few-problems/4844895002/", "title": "'Nothing broke': Nevada Caucus voting goes smoothly despite math headaches", "authors": ["Staff Reports", "Published P.M. Pt Feb."], "date": "2020-02-22", "keywords": ["voting", "headaches", "smoothly", "viability", "goes", "math", "precinct", "vote", "reno", "president", "trump", "caucus", "despite", "process", "nevada", "school", "wanted", "broke"], "summary": "CLOSE Nevadans gathered on Saturday Feb. 22, 2020 to caucus for the next Democratic nominee for president.\n“This is kind of going old school,” the first-time caucus goer said at Galena High.\nNot all caucus-goers who supported candidates who failed to reach viability wanted to re-align to another candidate.\n\"I would still prefer to get to vote for who I wanted to vote for,\" said Larson.\n'Get out and vote against Trump'At Carson Middle School, at least one supporter of President Donald Trump slipped into a caucus."}, {"url": "https://www.rgj.com/story/news/2020/03/21/coronavirus-updates-latest-reno-sparks-and-las-vegas/2891116001/", "title": "Coronavirus updates: 3 new cases confirmed in Washoe County", "authors": ["James Dehaven", "Marcella Corona", "Published A.M. Pt March"], "date": "2020-03-21", "keywords": ["county", "washoe", "local", "confirmed", "cases", "officials", "businesses", "sisolak", "updates", "health", "coronavirus", "nevada"], "summary": "Health officials confirm three new cases in Washoe CountyThe Washoe County Health District confirmed three new coronavirus cases on Saturday.\nThe recent positive cases bring the total to 25 cases in Washoe County.\nLaw enforcement increases patrol to protect closed businessesLaw enforcement agencies will have extra officers on patrol in Reno, Sparks and Washoe County to help keep watch over closed business amid the coronavirus outbreak, according to the Washoe County Regional Response Team.\nNext to her is Washoe County District Health Officer Kevin Dick, center, and Washoe County Manager Eric Brown.\nNellis Air Force Base confirms 2 positive coronavirus casesNellis Air Force Base has confirmed two new positive COVID-19 coronavirus cases, for a total of six cases."}, {"url": "https://www.theguardian.com/us-news/2020/apr/15/nurses-surgeons-janitors-first-us-health-workers-to-die-covid-19", "title": "Nurses, surgeons, janitors: the first US health workers to die from Covid-19", "authors": ["Danielle Renwick", "Sarah Varney", "Melissa Bailey", "Christina Jewett", "Heidi Shierholz", "Robert Reich", "Renee C Wurth", "Jeffrey Pfeffer"], "date": "2020-04-15", "keywords": ["family", "surgeons", "hospital", "simmons", "janitors", "karen", "health", "nurses", "workers", "die", "mother", "medical", "work", "covid19", "verrier"], "summary": "These are some of the first tragic casesNurses, surgeons, janitors: the first US health workers to die from Covid-19America’s healthcare workers are dying.\nHospitals are overwhelmed, workers lack protective equipment and some staff suffer from underlying health conditions that make them vulnerable to this pernicious virus.\nHealth authorities in the US have no consistent way of tallying the deaths of healthcare workers.\nWorkers at St Barnabas hospital struggled to find masks and gowns as staff set up makeshift morgues in the parking lot.\n– MB• We are aiming to document the life of every healthcare worker in America who dies from Covid-19."}, {"url": "https://www.sfgate.com/weather/article/CA-Reno-NV-Zone-Forecast-15139565.php", "title": "CA Reno NV Zone Forecast", "authors": [], "date": "2020-03-18", "keywords": ["cloudy", "pdt", "forecast", "chance", "snow", "highs", "rain", "winds", "lows", "zone", "morning", "mph", "ca", "reno", "nv"], "summary": "CA Reno NV Zone ForecastCA Reno NV Zone Forecast for Wednesday, March 18, 2020_____253 FPUS55 KREV 182132ZFPREVWestern Nevada-Eastern Sierra-Northeast California Zone ForecastNational Weather Service Reno NV232 PM PDT Wed Mar 18 2020This is an automatically generated product that provides averagedvalues for large geographic areas and may not be representativeof a specific area.\nSlight chance of rain and snow in the afternoon.\n$$CAZ070-NVZ005-191500-Surprise Valley California-Northern Washoe County-Including the cities of Cedarville, Eagleville, Fort Bidwell,Empire, and Gerlach232 PM PDT Wed Mar 18 2020.TONIGHT...Partly cloudy.\n.SUNDAY NIGHT...Partly cloudy in the evening, then mostly cloudywith a slight chance of snow after midnight.\nChance of snow and rain."}, {"url": "https://www.datacenterknowledge.com/business/reno-hopes-more-data-center-investment-thanks-controversial-tax-break", "title": "In Reno, Hopes of More Data Center Investment Thanks to Controversial Tax Break", "authors": [], "date": "2020-03-18", "keywords": ["companies", "center", "industrial", "investment", "data", "opportunity", "zone", "thanks", "controversial", "break", "thompson", "tax", "nevada", "tesla", "reno", "hopes"], "summary": "This is the second part of a special DCK series looking at Opportunity Zones and data center developers’ experience with them to date.\nRelated: Opportunity Zones – What Data Center Investors Need to KnowThe site, perhaps more famous for being home to the Tesla Gigafactory, a battery manufacturing plant, is also home to an enormous Switch data center and a construction site for a Google data center; hyperscale data center developer EdgeCore Internet Real Estate has plans for a 1 million-square foot, 225MW campus there.\nThe Tahoe Reno Industrial Center, or TRI, organization said it has received a lot of interest from more potential data center operators because of the existing projects.\nRelated: Former Sacramento Air Force Base Site Could Become a Data Center Campus“The potential for expansion is massive,” he said.\nBut the fact that the site is in an Opportunity Zone – which he calls the “O-Zone” – is on their minds."}, {"url": "https://www.rgj.com/story/news/2020/03/24/coronavirus-update-nevada-covid-19-cases/2904986001/", "title": "Coronavirus: 2 more deaths reported, UNR to hold virtual commencement ceremony", "authors": ["Staff Reports", "Published A.M. Pt March"], "date": "2020-03-24", "keywords": ["commencement", "county", "washoe", "nevada", "positive", "cases", "state", "health", "unr", "deaths", "test", "virtual", "coronavirus", "ceremony", "hold", "according", "reported", "covid19"], "summary": "UNR to hold virtual commencement ceremonyThe University of Nevada, Reno cancelled in-person commencement ceremonies in May in response to the coronavirus.\nHalf dozen new cases reportedSix new cases of the coronavirus were reported, bumping the total to 50 cases in Washoe County, according to the Washoe County Health District.\nTwo more deaths reported, Sisolak updates state on coronavirus effortsLAS VEGAS – The Southern Nevada Health District is reporting two deaths related to COVID-19.\nThe Washoe County Health District is working to trace and reach out to those who may have come into contact with this person.\nNineteen new cases were reported in Washoe County late Monday afternoon, increasing the county total to 44 cases."}, {"url": "https://thisisreno.com/2020/03/unr-students-ordered-to-vacate-residence-halls-by-march-25/", "title": "UNR: Students to vacate residence halls by March 25", "authors": [], "date": "2020-03-19", "keywords": ["residence", "email", "student", "25", "halls", "today", "unr", "reno", "vacate", "students", "sent", "work", "need"], "summary": "We need your help This Is Reno has been been hit incredibly hard by COVID-19.\n$5.00 $25.00 $100.00 Custom Amount: $ Contribute now Powered byA University of Nevada, Reno student sent to the following email that was emailed to students today ordering students to vacate residence halls by March 25 at 5 p.m.University spokesperson Kerri Garcia disputed that the email below was not an order but that UNR “made the decision that residents need to move…by March 25, 2020.\n“Residential Life staff will review all of these situations and then work with each student on a scenario that best fits their situation.\nWe will of course lock and secure students’ rooms and then work with them to identify a date/time when conditions are better to check out.\nIt will be important for students to respond to the survey sent by their Resident Director so we can appropriately work with them.”The email sent to students today"}, {"url": "https://www.ktnv.com/news/5-0-earthquake-hits-near-carson-city", "title": "5.0 earthquake hits near Carson City", "authors": [], "date": "2020-03-21", "keywords": ["earthquake", "usgs", "carson", "hits", "city", "50", "preliminary", "service", "websitedid", "centered", "near"], "summary": "CARSON CITY (KTNV) — US Geological Service is reporting a preliminary 5.0 earthquake near Carson City.\nThe earthquake centered about 3 miles from Indian Hills, Nevada.\nUSGS has the full details on their website.\nDid you feel the preliminary M 5.0 earthquake centered near Carson City?\nIf so, please report it to the @USGS at the link below:https://t.co/L2fisXZLz6 — NWS Reno (@NWSReno) March 21, 2020"}, {"url": "https://www.rgj.com/story/news/2020/03/22/coronavirus-closures-reno-midtown-business-owners-impact/2893786001/", "title": "Midtown business owners worried, optimistic through early days of coronavirus closure", "authors": ["Marcella Corona", "Published A.M. Pt March"], "date": "2020-03-22", "keywords": ["restaurants", "business", "optimistic", "closure", "businesses", "owners", "early", "days", "open", "reno", "woman", "marcella", "coronavirus", "midtown", "close", "worried", "owner"], "summary": "Reno Gazette JournalEditor's note: This content is being provided for free as a public service to our readers during the coronavirus outbreak.\nSeveral cars passed through the rapidly redeveloping business district, despite the road closures and construction work on South Virginia Street.\n'You must shut down': Businesses close doors amid outbreakOn Friday, Gov.\n“My beliefs are, when you have an open business, you want people to come in and feel a little happiness,” Gutierrez said.\nSchneider said she supported Sisolak’s formal mandate to close businesses to keep the virus from spreading."}, {"url": "https://www.rgj.com/story/news/education/2020/03/19/list-daycares-still-open-and-closed-washoe-county/2870239001/", "title": "LIST: Daycares can stay open during COVID-19 closures. See which ones are open, closed", "authors": ["Siobhan Mcandrew", "Published A.M. Pt March"], "date": "2020-03-19", "keywords": ["closures", "closedhead", "start", "ones", "center", "child", "learning", "kids", "closed", "open", "preschool", "list", "christian", "school", "stay", "openthe", "daycares", "covid19"], "summary": "CLOSEEditor's note: This list was from the Washoe County Health District from data as of March 18, 2020.\nDaycares are among the businesses staying open after Gov.\nSteve Sisolak told nonessential businesses to close over concerns about the spread of the coronavirus.\nThe Reno Gazette Journal has reached out to Sisolak for comment on daycares and his administration's decision to allow those to stay open.\nAccording to data from the Washoe County Health District, the majority of daycare centers were still open as of March 18: 60 are open and 36 are closed."}, {"url": "https://lasvegassun.com/news/2020/mar/25/a-timeline-of-the-coronavirus-crisis-in-las-vegas/", "title": "A timeline of the coronavirus crisis in Las Vegas", "authors": ["Unlv Photo Services"], "date": "2020-03-25", "keywords": ["county", "district", "sisolak", "steve", "timeline", "clark", "announces", "las", "vegas", "coronavirus", "nevada", "crisis"], "summary": "Steve Sisolak announces that the federal government approved testing for the virus at two commercial labs, joining two public labs.\n• March 10: MGM Resorts International announces that it is temporarily closing buffets at its Las Vegas Strip properties.\nIt’s a major blow to Las Vegas, which counts the opening weekend of the men’s tournament as one of its busiest of the year.\n• March 14: Cirque du Soleil, creator of many of the most popular shows in Las Vegas, says it is temporarily suspending its productions in Las Vegas and around the world.\n• March 16: The Roman Catholic Diocese of Las Vegas cancels Mass at least through the April 5 weekend, a week before Easter."}, {"url": "https://www.cnbc.com/2020/03/30/tesla-gigafactory-employee-tests-positive-for-covid-19-internal-memo.html", "title": "Tesla Gigafactory employee tests positive for COVID-19, says internal memo", "authors": ["Lora Kolodny"], "date": "2020-03-30", "keywords": ["employee", "gigafactory", "positive", "day", "internal", "tests", "infected", "sent", "coronavirus", "memo", "tesla", "employees", "musk", "covid19"], "summary": "An employee at Tesla's sprawling battery plant outside of Reno, Nevada, has tested positive for COVID-19 according to internal communications obtained by CNBC.\nA memo sent to Panasonic North America employees who work in the Gigafactory on March 29 said the infected Tesla employee was sent home on Saturday, March 21, after being on-site for an hour and feeling ill.\nThese people told CNBC the infected Tesla employee was sent home on the same day that Tesla and Panasonic implemented temperature-screening measures at the plant.\nTesla finally told the county on March 26 that it also plans to reduce the number of workers at the Gigafactory by around 75%.\nTesla shares finished down 2.4% on Monday on an otherwise mostly positive day for tech stocks and the market overall."}, {"url": "https://www.rgj.com/story/news/2020/03/23/unr-tmcc-return-spring-break-amid-closed-campuses/2903713001/", "title": "UNR, TMCC return from spring break amid closed campuses", "authors": ["Siobhan Mcandrew", "Published P.M. Pt March"], "date": "2020-03-23", "keywords": ["campuses", "spring", "closed", "unr", "break", "amid", "president", "online", "classes", "students", "faculty", "nevada", "public", "reno", "return", "tmcc"], "summary": "Reno Gazette JournalAs thousands of students returned from spring break at the University of Nevada, Reno and Truckee Meadows Community College, it wasn't college as usual.\nUNR, TMCC and Nevada's five other public colleges jumped into remote learning Monday in the wake of the coronavirus pandemic.\nAt UNR, students were moving out of residence halls, told to find other housing.\nFor at least 30 days, UNR and TMCC will deliver classes online.\nSteve Sisolak said there was a state hiring freeze, hiring essential positions can still occur for the UNR President, McCabe said."}, {"url": "https://thisisreno.com/2020/04/podcast-this-months-going-to-be-really-tough-covid-19/", "title": "PODCAST: This month’s going to be really tough (COVID-19)", "authors": ["Bob Conrad"], "date": "2020-04-03", "keywords": ["going", "sisolak", "steve", "months", "health", "tough", "vegas", "really", "schieve", "outlets", "nevada", "public", "reno", "covid19", "podcast"], "summary": "Reno Mayor Hillary Schieve is echoing Nevada Governor Steve Sisolak’s directive this week ordering people to stay at home.\nWe hear from both of them about what’s being done in the Silver State to deal with COVID-19.\nAlso: The news media, particularly small, independent outlets, are suffering as a result of COVID-19.\nThe problem with news outlets going out of business is that when people need information, they frequently turn to news sources.\nSteve Sisolak discusses measures to help the public with housing stability amid the COVID-19 public health crisis at a press conference at the Grant Sawyer Building in Las Vegas, Sunday, March 29, 2020."}, {"url": "https://townline.org/obituaries-for-thursday-march-26-2020/", "title": "OBITUARIES for Thursday, March 26, 2020", "authors": ["Website Editor"], "date": "2020-03-25", "keywords": ["family", "augusta", "2020", "waterville", "service", "26", "wife", "obituaries", "husband", "son", "life", "brann"], "summary": "MERLAND L. O’NEAL SR.OAKLAND – Merland L. O’Neal Sr., 63, passed away on Turesday, March 10, 2020, following a courageous battle with cancer.\nHELEN F. CAREYWINSLOW – Helen (Fortin) Carey, 88, of Winslow, formerly of Belgrade, passed away Thursday, March 12, 2020, at home.\nFAITH M. BRANNCOOPERS MILLS – Faith Marie Brann, 67, of Coopers Mills, passed away on Thursday, March 12, 2020.\nROLLAND R. CHURCHILLSKOWHEGAN – Rolland Robert “Bob” Churchill, 91, passed away Friday, March 13, 2020, at Maine Veterans Home, in Augusta.\nA memorial service will be held at 11 a.m., Saturday, June 20, 2020, at St. Mark’s Episcopal Church, Waterville, Maine."}, {"url": "https://www.theguardian.com/us-news/2020/mar/30/las-vegas-parking-lot-homeless-shelter", "title": "Las Vegas parking lot turned into 'homeless shelter' with social distancing markers", "authors": ["Mario Koran"], "date": "2020-03-30", "keywords": ["distancing", "parking", "center", "markers", "social", "vegas", "turned", "las", "city", "lot", "sleeping", "coronavirus", "shelter", "homeless"], "summary": "Officials turned a parking lot into a makeshift shelter, saying spaces for sleeping were drawn 6ft apart in observance of federal social distancing guidelines.\nPhotograph: Ethan Miller/Getty ImagesOfficials set up the new shelter in the parking lot of the Cashman Center, which most recently has hosted soccer games.\nThe blue mats laid down for people to sleep are easier to clean than the 24,000-sq-ft carpet squares volunteers had first used at the parking lot, which cannot be power washed.\nA Mancino-Williams (@Manda_like_wine) Nevada, a state in one of the richest countries in the world, has painted social-distancing boxes on a concrete parking lot for the homeless to sleep in.\nJulián Castro (@JulianCastro) After criminalizing homelessness this year, Las Vegas is now packing people into concrete grids out of sight."}, {"url": "https://techcrunch.com/2020/03/19/tesla-to-temporarily-shut-down-fremont-factory/", "title": "Tesla to temporarily shut down Fremont factory – TechCrunch", "authors": [], "date": "2020-03-19", "keywords": ["delivery", "order", "factory", "told", "shut", "fremont", "employees", "service", "tesla", "techcrunch", "operations", "temporarily", "vehicles"], "summary": "Tesla’s factory and a number of its other facilities are located in and around Fremont, which is within Alameda County.\nTesla kept the Fremont factory open despite the order, claiming that part of the company’s operations fell under an exemption in the county’s order.\nAs such, we have decided to temporarily suspend production at our factory in Fremont, from end of day March 23, which will allow an orderly shutdown.\nWorkers prep for deliveriesAs Tesla winds down the Fremont factory, the activity is shifting to its delivery operations.\nCurrent Tesla employees have told TechCrunch that communication about operations in California, one of its biggest markets, has been inconsistent and unclear as the COVID-19 pandemic has spread."}, {"url": "https://www.jweekly.com/2020/03/20/deaths-for-the-week-of-march-20-2020/", "title": "Deaths for the week of March 20, 2020 – J.", "authors": [], "date": "2020-03-20", "keywords": ["san", "family", "california", "20", "2020", "j", "great", "survived", "deaths", "week", "francisco", "son", "grandchildren", "university", "school"], "summary": "Hillie grew up in San Francisco and was the youngest son of seven children.\nThey moved from the suburbs of Chicago to the suburbs of San Francisco and raised their two daughters, Gwen and Betsey, in the Bay Area.\nJoan was a woman of great style, great personal charm and great warmth.\nShe attended Oakland High School, University of Colorado in Boulder and graduated from University of California Berkeley.\nEdie was born in Boston, Massachusetts and moved with her parents, Alice and Morris, and her brother Harold to San Francisco before the onset of World War II."}, {"url": "https://petergreenberg.com/2020/04/07/peter-answers-your-emails-round-2/", "title": "Peter Answers Your Emails: Round 2", "authors": ["Peter Greenberg", "Peter Greenberg Worldwide"], "date": "2020-04-07", "keywords": ["emails", "trip", "flight", "cruise", "answers", "insurance", "airlines", "travel", "wait", "peter", "refund", "round", "credit", "cancel"], "summary": "We had booked his airfare through Justfly, bought travel insurance and despite all that, we have not been able get a refund.\nThe travel insurance company refused to cover for cancellations due to Coronavirus for all trips booked after Jan 22, 2020.\nEMAIL: Bev Demko Reynoldsburg OhioPeter,you said that if you cancel (trip, airfare, etc.)\nWe did have trip insurance through Windstar, with a company called TripMate, but it was a nightmare claiming it.\nAs for your insurance, most travel insurance contains specific language excluding coverage for pandemics."}, {"url": "https://seekingalpha.com/article/4334007-lithium-miners-news-for-month-of-march-2020", "title": "Lithium Miners News For The Month Of March 2020", "authors": ["Matt Bohlsen"], "date": "2020-03-25", "keywords": ["miners", "2020", "production", "ganfeng", "month", "2019", "million", "hydroxide", "plant", "company", "lithium", "battery"], "summary": "Jiangxi Ganfeng Lithium [SHE:002460] [HK: 1772], Mineral Resources [ASX:MIN], International Lithium Corp. [TSXV:ILC] (ILHMF)No significant news for the month.\n(Chengdu) Tianqi Lithium Industries Inc. [SHE:002466]On March 22, 4-traders reported:Tianqi Lithium: China's Tianqi postpones commissioning of Australia lithium plant amid liquidity problems.\nThird-party vendors are engaged to engineer and design lithium carbonate and lithium hydroxide evaporator and crystallizer as well as provide performance guarantees and product samples.\nTianqi Lithium postpones commissioning of Australia lithium plant amid liquidity problems.\nDisclosure: I am/we are long NYSE:ALB, JIANGXI GANFENG LITHIUM [SHE: 2460], JIANGXI GANFENG LITHIUM [HK: 1772], SQM (NYSE:SQM), ASX:ORE, ASX:GXY, ASX:PLS, ASX:AJM, AMS:AMG, TSX:LAC, TSXV:NLC, ASX:AVZ, ASX:CXO, ASX:NMT."}, {"url": "https://www.staradvertiser.com/2020/03/21/breaking-news/las-vegas-mayor-and-nevada-governor-spar-over-casino-closures-amid-coronavirus-outbreak/", "title": "Las Vegas mayor and Nevada governor spar over casino closures amid coronavirus outbreak", "authors": ["Associated Press"], "date": "2020-03-21", "keywords": ["closures", "casino", "goodman", "governor", "sisolak", "businesses", "state", "mayor", "vegas", "las", "week", "coronavirus", "spar", "nevada", "outbreak", "shutdown"], "summary": "Las Vegas Mayor Carolyn Goodman became an outspoken outlier by declaring that her city should be allowed to stay open for business.\nNevada has tallied two deaths and more than 100 cases of COVID-19, almost all in the Las Vegas area.\nLas Vegas is not like New York, Los Angeles or San Francisco, she said in her prepared comments to the City Council.\nIn Nevada, almost three-fourths of positive cases of COVID-19 have been in the Las Vegas area.\n— Las Vegas Metropolitan Police Department officers today began checking businesses for compliance with Sisolak’s shutdown order, the department said."}, {"url": "https://cdapress.com/news/2020/mar/23/5-legals-for-march-23-2020/", "title": "Legals for March, 23 2020", "authors": [], "date": "2020-03-23", "keywords": ["county", "legals", "kootenai", "district", "2020", "post", "idaho", "23", "claims", "clerk", "falls", "legal", "court"], "summary": "March 23, 2020 12:00 AMSUMMARY OF POST FALLS ORDINANCE NO.\n1378 The City of Post Falls, Kootenai County Idaho hereby gives notice of the adoption of Post Falls Ordinance No.\n1379 The City of Post Falls, Kootenai County, Idaho hereby gives notice of the adoption of Post Falls Ordinance No.\n1380 The City of Post Falls, Kootenai County, Idaho hereby gives notice of the adoption of Post Falls Ordinance No.\nDated: March 18, 2020 JIM BRANNON KOOTENAI COUNTY DISTRICT COURT By: /s/ Susan McCoy County Deputy Clerk CDA LEGAL 3338 AD#372379 MARCH 23, 30, APRIL 6, 13, 2020"}, {"url": "https://www.leafly.com/news/industry/is-my-dispensary-open-for-marijuana-delivery", "title": "Is my dispensary open and can they deliver cannabis right now?", "authors": ["David Downs", "Max Savage Levenson"], "date": "2020-04-14", "keywords": ["stores", "deliver", "delivery", "curbside", "cannabis", "businesses", "dispensaries", "open", "right", "medical", "dispensary", "order", "essential"], "summary": "To find delivery options near you, try Leafly’s Canadian cannabis delivery finderLooking for cannabis pickup or delivery?\nMedical cannabis dispensaries are open.\nAre cannabis dispensaries open in California?\nSince March 19, California is under a statewide stay at home order, but officials have deemed cannabis “essential.” Cannabis stores and farms may remain open, subject to county rules.\nAre medical cannabis dispensaries open in Missouri?"}, {"url": "https://merrillfotonews.com/2020/04/01/alice-jane-aj-oday/", "title": "Alice Jane ‘AJ’ Hamlin O’Day", "authors": ["More Author"], "date": "2020-04-01", "keywords": ["jane", "family", "st", "alice", "oday", "jim", "returned", "merrill", "south", "school", "aj", "hamlin"], "summary": "Alice Jane, also known as ‘AJ’, was the first of twelve children born to James Harvey Hamlin and Margaret Running, born on 15 Mar 1929 at Holy Cross Hospital in Merrill, WI.\nAnd while the guys saw Jim O’Day as a great addition to the MHS sports program, she saw him as date potential and asked him to the turnabout dance in their sophomore year.\nThey returned to South Bend so Jim could enter the ND Master’s program while AJ worked in the university library.\nBy September of the next year, Newman was open and the O’Day family packed up for Wausau.\nAJ mourned the passing of her husband, Jim, in 2007; their infant son, Kieran Patrick, in 1967; her father James Harvey Hamlin, in 1953, and mother Margaret Running Hamlin, in 1984; her in-laws, John “Jack” O’Day in 1960 and Eloise (Shafer) O’Day, in 1984, all of Merrill."}, {"url": "https://www.capradio.org/articles/2020/03/13/as-coronavirus-cases-mount-nevada-declares-emergencies-braces-for-impact-on-casinos/", "title": "As Coronavirus Cases Mount, Nevada Declares Emergencies, Braces For Impact On Casinos", "authors": ["Bert Johnson"], "date": "2020-03-13", "keywords": ["city", "mount", "coronavirus", "nevada", "impact", "emergencies", "dick", "step", "washoe", "ready", "explained", "sisolak", "cases", "health", "declares", "casinos", "braces", "reno", "care"], "summary": "On Friday, the city of Reno did the same — even though at that point, Washoe County only had three confirmed cases.\nMeanwhile, public concerns over the virus have already caused declining business in Nevada, where the economy largely relies on tourism.\nAt a separate press conference earlier in the day, Washoe County District Health Officer Kevin Dick explained that public health officials could force casinos to close if the situation were grave enough.\n“We are not near any point in making that decision right now.”In the near term, Dick explained that a statewide shortage of health care providers makes prevention efforts even more crucial.\n“Based on the number of health care providers and access to health care that we have, which is low versus other states in the nation, if we do have an outbreak that will put more strain on our health care system,” he said."}, {"url": "https://www.rgj.com/story/news/2020/03/14/coronavirus-updates-what-we-know-reno-sparks-las-vegas-nevada/5049728002/", "title": "Coronavirus updates: COVID-19 is spreading locally. District says 'it's a wake-up call'", "authors": ["Marcella Corona", "Ed Komenda", "Published A.M. Pt March"], "date": "2020-03-14", "keywords": ["county", "district", "washoe", "wakeup", "state", "updates", "locally", "health", "vegas", "coronavirus", "spreading", "resorts", "covid19", "dick"], "summary": "(Photo: Andy Barron/RGJ)Health District says COVID-19 now spreading locally: 'It's a wake-up call'The Washoe County Health District staged a press briefing Saturday afternoon after announcing the fourth positive case of COVID-19 in Washoe County, the 21st in the state.\nFourth coronavirus case reported to Washoe County Health DistrictThe Washoe County Health District announced another man in his 20s, who has not traveled outside of the county, tested presumptive positive for the COVID-19 coronavirus.\nBuy Photo Washoe County officials hold a press conference on the Coronavirus at the Washoe County Administration Complex on Friday March 13, 2020.\nConcerned residents should contact their healthcare provider, telemedicine provider or call the Washoe County Health District at 311 or at 775-328-2427.\nResidents who believe they are showing symptoms should not call 911, and instead, call 311 or the Washoe County Health District at 775-328-2427."}, {"url": "https://thisisreno.com/2020/01/photos-womens-march-draws-thousands/", "title": "PHOTOS: Women’s March draws thousands", "authors": ["Don Dike Anukam"], "date": "2020-01-19", "keywords": ["draws", "multiple", "college", "standoffs", "radio", "reno", "womens", "talkshow", "range", "involved", "thousands", "public", "speeches", "photos"], "summary": "Don Dike-Anukam is a Reno native attending college in northern Nevada.\nHe has been involved in activist politics for 15 years on and off, and has been involved in multiple campaigns in multiple positions in that time.\nHe also was a college radio political, news, and talk-show host covering a range of stories from hostage standoffs, fires, interviews, and public speeches."}, {"url": "https://www.rgj.com/story/news/2020/03/09/coronavirus-updates-2nd-washoe-man-tests-presumptively-positive-briefing-11/5001143002/", "title": "UPDATES: Washoe County School District says all out-of-state travel is canceled", "authors": ["Sam Gross", "Siobhan Mcandrew", "Jim Krajewski", "Published A.M. Pt March"], "date": "2020-03-09", "keywords": ["county", "district", "canceled", "washoe", "united", "updates", "outofstate", "health", "travel", "coronavirus", "students", "nevada", "staff", "school", "covid19"], "summary": "----------------School district canceling all out-of-state travel for sports, academic eventsWith spring break coming up over the next two weeks, March 14-28, many high school athletic teams have trips to California planned for competition there.\nThe Washoe County School District canceled all out-of-state athletic trips on Monday, citing concerns over the coronavirus outbreak.\nOn the school district website, administrators wrote: \"We have made the difficult decision to cancel all out-of-state and all international district-sponsored student and staff travel including conferences, athletics, and academic related activities until further notice.\nBishop Manogue is not in the school district, but athletic director Jason Sterrett said the school will follow WCSD recommendations with regards to athletic and academic events outside of the state.\nThe health district over the weekend announced the second presumptively positive test from a man in his 30's began presenting symptoms after traveling to Santa Clara, California."}, {"url": "https://thisisreno.com/2020/01/reno-2020-new-year-downtown/", "title": "PHOTOS: Biggest Little City rings in new decade", "authors": ["Ty O'Neil"], "date": "2020-01-01", "keywords": ["downtown", "warren", "little", "ty", "yearcheck", "decade", "rings", "words", "washoe", "officers", "city", "wish", "biggest", "department", "reno", "photos"], "summary": "Images by Ty O’Neil | Cover photo by Trevor BexonReno roared into 2020 last night with a major fireworks show put on by casino properties, The Row.\nThousands came to downtown to celebrate the new year, though attendance appeared sparse compared with past New Year’s Eve celebrations.\nLaw enforcement was out in full force, including mounted officers, bike cops and Washoe County Sheriff’s deputies.\nA Reno Police spokesperson said that 21 people were arrested downtown for various infractions — mostly misdemeanors.\nAt one point, the Reno Fire Department closed the entrance to Harrah’s for a suspected Hazmat incident."}, {"url": "https://www.latimes.com/california/story/2020-03-22/californians-flee-cities-as-coronavirus-pandemic-spreads", "title": "Hoping to escape coronavirus, city dwellers are fleeing to California’s deserts and mountains", "authors": ["Staff Writer", "Louis Sahagun Is A Staff Writer At The Los Angeles Times. He Covers Issues Ranging Religion", "Culture", "The Environment To Crime", "Politics", "Water. He Was On The Team Of L.A. Times Writers That Earned The Pulitzer Prize In Public Service For A Series On Latinos In Southern California", "The Team That Was A Finalist In For The Pulitzer Prize In Breaking News. He Is A Ccnma", "Latino Journalists Of California Board Member", "Author Of The Book", "Master Of The Mysteries"], "date": "2020-03-22", "keywords": ["mammoth", "rentals", "joshua", "angeles", "tree", "fleeing", "californias", "deserts", "city", "dwellers", "mountains", "escape", "coronavirus", "town", "residents", "hoping", "los"], "summary": "Along the way, a distressing advisory came over her cellphone: A client in Los Angeles had just auto-booked the place for three weeks.\nJoshua Tree, a threadbare desert oasis roughly 130 miles east of Los Angeles, has been inundated.\nGina Grande, who left her apartment in San Francisco to escape the coronavirus shutdown, takes a stroll in the desert next to her home in Joshua Tree.\nTracy Fisher managed to leave Italy just as the coronavirus was exploding and now enjoys the isolation of her home overlooking Yucca Mesa in Joshua Tree.\nNow, many of those vacancies are snapped up by city residents and owners of shared-home rentals with plans to hunker down for months, if necessary."}, {"url": "https://www.myarklamiss.com/news/national-news/four-dead-including-two-juveniles-in-murder-suicide/", "title": "Four dead, including two juveniles, in murder-suicide", "authors": ["Seth Borenstein", "Associated Press", "The Associated Press", "Matthew Brown"], "date": "2020-03-05", "keywords": ["county", "murdersuicide", "washoe", "dead", "including", "died", "juveniles", "according", "nevada", "withheld", "reno", "app"], "summary": "Reno, Nevada (NBC)(03/05/20)— Four people, including two juveniles, were found dead in a Reno, Nevada, home on Wednesday in what police believe is a murder-suicide.\nThe identities of the dead were being withheld pending confirmation by the Washoe County Medical Examiner’s Office.\nTwo of the dead are said to be juveniles who attended Damonte Ranch High School.\nThe Washoe County School District said in a statement that “two of our students died following a domestic situation in their home,” according to KRNV.\nStay up to date with the latest news by downloading the KTVE/KARD News App from the App Store or Google Play."}, {"url": "https://www.rgj.com/story/news/money/business/2020/03/12/2020-united-states-bowling-congress-tournament-initially-scheduled-reno-national-bowling-stadium-mar/5038249002/", "title": "2020 USBC Open Championship in Reno postponed until May due to coronavirus concerns", "authors": ["Jason Hidalgo", "Published P.M. Pt March"], "date": "2020-03-12", "keywords": ["usbc", "concerns", "stadium", "event", "saidthe", "2020", "championship", "postponed", "bowling", "open", "womens", "teams", "coronavirus", "senior", "tournament", "reno"], "summary": "CLOSEBuy Photo The National Bowling Stadium at 300 N. Center St. in downtown Reno May, 22, 2019.\n(Photo: Andy Barron/RGJ)The United States Bowling Congress announced on Thursday that it is postponing its 2020 Open Championship until May “due to COVID-19 safety concerns.”The annual bowling tournament was originally scheduled to be held at the National Bowling Stadium in Reno on March 21.\nThe USBC is also postponing or suspending the following events:USBC Women’s ChampionshipsUSBC ConventionUSBC MastersUSBC Senior QueensThe USBC Women’s Championships will be rescheduled for May 1 as well.\nThe USBC Masters, USBC Senior Queens and USBC Convention are indefinitely postponed and will be rescheduled later in 2020 “as public health conditions allow.”“USBC made this difficult decision out of concern for the health and safety of our members, their families and local communities,” the organization said.\nThe USBC Open Championship is the latest event to be impacted by concerns surrounding the coronavirus."}, {"url": "https://heavy.com/news/2020/03/joan-huber-2/", "title": "Joan Huber: Irish Woman Killed Family in Reno, Nevada, Cops Say", "authors": ["Jessica Mcbride"], "date": "2020-03-08", "keywords": ["family", "kerry", "huber", "high", "woman", "killed", "say", "irish", "husband", "nevada", "joan", "school", "teenage", "reno", "cops"], "summary": "Joan Huber is a mother and wife originally from County Kerry, Ireland who police say shot and killed her husband and two teenage sons before killing herself in Reno, Nevada.\nHuber’s children attended Damonte Ranch High School, which has suffered a string of tragedies recently.\nThe family lived in a four-bedroom home in Reno on “a quiet cul de sac,” according to the Reno Gazette Journal.\nThis appears to be an isolated incident and there is no threat to the community.”Authorities later identified the victims as the Hubers, and the suspected perpetrator as Joan Huber.\nAccording to KOLO-TV, two other high school students died in January and February of accidental drug overdoses."}, {"url": "https://www.reviewjournal.com/news/politics-and-government/nevada/5-new-cases-of-covid-19-reported-in-washoe-nevada-total-at-26-1981886/", "title": "5 new cases of COVID-19 reported in Washoe, Nevada total at 26", "authors": ["Las Vegas Review-Journal"], "date": "2020-03-16", "keywords": ["county", "airport", "washoe", "disease", "cases", "reported", "26", "health", "passengers", "plane", "area", "nevada", "total", "reno", "covid19"], "summary": "The five new cases, which brings the Reno area total to nine, are all travel-related or connected to a previously identified local case.\n(NIAID-RML via AP)RENO — Northern Nevada logged five new cases of COVID-19 Sunday, health officials in Washoe County announced, bringing Nevada’s total to 26.\nA chartered 737 carrying the passengers from San Diego was bound for Las Vegas after first stopping in Reno.\nThe five new cases, which brings the Reno area total to nine, are all travel-related or connected to a previously-identified local case.\nThe Washoe County Health District said the five were three women and two men ranging in age from their 20s to their 40s."}, {"url": "https://www.8newsnow.com/news/local-news/snow-returns-to-reno-sparks-area-and-sierra-nevada/", "title": "Snow returns to Reno-Sparks area and Sierra Nevada", "authors": ["Kaitlyn Olvera", "The Associated Press", "Nexstar Media Wire", "Cbs News"], "date": "2020-03-01", "keywords": ["returns", "snow", "tahoe", "renosparks", "reports", "morning", "lake", "area", "nevada", "reported", "reno", "sierra"], "summary": "RENO, Nev. (AP) — After an unusually dry and warm February, snow has returned to the Reno-Sparks area and the Sierra Nevada.\nSnow returns to the Reno-Sparks, Tahoe areas.\nCourtesy: Meghan BreenSnow returns to the Reno-Sparks, Tahoe areas.\npic.twitter.com/XkoIf5l55e — NWS Reno (@NWSReno) March 1, 2020Chain controls are widespread in the Sierra and Lake Tahoe region.\nSouth Lake Tahoe reported 8 inches of snow by mid-morning Sunday."}, {"url": "https://thisisreno.com/2020/03/the-biggest-little-virus-covid-19-in-washoe-county/", "title": "The biggest little virus: COVID-19 in Washoe County", "authors": ["Eric Marks"], "date": "2020-03-10", "keywords": ["county", "little", "washoe", "confirmed", "report", "media", "health", "virus", "coronavirus", "biggest", "outlets", "covid19"], "summary": "Feature image: Trevor BexonThe first report of Coronavirus in Washoe County came last week.\nThe Washoe County Health District issued a statement that it had received a possible positive report of Novel Coronavirus (COVID-19) in a 50-year-old resident, and his test was sent to the Centers for Disease Control and Prevention for verification.\nOn Sunday, WCHD announced a second potential case of Coronavirus in a Washoe County resident, a male in his 30s.\nLocal officials’ takeLocal health officials say they have been “working diligently to conduct a ‘Contact Tracing Investigation’ of those who had close contacts with this individual,” according to Washoe County Health Officer Kevin Dick.\nHe then expressed that the safety, health and well-being of Washoe County residents and employees was of the utmost importance to the county, and himself personally."}, {"url": "https://www.rgj.com/story/news/education/2020/03/14/coronavirus-nevada-covid-19-tests-unr/5047724002/", "title": "Coronavirus in Nevada: An exclusive look inside the lab where the state tests for COVID-19", "authors": ["Siobhan Mcandrew", "Published P.M. Pt March"], "date": "2020-03-14", "keywords": ["testing", "lab", "positive", "state", "pandori", "inside", "health", "look", "tests", "coronavirus", "test", "exclusive", "nevada", "samples", "covid19"], "summary": "CLOSE Nevada State Public Health Laboratory Director Dr. Mark Pandori shows us how they test samples for COVID-19.\nWhen they arrive, it takes a team of experts from the Nevada State Health Laboratory about four hours to know if the sample has tested positive for COVID-19.\nBuy Photo The Nevada State Public Health Lab in Reno on March 13, 2020.\nBuy Photo Director Mark Pandori holds a test kit for COVID-19 at the Nevada State Public Health Lab in Reno on March 13, 2020.\nBuy Photo Dr. Andrew Gorzalski tests samples for COVID-19 at the Nevada State Health Laboratory in Reno on March 13, 2020."}, {"url": "https://knpr.org/knpr/2020-03/unemployment-official-everyone-should-try", "title": "Unemployment official: ‘Everyone should try’", "authors": ["Mar"], "date": "2020-03-16", "keywords": ["workforce", "state", "states", "unemployment", "official", "try", "training", "staffing", "website", "employment", "department", "detr"], "summary": "Are they eligible for unemployment benefits?\nThey might be, says Rosa Mendez, spokeswoman for the Nevada Department of Employment, Training and Rehabilitation, or DETR.\nThat bill would, among other things, enhance qualifying states’ unemployment insurance programs and loosen applicant’s restrictions to qualify for it.\nThat’s the state’s workforce development program, kind of like the government’s version of Indeed.\nOn March 16, DETR expanded staffing to handle an expected spike in unemployment insurance claims, according to a news release."}, {"url": "https://thisisreno.com/2020/03/video-snake-on-a-plane-out-of-reno-tahoe-startles-passengers/", "title": "EXCLUSIVE VIDEO: Snake on a plane out of Reno-Tahoe startles passengers", "authors": ["Bob Conrad"], "date": "2020-03-02", "keywords": ["stowaway", "snake", "video", "passenger", "flight", "passengers", "plane", "wanted", "today", "air", "spotted", "exclusive", "unlikely", "renotahoe", "startles"], "summary": "Alaska Air flight 2706, operated by Horizon air, had an unlikely stowaway today: a snake.\nA black-and-white snake was spotted slithering below passenger seats on the plane.\nWhen spotted, the snake was quickly recognized as a pet.\nShe says it is a very friendly snake, said a passenger who shot the video and wanted to remain anonymous.\nThe flight was heading from Reno/Tahoe to Portland."}, {"url": "https://thisisreno.com/2020/03/coronavirus-reno-massive-sweep-of-homeless-camps/", "title": "PODCAST: Coronavirus reaches Reno, City conducts massive sweep of homeless camps", "authors": ["Bob Conrad"], "date": "2020-03-09", "keywords": ["sweep", "starbuck", "massive", "city", "coronavirus", "residents", "conducts", "camps", "tracks", "reaches", "podcast", "homeless", "lucia", "officials", "near", "town", "school", "reno", "image"], "summary": "SUBSCRIBEThe City of Reno last week ordered more than 150 houseless residents to move from where they were living along train tracks near the Reno Aces baseball stadium.\nWe hear from the first reporter on the scene, Lucia Starbuck from Our Town Reno.\nWe hear from health officials about the Coronavirus in the Reno area, as well as Washoe County Sheriff Darin Balaam’s approach to hand-washing.\nSpecial thanks to Scott King and Lucia Starbuck from Our Town Reno for reporting used in this show.\nCover image: Homeless encampments near the tracks after a massive sweep."}, {"url": "https://www.rgj.com/story/news/2020/03/15/avalanche-danger-sierra-nevada-mountains-lake-tahoe-winter-storm/5054180002/", "title": "With resorts closed, skiers considering Sierra backcountry find high avalanche risk", "authors": ["Benjamin Spillman", "Published A.M. Pt March"], "date": "2020-03-15", "keywords": ["slabs", "snow", "deep", "advisory", "storm", "backcountry", "slab", "risk", "closed", "high", "considering", "sierra", "terrain", "avalanche", "skiers", "resorts"], "summary": "The combination of the first fresh powder in months and potentially thousands of skiers and snowboarders without resort access is increasing concerns that people could be tempted to head into avalanche terrain.\nThe Sierra Avalanche Center has a word of advice.\n\"Conditions are dangerous and travel in or below avalanche terrain is not recommended.\nA deep slab avalanche occurs when the slab of snow that breaks loose is deep in the snowpack, or sometimes all the way to the ground.\n\"Becoming caught in a deep slab avalanche near or below treeline may not be survivable,\" the advisory noted."}, {"url": "https://www.rgj.com/story/news/2020/04/01/former-nevada-gov-brian-sandoval-applies-unr-president/5101568002/", "title": "Former Gov. Brian Sandoval applies for UNR president, steps down from MGM position", "authors": ["Siobhan Mcandrew", "Published A.M. Pt April"], "date": "2020-04-01", "keywords": ["university", "public", "applies", "governor", "search", "gov", "brian", "unr", "president", "sandoval", "position", "nevada", "steps", "mgm", "reno", "resorts"], "summary": "CLOSE Nevada Governor Brian Sandoval prepares for life in the private sector after leading the state for the past 8 years.\nBrian Sandoval has applied for the top post at the University of Nevada, Reno.\nSandoval has long been rumored to be interested in applying to become the 17th president of UNR.\nMore: Sandoval on leaving public officeSandoval, who served two terms as governor, has been the president of global gaming development at MGM Resorts since leaving office in January 2019.\n“We are grateful to Governor Sandoval for all that he has accomplished in his time at MGM Resorts."}, {"url": "https://thisisreno.com/2019/12/photos-reno-year-in-review-for-2019/", "title": "PHOTOS: Reno year in review for 2019", "authors": ["Ty O'Neil"], "date": "2019-12-27", "keywords": ["downtown", "photographer", "ty", "image", "laue", "rodeo", "2019", "oneil", "review", "nevada", "reno", "photos"], "summary": "Revelers rang in 2019 in frigid, 20-degree temperatures in downtown Reno.\nThe third annual women’s march was Jan. 19 in downtown Reno and brought together hundreds of women that marched from the Reno Arch to the Reno City Plaza.\nRather than take the usual photos with campaign signs, podium and stage, photographer Ty O’Neil captured several images before Sanders took the mic.\nSenator Bernie Sanders speaks at the University of Nevada, Reno in his second of three visits to northern Nevada in 2019 for his 2020 presidential campaign.\nDía de los Muertos brought out thousands to enjoy the colorful celebrations along Wells Avenue and at the University of Nevada, Reno."}, {"url": "https://kslsports.com/432572/espns-fpi-projects-five-wins-by-utah-state-football-in-2020/", "title": "ESPN’s FPI Projects Five Wins By Utah State Football In 2020", "authors": ["Kyle Ireland", "Ksl Sports"], "date": "2020-04-15", "keywords": ["aggies", "play", "espns", "fpi", "2020", "state", "teams", "utah", "season", "win", "according", "wins", "projects", "football"], "summary": "LOGAN, Utah – ESPN’s Football Power Index (FPI) projects five wins by the Utah State Aggies in the upcoming 2020 college football season.\nUtah State owns a -7.8 FPI rating which ranked No.\nFPI gives Utah State nearly a 70 percent advantage in the late October game.\nUtah State is projected to pick up the win according to FPI.\nUtah State finished the regular season as a bowl-eligible team and ended the year with a 7-6 record."}, {"url": "https://patch.com/nevada/reno/reno-4th-july-fireworks-2019-guide-scheduled-time", "title": "Reno 4th Of July Fireworks: 2019 Guide, Scheduled Time", "authors": [], "date": "2019-06-17", "keywords": ["vendors", "post", "scheduled", "guide", "2019", "pm4th", "food", "4th", "fireworkswhere", "reno", "fireworks", "virginia", "fourth"], "summary": "RENO, NV— July 4th is quickly approaching, which means it's time to fire up that barbecue and find out what Fourth of July fireworks and festivities are going on near you this Independence Day.\nWe gathered up all the fireworks shows, parades and festivals happening in and around Reno so you can start planning now.\nHere's what's in store this July 4th in Reno:Star Spangled SparksWhat: Entertainment, Food Vendors, FireworksWhere: Nugget Casino ResortWhen: July 4, 2019/ 4:00 p.m.4th of July with Reno AcesWhat: Baseball GameWhere: Greater Nevada FieldWhen: July 4, 2019 / 6:35 p.m.4th of July with Reno PhilharmonicWhat: Performance, Food Vendors, FireworksWhere: Wingfield ParkWhen: July 4, 2019/ 5:00 p.m.- 9:30 p.m.4th of July in Virginia CityWhat: Parade, Entertainment, Concert, FireworksWhere: Virginia CityWhen: July 4, 2019/ 10:00 a.m. Fireworks begin at dusk.\n40th annual July 3rd Fireworks & Beach PartyWhat: Food, Beverages, Performances, FireworksWhere: Kings BeachWhen: July 3, 2019 / 7:00 p.m.- 10:00 p.m.Know of other events in the area?\nPost them on the Patch calendar or share details on our free Neighbor Post feature."}, {"url": "https://www.nevadabusiness.com/2019/11/rsar-releases-october-2019-existing-home-sales-report/", "title": "RSAR Releases October 2019 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2019-11-07", "keywords": ["homes", "sales", "existing", "report", "2018", "singlefamily", "median", "releases", "rsar", "2019", "decrease", "price", "increase"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its October 2019 report on existing home sales in Reno, Sparks and Fernley, including median sales price and number of home sales in the region.\nThe median sales price of existing condominium/townhomes in Reno-Sparks in October 2019 was $235,000; an 18 percent increase from a year ago.\nThe existing condominium/townhome median sales price for October 2019 in Reno was $275,000; a 26 percent increase from last year.\nThe existing condominium/townhome median sales price for October 2019 in Sparks was $182,250; an 8 percent decrease from last year.\nThe October 2019 report indicated that Fernley had 51 sales of existing single-family homes, an increase of 11 percent from October 2018 and a 28 percent increase from September 2019."}, {"url": "https://www.rgj.com/story/news/2020/02/04/reno-sparks-pedestrian-fatality-rate-wcsd-students-hit-nevada-public-safety/4599682002/", "title": "16 Reno-area pedestrians died in 2019, the deadliest in years. Here's why it's so bad", "authors": ["Sam Gross", "Published A.M. Pt Feb."], "date": "2020-02-04", "keywords": ["bad", "hit", "shaw", "died", "vehicle", "renoarea", "16", "reno", "incidents", "2019", "students", "deadliest", "according", "pedestrian", "school", "heres", "pedestrians"], "summary": "CLOSE A pedestrian was hit and killed by a Reno fire truck on 4th Street early Saturday morning, Oct. 19, 2019.\nMap: Here are the locations of deadly vehicle versus pedestrian crashes in the Reno-Sparks area in 2019.\nAs of late January, 25 WCSD students were involved in vehicle versus pedestrian injury crashes this school year, according to Kapuler.\nAs a comparison, the Clark County School District — the fifth-largest school district in the nation, with 320,000 students — had 29 students hit as of mid-January.\nIt’s nearly a 20 percent increase over 2018 and 2017, which saw 196 and 197 vehicle versus pedestrian incidents respectively."}, {"url": "https://www.rgj.com/story/news/money/business/2020/03/13/reno-nevada-coronavirus-economy-washoe-county/5038628002/", "title": "COVID-19 impact on the Reno economy: It will get worse before it gets better, leaders say", "authors": ["Jason Hidalgo", "Published A.M. Pt March"], "date": "2020-03-13", "keywords": ["airport", "gets", "kulpin", "worse", "mokuau", "better", "enos", "jacobs", "say", "leaders", "coronavirus", "kazmierski", "economy", "impact", "reno", "covid19"], "summary": "“I felt better before the two black swans of the market showed up,” said Jeff Jacobs, CEO of Jacobs Entertainment.\nGiven the impact of COVID-19 on air travel, however, the Reno airport’s hot streak is likely coming to an end.\nOakland, meanwhile, saw a 9% drop in maritime freight as well, which could more directly impact the Reno market.\n“That’s pretty substantial.”Economic impact: Coronavirus triggers layoffs in Vegas, Reno workers on edgeFreight leaving the Reno market is also down from the previous year by nearly 6%.\nKazmierski expects the local gaming and tourism economy to take a significant hit from the impact of COVID-19."}, {"url": "https://www.rgj.com/story/life/2019/10/10/halloween-events-haunted-houses-pumpkin-patch-october-reno-sparks/3914694002/", "title": "Fall, fun and spooky: Haunted houses, zombie crawls and more things to do this October", "authors": ["Marcella Corona", "Published P.M. Pt Oct."], "date": "2019-10-10", "keywords": ["zombie", "things", "spooky", "crawls", "event", "house", "visit", "saturdays", "pumpkin", "fun", "ride", "features", "haunted", "houses", "fall", "includes", "halloween"], "summary": "USA TODAYIt's that time of year again for haunted houses, pumpkin patches, ghoulish costumes, and other fun Halloween events.\nThe event features a spooky train ride, live music, haunted houses, games, and a costume contest.\nThe event features spooky short films, filmmaker Q&A and a costume contest.\nDay of the Dead FestivalFace paintings, folkloric ballets and costumed performers are just a few fun features of this year’s Día de los Muertos Festival.\nThe event includes an altar exhibition in the parking lot of the Reno Little Theater, 147 E. Pueblo St."}, {"url": "https://www.wbur.org/hereandnow/2019/10/04/reno-nevada-housing-crisis", "title": "Facing An Affordable Housing Crisis, Reno Looks To Build 1,000 New Homes In 120 Days", "authors": ["Peter O'Dowd", "Serena Mcmahon"], "date": "2019-10-04", "keywords": ["affordable", "homes", "developers", "days", "recession", "plan", "median", "city", "fees", "housing", "facing", "crisis", "120", "looks", "schieve", "reno", "need", "build"], "summary": "The city of Reno, Nevada, has approved an ambitious plan: construct 1,000 new homes in 120 days.\nThe median home price in Reno city hit $420,500 earlier this year.\nPlus, Schieve says, Reno –– known as “The Biggest Little City in the World” –– has seen a boost of economic development.\nSchieve says when developers apply to delay fees, the city council will lean toward favoring plans that include a mix of affordable workforce housing.\nIf the demand for housing is so high, why do developers need incentives to build?"}, {"url": "https://www.pymnts.com/blockchain/bitcoin/2020/bitcoin-daily-canaan-reports-148-million-losses-2019-shopping-app-fold-signs-visa-fast-track-program/", "title": "Canaan Reports $148.6M In Losses For 2019", "authors": [], "date": "2020-04-09", "keywords": ["registered", "consumers", "fold", "purchase", "1486m", "canaan", "bitcoin", "rewards", "2019", "million", "public", "reports", "card", "losses"], "summary": "Canaan Creative, the Chinese bitcoin miner maker, registered a net loss of $148.6 million for last year on $204.3 million in revenue, CoinDesk reported.\nCanaan, for its part, put forward its inaugural earnings report after going public last November in the United States.\nCanaan said it sold overall computer power of 10.5 exhashes per second that comprised for approximately 20 percent of the computing power growth of the bitcoin network in 2019.\nFold will now have the ability to provide a co-branded Visa card that lets consumers receive bitcoin rewards via Fast Track.\nWith the Fold card, customers will be able to spend dollars and earn bitcoin in return on each purchase."}, {"url": "https://www.curbed.com/2020/3/3/21155109/downtown-real-estate-reno-tesla-gigafactory", "title": "Reno gambled with Tesla. Affordable housing paid the price.", "authors": ["Patrick Sisson", "Mar"], "date": "2020-03-03", "keywords": ["affordable", "downtown", "gambled", "paid", "tech", "building", "city", "gaming", "housing", "nevada", "tesla", "reno", "price", "citys"], "summary": "The last hurrah for Harrah’s says a lot about the changing face of Reno, Nevada.\nIt was a jewel in the crown of a businessman who would help build the city’s gaming industry.\n“In a tight market, the pressure falls upon those least able to afford it,” says Brent Boynton, community outreach coordinator at the Reno Housing Authority.\n“As more and more industry has come to town, even though the economy has improved, wages haven’t kept up with the cost of housing,” says Reno Housing Authority’s Boynton.\nThe Reno Housing Authority provides public housing and housing choice vouchers to roughly 3,500 families in the Reno-Sparks area, and has roughly the same number on waiting lists for assistance."}, {"url": "https://www.rgj.com/story/life/outdoors/2019/11/19/reno-tahoe-autumn-driest-decades-but-hope-wet-2019-20-winter/4234656002/", "title": "Reno-Tahoe autumn driest in decades but that doesn't necessarily mean dry winter", "authors": ["Benjamin Spillman", "Published A.M. Pt Nov."], "date": "2019-11-19", "keywords": ["winter", "autumn", "swain", "precipitation", "snow", "change", "drier", "doesnt", "pretty", "driest", "world", "weather", "necessarily", "decades", "renotahoe", "reno", "mean", "dry"], "summary": "CLOSE Aerial images of Reno after a winter storm dumped more than seven inches on the city and as much as four feet in the mountains.\nReno Gazette JournalAutumn in the Reno-Tahoe area is off to one of its driest starts in decades.\n“The weather pattern can change pretty dramatically, pretty quickly,” said National Weather Service meteorologist Zach Tolby.\nIt doesn’t necessarily mean drier winters in the Sierra Neva, though.\nWarmer, drier weather in autumn and spring extends the fire season which stresses resources and increases risk for communities in fire-prone areas."}, {"url": "https://thetahoeweekly.com/2019/10/tahoe-music-events-festivals-fall-2019-edition/", "title": "Fall 2019 edition - Tahoe Weekly", "authors": ["Tahoe Weekly Is The Tahoe", "Truckee S No. Source For Live Music", "Events", "Festivals", "Entertainment", "Outdoors", "Recreation", "Food", "Wine", "Arts"], "date": "2019-10-02", "keywords": ["weekly", "carson", "edition", "tahoe", "annual", "center", "city", "wine", "2019", "lake", "fall", "nov", "oct", "reno"], "summary": "| battlebornbeerfest.comSouth Lake Tahoe Food & Wine FestivalOct. 25-27 | Harrah’s and Harvey’s Lake Tahoe | Stateline, Nev.\n| tmcc.edu“Mathilda, The Musical”Nov. 8-24 | Carson City Community Center | Carson City, Nev.Roald Dahl’s internationally acclaimed, high-energy will play in Nevada for the first time.\n| veterans.nv.gov“Polar Express” trainNov. 15-Dec. 24 | Carson City Eastgate Depot | Carson City, Nev.\n| virginiatruckee.comTahoe City Holiday HopNov. 30 | Downtown | Tahoe CityKick off the holiday season in style at the Tahoe City Holiday Hop.\n| justinhope.orgBoo-NanzaOct. 29 | Carson City Community Center | Carson City, Nev."}, {"url": "https://www.nevadabusiness.com/2019/12/rsar-releases-november-2019-existing-home-sales-report/", "title": "RSAR Releases November 2019 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2019-12-07", "keywords": ["homes", "sales", "existing", "report", "2018", "singlefamily", "median", "releases", "rsar", "2019", "decrease", "price", "increase"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its November 2019 report on existing home sales in Reno, Sparks and Fernley, including median sales price and number of home sales in the region.\nThe report listed the median sales price for an existing single-family residence in Reno-Sparks in November 2019 at $400,000; a 6 percent increase from November 2018 and no change from October 2019.\nThe median sales price of existing condominium/townhomes in Reno-Sparks in November 2019 was $230,700; a 30 percent increase from a year ago.\nThe existing condominium/townhome median sales price for November 2019 in Reno was $257,000; a 50 percent increase from last year.\nThe existing condominium/townhome median sales price for November 2019 in Sparks was $215,000; a 16 percent increase from last year."}, {"url": "https://www.rgj.com/story/news/2019/12/16/reno-house-catches-fire-rfd-says-its-abandoned/2668547001/", "title": "Update: Fire now contained at abandoned house in downtown Reno", "authors": ["Sam Gross", "Published P.M. Pt Dec."], "date": "2019-12-16", "keywords": ["downtown", "house", "abandoned", "jensen", "building", "structure", "contained", "intense", "additional", "turned", "nevada", "update", "street", "reno"], "summary": "CLOSE Structure fire at 447 Nevada Street Reno Gazette JournalThis story has been updated with additional information.\nFirefighters squared off against an intense fire in an abandoned home in downtown Reno on Monday.\nThere were no injuries and the house, which was slated for demolition, appears to be a total loss, according to Brad Jensen, a battalion chief with Reno Fire.\nThe house, located at 447 Nevada Street, is directly adjacent to a Starbucks and other businesses on the corner of Fifth and Nevada streets.\nThe two-bedroom, one-bath house dates back to 1930, according to the real estate website Zillow."}, {"url": "https://www.nevadabusiness.com/2019/10/rsar-releases-september-2019-existing-home-sales-report/", "title": "RSAR Releases September 2019 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2019-10-10", "keywords": ["homes", "sales", "existing", "increase", "report", "2018", "singlefamily", "median", "releases", "rsar", "2019", "price", "decrease"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its August 2019 report on existing home sales in Reno, Sparks and Fernley, including median sales price and number of home sales in the region.\nThe median sales price of existing condominium/townhomes in Reno-Sparks in September 2019 was $213,000; less than 1 percent increase from a year ago.\nThe existing condominium/townhome median sales price for September 2019 in Reno was $231,500; a 2 percent decrease from last year.\nThe existing condominium/townhome median sales price for September 2019 in Sparks was $195,000; a 2 percent decrease from last year.\nThe September 2019 report indicated that Fernley had 39 sales of existing single-family homes, a decrease of 38 percent from September 2018 and a 22 percent decrease from August 2019."}, {"url": "https://www.reviewjournal.com/news/politics-and-government/2019-legislature/nevada-sees-many-new-laws-but-how-will-they-affect-you-1682418/", "title": "Nevada sees many new laws, but how will they affect you?", "authors": ["Las Vegas Review-Journal", "Lisa Mascaro The Associated Press"], "date": "2019-06-08", "keywords": ["affect", "assembly", "law", "state", "governorfor", "sees", "senate", "bill", "signed", "effective", "laws", "oct", "nevada", "jan"], "summary": "Hundreds of bills were passed by the 2019 Nevada Legislature: Here’s how many of those new laws will affect everyday people.\nFor injured workers: You will have the right to choose your own doctor or chiropractor (Senate Bill 381.\nLicense plates“Vegas Strong” 1 October plate: (Assembly Bill 333, signed by governor)Women’s suffrage centenary: (Assembly Bill 499, signed by governor)Electric vehicles: (Senate Bill 181, signed by governor.)\n(Senate Bill 143; first policy bill signed by the governor.)\nDrone hunting: Puts in state law existing agency regulations against using drones to harass, hunt or kill game birds or mammals."}, {"url": "https://www.rgj.com/story/money/business/2019/08/05/reno-sparks-construction-projects-apartments-aloft-hotel/1602603001/", "title": "Under construction: 7 projects underway in Reno-Sparks", "authors": ["Brett Mcginness", "Published A.M. Pt Aug."], "date": "2019-08-05", "keywords": ["northern", "center", "renosparks", "underway", "project", "development", "housing", "south", "facility", "nevada", "projects", "construction", "reno"], "summary": "(Photo: Brett McGinness/RGJ)Chase continues its expansion into Northern Nevada with construction of a new branch in Spanish Springs.\nThe construction comes at a time when Northern Nevada struggles with a shortage of doctors in the region.\nGigi Chisel, vice president of Northern Nevada Development for Lewis Management Corp., said the timing is right for construction in the south Reno area.\nThe townhouses are going in just a stone's throw from another housing development, the Steamboat by Vintage apartments targeted toward low-income renters.\nSteamboat by Vintage600 Geiger Grade Rd., RenoExterior elevation for the Steamboat by Vintage housing development in south Reno."}, {"url": "https://thisisreno.com/2019/09/regional-plan-public-input-needed-to-map-next-two-decades-of-growth/", "title": "Regional Plan: Public input needed to map next two decades of growth", "authors": ["Trevor Bexon"], "date": "2019-09-19", "keywords": ["adoption", "map", "planning", "growth", "needed", "street", "plan", "regional", "2019", "input", "600", "truckee", "decades", "public", "agency", "nv"], "summary": "The Truckee Meadows Regional Planning Agency met on Wednesday, September 12, to hold a community conversation about the 2019 Regional Plan that will map out the next 20 years of growth for the area.\nThe planning agency is focused on community engagement as it nears the adoption of the 2019 plan.\nIts plan is revised every five years, and the 2019 plan will be the fifth revision since its original adoption in 1991.\nEliminating redundancies and making the plan more implementable with a focus on the Nevada Revised Statutes was also discussed.\nThe planning agency is scheduled to hold three review meetings next week which will allow for more public comment before the possible adoption of the 2019 plan on October 10, 2019."}, {"url": "https://www.marketplace.org/2019/11/08/reno-nevada-tech-boom-great-recession/", "title": "How Reno, Nevada, turned its economy into a small powerhouse", "authors": [], "date": "2019-11-08", "keywords": ["powerhouse", "things", "going", "small", "think", "economy", "issues", "recession", "turned", "thats", "really", "housing", "nevada", "reno", "know"], "summary": "The Reno-Sparks region in Nevada has experienced something of an economic boom following the 2008 recession.\nThe McKinsey Global Institute recently labeled Reno-Sparks as a “small powerhouse” economy.\nWe did a lot of soul-searching with entrepreneurs, small businesses, those things that we really feel that make a difference in Reno and could diversify our culture.\nBecause, as you know, you know, housing doesn’t pop up overnight, and, you know, we’ve reached out to developers and said, “Hey, this is the time to build.\nBuild now because we need housing now.” And remember, in the recession, many of those developers were wiped out."}, {"url": "https://www.rgj.com/story/news/2020/01/01/rgj-top-local-news-stories-2019/2785003001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "title": "These RGJ stories were the most widely read by local readers in 2019", "authors": ["Peggy Santoro", "Published A.M. Pt Jan."], "date": "2020-01-01", "keywords": ["desert", "local", "nevada", "jason", "musselman", "readers", "mustang", "city", "2019", "rgj", "food", "widely", "reno", "read"], "summary": "CLOSE Take a look at the best images of 2019 from the RGJ's Jason Bean & Andy Barron.\n(Photo: Kurt Kuznicki/Contributed photo)APRILAfter a lot of will-he-or-won't-he, he did: Eric Musselman ditched Reno to coach the Arkansas basketball team.\n(Photo: Andy Barron/RGJ)JULYBuy Photo Damage to the front of Argentina Hall at the University of Nevada, Reno is seen during a media tour on July 11, 2019.\n(Photo: Photo by Jenny Kane/RGJ)DECEMBERThe RGJ couldn't bring you these stories of life in Northern Nevada without your support.\nWe ask that you continue to sustain local journalism by subscribing to the RGJ."}, {"url": "https://thisisreno.com/2020/01/14-things-to-do-this-week-in-the-reno-area-2/", "title": "14 things to do this week in the Reno area", "authors": ["Tabitha Mueller"], "date": "2020-01-14", "keywords": ["things", "event", "dance", "way", "events", "renos", "evening", "week", "try", "live", "area", "14", "street", "brass", "reno"], "summary": "Welcome to our weekly column of things to do in the Reno area.\nThis week you can attend a murder mystery party, sing karaoke accompanied by a live band, do some yoga, attend a live concert and more.\nAttending this event can be a fun way to enjoy live music, kick back and enjoy the evening.\nThis live evening of true stories, told without notes, will be the perfect way to relax after a long day.\nImage: Ty O’NeilCheck out Bull Riding7:30 p.m., Reno Events Center, 400 N. Center Street, RenoThe Professional Bull Riding Pendleton Whisky Velocity Tour is coming to Reno on Friday and Saturday."}, {"url": "https://www.rgj.com/story/life/things-to-do/2019/07/16/reno-nevada-best-places-live-america-outside-magazine-list/1726847001/", "title": "Magazine dubs Reno 1 of 12 best places to live in the U.S.", "authors": ["Erin Davoran", "Published P.M. Pt July"], "date": "2019-07-16", "keywords": ["trail", "rock", "magazine", "tech", "outside", "12", "dubs", "tahoe", "renos", "places", "live", "best", "reno"], "summary": "CLOSE Amy Berry of the Tahoe Fund takes the Reno Gazette Journal on a bike ride along the new Tahoe East Shore Trail.\nReno Gazette-JournalReno is one of the 12 best places to live in America, according to Outside Magazine.\nWhy Reno was chosen as one of the best places to liveThe magazine highlighted Reno's growing tech industry, Burning Man and Midtown.\nMore on Reno's tech industry:More on Burning Man:Midtown is mentioned as a reinvented neighborhood.\nAnd while the article does mention rising home prices in Reno, the Biggest Little City is also credited as \"inexpensive.\""}, {"url": "https://www.rgj.com/story/news/politics/2020/01/08/biden-stump-sparks-high-school-friday/2847691001/", "title": "Joe Biden to stump at Sparks High School on Friday", "authors": ["James Dehaven", "Published P.M. Pt Jan."], "date": "2020-01-08", "keywords": ["stump", "sparks", "event", "joe", "biden", "northern", "democratic", "presidential", "high", "president", "trump", "nevada", "school", "reno"], "summary": "CLOSE Former Vice President Joe Biden defended his son against attacks by President Trump and said his family has been through much worse Reno Gazette-JournalThe Democratic presidential front-runner last visited Northern Nevada in OctoberJoe Biden is headed back to Northern Nevada this week.\nThe former vice president and longtime Democratic presidential front-runner on Tuesday announced a “community event” set to begin at 6:00 p.m. Friday at Sparks High School, 820 15th St. in Sparks.\nThe event will count as Biden’s second 2020 campaign stop in Northern Nevada.\nFriday's event coincides with a virtual town hall announced earlier this week by fellow Democratic presidential candidate Andrew Yang.\nBuy Photo Joe Biden speaks at Truckee Meadows Community College in Reno, Nevada on Oct. 2, 2019."}, {"url": "https://www.usatoday.com/in-depth/news/investigations/2019/10/29/the-city-podcast-season-2-reno-strip-clubs-tesla/2452350001/", "title": "High heels, high tech, high stakes: What happened when Reno tried to kick out its strip clubs", "authors": ["Anjeanette Damon", "Usa Today"], "date": "2019-10-29", "keywords": ["clubs", "usa", "strip", "orchid", "renos", "kick", "club", "high", "reno", "happened", "city", "heels", "stakes", "wild", "tech", "tried", "citys"], "summary": "They are undercover cops, sent in as part of a crackdown on Reno’s strip clubs that has more to do with local politics – and economic progress – than vice.\nSubscribe to the podcastThese officers are at the vanguard of the city's efforts to kick the strip clubs out of downtown.\nThe strip club kingpinThe focus of their fight is Reno’s strip club kingpin: Kamy Keshmiri.\nThere’ll be a time when I get my revenge.”Show caption Hide caption Wild Orchid co-owner Kamy Keshmiri, right, talks with his lawyer Mark Thierman inside the Wild Orchid strip club.\nThe men went to war against the... Wild Orchid co-owner Kamy Keshmiri, right, talks with his lawyer Mark Thierman inside the Wild Orchid strip club."}, {"url": "https://www.rgj.com/story/news/2019/10/13/columbus-day-indigenous-peoples-day-reno-nevada/3943738002/", "title": "Columbus Day no more: Reno to celebrate Indigenous Peoples Day on Monday", "authors": ["Brett Mcginness", "Published A.M. Pt Oct."], "date": "2019-10-13", "keywords": ["nevada", "northern", "states", "day", "city", "celebrate", "indigenous", "columbus", "peoples", "reno", "valdez"], "summary": "On Monday, the city of Reno will recognize its first official Indigenous Peoples Day, replacing recognition of Columbus Day.\nAn intertribal group in 2017 lobbied the Nevada Legislature to replace Columbus Day with Indigenous Peoples Day.\nCLOSE An earlier proposal to get rid of Columbus Day in favor of Indigenous People's Day was amended on Thursday to make two separate holidays.\nThe effort resulted not in the replacement of Columbus Day, but in the declaration of Aug. 9 as Indigenous Peoples Day, coinciding with a worldwide recognition of indigenous peoples by the United Nations.\nColumbus Day lives on in Montana: Indigenous People's Day bill defeated by lawmakersReno is among several locations in the United States officially recognizing Indigenous Peoples Day for the first time this year."}, {"url": "https://www.rgj.com/story/news/2019/07/12/rascal-flatts-july-13-reno-show-canceled/1721221001/", "title": "Rascal Flatts' July 13 Reno show canceled", "authors": ["Brett Mcginness", "Published P.M. Pt July"], "date": "2019-07-12", "keywords": ["canceled", "casino", "event", "13", "tickets", "visit", "shows", "resort", "12", "takes", "place", "rascal", "reno", "flatts"], "summary": "(June 11)Subscribe: Stay in the know with an online subscription to RGJ.com, starting at just 99 cents a monthSorry, country fans — Rascal Flatts won't be in Reno this weekend.\nThe show takes place every night but Monday, with two shows on Saturdays, at the Showroom, Eldorado Resort Casino, 345 N. Virginia St.\nIt takes place at 7:30 p.m. on Thursdays, Fridays and Saturdays in Sammy’s Showroom, Harrah’s Reno, 219 N. Center St.\nSee him at 8 p.m. at Grande Exposition Hall, Silver Legacy Resort Casino, 407 N. Virginia St.\nThe event takes place at the West Parking Lot of the Atlantis Resort Casino Spa, 3800 S. Virginia St."}, {"url": "https://www.nevadabusiness.com/2020/01/nevada-business-indicators-january-2020/", "title": "Business Indicators January 2020", "authors": ["Stephen Miller"], "date": "2020-01-01", "keywords": ["business", "sales", "2020", "jobs", "indicators", "yearoveryear", "economic", "investment", "real", "spending", "signals", "nevada", "seasonally"], "summary": "The upward revisions reflected less negative business investment, including inventory investment and more positive consumer spending than previously thought, which were partly offset by smaller state and local government spending than initially reported.\nIn addition, residential investment, inventory investment and government spending also contributed positively to the real GDP expansion, while continued weaker business investment and net exports contributed negatively to the economic expansion.\nSeasonally adjusted employment gained 700 jobs in October, showing its slowest yearly growth of 1.3 percent in nearly eight years.\nSeptember taxable sales also climbed robustly by 7.4 percent year-over-year, while gasoline sales (in gallons) remained flat over the same period.\nWashoe County displayed favorable economic signals."}, {"url": "https://www.rgj.com/story/life/food/2019/07/22/new-restaurants-reno-sparks-2019-indian-mexican-coffee-deli-sushi/1789064001/", "title": "9 new and upcoming restaurants in Reno and Sparks", "authors": ["Johnathan L. Wright", "Published P.M. Pt July"], "date": "2019-07-22", "keywords": ["restaurants", "coffee", "sparks", "arlington", "menu", "restaurant", "opened", "south", "sushi", "sierra", "upcoming", "reno"], "summary": "Stylish tacos and mezcal cocktails, new coffee for Wells Avenue, South Reno sandwiches, Sparks biryani and more: the latest dispatches from the Northern Nevada restaurant front.\n____________The Arlington Saloon is going into the old Blind Dog Tavern space in Arlington Towers in downtown Reno.\n____________Buy Photo The new Bawarchi Indian Cuisine in Sparks joins the original Bawarchi in South Reno.\n____________Buy Photo The new Ohana Sushi in Sparks also serves sushi burritos and poke bowls.\n____________Buy Photo The Urban Deli serves signature and build-your-own sandwiches from its South Reno premises."}, {"url": "https://www.rgj.com/story/news/2019/10/19/forecasters-predict-windy-weather-northern-nevada-saturday/4037576002/", "title": "Reno forecasters predict gusty winds through Northern Nevada on Saturday", "authors": ["Marcella Corona", "Published P.M. Pt Oct."], "date": "2019-10-19", "keywords": ["valley", "sunny", "northern", "predict", "winds", "low", "gusts", "reach", "high", "mph", "forecasters", "nevada", "reno", "gusty", "areas"], "summary": "(Photo: Marcella Corona/RGJ)Grab on to your Halloween decorations because forecasters are expecting high winds throughout the day on Saturday.\n“The main weather hazard today will be gusty winds,” forecasters said, adding they expect gusts to increase from south to north just south of U.S. 50.\n“Some model indicators are pointing to a very brief period where gusts could reach 55 mph,” forecasters said on the Weather Service website.\nThis also includes U.S. 395 in northeastern Lassen County, Nevada 447 and Modoc Route 1 through Surprise Valley, forecasters said on the agency’s website.\nRENO AREA FORECAST:Saturday: Mostly sunny with breezy winds; gusts up to 40 mph; high 62, low 36Sunday: Sunny; high 63, low 40Monday: Sunny; high 70, low 40Tuesday: Sunny; high 74, low 41TAHOE AREA FORECAST:Saturday: Mostly sunny with breezy winds, gusts up to 35 mph; high 54, low 34Sunday: Sunny; high 57, low 39Monday: Sunny; high 63, low 40Tuesday: Sunny; high 66, low 40Source: National Weather ServiceMarcella Corona is a breaking news reporter who covers crime and justice in Northern Nevada."}, {"url": "https://thisisreno.com/2019/10/teachers-rally-downtown-saturday-to-encourage-support-for-education/", "title": "Teachers rally downtown Saturday to encourage support for education (updated)", "authors": ["Bob Conrad"], "date": "2019-10-17", "keywords": ["downtown", "support", "event", "board", "nevada", "system", "trustees", "rally", "education", "encourage", "teachers", "updated", "students", "school", "policies"], "summary": "A nonunion teachers group is rallying on Saturday for a better education system.\nThe event, at 10 a.m. at City Plaza, by the BELIEVE sculpture, aims to raise the perception of education in Nevada.\n“Empower Nevada teachers was started to help give a voice to teachers in our community and advocate for the type of education system that the students in our classrooms truly deserve,” said one of the organizers, Calen Evans.\nMinetto, responding to a question about this, said the specific board policies are 9051 and 9052.\nEmpower Nevada Teachers’ Facebook page and website are highlighting community businesses that support education."}, {"url": "https://www.rgj.com/story/news/2019/10/29/remarkably-cold-temperatures-forecast-reno-outlying-areas-tuesday/2499256001/", "title": "'Remarkably cold temperatures' forecast for Reno, outlying areas on Wednesday — 16 degrees in the city", "authors": ["Sam Gross", "Published P.M. Pt Oct."], "date": "2019-10-29", "keywords": ["winter", "usa", "forecast", "expected", "temperatures", "remarkably", "today", "16", "city", "region", "week", "outlying", "mcguire", "tomorrow", "reno", "degrees", "areas", "cold"], "summary": "Reno Gazette-JournalNear record-low temperatures are expected in Reno tomorrow morning, with a frigid low of about 16 degrees forecast for the city.\nWhile Reno likely won't break its record low temperature of 13 degrees for Oct. 30 — which was set in 1971 — outlying areas north and east of the city might.\nThe potential record and near-record lows are expected on the heels of a very cold and dry front pushing through the region today.\nThat front has kicked up a brisk northerly wind that will keep temperatures in Reno on Tuesday down in the 40's.\n-- Photo by Hannah Gaber, USA TODAY Staff (Photo: Hannah Gaber, USA TODAY)Temperatures will remain below average through the end of the week."}, {"url": "https://www.rgj.com/story/news/2019/08/19/lithia-reno-nevada-dmv-construction/2024984001/", "title": "Under construction: New DMV, new home for Lithia, more industrial space for Reno", "authors": ["Brett Mcginness", "Published A.M. Pt Aug."], "date": "2019-08-19", "keywords": ["market", "lithia", "site", "space", "dmv", "building", "center", "industrial", "store", "commerce", "construction", "reno"], "summary": "From a massive influx of industrial space to the finishing touches on an auto dealership's new home, here's the latest on five projects underway in the region.\nThe new building provides flex space (that is, office and showroom space) and larger industrial space for tenants.\n(Photo: Brett McGinness/RGJ)Meanwhile, a significant expansion at the North Valleys Commerce Center is underway — and Panattoni says it's the biggest construction of speculative industrial space in the state's history.\nRoberts said the sheer size of the development helped the company find the necessary labor in a tight construction market.\nRoberts said Panattoni doesn't think the market is too overheated for a sudden influx of industrial space."}, {"url": "https://www.nevadabusiness.com/2019/10/celebrate-pro-bono-2019-offers-more-than-110-free-legal-help-sessions-throughout-nevada-in-october/", "title": "Celebrate Pro Bono 2019 Offers More Than 110 FREE Legal Help Sessions throughout Nevada in October", "authors": ["Greg Ferraro"], "date": "2019-10-09", "keywords": ["justice", "law", "lawyer", "bono", "help", "celebrate", "2019", "sessions", "free", "nevada", "pro", "access", "legal", "offers"], "summary": "Getting free help from a Nevada lawyer during Celebrate Pro Bono 2019, for some, could positively impact the outcome of their issue.\nSessions will be offered by many legal aid providers along with a multitude of pro bono lawyers and supporting partners.\nSession sponsors include Legal Aid Center of Southern Nevada, Nevada Legal Services, Southern Nevada Senior Law Program, Volunteer Attorneys for Rural Nevada (VARN), and Washoe Legal Services.\nMaking legal help available to everyone, regardless of ability to pay, is how we deliver on the American promise of justice for all.\nMore information about the Nevada Supreme Court Access to Justice Commission and legal needs in Nevada is available at www.nvbar.org/atj"}, {"url": "https://www.rgj.com/story/news/2019/12/24/rgj-citizen-of-the-year-2019-finalists/2737948001/", "title": "Finalists named for 2019 RGJ Citizen of the Year", "authors": ["Brett Mcginness", "Published A.M. Pt Dec."], "date": "2019-12-24", "keywords": ["nevada", "nichols", "good", "education", "phillips", "finalists", "2019", "really", "rgj", "teachers", "named", "program", "citizen", "reno", "work"], "summary": "CLOSEGrant Denton, Calen Evans, Allison Gorelick, Laura Jackson, Janet Phillips, Heather Goulding and Grace Nichols are the finalists for RGJ Citizen of the Year for 2019.\nWhen she moved to Nevada, Nichols met with Nevada National Guard Brig.\n\"We had three key ingredients to our good teamwork: good work, a good team and good strategy,\" Goulding said.\n\"Good work is important because it gave our team energy and it attracted other strong partners.\n\"If everything went really, really well — 2025."}, {"url": "https://www.rgj.com/story/news/2020/04/01/former-nevada-gov-brian-sandoval-applies-unr-president/5101568002/", "title": "Former Gov. Brian Sandoval applies for UNR president, steps down from MGM position", "authors": ["Siobhan Mcandrew", "Published A.M. Pt April"], "date": "2020-04-01", "keywords": ["university", "public", "applies", "governor", "search", "gov", "brian", "unr", "president", "sandoval", "position", "nevada", "steps", "mgm", "reno", "resorts"], "summary": "CLOSE Nevada Governor Brian Sandoval prepares for life in the private sector after leading the state for the past 8 years.\nBrian Sandoval has applied for the top post at the University of Nevada, Reno.\nSandoval has long been rumored to be interested in applying to become the 17th president of UNR.\nMore: Sandoval on leaving public officeSandoval, who served two terms as governor, has been the president of global gaming development at MGM Resorts since leaving office in January 2019.\n“We are grateful to Governor Sandoval for all that he has accomplished in his time at MGM Resorts."}, {"url": "https://thebusinessjournal.com/producers-dairy-buys-plant-other-assets-in-nearly-7m-bankruptcy-auction/", "title": "Producers Dairy buys plant, other assets in nearly $7M bankruptcy auction", "authors": [], "date": "2020-04-14", "keywords": ["buys", "nearly", "assets", "dean", "protection", "milk", "dairy", "foods", "million", "producers", "plant", "auction", "farms", "processor", "bankruptcy", "7m"], "summary": "Producers Dairy acquired this milk plant in Fairfield, California in 2018.\nWhen Dean Foods filed for bankruptcy protection in November 2019, it had reported net losses for seven of its eight previous quarters.\nBased in Dallas, Dean Foods had previously been the largest dairy processor and direct-to-store supplier in the U.S. Its assets were sold through acution for nearly half a billion dollars.\nFounded in 1932, Producers Dairy is a third-generation family business run by the Shehadey family.\nThe company acquired a milk plant in Fairfield in 2018, also through an auction."}, {"url": "https://www.rgj.com/story/news/politics/2020/04/15/nevada-primary-election-vote-mail-ballot-voting-coronavirus-plan/5138791002/", "title": "Nevada elections officials shoot down Democrat-requested tweaks to June's all-mail primary", "authors": ["James Dehaven", "Published P.M. Pt April"], "date": "2020-04-15", "keywords": ["allmail", "tweaks", "junes", "harvesting", "shoot", "officials", "democratrequested", "primary", "state", "voters", "democrats", "elections", "election", "polling", "nevada", "ballot"], "summary": "Previous Coverage: Nevada officials plan mail-in only June primary election amid coronavirus concernsDeputy Secretary of State Wayne Thorley on Tuesday issued a point-by-point response to those requests.\n“The Nevada State Democratic Party asks me to ignore laws that were enacted by the Nevada Legislature,” Thorley wrote.\n“I am asked to disregard long-standing voter integrity provisions found in NRS 293.325 and 293.330, including the restriction on ballot harvesting.\n“The decision to designate the 2020 primary election as an all-mail election was not made lightly,” he wrote.\nMore information about the primary election changes is available at 775-684-5705 or by emailing nvelect@sos.nv.gov."}, {"url": "https://www.nevadabusiness.com/2019/12/rsar-releases-november-2019-existing-home-sales-report/", "title": "RSAR Releases November 2019 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2019-12-07", "keywords": ["homes", "sales", "existing", "report", "2018", "singlefamily", "median", "releases", "rsar", "2019", "decrease", "price", "increase"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its November 2019 report on existing home sales in Reno, Sparks and Fernley, including median sales price and number of home sales in the region.\nThe report listed the median sales price for an existing single-family residence in Reno-Sparks in November 2019 at $400,000; a 6 percent increase from November 2018 and no change from October 2019.\nThe median sales price of existing condominium/townhomes in Reno-Sparks in November 2019 was $230,700; a 30 percent increase from a year ago.\nThe existing condominium/townhome median sales price for November 2019 in Reno was $257,000; a 50 percent increase from last year.\nThe existing condominium/townhome median sales price for November 2019 in Sparks was $215,000; a 16 percent increase from last year."}, {"url": "https://thisisreno.com/2019/12/photos-reno-year-in-review-for-2019/", "title": "PHOTOS: Reno year in review for 2019", "authors": ["Ty O'Neil"], "date": "2019-12-27", "keywords": ["downtown", "photographer", "ty", "image", "laue", "rodeo", "2019", "oneil", "review", "nevada", "reno", "photos"], "summary": "Revelers rang in 2019 in frigid, 20-degree temperatures in downtown Reno.\nThe third annual women’s march was Jan. 19 in downtown Reno and brought together hundreds of women that marched from the Reno Arch to the Reno City Plaza.\nRather than take the usual photos with campaign signs, podium and stage, photographer Ty O’Neil captured several images before Sanders took the mic.\nSenator Bernie Sanders speaks at the University of Nevada, Reno in his second of three visits to northern Nevada in 2019 for his 2020 presidential campaign.\nDía de los Muertos brought out thousands to enjoy the colorful celebrations along Wells Avenue and at the University of Nevada, Reno."}, {"url": "https://thisisreno.com/2019/11/15-things-to-do-this-week-in-the-reno-area/", "title": "15 things to do this week in the Reno area", "authors": ["Tabitha Mueller"], "date": "2019-11-15", "keywords": ["things", "event", "local", "sure", "happy", "events", "music", "evening", "week", "live", "15", "area", "reno", "comedy"], "summary": "Photo: Ty O’NeilBy Tabitha MuellerTry ice skating, listen to a blues concert, learn about the tango, celebrate Taco Tuesday, and attend other fun events in the Reno area this week!\nThere will be live music from local musician Dave Mensing, champagne specials, and cocktails.\nTwo canned goods for entry for members, and $10 for non-membershttps://www.facebook.com/events/525176224986272/Friday, November 22Check out Justin Rupple at Comedy Happy Hour6:30 – 8:00 p.m., LEX NightclubEnjoy drink specials, free bar snacks, and fantastic comedy at LEX Nightclub’s comedy happy hour.\nThere will be live music, a silent auction, and of course, delicious chili.\nTickets: Pay what you can, with a $20 suggested donationhttps://thisisreno.com/calendar/a-blues-revue/Be sure to check out our events page for other things happening in Reno this week."}, {"url": "https://www.pymnts.com/blockchain/bitcoin/2020/bitcoin-daily-canaan-reports-148-million-losses-2019-shopping-app-fold-signs-visa-fast-track-program/", "title": "Canaan Reports $148.6M In Losses For 2019", "authors": [], "date": "2020-04-09", "keywords": ["registered", "consumers", "fold", "purchase", "1486m", "canaan", "bitcoin", "rewards", "2019", "million", "public", "reports", "card", "losses"], "summary": "Canaan Creative, the Chinese bitcoin miner maker, registered a net loss of $148.6 million for last year on $204.3 million in revenue, CoinDesk reported.\nCanaan, for its part, put forward its inaugural earnings report after going public last November in the United States.\nCanaan said it sold overall computer power of 10.5 exhashes per second that comprised for approximately 20 percent of the computing power growth of the bitcoin network in 2019.\nFold will now have the ability to provide a co-branded Visa card that lets consumers receive bitcoin rewards via Fast Track.\nWith the Fold card, customers will be able to spend dollars and earn bitcoin in return on each purchase."}, {"url": "https://kslsports.com/432572/espns-fpi-projects-five-wins-by-utah-state-football-in-2020/", "title": "ESPN’s FPI Projects Five Wins By Utah State Football In 2020", "authors": ["Kyle Ireland", "Ksl Sports"], "date": "2020-04-15", "keywords": ["aggies", "play", "espns", "fpi", "2020", "state", "teams", "utah", "season", "win", "according", "wins", "projects", "football"], "summary": "LOGAN, Utah – ESPN’s Football Power Index (FPI) projects five wins by the Utah State Aggies in the upcoming 2020 college football season.\nUtah State owns a -7.8 FPI rating which ranked No.\nFPI gives Utah State nearly a 70 percent advantage in the late October game.\nUtah State is projected to pick up the win according to FPI.\nUtah State finished the regular season as a bowl-eligible team and ended the year with a 7-6 record."}, {"url": "https://www.baxterbulletin.com/story/sports/2020/04/16/musselman-gets-his-men/5146136002/", "title": "Musselman gets his men", "authors": ["Nate Allen", "Nate Allen Sports Service", "Published P.M. Ct April"], "date": "2020-04-16", "keywords": ["tate", "gets", "musselman", "men", "williams", "player", "arkansas", "guard", "thats", "jackson", "vance", "play"], "summary": "CLOSENew Mexico's Vance Jackson plays against Utah State during the first half of a Mountain West Conference tournament game on March 5, in Las Vegas.\nRegarding Williams, Musselman on Wednesday night was quoted in a UA-issued press release.\n“Jaylin is another versatile player, one that can play the 4 or the 5, that possesses a well-rounded skill set,” Musselman said.\n“Just to get a player 6-9, 230,” Musselman said after having no player taller than 6-8 last season.\n“Obviously Devo, Davonte Davis, is a guy that can play both guard spots and has great length,” Musselman said."}, {"url": "https://www.perishablenews.com/dairy/global-cheese-technology-forum-returns-to-reno-nevada-in-november/", "title": "Global Cheese Technology Forum Returns to Reno, Nevada in November", "authors": [], "date": "2019-08-26", "keywords": ["products", "industry", "returns", "gctf", "technology", "global", "whey", "opportunity", "latest", "dairy", "forum", "cheese", "meeting", "nevada", "reno"], "summary": "Elmhurst, IL – Don’t miss the conference that will bring all segments of the cheese industry together to address concerns and developments relevant to cheese and whey product manufacturers.\nThe Global Cheese Technology Forum (GCTF) will return to the Peppermill Resort in Reno, Nevada, on November 5 – 7 for their 5th biennial meeting.\nThis two-day event is an opportunity for those in the cheese and whey manufacturing industries to learn and discuss our role in today’s global economy.\nAttendees will have the opportunity to hear about new ideas and practices in cheese technology and applications, meet friends and colleagues, engage in panel discussions and be treated to a cheese and wine social.\nThis conference is being organized collaboratively by the American Dairy Products Institute, Dairy Products Technology Center (DPTC) at California Polytechnic State University and the Western Dairy Center at Utah State University."}, {"url": "https://www.marketplace.org/2019/11/08/reno-nevada-tech-boom-great-recession/", "title": "How Reno, Nevada, turned its economy into a small powerhouse", "authors": [], "date": "2019-11-08", "keywords": ["powerhouse", "things", "going", "small", "think", "economy", "issues", "recession", "turned", "thats", "really", "housing", "nevada", "reno", "know"], "summary": "The Reno-Sparks region in Nevada has experienced something of an economic boom following the 2008 recession.\nThe McKinsey Global Institute recently labeled Reno-Sparks as a “small powerhouse” economy.\nWe did a lot of soul-searching with entrepreneurs, small businesses, those things that we really feel that make a difference in Reno and could diversify our culture.\nBecause, as you know, you know, housing doesn’t pop up overnight, and, you know, we’ve reached out to developers and said, “Hey, this is the time to build.\nBuild now because we need housing now.” And remember, in the recession, many of those developers were wiped out."}, {"url": "https://www.nevadabusiness.com/2020/01/rsar-releases-2019-fourth-quarter-december-existing-home-sales-report/", "title": "RSAR Releases 2019 Fourth Quarter/December Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2020-01-09", "keywords": ["homes", "sales", "existing", "report", "quarterdecember", "singlefamily", "quarter", "median", "releases", "rsar", "2019", "price", "increase", "fourth"], "summary": "RSAR Releases 2019 Fourth Quarter/December Existing Home Sales ReportRENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its 2019 fourth quarter and December 2019 reports on existing home sales in Reno/Sparks and Fernley, including median sales price and number of home sales in the region.\nFourth Quarter 2019Reno/SparksIn the fourth quarter of 2019, the report showed Reno/Sparks had 1,516 sales of existing single-family homes; with a 15 percent increase from last year and a 16 percent decrease from the previous quarter.\nThe median sales price of an existing condominium/townhome in Reno/Sparks in the fourth quarter of 2019 was $226,000; an increase of 16 percent from a year ago.\nThe existing condominium/townhome median sales price for the fourth quarter of 2019 was $248,500; an increase of 24 percent from the past year.\nThe existing condominium/townhome median sales price for 2019’s fourth quarter in Sparks was $200,000; an increase of 7 percent from last year."}, {"url": "https://thisisreno.com/2019/11/19-things-to-do-this-week-in-the-reno-area/", "title": "19 things to do this week in the Reno area", "authors": ["Tabitha Mueller"], "date": "2019-11-19", "keywords": ["things", "400", "event", "game", "animal", "run", "holiday", "way", "reno", "week", "fun", "area", "tailgate", "19", "thanksgiving"], "summary": "Welcome to our weekly column of things to do in the Reno area.\nThis week features live performances, tailgates, a community Thanksgiving meal, a fun run and other goings-on.\nThe race is a fun way to gear up your appetite for a day of feasting.\nFREEhttps://www.facebook.com/events/509700429618895/Join a Fun Run!\nFREEhttps://thisisreno.com/calendar/crafts-for-christmas/Be sure to check out our events page for other things happening in Reno this week."}, {"url": "https://www.rgj.com/story/news/money/business/2019/12/23/reno-named-one-15-hottest-new-places-live-next-decade/2680672001/", "title": "Housing: Reno named one of the 15 'hottest' real estate markets for the next decade", "authors": ["Jason Hidalgo", "Published A.M. Pt Dec."], "date": "2019-12-23", "keywords": ["market", "markets", "estate", "real", "hottest", "renos", "city", "housing", "list", "15", "named", "area", "reno", "decade"], "summary": "Reno Gazette JournalReno’s hot housing market is expected to continue sizzling in the coming decade, according to a new real estate ranking.\nThe ranking is based on feedback by real estate agents from across the U.S. who were asked to predict the most popular real estate markets for the next 10 years.\n“Reno will surely be the hottest real estate market in the US for 2020 and beyond.”Inside Reno's housing crisis: Why aren’t more affordable homes being built?\nThis has fueled concerns that Reno’s housing market would start seeing the same affordability issues plaguing California markets such as the Bay Area if housing supply isn’t addressed.\nFor more details on the rankings, here is Business Insider’s list of the top 15 hottest real estate markets in the next decade."}, {"url": "https://thisisreno.com/2019/11/12-things-to-do-in-reno-this-week/", "title": "12 things to do in Reno this week", "authors": ["Tabitha Mueller"], "date": "2019-11-12", "keywords": ["head", "things", "event", "expo", "start", "steampunk", "events", "12", "renos", "week", "live", "reno"], "summary": "By Tabitha MuellerWatch a parade, enjoy live music, dance at a ball, learn about podcasting, and more in the Reno area this week!\nFREEhttps://thisisreno.com/calendar/handmade-for-the-holidays/Downtown Wine Walk2:00 – 5:00 p.m., Riverwalk DistrictWalk along the Truckee River in Downtown Reno and sample wines from merchants in the local area.\nThe Expo runs until Sunday and is a great way to round out the week.\nIf you’ve never gone to a Steampunk Expo before, why not try it out?\nTickets: Start at $20https://thisisreno.com/calendar/the-rat-pack-returns-to-the-original-polo-lounge-5pm-and-8pm-sunday-nov-17/Be sure to check out our events page for other things happening in Reno this week."}, {"url": "https://thisisreno.com/2019/11/city-advisory-boards-like-all-of-us-cancel-meetings/", "title": "City advisory boards, like all of us, cancel meetings", "authors": ["Tabitha Mueller"], "date": "2019-11-21", "keywords": ["nab", "meetings", "advisory", "various", "renos", "city", "community", "residents", "reno", "cancel", "boards"], "summary": "Reno City Hall.\nMembers of city government and city advisory boards are not immune to the interventions of day-to-day living either.\nIn the past year, various Neighborhood Advisory Boards (NAB) have canceled their meetings for sickness, health appointments or a lack of quorum, among other circumstances.\nJon Humbert, Reno’s public information officer, told This Is Reno, “The Neighborhood Advisory Boards provide a vital connection between the Reno community and the City Council.\nThat can lead to meetings that may not meet quorum, unfortunately.”Thankfully each NAB exceeds requirements for at least four meetings every year.”Despite the cancellation of various NAB meetings throughout 2019, the NABs have been meeting more than the required four times a year."}, {"url": "https://thisisreno.com/2019/11/photos-dia-de-los-muertos-celebrations/", "title": "PHOTOS: Día de los Muertos celebrations", "authors": [], "date": "2019-11-03", "keywords": ["tradition", "ty", "renoday", "celebrations", "oneildía", "día", "translates", "university", "remembrance", "theater", "reno", "muertos", "photos", "los"], "summary": "Photos by Ty O'NeilDía de los Muertos brought out colorful costumes and festive celebrations Saturday, Nov. 2 at several Reno events, including at Reno Little Theater and University of Nevada, Reno.\nDay of the Dead, as it translates to English, is a Mexican tradition in remembrance of friends and family who have died.\nRather than being …"}, {"url": "https://thisisreno.com/2019/11/10-things-to-do-in-reno-this-week-for-20-or-less/", "title": "10 things to do in Reno this week for $20 or Less", "authors": ["Tabitha Mueller"], "date": "2019-11-10", "keywords": ["things", "event", "20", "dance", "turkeys", "way", "events", "week", "free", "players", "public", "reno"], "summary": "Photo: Ty O’NeilBy Tabitha MuellerThis week brings comedic performances, basketball players, an 80’s themed celebration and more.\nFREEhttps://www.alltrails.com/trail/us/nevada/tom-cooke-trailWednesday, November 6Interact with the Harlem Globetrotters7:00 – 9:00 p.m., Reno Events CenterIf you love basketball or want to interact with some of basketball’s most legendary players, then this Harlem Globetrotters event is a must-visit.\nhttps://www.facebook.com/events/395916274647108/Sunday, November 10Dance Sunday Night7:00 – 10:00 p.m., Acro EnsoDance the night away at Ecstatic Dance Reno, an organization that hopes to help people find community through dance.\nTickets are $20https://thisisreno.com/calendar/sunday-night-ecstatic-dance/2019-11-10/Be sure to check out our events page for other things happening in Reno this week.\nIf you are hosting an event, please submit events to our events page."}, {"url": "https://www.rgj.com/story/news/2019/11/16/reno-national-weather-forecast-first-cold-weather-season-hit-next-week/4216285002/", "title": "Reno forecaster warns first cold weather of the season to hit next week", "authors": ["Marcella Corona", "Published P.M. Pt Nov."], "date": "2019-11-16", "keywords": ["snow", "sunny", "low", "hit", "temperatures", "forecaster", "week", "high", "season", "weather", "boyd", "warns", "reno", "rain", "cold"], "summary": "CLOSEBuy Photo A file photo of a man with a red umbrella walking through the rain in downtown Reno.\nForecasters are expecting valley rain and (maybe) some mountain snow next week, making this the first winter weather event of the season.\nThe cold weather is expected to hit the region Tuesday night into Wednesday, according to the National Weather Service.\nBoyd, who works for the National Weather Service in Reno, said the area already received some cold weather and snowfall in September.\n“It’s a reminder we do get weather this time of year.”Tranquil weather may be over this next week!"}, {"url": "https://thisisreno.com/2019/11/podcast-whats-next-for-the-city/", "title": "PODCAST: What’s next for The City?", "authors": ["Tabitha Mueller"], "date": "2019-11-29", "keywords": ["whats", "origin", "tabitha", "radio", "city", "thanks", "season", "sit", "reno", "podcast"], "summary": "Tabitha Mueller and Bob Conrad sit down with Anjeanette Damon from The City podcast to discuss the origin of season two of The City — and what’s next now that season two is complete.\nIn case you missed it, The City season two is focused on Reno, Nevada and the city’s battle for an identity.\nThanks to KWNK Community Radio for hosting this interview.\nCheck out The City here: https://www.thecitypodcast.com/"}, {"url": "https://www.rgj.com/story/news/2019/11/29/black-friday-snow-chain-controls-widespread-reno-tahoe-i-80-lake-tahoe-interstate-80-donner-summit/4330548002/", "title": "UPDATE: Reno got more than double the amount of snow than Truckee in the past 24 hours", "authors": ["Sam Gross", "Published A.M. Pt Nov."], "date": "2019-11-29", "keywords": ["snow", "storm", "service", "hours", "roads", "24", "past", "truckee", "lake", "weather", "according", "sierra", "update", "double", "reno", "controls"], "summary": "Reno Gazette-JournalNWS: Reno got more snow than Truckee last nightUpdate, 10:00 a.m.\nThe Reno-Tahoe International Airport on Thanksgiving night got more than double the amount of snow that fell in Truckee or South Lake Tahoe in the past 24 hours, according to a tweet from the National Weather Service in Reno.\nScattered #snow showers remain in the forecast for the Sierra this morning, but another winter storm is looming for this weekend.\nSnow levels with the storm are expected to start fairly low, touching the valley floors, before they quickly rise.\nCurrently, the weather service is forecasting an additional 2 to 6 inches of snow along the Sierra Front in Nevada from this weekend's storm."}, {"url": "https://www.rgj.com/story/news/2019/11/26/nws-reno-winter-storm-warning-issued-lake-tahoe-over-thanksgiving-i-80-snow-donner-summit-sierra/4308354002/", "title": "Thanksgiving snow: Chain controls on Mt. Rose Highway; traffic still held on I-80", "authors": ["Sam Gross", "Published A.M. Pt Nov."], "date": "2019-11-26", "keywords": ["highway", "rose", "i80", "held", "winter", "weather", "controls", "snowfall", "storm", "mt", "interstate", "lake", "chain", "thanksgiving", "snow", "donner", "traffic", "travel", "according"], "summary": "CLOSE Drone aerials shot at Donner Lake, Emerald Bay and at the Summit of the Mt.\nRose Highway on March 4 show the beautiful aftermath of record-setting snowfall at Lake Tahoe and on the surrounding mountains.\nUPDATE: R-2 EB/WB Alta to Donner Lake Interchange.\nR-2 EB/WB between Cisco and Donner Lake Interchange.\nThis Thanksgiving week storm will be followed closely by another sizeable winter storm this weekend, according to NWS Reno."}, {"url": "https://www.rgj.com/story/news/2019/11/27/80-westbound-closed-chain-controls-widespread-lake-tahoe-interstate-80-donner-summit-reno-snow/4317799002/", "title": "UPDATE: I80 reopens in both directions, chains are still required", "authors": ["Sam Gross", "Marcella Corona", "Published A.M. Pt Nov."], "date": "2019-11-27", "keywords": ["directions", "reopens", "snow", "i80", "storm", "service", "chains", "morning", "required", "weather", "according", "travel", "sierra", "update", "reno", "controls"], "summary": "Reno Gazette Journal'Just stay home this weekend'Update, 9:16 p.m.Interstate 80 has reopened in both directions, according to the California Department of Transportations.\nThe National Weather Service in Reno has some simple advice for anyone wondering if driving across the Sierra this weekend is a good idea.\nThat \"significant winter storm,\" according to the weather service, is expected to further hamper Thanksgiving weekend travel as people attempt to return home across the passes.\nAside from the quiet window Saturday morning, travel over the Sierra is ill-advised.\nBuy Photo Reno blanketed in snow on Feb. 10, 2019 from the National Weather Service offices off Raggio Parkway."}, {"url": "https://www.rgj.com/story/life/food/2019/12/09/7-new-and-upcoming-restaurants-reno-sparks-as-of-dec-10-2019-including-great-full-gardens-gourmelt/4379337002/", "title": "5th Great Full Gardens opens today, and other new and upcoming Reno-Sparks restaurants", "authors": ["Johnathan L. Wright", "Published A.M. Pt Dec."], "date": "2019-12-09", "keywords": ["restaurants", "sparks", "restaurant", "great", "center", "dec", "renosparks", "today", "5th", "l", "rgj", "legends", "upcoming", "reno", "northstar", "gardens", "opens"], "summary": "CLOSEBuy Photo Great Full Gardens in the Legends center in Sparks is the group's fifth Northern Nevada location.\nThe shop known for its oozy melty grilled cheese sandwiches is reopening in mid-December in the Sparks Crossing center, according to the restaurant's website.\n____________The interior of the new Great Full Gardens restaurant in the Legends center in Sparks.\nThe restaurants seats about 110 and offers the same menu as Great Full Gardens Midtown and South Meadows.\nJohnathan L. Wright is the food and drink editor of RGJ Media, part of the USA Today Network."}, {"url": "https://www.rgj.com/story/news/2019/11/05/massive-power-outage-leaves-12-600-people-without-electricity-nv-energy-washoe-county/4167251002/", "title": "UPDATE: NV Energy blames debris for massive power outage", "authors": ["Marcella Corona", "Published A.M. Pt Nov."], "date": "2019-11-05", "keywords": ["school", "washoe", "energy", "debris", "reported", "massive", "power", "customers", "according", "update", "blames", "reno", "nv", "outage"], "summary": "A massive power outage has left more than 12,000 NV Energy customers without power on Tuesday, Nov. 5, 2019.\n1:28 p.m. update:The power has been fully restored to all NV Energy customers in Washoe County as of 12 p.m., according to Kristen Saibini, senior corporate communication specialist for NV Energy.\n11:54 a.m. update:Only 12 NV Energy customers are now without power, according to Kristen Saibini, senior corporate communication specialist for NV Energy.\n11:18 a.m. update:A massive power outage has left more than 12,000 people without electricity in Reno, according to NV Energy.\nThe outage has affected a total of 12,656 NV Energy customers."}, {"url": "https://thisisreno.com/2019/10/opinion-defining-renos-downtown/", "title": "OPINION: Defining Reno’s downtown", "authors": [], "date": "2019-10-29", "keywords": ["downtown", "casino", "streets", "core", "renos", "reno", "city", "defining", "area", "kazmierski", "street", "opinion"], "summary": "What comprises Reno’s “downtown,” what urbanists generally define as a city’s business and civic center, has shifted, and our definitions and descriptions need to shift along with it.\nWhat Kazmierski describes already exists, in abundance.”The current “Entertainment District” was indeed once Reno’s downtown, back when the main business district spanned the blocks between the river and the railroad.\nIn the meantime, it’s time to acknowledge—and celebrate—the fact that Reno’s downtown is not what, or where, it used to be.\nThis is the “soul of the community.” If you’re going to define one area as Reno’s downtown, this is it.\nThat doesn’t mean abandoning the casino core, which is slowly diversifying with the addition of residential high-rises, non-gaming hotels, and other amenities."}, {"url": "https://www.rgj.com/story/news/2020/02/04/reno-sparks-pedestrian-fatality-rate-wcsd-students-hit-nevada-public-safety/4599682002/", "title": "16 Reno-area pedestrians died in 2019, the deadliest in years. Here's why it's so bad", "authors": ["Sam Gross", "Published A.M. Pt Feb."], "date": "2020-02-04", "keywords": ["bad", "hit", "shaw", "died", "vehicle", "renoarea", "16", "reno", "incidents", "2019", "students", "deadliest", "according", "pedestrian", "school", "heres", "pedestrians"], "summary": "CLOSE A pedestrian was hit and killed by a Reno fire truck on 4th Street early Saturday morning, Oct. 19, 2019.\nMap: Here are the locations of deadly vehicle versus pedestrian crashes in the Reno-Sparks area in 2019.\nAs of late January, 25 WCSD students were involved in vehicle versus pedestrian injury crashes this school year, according to Kapuler.\nAs a comparison, the Clark County School District — the fifth-largest school district in the nation, with 320,000 students — had 29 students hit as of mid-January.\nIt’s nearly a 20 percent increase over 2018 and 2017, which saw 196 and 197 vehicle versus pedestrian incidents respectively."}, {"url": "https://thisisreno.com/2019/11/photos-into-the-world-of-steampunk/", "title": "PHOTOS: Into the World of Steampunk", "authors": ["Ty O'Neil"], "date": "2019-11-18", "keywords": ["desert", "winter", "weekend", "wonderland", "workshops", "steampunk", "high", "world", "wilbur", "vendor", "photos"], "summary": "Steampunk and “Alice in Wonderland” took over the Wilbur D. May Center this past weekend.\nHigh Desert Steam brought the two together for the Winter Wonderland Expo and Ball.\nActivities at the event included live stage performances, vendor booths with steampunk attire and literature for sale, workshops, panels, and dancing.\nCustom cocktails were offered by High Desert Botanicals and The Glass Die hosted a board game room.\nAttendees had the opportunity to take selfies with those in costume and talk about the sci-fi world of steampunk."}, {"url": "https://www.rgj.com/story/news/2020/01/01/rgj-top-local-news-stories-2019/2785003001/?utm_source=google&utm_medium=amp&utm_campaign=speakable", "title": "These RGJ stories were the most widely read by local readers in 2019", "authors": ["Peggy Santoro", "Published A.M. Pt Jan."], "date": "2020-01-01", "keywords": ["desert", "local", "nevada", "jason", "musselman", "readers", "mustang", "city", "2019", "rgj", "food", "widely", "reno", "read"], "summary": "CLOSE Take a look at the best images of 2019 from the RGJ's Jason Bean & Andy Barron.\n(Photo: Kurt Kuznicki/Contributed photo)APRILAfter a lot of will-he-or-won't-he, he did: Eric Musselman ditched Reno to coach the Arkansas basketball team.\n(Photo: Andy Barron/RGJ)JULYBuy Photo Damage to the front of Argentina Hall at the University of Nevada, Reno is seen during a media tour on July 11, 2019.\n(Photo: Photo by Jenny Kane/RGJ)DECEMBERThe RGJ couldn't bring you these stories of life in Northern Nevada without your support.\nWe ask that you continue to sustain local journalism by subscribing to the RGJ."}, {"url": "https://thisisreno.com/2019/11/residents-tour-homeless-camps-along-truckee-river/", "title": "Residents tour homeless camps along Truckee River", "authors": ["Trevor Bexon"], "date": "2019-11-02", "keywords": ["walk", "tour", "walking", "camps", "waste", "city", "help", "truckee", "say", "residents", "living", "river", "homeless"], "summary": "The tour met at the City of Reno’s Brodhead Park tucked behind Greater Nevada Field on the Truckee River.\nHe has been homeless at points in his life and came to the walk to represent the homeless and make sure no one was being harassed or threatened.\nRead was seen throughout the morning observing the interactions of walk participants when they were speaking to those that are homeless.\n“Homeless living sucks,” he continued.\nWe all [QOL, the homeless and residents] would like to see some change from our city and local government to help with this problem."}, {"url": "https://thetahoeweekly.com/2019/10/tahoe-music-events-festivals-fall-2019-edition/", "title": "Fall 2019 edition - Tahoe Weekly", "authors": ["Tahoe Weekly Is The Tahoe", "Truckee S No. Source For Live Music", "Events", "Festivals", "Entertainment", "Outdoors", "Recreation", "Food", "Wine", "Arts"], "date": "2019-10-02", "keywords": ["weekly", "carson", "edition", "tahoe", "annual", "center", "city", "wine", "2019", "lake", "fall", "nov", "oct", "reno"], "summary": "| battlebornbeerfest.comSouth Lake Tahoe Food & Wine FestivalOct. 25-27 | Harrah’s and Harvey’s Lake Tahoe | Stateline, Nev.\n| tmcc.edu“Mathilda, The Musical”Nov. 8-24 | Carson City Community Center | Carson City, Nev.Roald Dahl’s internationally acclaimed, high-energy will play in Nevada for the first time.\n| veterans.nv.gov“Polar Express” trainNov. 15-Dec. 24 | Carson City Eastgate Depot | Carson City, Nev.\n| virginiatruckee.comTahoe City Holiday HopNov. 30 | Downtown | Tahoe CityKick off the holiday season in style at the Tahoe City Holiday Hop.\n| justinhope.orgBoo-NanzaOct. 29 | Carson City Community Center | Carson City, Nev."}, {"url": "https://www.rgj.com/story/news/2019/11/28/winter-storm-hamper-post-thanksgiving-travel-bring-more-snow/4326155002/", "title": "Another winter storm expected to dump snow this weekend in Reno, Tahoe", "authors": ["Jenny Kane", "Published A.M. Pt Nov."], "date": "2019-11-28", "keywords": ["dump", "winter", "weekend", "inches", "window", "snow", "expected", "national", "storm", "tahoe", "day", "weather", "service", "reno"], "summary": "CLOSE A timelapse from the National Weather Service in Reno's office north of town shows a strong cold front dust Peavine with a coat of snow on Sept. .\nReno Gazette JournalThanksgiving felt a little more like Christmas with the continuing snowfall this week, and the winter weather is expected to continue.\nSnow showers are forecasted throughout the day in the Reno and Tahoe areas on Thanksgiving day and evening with an additional inch to two inches of snow expected tonight in the Reno and Tahoe areas.\nSki resorts could see an additional two to six inches through Friday morning, according to the National Weather Service in Reno.\n\"But then there's more,\" Fuentes said, noting there will be active winter weather on and off through the end of next week."}, {"url": "https://www.rgj.com/story/news/2019/12/05/another-winter-storm-expected-hit-sierra-lake-tahoe-weekend-interstate-80-reno-sparks-snow-passes/2624569001/", "title": "Another winter storm is expected to hit the Sierra, Lake Tahoe this weekend; here's what to expect", "authors": ["Sam Gross", "Published P.M. Pt Dec."], "date": "2019-12-05", "keywords": ["winter", "weekend", "expect", "expected", "storm", "hit", "tahoe", "warning", "wet", "lake", "travel", "sierra", "heres", "reno"], "summary": "Another winter storm is on track to bring snow and rain to Lake Tahoe, the Sierra, Reno-Sparks and other communities along the Sierra Front in western Nevada.\nThe storm is expected to move into the region Friday evening and last until Sunday morning, according to the National Weather Service in Reno.\nThe weather service has issued a winter storm warning for the greater Lake Tahoe region, which includes South Lake Tahoe, Truckee.\nWinter Storm Warning in effect for Sierra elevations above 5500 feet.\n#CAwxpic.twitter.com/NhcFJGghAF — NWS Sacramento (@NWSSacramento) December 5, 2019The storm is mainly expected to impact the Sierra and Lake Tahoe regions Friday and Saturday and move into western Nevada by Saturday evening."}, {"url": "https://thisisreno.com/2019/12/throwing-shade-a-city-ordinance-change-will-reduce-public-input-on-luxury-hotel-project/", "title": "Throwing Shade: A city ordinance change will reduce public input on luxury hotel project (updated)", "authors": ["Bob Conrad"], "date": "2019-12-12", "keywords": ["hotel", "proposed", "change", "building", "reduce", "shade", "city", "project", "ordinance", "input", "throwing", "updated", "luxury", "development", "projects", "public", "reno"], "summary": "UPDATE (December 12, 2019): The Reno City Council voted yesterday to approve the ordinance change.\nMore than 200 people wrote and spoke against the ordinance change.\nCritics say a change to a city ordinance regarding the shading at public parks and plazas would reduce opportunity for public input on a 20-story hotel and office building across from Wingfield Park.\nCharlat said that the hotel project would impact the church at a cost of up to $250,000.\nIt was all types of housing.”Councilmember Jenny Brekhus opposed the ordinance change at the city’s Dec. 4, 2019 meeting."}, {"url": "https://thisisreno.com/2019/11/photos-veterans-day-parade-in-downtown-reno/", "title": "PHOTOS: Veterans Day parade in downtown Reno", "authors": ["Ty O'Neil"], "date": "2019-11-12", "keywords": ["downtown", "wilson", "veterans", "virginia", "parade", "day", "victory", "america", "turned", "armistice", "street", "reno", "photos"], "summary": "Hundreds of participants and spectators turned out Monday to honor area veterans during the 2019 Veterans Day Parade in downtown Reno.\nThe parade began at the Virginia Street Bridge and continued north along Virginia Street to Fifth Street.\nThis year’s parade marked the 100th anniversary of Armistice Day, proclaimed by President Wilson Nov. 11, 1919.\nHe said:“To us in America, the reflections of Armistice Day will be filled with solemn pride in the heroism of those who died in the country’s service and with gratitude for the victory, both because of the thing from which it has freed us and because of the opportunity it has given America to show her sympathy with peace and justice in the councils of the nations…”"}, {"url": "https://lasvegassun.com/news/2020/mar/25/a-timeline-of-the-coronavirus-crisis-in-las-vegas/", "title": "A timeline of the coronavirus crisis in Las Vegas", "authors": ["Unlv Photo Services"], "date": "2020-03-25", "keywords": ["county", "district", "sisolak", "steve", "timeline", "clark", "announces", "las", "vegas", "coronavirus", "nevada", "crisis"], "summary": "Steve Sisolak announces that the federal government approved testing for the virus at two commercial labs, joining two public labs.\n• March 10: MGM Resorts International announces that it is temporarily closing buffets at its Las Vegas Strip properties.\nIt’s a major blow to Las Vegas, which counts the opening weekend of the men’s tournament as one of its busiest of the year.\n• March 14: Cirque du Soleil, creator of many of the most popular shows in Las Vegas, says it is temporarily suspending its productions in Las Vegas and around the world.\n• March 16: The Roman Catholic Diocese of Las Vegas cancels Mass at least through the April 5 weekend, a week before Easter."}, {"url": "https://thisisreno.com/2019/12/16-things-to-do-this-week-in-the-reno-area-2/", "title": "16 things to do this week in the Reno area", "authors": ["Tabitha Mueller"], "date": "2019-12-16", "keywords": ["things", "event", "local", "way", "dec", "holiday", "16", "evening", "week", "800", "season", "performing", "area", "reno"], "summary": "Ballet’s “The Nutcracker.” Photo: Patrick KennedyWelcome to our weekly column of things to do in the Reno area!\nDJs gather each week with special guests to listen to some classic tunes as well as modern re-mixes.\nHosted by AAF, AIGA, PRSA, PSN, and Reno AMA, this is a fabulous (and fun!)\nTickets start at $27https://thisisreno.com/calendar/a-v-a-ballet-theatre-and-the-reno-phils-the-nutcracker/2019-12-13/Saturday, December 14Celebrate the Holiday Season with some Jazz2:00 p.m., Cargo Concert HallThe Reno Jazz Orchestra brings in the holiday season with their “Home for the Holidays” show featuring world-renowned trombonist Bob McChesney and vocalist Calabri Foti headlining the 17-piece orchestra.\n10:00 a.m. – 3:00 p.m., Lakeridge Golf Course – 19th HoleShop local and handmade this holiday season when you stop by the Annual Holiday Fair featuring local artists, craftsmen, and small businesses."}, {"url": "https://thisisreno.com/2019/12/photos-reno-year-in-review-for-2019/", "title": "PHOTOS: Reno year in review for 2019", "authors": ["Ty O'Neil"], "date": "2019-12-27", "keywords": ["downtown", "photographer", "ty", "image", "laue", "rodeo", "2019", "oneil", "review", "nevada", "reno", "photos"], "summary": "Revelers rang in 2019 in frigid, 20-degree temperatures in downtown Reno.\nThe third annual women’s march was Jan. 19 in downtown Reno and brought together hundreds of women that marched from the Reno Arch to the Reno City Plaza.\nRather than take the usual photos with campaign signs, podium and stage, photographer Ty O’Neil captured several images before Sanders took the mic.\nSenator Bernie Sanders speaks at the University of Nevada, Reno in his second of three visits to northern Nevada in 2019 for his 2020 presidential campaign.\nDía de los Muertos brought out thousands to enjoy the colorful celebrations along Wells Avenue and at the University of Nevada, Reno."}, {"url": "https://thisisreno.com/2019/12/15-things-to-do-this-week-in-the-reno-area-2/", "title": "15 things to do this week in the Reno area", "authors": ["Tabitha Mueller"], "date": "2019-12-15", "keywords": ["things", "dance", "event", "tree", "way", "events", "music", "fun", "week", "open", "night", "15", "area", "reno"], "summary": "Welcome to our weekly column of things to do in the Reno area!\nThe event takes place every Monday and can be a fun way to meet new people and get involved in Reno’s artistic community.\nIf you’ve never tried line dancing before, this is a fun way to start.\nKaraoke night is a fun way to get out and let loose after a long week.\nhttps://thisisreno.com/calendar/dj-sandhu-at-lex/Dance back to the ’80s9:00 p.m. – 2:00 a.m., The Polo Lounge RenoFluff up your hair, break out your neon, and head out to The Polo Lounge Reno for their 80’s night dance party."}, {"url": "https://www.nevadabusiness.com/2020/01/rsar-releases-2019-fourth-quarter-december-existing-home-sales-report/", "title": "RSAR Releases 2019 Fourth Quarter/December Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2020-01-09", "keywords": ["homes", "sales", "existing", "report", "quarterdecember", "singlefamily", "quarter", "median", "releases", "rsar", "2019", "price", "increase", "fourth"], "summary": "RSAR Releases 2019 Fourth Quarter/December Existing Home Sales ReportRENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its 2019 fourth quarter and December 2019 reports on existing home sales in Reno/Sparks and Fernley, including median sales price and number of home sales in the region.\nFourth Quarter 2019Reno/SparksIn the fourth quarter of 2019, the report showed Reno/Sparks had 1,516 sales of existing single-family homes; with a 15 percent increase from last year and a 16 percent decrease from the previous quarter.\nThe median sales price of an existing condominium/townhome in Reno/Sparks in the fourth quarter of 2019 was $226,000; an increase of 16 percent from a year ago.\nThe existing condominium/townhome median sales price for the fourth quarter of 2019 was $248,500; an increase of 24 percent from the past year.\nThe existing condominium/townhome median sales price for 2019’s fourth quarter in Sparks was $200,000; an increase of 7 percent from last year."}, {"url": "https://www.rgj.com/story/life/food/2019/12/09/7-new-and-upcoming-restaurants-reno-sparks-as-of-dec-10-2019-including-great-full-gardens-gourmelt/4379337002/", "title": "5th Great Full Gardens opens today, and other new and upcoming Reno-Sparks restaurants", "authors": ["Johnathan L. Wright", "Published A.M. Pt Dec."], "date": "2019-12-09", "keywords": ["restaurants", "sparks", "restaurant", "great", "center", "dec", "renosparks", "today", "5th", "l", "rgj", "legends", "upcoming", "reno", "northstar", "gardens", "opens"], "summary": "CLOSEBuy Photo Great Full Gardens in the Legends center in Sparks is the group's fifth Northern Nevada location.\nThe shop known for its oozy melty grilled cheese sandwiches is reopening in mid-December in the Sparks Crossing center, according to the restaurant's website.\n____________The interior of the new Great Full Gardens restaurant in the Legends center in Sparks.\nThe restaurants seats about 110 and offers the same menu as Great Full Gardens Midtown and South Meadows.\nJohnathan L. Wright is the food and drink editor of RGJ Media, part of the USA Today Network."}, {"url": "https://thisisreno.com/2020/04/tmwa-defers-pre-approved-rate-increase-suspends-water-shutoffs/", "title": "TMWA defers pre-approved rate increase, suspends water shutoffs", "authors": ["Carla O'Day"], "date": "2020-04-11", "keywords": ["defers", "increases", "board", "increase", "shutoffs", "water", "money", "preapproved", "hartung", "tmwa", "rate", "customers", "planned", "suspends"], "summary": "The Truckee Meadows Water Authority board on Friday postponed a rate increase scheduled to go into effect in May and plans to revisit the issue in coming months.\n“While this rate increase is necessary, right now is not the correct time for implementation.\nAt the December 2018 meeting, the board approved deferring the third 2.5 percent rate increase out to May 2020, with the fourth and fifth planned for May 2021 and May 2022.\nBoard member Neoma Jardon suggested TMWA tap its Rate Stabilization Fund to help with immediate budget issues.\nTMWA has also suspended water shutoffs for customers."}, {"url": "https://thisisreno.com/2019/12/sanders-rally-draws-crowd-falls-flat/", "title": "Sanders rally draws crowd, falls flat (subscriber content)", "authors": ["Tabitha Mueller"], "date": "2019-12-10", "keywords": ["writer", "falls", "tabitha", "draws", "rally", "storytelling", "renos", "sanders", "content", "reno", "playing", "subscriber", "quidditch", "podcasts", "crowd", "terrain", "tracking", "flat"], "summary": "Tabitha Mueller is a freelance writer and multimedia journalist based out of Reno, Nevada.\nShe is fascinated by storytelling, place, and the intersection of narrative and data analysis and holds a bachelor’s degree in Geography and English and American Literatures from Middlebury College.\nWhen she is not tracking down a story or listening to podcasts, you can find her hiking Nevada’s gorgeous terrain, perusing local bookstores, playing Quidditch, and discovering Reno’s hidden stories."}, {"url": "https://www.rgj.com/story/news/2019/12/16/reno-house-catches-fire-rfd-says-its-abandoned/2668547001/", "title": "Update: Fire now contained at abandoned house in downtown Reno", "authors": ["Sam Gross", "Published P.M. Pt Dec."], "date": "2019-12-16", "keywords": ["downtown", "house", "abandoned", "jensen", "building", "structure", "contained", "intense", "additional", "turned", "nevada", "update", "street", "reno"], "summary": "CLOSE Structure fire at 447 Nevada Street Reno Gazette JournalThis story has been updated with additional information.\nFirefighters squared off against an intense fire in an abandoned home in downtown Reno on Monday.\nThere were no injuries and the house, which was slated for demolition, appears to be a total loss, according to Brad Jensen, a battalion chief with Reno Fire.\nThe house, located at 447 Nevada Street, is directly adjacent to a Starbucks and other businesses on the corner of Fifth and Nevada streets.\nThe two-bedroom, one-bath house dates back to 1930, according to the real estate website Zillow."}, {"url": "https://www.rgj.com/story/news/2019/12/14/national-weather-service-winter-storm-snow-reno-tahoe-saturday/2650483001/", "title": "More snow on tap for Reno-Tahoe Saturday night to Sunday, forecasters say", "authors": ["Marcella Corona", "Published A.M. Pt Dec."], "date": "2019-12-14", "keywords": ["cloudy", "inches", "snowfall", "snow", "sunny", "low", "high", "tap", "say", "night", "forecasters", "weather", "nevada", "area", "renotahoe"], "summary": "That front will then drop south through the area, bringing snow levels to all valley floors by the afternoon and evening.\n“Keep in mind that it doesn’t take much snow to bring travel difficulties,” forecasters said in the special weather statement.\nForecasters said they expect the band of snow to move out of the region by sunrise on Sunday.\nAnother round of snow is expected tonight that could bring snow impacts to the lower elevations of western Nevada.\nSnowfall overnight could be very hit and miss with 0-3 inches of snow in western Nevada and 0-5 inches of snow in the Sierra."}, {"url": "https://www.pymnts.com/blockchain/bitcoin/2020/bitcoin-daily-canaan-reports-148-million-losses-2019-shopping-app-fold-signs-visa-fast-track-program/", "title": "Canaan Reports $148.6M In Losses For 2019", "authors": [], "date": "2020-04-09", "keywords": ["registered", "consumers", "fold", "purchase", "1486m", "canaan", "bitcoin", "rewards", "2019", "million", "public", "reports", "card", "losses"], "summary": "Canaan Creative, the Chinese bitcoin miner maker, registered a net loss of $148.6 million for last year on $204.3 million in revenue, CoinDesk reported.\nCanaan, for its part, put forward its inaugural earnings report after going public last November in the United States.\nCanaan said it sold overall computer power of 10.5 exhashes per second that comprised for approximately 20 percent of the computing power growth of the bitcoin network in 2019.\nFold will now have the ability to provide a co-branded Visa card that lets consumers receive bitcoin rewards via Fast Track.\nWith the Fold card, customers will be able to spend dollars and earn bitcoin in return on each purchase."}, {"url": "https://www.rgj.com/story/news/2019/12/05/another-winter-storm-expected-hit-sierra-lake-tahoe-weekend-interstate-80-reno-sparks-snow-passes/2624569001/", "title": "Another winter storm is expected to hit the Sierra, Lake Tahoe this weekend; here's what to expect", "authors": ["Sam Gross", "Published P.M. Pt Dec."], "date": "2019-12-05", "keywords": ["winter", "weekend", "expect", "expected", "storm", "hit", "tahoe", "warning", "wet", "lake", "travel", "sierra", "heres", "reno"], "summary": "Another winter storm is on track to bring snow and rain to Lake Tahoe, the Sierra, Reno-Sparks and other communities along the Sierra Front in western Nevada.\nThe storm is expected to move into the region Friday evening and last until Sunday morning, according to the National Weather Service in Reno.\nThe weather service has issued a winter storm warning for the greater Lake Tahoe region, which includes South Lake Tahoe, Truckee.\nWinter Storm Warning in effect for Sierra elevations above 5500 feet.\n#CAwxpic.twitter.com/NhcFJGghAF — NWS Sacramento (@NWSSacramento) December 5, 2019The storm is mainly expected to impact the Sierra and Lake Tahoe regions Friday and Saturday and move into western Nevada by Saturday evening."}, {"url": "https://www.rgj.com/story/news/2019/12/02/incline-schools-delay-all-other-wcsd-schools-normal-schedule-sierra-snow/4350642002/", "title": "Storm updates: Chain controls dropped on Interstate 80", "authors": ["Brian Duggan", "Sam Gross", "Published A.M. Pt Dec."], "date": "2019-12-02", "keywords": ["snow", "storm", "80", "interstate", "updates", "morning", "city", "dropped", "chain", "western", "according", "weather", "nevada", "controls", "school", "schools"], "summary": "CLOSEChain controls dropped on Interstate 80Update, 10:35 a.m.All chain controls on Interstate 80 have been dropped, according to a tweet from Caltrans.\nhttps://t.co/j5dyOtQCIZ — Caltrans District 3 (@CaltransDist3) December 2, 2019Carson City schools on snow dayUpdate, 9:17 a.m.\nOn the valley floors of Western Nevada, precipitation from the storm has mostly turned to rain.\nCarson City schools are also on a two hour delay as is the Western Nevada College campus in the capital (the delay doesn’t affect WNC’s Fallon campus).\nThe Carson City School District sent this statement Monday morning: “Principals will adjust the school schedule for the shortened day."}, {"url": "http://nevadasagebrush.com/blog/2020/04/10/nshe-approves-contract-extension-for-johnson-proposes-credit-surcharge/", "title": "NSHE approves contract extension for Johnson, proposes credit surcharge", "authors": ["Taylor Avery", "Andrew Mendez", "Rylee Jackson", "Emilie Rodriguez", "Vincent Rendon", "Matt Cotter", "Isaiah Burrows", "Matt Hanifan"], "date": "2020-04-10", "keywords": ["reduction", "budget", "nshe", "board", "proposes", "state", "college", "regents", "president", "approves", "extension", "surcharge", "students", "nevada", "contract", "johnson", "credit"], "summary": "NSHE also announced the Board of Regents approved of a budget reduction proposal.\nThe proposal was in response to Nevada Governor Steve Sisolak’s request for budget reduction proposals from all state agencies.\nThe budget reduction for NSHE totaled $124.7 million for the two-year period – $27 million in 2020 and $97 million in 2021,” NSHE said in an email.\nNevada State College students would pay $5 more.\nCollege of Southern Nevada, Great Basin College, Truckee Meadows Community College and Western Nevada College students will pay $3 more per course."}, {"url": "https://www.rgj.com/story/news/2019/12/13/nhp-hazmat-spill-closes-i-580-mill-street-plumb-lane-reno/2642700001/", "title": "UPDATE: I580 is reopened in both directions following an acid spill", "authors": ["Marcella Corona", "Published P.M. Pt Dec."], "date": "2019-12-13", "keywords": ["directions", "highway", "nevada", "580", "shut", "i580", "interstate", "acid", "lanes", "hydrochloric", "following", "reopened", "update", "spill", "incident"], "summary": "CLOSEBuy Photo A Reno police officer directs traffic under the I-580 at the Mill Street onramp during an acid spill on the freeway on Friday afternoon, Dec. 13, 2019.\n(Photo: Andy Barron/RGJ)4:37 p.m. update:Travel lanes in both directions on Interstate 580 have been reopened, according to the Nevada Highway Patrol.\nThe highway was temporarily closed due to a hydrochloric acid spill on Friday afternoon.\n\"It's not as strong as hydrochloric acid,\" he said, adding authorities are still investigating where the material came from.\nAnyone with information on the hydrochloric acid spill is asked to contact the Nevada Highway Patrol."}, {"url": "https://www.rgj.com/story/news/crime/2019/12/31/sparks-police-arrest-man-connection-shooting/2785185001/", "title": "Police arrest man in connection to a shooting in Sparks", "authors": ["Marcella Corona", "Published A.M. Pt Dec."], "date": "2019-12-31", "keywords": ["connection", "county", "sparks", "man", "washoe", "weapon", "neglect", "prohibited", "zepedagonzalez", "shooting", "owning", "arrest", "possessing"], "summary": "(Photo: Provided by the Washoe County Sheriff's Office)Investigators arrested a man following a shooting on Monday at a motel in Sparks, according to the Sparks Police Department.\nMarcial Zepeda-Gonzalez, 37, faces several charges including battery with a deadly weapon, child abuse or neglect and owning or possessing a gun by a prohibited person.\nAt about 12:16 p.m. on Monday, officers responded to a report of gunfire at the Aloha Inn in the 200 block of North McCarran Boulevard.\nWhen they arrived, they found a man with gunshot wounds lying on the ground.\nZepeda-Gonzalez was interviewed at the Sparks Police Department and was later booked into the Washoe County jail."}, {"url": "https://www.rgj.com/story/news/2020/03/12/reno-forecasters-winter-storm-dump-snow-rain-weekend/5037324002/", "title": "'Biggest winter storm' of the year to dump mountain snow, rain over the weekend", "authors": ["Marcella Corona", "Published P.M. Pt March"], "date": "2020-03-12", "keywords": ["dump", "winter", "weekend", "precipitation", "snow", "storm", "high", "region", "mountain", "mph", "weather", "forecasters", "reno", "rain", "biggest"], "summary": "Reno forecasters predict an incoming winter storm will drop mountain snow and valley rain over the weekend.\nReno forecasters are expecting a strong winter storm to hit the region over the weekend, bringing with it, cold temperatures, gusty winds, mountain snow and maybe some rain in the valley areas.\nThe storm is expected to dump 2 to 3 feet of snow in the high Sierra through Monday morning.\nLooking aheadLaGuardia said the gloomy weather could last through early next week, dropping more rain and snow.\nLaGuardia said he believes the incoming storm is one of the \"biggest winter storms for this calendar year.\""}, {"url": "https://thisisreno.com/2019/12/our-top-stories-of-2019/", "title": "Our top stories of 2019", "authors": ["Bob Conrad"], "date": "2019-12-31", "keywords": ["county", "ty", "local", "media", "independent", "city", "2019", "school", "reno", "bikes"], "summary": "Ty O’Neil’s 2019 image from the Reno Rodeo was named one of the top-50 images of the year by My Modern Met.\nThis Is Reno in 2019 saw record website visits, increased social media engagement and productive partnerships with other local media sources.\nThese stories reached more than a half million unique visitors in 2019 with most readers coming directly to thisisreno.com and through online searches.\nWashoe County School District melts down“It’s business as usual.” School Board Trustee Katy Simon HollandWashoe County School District’s foibles dominated reader interest in 2019.\nNine stories about the district were in our top-20 for 2019."}, {"url": "https://q13fox.com/2019/12/19/lacey-police-searching-for-level-3-sex-offender-who-cut-off-gps-tracker/", "title": "CAPTURED: Lacey Police track accused child molester Patrick Middleton to Reno, NV", "authors": ["David Rose"], "date": "2019-12-19", "keywords": ["accused", "sex", "middleton", "child", "track", "reno", "wanted", "lacey", "say", "molestation", "captured", "molester", "nv", "patrick", "offender"], "summary": "RENO, NV — January 25, 2020Lacey Police detectives tracked Level III sex offender Patrick Middleton to Reno, Nevada.\nFUGITIVE UPDATE January 10, 2020 —Lacey Police detectives say wanted sex offender, Patrick Middleton, may have been spotted on the coast in Warrenton and Seaside, Oregon and Ocean Park, Washington.\nPlease enable Javascript to watch this videoFUGITIVE WANTED IN LACEY Dec. 19, 2019 --Lacey Police are asking for the public's help to find Level 3 sex offender Patrick Middleton.\nThey say he cut off his GPS tracker and is wanted for 2 counts Child Molestation 1st Degree.\n\"Patrick Middleton is a registered sex offender already."}, {"url": "https://thisisreno.com/2019/12/free-six-places-to-recycle-your-christmas-tree/", "title": "FREE: Six places to recycle your Christmas tree", "authors": [], "date": "2019-12-26", "keywords": ["valley", "trees", "washoe", "tree", "visit", "recycling", "recycle", "places", "truckee", "free", "spanish", "reno", "christmas"], "summary": "Local agencies are partnering with the state to recycle Christmas trees at no charge.\nIn the Reno area, there are drop off locations at area parks and fire stations.\nMore than 159,000 trees have been recycled, since 2003, through the Keep Truckee Meadows Beautiful Christmas Tree Recycling program, thanks to the help of thousands of volunteers and many partners.\nThe Boy Scouts of America also offer a Christmas Tree pick up service on Saturday, December 28 and Saturday, January 4.\nFor more information on Christmas tree recycling programs, visit ndep.nv.gov/nevada-recycles."}, {"url": "https://www.nevadabusiness.com/2019/12/business-indicators-december-2019/", "title": "Business Indicators December 2019", "authors": ["Stephen Miller"], "date": "2019-12-01", "keywords": ["gain", "business", "sales", "strong", "jobs", "indicators", "yearoveryear", "economic", "experienced", "2019", "employment", "nevada", "gained"], "summary": "U.S. nonfarm employment gained 128,000 jobs in October with large losses in the manufacturing sector due to the auto industry strike.\nAugust taxable sales experienced a strong year-over-year rise of 7.6 percent, while gasoline sales (in gallons) increased slightly by 0.8 percent over the same period.\nSeasonally adjusted employment gained 5,500 jobs in September, up by 2.1 percent from last year.\nAugust taxable sales and gasoline sales for Washoe and Storey Counties experienced year-over-year gains, up by 6.9 and 2.6 percent, respectively.\nSeptember total airport passengers continued its strong year-over-year gain, increasing by 8.1 percent."}, {"url": "https://thisisreno.com/2019/12/health-district-more-flu-illnesses-earlier-this-season-than-previous-years/", "title": "Health District: More flu illnesses earlier this season than previous years", "authors": ["Carla O'Day"], "date": "2019-12-22", "keywords": ["county", "district", "seasons", "washoe", "symptoms", "illnesses", "flu", "health", "season", "earlier", "according", "influenza", "previous"], "summary": "Washoe County has had three influenza-related deaths this season, all among people younger than 40, and health officials are urging people to get vaccinated.\nA total of 96 people locally have been hospitalized due to flu-like symptoms, according to the Washoe County Health District.\nKevin Dick, WashoeCounty Health District.\n“We cannot overstate the importance of the flu shot,” Kevin Dick, Washoe County Health District officer, said in a statement.\nThis season’s predominant strain has been Influenza B/Victoria, unlike most influenza seasons that experience higher activity due to Influenza A, information from the health district states."}, {"url": "https://www.rgj.com/story/news/2019/12/05/dense-fog-cancels-delays-and-diverts-flights-reno-tahoe/2620777001/", "title": "Flights delayed, diverted and canceled at Reno-Tahoe International Airport due to dense fog", "authors": ["Sam Gross", "Published A.M. Pt Dec."], "date": "2019-12-05", "keywords": ["canceled", "airport", "youre", "snow", "kulpin", "delayed", "international", "today", "visibility", "reno", "weather", "fog", "dense", "flights", "renotahoe", "diverted"], "summary": "CLOSEBuy Photo The air traffic control tower at the Reno-Tahoe International airport is seen in dense fog on Dec. 5, 2019.\n(Photo: JASON BEAN/RGJ)Several flights at the Reno-Tahoe International Airport have been diverted, delayed or outright canceled this morning due to dense fog socking in the valley.\nAirport spokesperson Brian Kulpin said so far two inbound flights have been diverted to Sacramento and several others have been canceled or delayed.\nDense Fog Advisory will be in effect thru Friday @ 10AM - https://t.co/wVq88gvUsHFog is impacting flight and road travels today.\n\"At about a quarter mile of visibility, you're really facing a challenge in landing and taking off an aircraft.\""}, {"url": "https://www.capradio.org/articles/2020/03/13/as-coronavirus-cases-mount-nevada-declares-emergencies-braces-for-impact-on-casinos/", "title": "As Coronavirus Cases Mount, Nevada Declares Emergencies, Braces For Impact On Casinos", "authors": ["Bert Johnson"], "date": "2020-03-13", "keywords": ["city", "mount", "coronavirus", "nevada", "impact", "emergencies", "dick", "step", "washoe", "ready", "explained", "sisolak", "cases", "health", "declares", "casinos", "braces", "reno", "care"], "summary": "On Friday, the city of Reno did the same — even though at that point, Washoe County only had three confirmed cases.\nMeanwhile, public concerns over the virus have already caused declining business in Nevada, where the economy largely relies on tourism.\nAt a separate press conference earlier in the day, Washoe County District Health Officer Kevin Dick explained that public health officials could force casinos to close if the situation were grave enough.\n“We are not near any point in making that decision right now.”In the near term, Dick explained that a statewide shortage of health care providers makes prevention efforts even more crucial.\n“Based on the number of health care providers and access to health care that we have, which is low versus other states in the nation, if we do have an outbreak that will put more strain on our health care system,” he said."}, {"url": "https://www.rgj.com/story/news/crime/2019/12/19/driver-who-hit-and-killed-pedestrian-80-arrested-dui-having-suspended-license/2700971001/", "title": "NHP: Driver who hit and killed pedestrian on I-80 arrested for DUI, having suspended license", "authors": ["Sam Gross", "Published P.M. Pt Dec."], "date": "2019-12-19", "keywords": ["irene", "county", "boomtown", "suspended", "nhp", "washoe", "i80", "dui", "hit", "interstate", "having", "killed", "21", "license", "pedestrian", "count", "vasquez", "driver"], "summary": "CLOSEFrancene Irene Vasquez, 21 (Photo: Washoe County Jail)One person was arrested and accused of being intoxicated after they struck and killed a pedestrian on Interstate 80 near Boomtown Wednesday evening, according to the Nevada Highway Patrol.\nFrancene Irene Vasquez, 21, was booked into Washoe County Jail on Dec. 18 for one count of DUI and one count of driving with a suspended license.\nFATAL CRASH: Vehicle vs. pedestrian on W/B IR-80 and Boomtown.\n— NHP Northern Command (@NHPNorthernComm) December 19, 2019It's still unclear why the pedestrian was on the interstate.\nNHP Trooper Hannah DeGoey said investigators are still working to determine who was at fault in the crash."}, {"url": "https://thisisreno.com/2019/12/city-to-review-multiple-projects-in-housing-initiative/", "title": "City to review multiple projects in housing initiative", "authors": ["Tabitha Mueller"], "date": "2019-12-10", "keywords": ["submissions", "initiative", "multiple", "submitted", "city", "project", "review", "housing", "staff", "units", "developer", "projects", "reno"], "summary": "Krater was joined in September on a housing forum panel with the Reno Housing Authority’s Amy Jones, left, and developer Bob Lissner, right.\n“1,000 Home in 120 Days” is a plan to increase housing developments in Reno by deferring city fees for builders constructing environmentally and socially conscious housing.\nAlthough the City is enthusiastic about the project proposals, housing advocates are concerned about the lack of stipulations for affordable housing.\n[The City] does not want to create red-lining of affordable housing and non-affordable districts.”More housing options, he said, may ultimately decrease rent prices.\nThe first application review of the project submissions in a staff report to council shows a mixture of multi-family, student housing, townhomes and senior housing types."}, {"url": "https://www.rgj.com/story/news/2019/12/27/immunize-nevada-cancels-events-following-anti-vaxxer-harassment/2753476001/", "title": "Immunize Nevada cancels events after social media harassment", "authors": ["Marcella Corona", "Published P.M. Pt Dec."], "date": "2019-12-27", "keywords": ["immunize", "event", "parker", "exemptions", "media", "events", "health", "social", "host", "community", "cancels", "nevada", "harassment", "organization"], "summary": "The comments were bringing down the overall review ratings, according to Immunize Nevada executive director Heidi Parker.\nImmunize Nevada blacked out the names of the posters and the venue.\n(Photo: Provided by Immunize Nevada)A financial hitWith sponsorships from groups such as the Community Health Alliance, Immunize Nevada booked the venues and made food arrangements several months in advance.\nImmunize Nevada reported the hecklers to Facebook and Yelp, which took down the comments.\nVanessa Vancour, a spokeswoman for the Community Health Alliance, described the decision as unfortunate."}, {"url": "https://www.rgj.com/story/news/2019/12/20/nws-its-unlikely-reno-sparks-get-white-christmas-interstate-80-snow-chain-controls-lake-tahoe/2715036001/", "title": "It's unlikely Reno-Sparks will get a white Christmas, but travel through the Sierra could be stormy", "authors": ["Sam Gross", "Published P.M. Pt Dec."], "date": "2019-12-20", "keywords": ["stormy", "winter", "snow", "expected", "renosparks", "laguardia", "lake", "travel", "weather", "driving", "sierra", "white", "unlikely", "reno", "christmas"], "summary": "Reno Gazette-JournalIt's not looking likely that Reno-Sparks will have a white Christmas this year.\nBut that doesn't mean December's active winter weather pattern won't hamper holiday travel at Lake Tahoe and over the high Sierra passes.\nAt Lake Tahoe level, just a few inches of snow is expected — just enough to slicken roads.\nSnow is in the forecast for the Sierra, so make sure that you have a solid winter driving kit while traveling through the mountains!\nWhat's your winter driving tip?"}, {"url": "https://www.rgj.com/story/news/education/2019/12/18/3-drug-dealers-linked-2-unr-deaths-get-sentenced/2692935001/", "title": "Dealers who sold fatal drugs to UNR students sentenced to prison, probation", "authors": ["Siobhan Mcandrew", "Published P.M. Pt Dec."], "date": "2019-12-18", "keywords": ["drug", "sold", "probation", "fatal", "hearing", "sentenced", "winters", "donovan", "drugs", "unr", "2019", "students", "sentencing", "prison", "taylor", "reno", "dealers", "watts"], "summary": "CLOSE UNR moms Robyn Watts and Teresa Taylor react after attending the sentencing hearing at Washoe County Courthouse on Dec. 18, 2019.\nReno Gazette JournalTwo drug dealers linked to the deaths of two University of Nevada, Reno students were sentenced to prison on Wednesday.\nA third dealer, also linked to a drug ring operating out a house on Oliver Street in Reno, was sentenced to probation.\nTheir sons, Jordan Watts and Ben Taylor, died in March from an overdose of drugs laced with fentanyl linked to the defendants.\n(Photo: JASON BEAN/RGJ)Taylor and Watts went to police with phone messages linking their sons' purchases to the group of drug dealers that sold to students."}, {"url": "https://www.rgj.com/story/news/2019/12/07/winter-storm-winds-mountain-snow-valley-rain-sierra-nevada-weather/4366591002/", "title": "UPDATE: Chains required on I80 west of Truckee", "authors": ["Marcella Corona", "Published P.M. Pt Dec."], "date": "2019-12-07", "keywords": ["snow", "i80", "low", "sunny", "storm", "west", "chains", "high", "afternoon", "truckee", "required", "weather", "western", "nevada", "update", "reno"], "summary": "Forecasters issue wind advisory for portions of western Nevada.\n5 p.m. update:Chains are required on vehicles without four-wheel drive or snow tires on two major roads:Mt.\nRose Highway, from Galena Creek Regional Park to Incline VillageInterstate 80, from Donner Lake Road to Kingvale, west of Truckee.\nSaturday afternoon and early evening will also be the peak period for spillover rainfall across western Nevada.\nThe National Weather Service issued a wind advisory for portions of western Nevada, including Reno, the North Valleys, Carson City and Carson Valley."}, {"url": "https://www.nevadabusiness.com/2020/02/rsar-releases-january-2020-existing-home-sales-report/", "title": "RSAR Releases January 2020 Existing Home Sales Report", "authors": ["Chrisie Yabu"], "date": "2020-02-11", "keywords": ["homes", "sales", "existing", "2020", "report", "singlefamily", "renosparks", "median", "releases", "rsar", "2019", "price", "increase"], "summary": "RENO, Nev. – The Reno/Sparks Association of REALTORS® (RSAR) today released its January 2020 report on existing home sales in Reno/Sparks and Fernley, including median sales price and number of home sales in the region.\nDuring January 2020, the report showed Reno/Sparks had 377 sales of existing single-family homes; with a 16 percent increase from last year and a 27 percent decrease from one month ago.\nThe median sales price of an existing condominium/townhome in Reno/Sparks in January 2020 was $246,000; an increase of 33 percent from a year ago.\nThe existing condominium/townhome median sales price for January 2020 in Reno was $255,750; a 46 percent increase from last year.\nThe existing condominium/townhome median sales price for January 2020 in Sparks was $215,000; a 12 percent increase from last year."}]