[{"url": "https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2020/04/16/amid-pandemic-a-ray-of-light-for-gun-control-advocates-on-nras-home-turf", "title": "Amid Pandemic, a Ray of Light for Gun Control Advocates on NRA's Home Turf", "authors": [], "date": "2020-04-16", "keywords": ["ray", "pandemic", "advocates", "state", "states", "gun", "democratic", "turf", "amid", "senate", "laws", "light", "legislation", "control", "rights", "virginia", "nras"], "summary": "Carmen Lodato began advocating with gun control group Moms Demand Action after her mother was shot and killed in Alexandria, Virginia, in 2014.\nAdvocates like her were instrumental in getting stricter gun laws implemented this year.\nEverything follows.”A week later, on Martin Luther King Jr. Day, an estimated 22,000 gun rights activists, many heavily armed, gathered on the Capitol grounds to protest gun control legislation.\n“Contrary to what the other side is saying, the election is not a referendum on gun control,” he said.\nAs one of the fiercest and most vocal gun rights advocates in the legislative body, Republican state Sen. Amanda Chase, known for carrying a pistol into floor debates, remained opposed to any gun control measures."}, {"url": "https://wtop.com/virginia/2020/01/in-richmond-gun-rights-rally-looms-over-va-lobby-day/", "title": "In Richmond, gun-rights rally looms over Va. Lobby Day", "authors": ["News Traffic Weather"], "date": "2020-01-20", "keywords": ["va", "ap", "told", "rally", "lobby", "day", "gun", "virginia", "square", "richmond", "threats", "looms", "gunrights", "capitol"], "summary": "Gun-rights advocates filled Virginia's Capitol Square and the streets of Richmond on a chilly, uneasy Monday to lobby and rally against tighter gun legislation in the commonwealth.\nGun-rights advocates filled Virginia’s Capitol Square and the streets of Richmond on a chilly, uneasy Monday to lobby and rally against tighter gun legislation in the commonwealth.\nThe rally on Lobby Day, which is traditionally when advocates for various causes plead their case to state legislators, coincided with Martin Luther King Jr. Day.\nSeveral activists spent the night before Lobby Day inside the offices of state Dels.\nBut threats of violence forced Brady & our partners to cancel the 28th Annual Virginia Lobby Day & Vigil on MLK Day."}, {"url": "https://wtvr.com/2020/01/20/gun-rights-rally-richmond-virginia/", "title": "LIVE UPDATES: Pro-gun rally in Virginia ends peacefully", "authors": [], "date": "2020-01-20", "keywords": ["streets", "va", "peacefully", "states", "rally", "ends", "updates", "virginias", "scroll", "richmond", "live", "progun", "voice", "plans", "virginia"], "summary": "RICHMOND, Va. -- An estimated 22,000 gun-rights activists and other groups crowded the streets around Virginia’s Capitol in downtown Richmond to voice their opposition to plans by the state's Democratic leadership to pass gun-control legislation.\nThe rally ended around noon.\nScroll down for live updates."}, {"url": "https://valawyersweekly.com/2020/04/15/suit-related-to-bankruptcy-is-transferred/", "title": "Suit ‘related to’ bankruptcy is transferred", "authors": ["Virginia Lawyers Weekly"], "date": "2020-04-15", "keywords": ["suit", "remand", "case", "transferred", "motion", "removed", "transfer", "action", "bankruptcy", "related", "court", "virginia"], "summary": "Kleinhendler removed the case Jan. 6, 2020, and now seeks to have it heard by the New York bankruptcy court.\nThe court finds that the removed action is “related to” the bankruptcy case within the meaning of 28 U.S.C.\nThe Cipollones allege that “related to” jurisdiction does not exist because Virginia True, the debtor in the bankruptcy case, is not a party to the removed action.\nThis court has “related to” jurisdiction over the removed action because resolution of the removed action may impact the administration of Virginia True’s bankruptcy estate.\nBecause resolution of the removed action may trigger Virginia True’s obligations under the indemnification provisions of its bylaws and, thereby, alter Virginia True’s liabilities, the removed action is “related to” the bankruptcy case."}, {"url": "https://www.wsls.com/news/2020/01/17/what-you-need-to-know-before-heading-to-lobby-day-2020-in-richmond/", "title": "What you need to know before heading to Lobby Day 2020 in Richmond", "authors": ["Jeff Williamson"], "date": "2020-01-17", "keywords": ["leigh", "2020", "st", "lobby", "day", "right", "broad", "turn", "richmond", "heading", "buses", "left", "regular", "street", "resume", "need", "know"], "summary": "1A/B/C (Southbound): from Broad St., buses turn right on 5th St., left on Cary St., right on 14th St. and resume regular routing.\n1A/B/C (Northbound): from 14th St., buses turn left on Broad St., right on 11th St., left on Leigh St. and resume regular routing.\n2A/B/C (Southbound): from Broad St., buses turn right on 5th St., left on Cary St., right on 8th St. and resume regular routing.\n12 (Eastbound): from Marshall St., buses turn left on 7th St., right on Jackson St., right on 8th St., left on Leigh St. and serve Bay M on Leigh St. at the Temporary Transfer Plaza.\n14 (Westbound): from Main St., buses turn left on 14th St., right on Canal St., right on 4th St. and resume regular routing."}, {"url": "https://nymag.com/intelligencer/2020/01/virginia-in-state-of-emergency-for-richmond-pro-gun-rally.html", "title": "Virginia in State of Emergency for Richmond Pro-Gun Rally", "authors": ["Matt Stieb"], "date": "2020-01-15", "keywords": ["treason", "state", "rally", "gun", "unite", "violence", "right", "emergency", "richmond", "progun", "virginia", "capitol"], "summary": "Alt-right and white nationalist protestors at the 2017 Unite the Right rally in Charlottesville, Virginia.\nPhoto: Shay Horse/NurPhoto via Getty ImagesOn Wednesday afternoon, Virginia Governor Ralph Northam declared a state of emergency in anticipation of “Lobby Day,” a pro-gun rally at the state capitol in Richmond which has attracted the attention of far-right agitators.\nAccording to the executive order, Virginia pro-gun groups and outside protestors threatening violence intend to “storm” the state capital to rail against recent gun control legislation.\nPro-gun activists have already protested at the state capitol, where firearms have already been banned.\nAccording to the Daily Beast, at least four notable attendees of the Unite the Right rally will be at the Richmond demonstration."}, {"url": "https://www.nytimes.com/2020/04/14/us/coronavirus-updates.html", "title": "Coronavirus Updates: Trump Halts U.S. Funding of World Health Organization", "authors": [], "date": "2020-04-14", "keywords": ["ok", "josh", "halts", "funding", "dont", "health", "updates", "right", "rosenberg", "doctor", "trump", "world", "coronavirus", "hes", "patients", "know", "dr", "organization"], "summary": "dr. josh rosenberg Right.\ndr. josh rosenberg I’ll just write — because I mean, listen, on some of these you have a real reason why.\ndr. josh rosenberg OK.\ndr. josh rosenberg OK.\ndr. josh rosenberg Right."}, {"url": "https://www.ammoland.com/2019/12/virginia-important-statement-about-vcdl-capital-lobby-day-jan-20th-2020/", "title": "Virginia: Important Statement about VCDL Capital Lobby Day, Jan 20th 2020", "authors": ["Philip Van Cleave", "Some Guy", "Wild Bill", "Heed The Call-Up", "Jack Mac", "Green Mtn. Boy"], "date": "2019-12-18", "keywords": ["vcdl", "2020", "vcdls", "important", "lobby", "gun", "day", "citizens", "owners", "right", "capital", "20th", "jan", "statement", "carry", "defense", "virginia"], "summary": "Virginia – -(AmmoLand.com)- Monday, January 20, is Virginia Citizens Defense League's Lobby Day.\nLobby Day is about, well, lobbying – sending a message to the General Assembly and to the Governor, Attorney General, and the Lt.\nSome militia groups are looking to take canned food donations during Lobby Day and deliver them to a Richmond Food Bank.\nVirginia Citizens Defense League's important messages inevitably get lost as the press rushes to get pictures of anyone carrying an AR or AK.\nAbout Virginia Citizens Defense League, Inc. (VCDL):Virginia Citizens Defense League, Inc. (VCDL)."}, {"url": "https://www.nytimes.com/2020/01/16/us/fbi-arrest-virginia-gun-rally.html", "title": "Virginia Capital on Edge as F.B.I. Arrests Suspected Neo-Nazis Before Gun Rally", "authors": ["Timothy Williams", "Adam Goldman", "Neil Macfarquhar"], "date": "2020-01-16", "keywords": ["neonazis", "suspected", "arrests", "officials", "men", "gun", "rally", "war", "rifle", "richmond", "online", "capital", "edge", "fbi", "mr", "virginia", "read"], "summary": "According to the authorities, Mr. Lemley and Mr. Mathews made a functioning assault rifle.\nThey also bought more than 1,500 rounds of rifle ammunition, fired the rifle at a Maryland gun range and acquired vests to hold body armor.\nAlthough the charges were not directly linked to the Richmond rally, law enforcement officials said the three men had discussed attending it.\nAdditionally, three other men associated with the Base being tracked by the F.B.I.\nOfficials said they were plotting to kill a couple belonging to the loose affiliation of radical activists known as antifa."}, {"url": "https://www.wric.com/news/politics/capitol-connection/virginians-discuss-gun-rally-as-richmond-preps-for-lobby-day/", "title": "Virginians discuss gun rally as Richmond preps for Lobby Day", "authors": ["Amy Simpson", "Jackie Defusco"], "date": "2020-01-17", "keywords": ["8news", "preparations", "state", "rally", "lobby", "gun", "day", "virginians", "richmond", "preps", "street", "discuss", "signs", "capitol"], "summary": "RICHMOND, Va. (WRIC) — The Virginia State Capitol is expected to look and feel much different Monday as thousands of gun-rights supporters plan to rally for Lobby Day.\nOn Friday, 8News spent time around Capitol Square to find out what preparations have already been made ahead of the rally.\nDrivers in Richmond were greeted with signs Friday of what to expect on Lobby Day.\nThe preparations indicate the potential for a busier than usual Lobby Day in Richmond.\n“I’ll be on the other side of the fence watching in.”Moms Demand Action and the Coalition to Stop Gun Violence cancelled their planned events for Lobby Day."}, {"url": "https://www.wusa9.com/gallery/news/local/virginia/lobby-day-gun-rights-rally/65-51a3b971-e83c-4b76-95ab-ffa09d85fcc4", "title": "Assault rifles, sniper rifles and shotguns among demonstrators at VA Lobby Day", "authors": [], "date": "2020-01-20", "keywords": ["va", "thousands", "supporters", "table", "state", "assault", "lobby", "rally", "demonstrators", "day", "gun", "zone", "rifles", "sits", "shotguns", "universal", "sniper"], "summary": "A shotgun sits on a table outside the security zone near the state capitol during a pro gun rally, Monday, Jan. 20, 2020, in Richmond, Va. Thousands of pro-gun supporters are expected at the rally to oppose gun control legislation like universal background checks that are being pushed by the newly elected Democratic legislature.\n(AP Photo/Julio Cortez)"}, {"url": "http://richmondfreepress.com/photos/galleries/2020/jan/17/photos-january-16-18-2020-edition/", "title": "Serving the African American Community in Richmond, VA", "authors": [], "date": "2020-01-17", "keywords": ["african", "stricken", "va", "impacted", "commonwealth", "3600", "american", "walks", "virginians", "richmond", "community", "life", "thecoronavirustheairbornerespiratoryillnessthathas", "serving"], "summary": "Virginians of all walks of life have been impacted by thecoronavirus,theairbornerespiratoryillnessthathas stricken more than 3,600 people in the Commonwealth and ..."}, {"url": "https://www.cnn.com/videos/us/2020/01/20/tight-security-thousands-people-pro-gun-rally-richmond-virginia-sidner-lklv-nr-vpx.cnn", "title": "Thousands of gun rights advocates attend pro-gun rally in Richmond, Virginia", "authors": [], "date": "2020-01-20", "keywords": ["security", "advocates", "attend", "took", "prevent", "rally", "gun", "violence", "richmond", "place", "progun", "thousands", "gunrights", "rights", "virginia"], "summary": "Thousands of gun-rights advocates kicked off a gun-rights rally in Richmond, Virginia, amid heavy security as authorities look to prevent the kind of violence that took place in nearby Charlottesville three years ago."}, {"url": "https://www.ammoland.com/2020/01/virginia-governor-sets-a-trap-for-lobby-day-20-january-2020/", "title": "Virginia Governor Sets a Trap for Lobby Day, 20 January, 2020", "authors": ["Dean Weingarten", "Heed The Call-Up", "Wild Bill", "Sgt Rock", "Dave In Fairfax", "Richard H", "Papa Smurf", "Ryben Flynn", "Unlicensed Bozo", "Alan In Nh"], "date": "2020-01-17", "keywords": ["trap", "2020", "sets", "20", "amendment", "second", "supporters", "lobby", "media", "day", "violent", "governor", "northam", "rights", "virginia"], "summary": "U.S.A. –-(Ammoland.com)- Second Amendment supporters face a daunting challenge in Virginia for Lobby day, at the Virginia Capitol in Richmond, on 20 January 2020.\nIt has kept improving the state preemption law, to prevent local governments from chipping away at Second Amendment rights.\nIt has been one of the most effective of the state organizations working to restore Second Amendment rights.\nThe entire weight of the legacy media has been against Second Amendment supporters for 50 years, but Second Amendment supporters have been winning battles, gradually, for the last 30 years.\nVirginians need to show courage, exercise discipline, and be shrewd to avoid the trap this Lobby Day has become."}, {"url": "https://wtvr.com/2020/01/01/2020-begins-with-richmond-deadly-shooting/", "title": "2020 begins with Richmond deadly shooting", "authors": [], "date": "2020-01-01", "keywords": ["va", "block", "2020", "information", "richmond", "begins", "tip", "shooting", "deadly", "submit", "woundpolice", "mercante", "surrounding"], "summary": "RICHMOND, Va. -- Police have made an arrest in a deadly shooting just minutes into the New Year in Richmond.\nOfficers were called to the 2500 block of North Avenue for a report of a shooting just before 12:15 a.m., according to James Mercante with Richmond Police.\nDetectives arrested 25-year-old Mateen B. Johnson, of the 7600 block of Portadown Court in Henrico, in connection with the shooting.\nNo additional details about the circumstances surrounding the shooting were available at last check.\nThis is a developing story, so anyone with more information can submit a news tip here."}, {"url": "https://wtvr.com/2020/01/17/lobby-day-street-closures-richmond/", "title": "These streets will be closed on Lobby Day in Richmond", "authors": [], "date": "2020-01-17", "keywords": ["streets", "capitol", "st", "lobby", "day", "closed", "right", "broad", "buses", "richmond", "turn", "temporary", "regular", "resume", "left"], "summary": "RICHMOND, Va. -- A number of streets will be closed near the Virginia State Capitol in Richmond on Lobby Day, according to Richmond officials.\nPulse (Eastbound): from Broad St., buses turn right on 5th St., left on Cary St., left on 14th St., right on Main St. and resume regular routing.\n1A/B/C (Southbound): from Broad St., buses turn right on 5th St., left on Cary St., right on 14th St. and resume regular routing.\n1A/B/C (Northbound): from 14th St., buses turn left on Broad St., right on 11th St., left on Leigh St. and resume regular routing.\n2A/B/C (Southbound): from Broad St., buses turn right on 5th St., left on Cary St., right on 8th St. and resume regular routing."}, {"url": "https://wtvr.com/2020/01/09/supporters-opponents-rally-outside-virginia-state-capitol-as-2020-general-assembly-session-begins/", "title": "Supporters, opponents rally outside Virginia State Capitol as 2020 General Assembly session begins", "authors": [], "date": "2020-01-09", "keywords": ["constitution", "general", "ratify", "supporters", "amendment", "state", "states", "rally", "outside", "passed", "opponents", "begins", "session", "statues", "era", "virginia", "capitol"], "summary": "RICHMOND, Va. -- Supporters and opponents of a variety of causes rallied outside the State Capitol on Wednesday as the 2020 General Assembly got under way.\nSupporters of the amendment have been lobbying for Virginia to become the 38th state.\nHeading into this year’s General Assembly, with Democrats controlling both chambers and the Governor’s mansion, supporters of the ERA feel more confident it would pass.\nVirginia state law allows local governments to erect war monuments, but prohibits the local governments from taking them down or modifying them.\nOn the steps of the State Capitol Wednesday, supporters of giving localities the power over the statues held a rally calling on lawmakers to do just that."}, {"url": "https://wtop.com/virginia/2020/01/richmond-gun-rally-will-not-be-armed-protest-says-organizer/", "title": "Richmond gun rally will not be ‘armed protest,’ says organizer", "authors": ["News Traffic Weather"], "date": "2020-01-09", "keywords": ["protest", "event", "gun", "rally", "buses", "richmond", "armed", "cleave", "guns", "group", "saying", "van", "organizer", "virginia"], "summary": "The lead organizer behind a major pro-gun rally planned for Richmond, Virginia, later this month is defending the event, saying there is \"nothing menacing\" about it following media reports that suggested it would be an \"armed protest.\"\nThe lead organizer behind a major pro-gun rally planned for Richmond, Virginia, later this month is defending the event, saying there is “nothing menacing” about it following media reports that suggested it would be an “armed protest.”“That’s a totally inaccurate summary of what this is,” said Philip Van Cleave, president of the Virginia Citizens Defense League.\n“People are really, really upset.”The Virginia Citizens Defense League is expecting at least 30,000 people to show up on Jan. 20.\nBut this time, it has already arranged about 30 buses, not including buses coming from other Virginia groups and out-of-state organizations.\n“We don’t have any firm numbers, but we do expect it to be an absolutely sizable crowd,” said Van Cleave."}, {"url": "https://www.nationalreview.com/2020/01/how-far-left-will-democrats-push-virginia/", "title": "Richmond VA Gun Rally -- Democrats' Agenda: How Far Left Will They Push State?", "authors": ["John Mccormack", "David Harsanyi", "Victor Davis Hanson", "Tobias Hoonhout", "Rich Lowry", "Jim Geraghty", "John Yoo", "Mairead Mcardle", "Read More", "The American Conservative"], "date": "2020-01-21", "keywords": ["agenda", "state", "rally", "push", "virginia", "gun", "weeks", "senate", "right", "control", "ban", "va", "democrats", "bill", "far", "left", "bills", "house", "richmond"], "summary": "Gun-rights advocates and militia members attend a rally in Richmond, Va., January 20, 2020.\nTo pull the state’s economic policy to the left, Virginia Democrats have proposed measures to weaken the state’s right-to-work law, curb greenhouse-gas emissions, and raise the minimum wage.\nVirginia Democrats have already chewed up about a quarter of the current 60-day session with their gun-control bills and the passage of the Equal Rights Amendment.\nAdvertisementThe other potential break on the legislature’s progressive ambitions is the reluctance of Senate Democrats, who only control the upper chamber 21–19, to push the envelope too far.\nThree weeks isn’t much time for Democrats to pass their wish list of left-wing bills, but it could certainly be enough time."}, {"url": "https://wtvr.com/2020/01/12/virginia-lawmakers-gun-control-bills/", "title": "Virginia lawmakers expected to vote on several gun bills Monday", "authors": [], "date": "2020-01-12", "keywords": ["bills", "going", "general", "goddard", "expected", "gun", "vote", "democrats", "background", "lawmakers", "laws", "control", "virginia"], "summary": "For many years, Democrats cried foul when gun control bills quickly failed in Republican-controlled committees.\nGun show attendee on possible changes to Virginia gun laws: 'It's kind of scary'Gun owners and enthusiasts like Jerry Harding browsed over thousands of firearms among the 800 tables at the Richmond Gun Show at the Richmond Raceway Complex on Saturday, Jan. 4.\nPowell called the possibility of new gun laws during the General Assembly session \"kind of scary, I guess you could say.\"\nGun control advocate wants background checksGun control advocates like Andrew Goddard, whose son was wounded in the 2007 Virginia Tech shooting, support Northam's initiatives.\nPolling from the Pew Research Center showed 60 percent of Americans believe gun laws should be more strict as of September 2019."}, {"url": "https://www.ammoland.com/2019/12/virginia-defend-freedom-join-us-january-13th-2020/", "title": "Virginia: Defend Freedom – Join Us January 13th, 2020", "authors": ["Jack Mac", "Heed The Call-Up", "Jens", "Rex Nanorum", "Wild Bill"], "date": "2019-12-28", "keywords": ["stand", "va", "freedom", "2020", "defend", "visit", "gun", "right", "political", "legislative", "nra", "northam", "join", "virginia", "13th"], "summary": "This fight begins on January 13th during the first hearing of the Senate Courts of Justice Committee, and we must hold tyranny in check.\nWhile it is important for Virginia gun owners to make their voices heard at all times, it is critical on this first day.\nIt is time to stand with your fellow NRA members and urge the committee to block the Bloomberg – Northam gun ban.\nJanuary 13, 2020, starting 8AMVirginia State Capitol1000 Bank St.Richmond, VA 23218NRA staff will be on-site with giveaways, including an emergency airdrop from Magpul.\nBe on the lookout for postcards and emails with legislative updates and upcoming townhall events to defend and fight for our rights."}, {"url": "https://wtkr.com/2020/01/21/virginia-gun-sales-dramatically-increase-in-2019-i-didnt-think-i-would-ever-be-buying-one/", "title": "Virginia gun sales dramatically increase in 2019: ‘I didn’t think I would ever be buying one’", "authors": [], "date": "2020-01-21", "keywords": ["proposed", "going", "sales", "didnt", "think", "buying", "dramatically", "wright", "bills", "gun", "virginia", "hill", "stauffer", "protect", "2019", "laws", "increase"], "summary": "RICHMOND, Va. (WTVR) - 66-year-old Ida Wright decided today was the day she was going to buy her first hand gun.\n“I didn’t think I would ever be buying a gun, but things are changing so drastically,” Wright says.\nStores like Southern Gun World in Chesterfield County say gun sales have drastically increased over the past few weeks.\n“They were motivated.”According to statistics, December gun sales totaled nearly 74 thousand, a 47% increase over sales in December 2018.\nHill says the proposed bills are providing incentives for gun owners to take action."}, {"url": "https://www.nytimes.com/2020/01/18/us/virginia-guns-charlottesville.html", "title": "What Did Virginia Learn From Charlottesville?", "authors": ["Nicholas Bogel-Burroughs", "Richard A. Oppel Jr."], "date": "2020-01-18", "keywords": ["weapon", "report", "state", "learn", "torches", "richmond", "weapons", "charlottesville", "white", "ban", "virginia", "prosecutor"], "summary": "Here are some ways that Richmond is trying to avoid a disaster on Monday:The governor is banning guns, torches and even baseballs.\nWhen Mr. Northam declared the state of emergency, he also prohibited civilians who approach the Capitol from carrying weapons.\nThe group that is hosting the event, the Virginia Citizens Defense League, fought Mr. Northam’s executive order in court, but the State Supreme Court upheld the ban.\nIn 2017, a Charlottesville police captain asked a local prosecutor whether the police could ban bats, poles and other weapons from the park where white nationalists and counterprotesters had planned to gather.\nThe prosecutor said no, and the Charlottesville Police Department prepared for the event under the belief that it could not enforce a ban on sticks, shields or any other potential weapon."}, {"url": "https://www.wsls.com/news/virginia/2020/01/20/richmond-prepares-as-crowds-start-to-descend-for-lobby-day/", "title": "One arrest made as more than 20,000 descend on Richmond for Lobby Day, pro-gun rally", "authors": ["Tommy Lopez", "Colter Anstaett", "Samantha Smith"], "date": "2020-01-20", "keywords": ["20", "descend", "20000", "state", "lobby", "rally", "day", "gun", "outside", "square", "richmond", "progun", "arrest", "virginia", "capitol"], "summary": "More than 100 people traveled from Safeside Tactical in Roanoke and Lynchburg to Richmond for Lobby Day.\nCapitol Square & the surrounding area saw crowds of tens of thousands & only one arrest was made.\n3:51 p.m. updatePolice said that a Richmond woman was arrested during Monday’s pro-gun rally in Richmond.\nMikaela E. Beschler, 21, of Richmond, Virginia (Richmond Police Department)She was charged with one felony count of wearing a mask in public in the 800 block of East Broad Street.\nInside Capitol Square, state troopers and Capitol Police are everywhere."}, {"url": "https://wtvr.com/2020/01/15/programs-and-events-to-honor-dr-martin-luther-king-jr/", "title": "Programs and Events to Honor Dr. Martin Luther King, Jr.", "authors": [], "date": "2020-01-15", "keywords": ["peace", "visit", "programs", "maymont", "information", "luther", "king", "events", "virginia", "day", "center", "jr", "richmond", "community", "honor", "africanamerican", "martin", "dr"], "summary": "RICHMOND, Va.-- Programs and Events to Honor Dr. Martin Luther King, Jr.42nd Annual Community Leaders Breakfast hosted by Virginia Union UniversityFriday, January 17, 7:30 a.m. at the Richmond Marriott Downtown, 500 E Broad St, Richmond.\nPresented by the Virginia General Assembly Dr. Martin Luther King, Jr. Memorial Commission.\nFor more information and to register for the 7th Annual MLK Community Day, visit www.kissrichmond.com/events.\nDetails at https://maymont.org/event/community-planning-workshop-the-african-american-experience-circa-1900/The Richmond Peace Education Center presents Generation Dream Edu-concert February 8th and February 16th.\nFor more information call the Peace Center at 804-232-1002, or email the Peace Center’s Youth Programs Coordinator, Christina Leoni-Osion at youth@rpec.org or visit https://www.rpec.org/"}, {"url": "https://wtvr.com/2020/01/27/richmond-homeless/", "title": "Richmond groups work to find help for the homeless", "authors": [], "date": "2020-01-27", "keywords": ["number", "stevens", "12", "groups", "help", "richmond", "housing", "homelessness", "projects", "count", "work", "virginia", "homeless"], "summary": "RICHMOND, Va.-- Virginia Governor Ralph Northam announced nearly $12 million in funding to help in the fight against homelessness.\nThe money will pay for Affordable and Special Needs Housing loans for 12 projects and more than $1.2 million in Homeless Reduction Grants to support 13 projects funded through the Virginia Housing Trust Fund, according to the Governor's Office.\nIn an effort to help in the fight against homelessness, each January the Department of Housing takes a count of the number of homeless in our communities.\nVolunteers like Bernard Stevens said they hoped their work helped that number continue to decline.\nStevens said the survey also helps them find the right kind of help for those who need it."}, {"url": "https://www.theday.com/article/20200126/OP03/200129625", "title": "News from southeastern Connecticut", "authors": [], "date": "2020-01-26", "keywords": ["southeastern", "thousands", "fear", "gun", "rally", "richmond", "weapons", "guns", "connecticut", "taking", "virginia", "capitol"], "summary": "Y'all, it smelled like fear last Monday out there in Richmond, Virginia.\nScores of men — plus a handful of women — dressed up in battle rattle and draped themselves with assault weapons, long guns and handguns.\nFear of having to pass a background check if they want to buy a gun from a private individual?\nOnly 30% of Virginia gun deaths are homicides, according to the Centers for Disease Control.\nThat almost perfectly describes the demographic at the gun rally in Richmond."}, {"url": "https://wtvr.com/2020/01/20/lobby-day-inside-the-ga/", "title": "While thousands rallied outside to protect gun rights, a few were actually able to speak to Virginia lawmakers inside", "authors": [], "date": "2020-01-20", "keywords": ["warren", "theyre", "going", "va", "saidthe", "state", "rallied", "virginia", "outside", "inside", "gun", "protect", "lawmakers", "mickelinc", "rva", "thousands", "rights", "speak"], "summary": "RICHMOND, Va. — As thousands of people chanted and rallied for gun rights outside the Virginia State Capitol Monday, inside the situation was much more calm.\n“I’ve been standing outside in the freezing cold weather,” Sharen Warren, from Fairfax, said.\nThis Fairfax couple used to be represented by Northern VA’s last Republican legislator in the VA ‘burbs closest to DC.\n“I think we have a lot more agreement than I might have anticipated,” Mickelinc said after talking to Carr.\nHe visited his delegate Betsy Carr to let her know that even though her district is Blue, she still represents voters like him who support gun rights."}, {"url": "https://wtvr.com/2020/01/17/rva-weekend-eventsfreedom-classic-festival-richmond-jewish-food-festival/", "title": "RVA Weekend Events:Freedom Classic Festival & Richmond Jewish Food Festival", "authors": [], "date": "2020-01-17", "keywords": ["weekend", "african", "jewish", "visit", "maymont", "ave", "festival", "information", "jcc", "american", "vibe", "eventsfreedom", "richmond", "classic", "food", "rva", "monument"], "summary": "For more information visit https://positiveviberva.com/ or call 804-560-9622.\nThe 13th Annual Richmond Jewish Food FestivalJanuary 19 & 20, 11:30am – 7:30pmWeinstein Jewish Community Center,5403 Monument Avenue Richmond, VAJewish foods, entertainment, and vendors both days.\nPark easily in the neighborhood across Monument Ave from the Weinstein JCC, then catch the free festival shuttle to and from the JCC.\nShuttles pick up passengers on Lake Ave, Cutshaw Ave, Treboy Ave, and W. Grace Street.\nBring opinions and inspirations regarding historical and modern-day stories of African American democracy, diversity and opportunity, especially in relation to the Maymont Mansion exhibition that interprets the work and home lives of the African American staff at Maymont, 1893-1925."}, {"url": "https://www.wric.com/news/local-news/new-york-times-names-richmond-in-52-places-to-go-in-2020-list/", "title": "New York Times names Richmond in ’52 Places to Go in 2020′ list", "authors": ["Danielle Guichard", "Laura Perrot", "Ben Dennis", "Amy Simpson"], "date": "2020-01-09", "keywords": ["2020", "mentions", "york", "war", "names", "places", "richmond", "article", "list", "food", "wileys", "times", "river", "citys", "52"], "summary": "RICHMOND, Va. (WRIC) — Richmonders already know the River City is one of the best places to visit.\nThe New York Times ranked Richmond No.\n39 in their “52 Places to Go in 2020” list.\nThe NYT specifically mentions the James River offering Class III and IV whitewater rafting — a “rarity” within a U.S. city, the paper said.\nThe New York Times’ full list can be found here."}, {"url": "https://wtvr.com/2020/01/02/january-2020-weather-outlook/", "title": "January 2020 weather outlook", "authors": [], "date": "2020-01-02", "keywords": ["outlook", "inches", "precipitation", "snow", "2020", "temperatures", "average", "month", "milder", "weather", "rain", "normal"], "summary": "RICHMOND, Va. -- December's temperatures averaged three degrees above normal, and rainfall was right on target.\nAn average January produces nearly three inches of liquid precipitation, which includes rain and the water-equivalent of any ice or snow.\nThe latest outlook from the National Weather Service has temperatures in our area near or above normal.\nDue to milder temperatures, rain would be more likely.\nStay With CBS 6, The Weather Authority."}, {"url": "https://wtvr.com/2020/01/30/virginia-house-passes-gun-control-measures/", "title": "Virginia House passes gun-control measures", "authors": [], "date": "2020-01-30", "keywords": ["bills", "guncontrol", "house", "class", "gun", "passed", "measures", "guns", "order", "passes", "legislation", "include", "virginia"], "summary": "RICHMOND, Va. -- The Virginia House of Delegates has passed several pieces of gun-control legislation, but some of the measures face an uncertain future in the more conservative Senate.\nThe Democratic-led House approved seven gun measures Thursday, largely along party lines.\nOther bills include the so-called Red Flag Law, which would temporarily take guns away from anyone deemed a threat, one handgun a month, and mandatory reporting of lost or stolen firearms.\nDemocrats say the bills will prevent senseless deaths, while Republicans argue the measures infringe on law-abiding gun owners' rights.\nThe passed bills did not include a proposed assault weapon ban, a top priority for Gov."}, {"url": "https://www.ammoland.com/2020/01/virginia-we-need-boots-on-the-ground-and-trainers/", "title": "Virginia! We Need Boots on the Ground and Trainers", "authors": ["Heed The Call-Up", "Gene Ralno", "Jens", "Rex Nanorum", "Wild Bill"], "date": "2020-01-02", "keywords": ["county", "ground", "va", "trainers", "law", "oath", "virginia", "militia", "official", "training", "volunteer", "military", "boots", "need"], "summary": "Email us at: [email protected] Put “volunteer military trainer” or “volunteer LEO trainer” in the subject line.\nUrge all counties to follow the example of Tazewell County, VA by passing a resolution establishing an official county militia.\nAn official county militia would be acting under, and pursuant to, the full authority of the elected government of the county, not just a private “militia”.\nNOTE: this does NOT mean we will not be working with non-official volunteer militia in Virginia.\nTo volunteer, email us at: [email protected] and put “Volunteer military (or LEO) trainer” in subject line."}, {"url": "https://www.wric.com/news/politics/capitol-connection/virginia-senate-passes-3-gun-measures/", "title": "Virginia Senate passes 3 gun measures", "authors": ["Dean Mirshahi", "Jackie Defusco"], "date": "2020-01-16", "keywords": ["bills", "public", "firearms", "gun", "buildings", "localities", "senate", "parks", "richmond", "measures", "guns", "passes", "virginia"], "summary": "RICHMOND, Va. (WRIC) — Lawmakers in the Virginia Senate passed three gun measures Thursday that would require background checks on all firearm sales, limit gun purchases to one in a 30-day period and allow localities to ban guns from public buildings, parks and events.\nThe state Senate advanced all three bills mainly along party lines, with Senate Bills 35 and 69 passing 21-19 and Senate Bill 70 getting through with a 23-17 vote.\nBREAKING: SB 35 passes in the senate.\nIt gives localities the authority to ban guns in public buildings, parks, permitted events.\nThe suspects face several charges after reportedly possessing several firearms and thousands of rounds of ammunition."}, {"url": "https://www.bellingcat.com/news/2020/01/19/richmond-gun-rally-is-a-virginia-cop-giving-4chans-pol-board-inside-info/", "title": "Richmond Gun Rally: Is A Virginia Cop Giving 4Chan’s /pol Board Inside Info?", "authors": [], "date": "2020-01-19", "keywords": ["event", "board", "pol", "rally", "gun", "inside", "officer", "posts", "officers", "richmond", "giving", "info", "users", "anons", "poster", "cop", "virginia"], "summary": "This event started as the annual “Lobby Day” rally for the Virginia Citizens Defense League (VCDL) but has quickly gotten out of control.\nWhat /pol Wants From January 204chan’s /pol board is one of the largest white nationalist gathering places on the Internet.\nBut this Richmond police officer badge does not show up on Yandex or Google reverse image searches.\nAnd based on this tweet from the Richmond police, the badge posted onto /pol does seem to match the badges issued by the Richmond Police Department.\nQuite a few anons express significant distrust of the poster claiming to be a Richmond police officer."}, {"url": "https://www.usatoday.com/story/money/2020/04/09/coronavirus-30-places-where-recession-could-hit-hardest/2964955001/", "title": "New York, Gilpin are among the places a COVID-19 recession will likely hit hardest", "authors": ["Samuel Stebbins", "Michael B. Sauter", "Published A.M. Et April"], "date": "2020-04-09", "keywords": ["county", "workforce", "population", "2020", "cases", "york", "hit", "recession", "industries", "metropolitan", "places", "rate", "likely", "hardest", "gilpin", "area", "covid19"], "summary": "To identify the places a COVID-19 recession will likely hit hardest, 24/7 Wall St. created an index comprising three measures: employment in highly-exposed industries, COVID-19 infection rates, and population density.\nAs of the end of March, there have been 45 confirmed cases of COVID-19 in Harrison County and one death.\nWe only considered counties and county equivalents that fall within a metropolitan area because metro areas are typically hubs of economic activity.\nData on COVID-19 cases and deaths by county and state came from the New York Times and are current as of March 31, 2020.\nCOVID-19 cases and death toll were adjusted for population using five-year estimates from the U.S. Census Bureau’s 2018 American Community Survey."}, {"url": "https://www.wric.com/news/local-news/richmond/richmond-among-best-cities-to-find-a-job-in-2020-survey-says/", "title": "Richmond among best cities to find a job in 2020, survey says", "authors": ["Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-01-04", "keywords": ["survey", "2020", "virginia", "vt", "city", "job", "richmond", "website", "list", "wric", "ca", "wallethub", "best", "cities"], "summary": "RICHMOND, Va. (WRIC) — The River City is flowing with job opportunities.\nRichmond is ranked the 69th best city to find a job in the new year, according to a report from WalletHub.\nThe personal finance website assessed employment growth and opportunity for more than 180 cities nationwide.\nRichmond was one of five Virginia cities to make the list: Virginia Beach (37) Chesapeake (63) Newport News (96) and Norfolk (134).\nLATEST STORIES:"}, {"url": "https://www.wric.com/community/positively-richmond/meet-alona-the-first-rva-baby-of-the-decade/", "title": "Meet Alona, the first RVA baby of the decade", "authors": ["Keyris Manzanares", "Michael Stern"], "date": "2020-01-04", "keywords": ["welcomed", "meet", "weighing", "girl", "alona", "richmond", "world", "wric", "rva", "born", "johnson", "baby", "decade"], "summary": "RICHMOND, Va. (WRIC) — It’s a girl!\nAlona Cierra Johnson is the first baby of the decade born in the Richmond region.\nEbony Johnson welcomed her baby girl at 1:13 a.m. on January 1, 2020.\nBaby Alona came into the world weighing eight pounds and measuring 20 inches long.\nShe was born at Bon Secours Memorial Regional Medical Center."}, {"url": "https://wtvr.com/2020/01/07/officials-investigating-after-downtown-richmond-fire/", "title": "Officials investigating after Downtown Richmond fire", "authors": [], "date": "2020-01-07", "keywords": ["downtown", "va", "officials", "investigation", "stofficials", "underway", "investigationthis", "richmond", "tip", "submit", "shortly", "investigating", "say"], "summary": "RICHMOND, Va. — An investigation is underway following a fire in downtown Richmond on Tuesday evening.\nThe fire broke out around 6:30 p.m. on the 200 block of E. Grace St.Officials say it was contained shortly after arrival, and that no one was injured.\nThe cause of the fire is currently under investigation.\nThis is a developing story, so anyone with more information can submit a news tip here."}, {"url": "https://www.wric.com/news/local-news/richmond/stoney-expected-to-unveil-new-initiatives-for-2020-in-state-of-the-city-address/", "title": "Stoney unveils new initiatives for 2020 in State of the City address", "authors": ["Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-01-28", "keywords": ["unveils", "2020", "families", "state", "initiatives", "truly", "mayor", "city", "address", "stoney", "richmond", "withdraw", "children", "thriving", "work"], "summary": "RICHMOND, Va. (WRIC) — Richmond Mayor Levar Stoney gave his third State of the City address Tuesday at the Virginia Museum of History and Culture.\nIn his speech, Stoney highlighted progress made in the last three years, unveiled a few initiatives for 2020, announced improvements to city permitting operations and called on increased focus on serving the needs of children and families in the city.\n“The state of our city is stronger and more competitive than it’s been in years,” Stoney said.\nStoney was adamant he would not withdraw his plans in a tweet on Monday.\n“We worked with city council and safe driving advocates to pass a ban on the use of handheld mobile devices while driving a car,” the mayor said."}, {"url": "https://www.wusa9.com/article/news/local/virginia/one-arrested-during-richmond-gun-rights-rally/291-bee0e90e-cc68-4d56-954d-2b5cd08bf54c", "title": "One arrested during Richmond gun rights rally for wearing a mask", "authors": ["Author", "Erin Patterson", "Now", "Published", "Pm Est January", "Updated"], "date": "2020-01-20", "keywords": ["state", "rally", "gun", "arrested", "lobby", "day", "outside", "mask", "richmond", "wearing", "rights", "virginia", "capitol"], "summary": "RICHMOND, Va. — Out of the 22,000 people who attended the \"Lobby Day\" gun rights rally in Richmond, one person was arrested.\nThe Virginia Capitol posted on Facebook claiming 21-year-old Mikaela E. Beschler was arrested around 1:30 p.m. on Monday.\nRELATED: Richmond 'Lobby Day' gun rights rally through social mediaRELATED: Thousands rally for gun rights in RichmondOfficials said the arrest happened after an officer saw Beschler for a third time with a bandanna covering her face.\nMikaela E. Beschler was arrested for one felony count of wearing a mask in public during Monday's gun-rights rally in Richmond.\nRELATED: Almost 300 people bussed from Virginia Beach to 'Lobby Day' rally in RichmondRELATED: How did the topic of gun rights escalate in Virginia?"}, {"url": "https://www.wric.com/news/politics/capitol-connection/lawmakers-could-expand-parole-eligibility-in-virginia/", "title": "Lawmakers could expand parole eligibility in Virginia", "authors": ["Alex Thorson", "Jackie Defusco"], "date": "2020-01-10", "keywords": ["proposed", "chance", "eligibility", "told", "wilson", "expand", "prisoners", "lawmakers", "say", "parole", "prison", "virginia"], "summary": "RICHMOND, Va. (WRIC) — Democratic lawmakers are proposing the chance for parole for some Virginia inmates but not for everyone.\nFor five years after that jurors were not told that the people they were sending to prison had no chance of parole.\nHundreds of prisoners say they’re paying the price but it could change during this year’s General Assembly session.\nRELATED: Virginia prisoners could get chance at release with proposed bills“He actually was defending himself,” Wilson said Friday.\nSome critics, including lawmakers, argue there is no evidence juries would have sentenced any differently if they had been told there was no parole in Virginia at the time."}, {"url": "https://www.nbc12.com/2020/01/19/richmond-public-schools-will-be-closed-monday-jan/", "title": "Richmond Public Schools will be closed on Monday after teachers request off to attend ‘Fund Our Future’ rally", "authors": ["Published At Pm"], "date": "2020-01-19", "keywords": ["unexpected", "families", "attend", "togo", "rally", "fund", "working", "teachers", "team", "future", "closed", "students", "sincerely", "schools", "request", "public", "superintendent", "richmond", "school"], "summary": "“I recognize doing so will create an unexpected childcare burden for our working families.\nOn behalf of RPS, I sincerely apologize for this.\nI also want to acknowledge that some of our families face food insecurity and depend on school meals for their children.\nIn light of this, our nutrition team will be preparing “to-go” bags for students to take home on Friday afternoon,” said Jason Kamras, Richmond Public Schools Superintendent."}, {"url": "https://www.wric.com/news/local-news/richmond/man-recovering-after-richmond-shooting/", "title": "Man injured in Richmond shooting Thursday night", "authors": ["Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-01-24", "keywords": ["man", "va", "timethis", "sustained", "richmond", "night", "wric", "shooting", "updateslatest", "suspect", "injured", "street"], "summary": "RICHMOND, Va. (WRIC) — A man is expected to be OK after a shooting in Richmond Thursday night.\nOfficers were called to the 5300 block of Hull Street Road around 8:40 p.m. following reports of a shooting.\nArriving officers found a man who had been shot.\nPolice add the injuries sustained were minor.\nThere is no suspect information at this time."}, {"url": "https://wtvr.com/2020/01/27/slow-paperwork-allowed-richmond-murder-suspect-to-walk-free/", "title": "Slow paperwork allowed Richmond murder suspect to walk free", "authors": [], "date": "2020-01-27", "keywords": ["presumption", "walk", "thomas", "jury", "riley", "slow", "store", "reeder", "allowed", "theres", "richmond", "night", "suspect", "free", "murder", "paperwork"], "summary": "RICHMOND, Va. -- Deon Thomas walked away from the Richmond Justice Center last Thursday because there wasn't a court order to hold him.\nHe had been indicted by a multi-jurisdictional grand jury a few days prior, but that paperwork was stuck somewhere in the justice pipeline.\nSteel fencing and cameras every 20 or 30 feet surround what used to be the Midlothian Village Apartments.\n\"The cameras are always on and the lights are bright at night to where you can see everything,” said Joyce Reeder.\nDeputy Commonwealth’s Attorney Learned Barry said this was a case where the general district paperwork moved faster than the circuit courts."}, {"url": "https://www.wric.com/news/politics/capitol-connection/families-ask-for-prison-reform-at-justice-rally/", "title": "Virginia families ask for prison reform at justice rally", "authors": ["Julius Kizzee", "Jackie Defusco"], "date": "2020-01-12", "keywords": ["bills", "family", "justice", "families", "harris", "ask", "rally", "network", "prison", "total", "reform", "virginia"], "summary": "RICHMOND, Va. (WRIC) — Hundreds of former prisoners, their family members and allies rallied at the Bell Tower near the State Capitol Saturday to call attention to several bills aimed towards prison reform.\nThe Virginia Prison Justice Network said more than 100 bills that deal with prison reform will be discussed during the 2020 General Assembly session.\nDuring the third annual Virginia Prison Justice Rally, attendees said they are hoping to bring people home that haven’t seen their families in years.\nSeveral delegates, including House Speaker Eileen Filler-Corn are undecided when it comes to prison reform bills.\n“We’re looking for not bits and pieces, but a total transformation,” Margaret Breslau with the Virginia Prison Justice Network said."}, {"url": "https://slate.com/podcasts/what-next/2020/01/how-a-virginia-gun-rights-rally-remained-peaceful", "title": "How Virginia’s Gun Rally Dodged a Bullet", "authors": ["Mary Harris"], "date": "2020-01-23", "keywords": ["bullet", "gun", "rally", "virginias", "wilson", "violence", "week", "turn", "violencepodcast", "threats", "thousands", "worried", "dodged", "virginia"], "summary": "Earlier this week, gun rights activists arrived outside the capitol building in Richmond, Virginia, to rally against proposed gun control laws.\nSome people worried the event would turn into another Charlottesville.\nBut even though thousands of people hoisted their guns and made threats against the government, there was no violence.\nRead her coverage of gun politics and gun violence.\nPodcast production by Mary Wilson, Jayson De Leon, Danielle Hewitt, and Mara Silvers."}, {"url": "https://www.henricocitizen.com/events/hobbies/richmond-gun-show-at-richmond-raceway-3/?gde=2020-01-04", "title": "Richmond Gun Show at Richmond Raceway", "authors": [], "date": "2020-01-04", "keywords": ["supplies", "visit", "war", "gun", "12", "trading", "swords", "richmond", "western", "raceway", "tables", "jan"], "summary": "The Richmond Gun Show will be held at Richmond Raceway from 9 a.m. to 5 p.m. Jan. 4 and from 10 a.m. to 5 p.m. Jan. 5.\nApproximately 800 tables will be selling, buying and trading shotguns, rifles, modern guns of all kinds, muskets, antique pistols and more.\nThere also will be swords, knives, hunting supplies, ammo, books, early Indian and western Americana, war relics and more, as well as classes and seminars.\nAdmission is $12 for adults, $6 for ages 12-17, and free for children under 12.\nFor details, visit showmastersgunshows.com."}, {"url": "https://www.ammoland.com/2020/01/need-volunteers-jan-20th-to-protect-patriots-at-richmond-gun-rights-rally/", "title": "Peaceful Volunteers Needed Jan. 20th to Protect Patriots at Richmond Gun Rights Rally", "authors": ["Dave In Fairfax", "Heed The Call-Up", "Charlie Foxtrot", "Greg K", "Wild Bill", "All Gun Laws Are Infringements", "Jens", "Rex Nanorum"], "date": "2020-01-18", "keywords": ["streets", "strong", "patriots", "volunteers", "needed", "oath", "rally", "gun", "protect", "training", "richmond", "peaceful", "armed", "jan", "northam", "rights", "patriot", "gage"], "summary": "We need LEO and military veterans to volunteer to help us on the ground at the ARMED rally in the streets of Richmond, VA on Monday, Jan. 20, 2020 (not in Gov.\nNortham’s absurd disarmed slave pen – out in the streets with the hardcore patriots who will NOT be disarmed).\nBest outcome is a calm, peaceful mass assembly of armed Americans exercising their rights to peaceably assemble (while armed!)\nHowever, the reality is that there will still be tens of thousands of armed American patriots there on Monday, Jan 20, 2020, in those narrow streets.\nInstead, surround it with armed patriots to mock and ridicule it."}, {"url": "https://www.nbc29.com/2020/01/08/general-assembly-session-underway-richmond/", "title": "2020 General Assembly session underway in Richmond", "authors": ["Annie Schroeder", "Lottye Lockhart", "Published At Pm"], "date": "2020-01-08", "keywords": ["support", "assembly", "general", "2020", "statues", "took", "war", "szakos", "underway", "supports", "richmond", "session", "charlottesville", "white", "stonewall", "supremacy"], "summary": "About 100 people from Take ‘Em Down Cville showed their support for a proposed bill that could give Charlottesville leaders the power to decide what happens to war memorials.\nFormer Charlottesville City Councilor Kristen Szakos took part in the rally.\nShe says statues like those of Confederate Generals Robert E. Lee and “Stonewall” Jackson in Charlottesville’s public parks send a message that supports the cause of white supremacy."}, {"url": "https://www.wric.com/8news-digital-exclusives/help-wanted-virginia-needs-thousands-of-workers-for-u-s-census-bureau-2020-count/", "title": "Help Wanted: Virginia needs thousands of workers for U.S. Census Bureau 2020 count", "authors": ["Ben Dennis", "Tyler Thrasher"], "date": "2020-01-22", "keywords": ["count", "2020", "united", "jobs", "trying", "seeks", "states", "need", "ron", "workers", "needs", "help", "bureau", "thousands", "census", "wanted", "virginia", "brown"], "summary": "RICHMOND, Va (WRIC) — The United States Census Bureau seeks to fill numerous local positions for the once-a-decade national headcount of people living in the country.\nWe have lots of jobs,” Ron Brown, partnership coordinator for the United States Census Bureau, said.\nOpen slots include recruiting assistants, field supervisors, office-based positions and people “knocking on doors, trying to get the information we are looking for, trying to help people respond to the Census,” Brown said.\nThe U.S. Census Bureau says application qualifications include:You must be at least 18 years old.\ndepending on what folks are looking for.” Ron Brown, partnership coordinator for the United States Census BureauMore application information can be found here or call 1-855-562-2020."}, {"url": "https://www.nbc12.com/2020/01/06/inaugural-virginia-womens-equality-legislative-summit-kicks-off-general-assembly/", "title": "Inaugural Virginia Women’s Equality Legislative Summit kicks off 2020 General Assembly", "authors": ["Adrianna Hargrove", "Published At Pm", "Published Am At Am"], "date": "2020-01-06", "keywords": ["uniting", "general", "assembly", "2020", "women", "table", "ways", "singular", "kicks", "inaugural", "womens", "legislative", "session", "summit", "equality", "virginia"], "summary": "“Launching this summit ahead of the General Assembly is a show of force for women’s equality advocates and organizations around Virginia,” Hornung said.\n“The Equal Rights Amendment will pass this session, and there are several other bills on the table that impact women and equality in major ways.\nBy linking arms and uniting behind a cohort of equality legislation, we’re advocating as a singular roar to our elected officials.”"}, {"url": "https://wtvr.com/2020/01/27/virginia-becomes-critical-38th-state-to-ratify-equal-rights-amendment/", "title": "Virginia becomes critical 38th state to ratify Equal Rights Amendment", "authors": [], "date": "2020-01-27", "keywords": ["history", "constitution", "women", "ratify", "38th", "amendment", "state", "states", "vote", "protection", "ratification", "equal", "era", "critical", "rights", "virginia"], "summary": "RICHMOND, Va. -- Virginia has officially become the critical 38th state to ratify the Equal Rights Amendment.\nERA advocates say the amendment will enshrine equality for women into the Constitution, offering stronger protections in sex discrimination cases.\nHouse Speaker Eileen Filler-Corn (D-Fairfax), who became the first woman Speaker in Virginia history, released a statement praising the ratification.\nBy the action we have taken today, our daughters and their daughters after them will have equal protection law.\nWomen deserve equal protection under the law, and Virginia enthusiastically takes this step to get there.”"}, {"url": "https://www.nraila.org/articles/20191230/virginia-first-weeks-of-january-are-critical", "title": "Virginia: First Weeks of January are Critical", "authors": [], "date": "2019-12-30", "keywords": ["bills", "va", "lawabiding", "2020", "freedom", "gun", "owners", "weeks", "richmond", "hear", "nra", "critical", "virginia"], "summary": "Law-abiding gun owners throughout the Commonwealth must continue to join together to fight against gun bans, gun rationing, and confiscation this January in Richmond.\nYour NRA has events planned for the early, critical days of the 2020 legislative session.\nIt’s critical that law-abiding gun owners are heard on this day, because waiting even one week to make our voices heard, whether individually or at an organized event, will simply be too late.\nPlease contact Senator Edwards at 804-698-7521 and strongly urge him to OPPOSE ANY GUN BANS, GUN RATIONING, AND CONFISCATION!\nVirginia State Senators from these areas have been invited in order to hear from their constituents on the anti-gun bills under consideration."}, {"url": "https://www.nbc12.com/2020/01/13/news-know-jan-nra-gun-rights-advocates-gathering-south-richmond-shooting-homicide-investigation-underway/", "title": "News to know for Jan. 13: NRA, gun-rights advocates gathering; South Richmond shooting; Homicide investigation underway", "authors": ["Published At Pm"], "date": "2020-01-13", "keywords": ["grounds", "investigation", "university", "nra", "lifted", "jan", "gunrights", "know", "longwood", "lockdown", "suspects", "underway", "shooting", "safe", "south", "placed", "left", "scene", "richmond", "homicide"], "summary": "According to Longwood University alerts, when police got to the scene, the suspects had already left.\nOut of the abundance of caution, campus police placed the university on lockdown to ensure the grounds were safe.\nLockdown was lifted around 11:10 p.m."}, {"url": "https://www.wric.com/news/politics/capitol-connection/virginia-democrats-outline-2020-priorities-on-eve-of-general-assembly-session/", "title": "Northam, Virginia Democrats outline priorities of 2020 General Assembly session", "authors": ["Dean Mirshahi", "Jackie Defusco"], "date": "2020-01-07", "keywords": ["general", "assembly", "2020", "incoming", "democrats", "senate", "womens", "majority", "session", "housing", "priorities", "northam", "outline", "rights", "virginia"], "summary": "Ralph Northam shared the legislative priorities Virginia Democrats will pursue in the upcoming 2020 General Assembly session on Tuesday alongside new leadership from both chambers.\nWith House-Speaker-designee Eileen Filler-Corn (D-Fairfax) and incoming Senate Majority Leader Richard L. Saslaw (D-Fairfax) with him, Northam announced an 11-point agenda that Democrats have dubbed the “Virginia 2020 Plan”“We are presenting an agenda that is different from every previous General Assembly session,” Northam said.\nPriorities in the “Virginia 2020 Plan”:Pass the Equal Rights Amendment.\n“We have a lot to do,” said incoming Senate Majority Leader Saslaw.\nNew leadership in the Democratic controlled House and state Senate, incoming House Majority Leader Charniele Herring (D-Alexandria) and incoming Senate Caucus Chair Maime Locke (D-Hampton), were also in attendance on Tuesday."}, {"url": "https://wtvr.com/2020/01/07/democrats-push-to-raise-minimum-wage-in-virginia-during-2020-ga-session/amp/", "title": "Democrats push to raise minimum wage in Virginia during 2020 GA session", "authors": [], "date": "2020-01-07", "keywords": ["business", "2020", "roth", "raise", "wilson", "state", "groups", "wage", "democrats", "workers", "hour", "minimum", "session", "ga", "push", "virginia"], "summary": "RICHMOND, Va. -- The push to raise the minimum wage in Virginia may bear fruit in 2020 after Democrats gained power at the General Assembly.\nGovernor Ralph Northam and Virginia Democrats listed raising state wage standards as part of their package of legislative priorities one day before the 2020 session begins.\nThe federal minimum wage has not changed in more than a decade (2009) while the cost of living in many areas has increased.\nMultiple bills before the legislature would raise Virginia’s minimum wage gradually over the course of several years.\nNortham said Tuesday the details still need to be worked out, but Democrats planned to set in-motion a minimum wage increase this session."}, {"url": "https://www.ammoland.com/2020/01/virginia-get-your-elected-local-officials-to-join-us-on-lobby-day/", "title": "Virginia: Get Your Elected Local Officials To Join Us On Lobby Day!", "authors": ["Philip Van Cleave", "Green Mtn. Boy"], "date": "2020-01-16", "keywords": ["vcdl", "local", "elected", "officials", "sanctuary", "lobby", "gun", "day", "citizens", "rights", "league", "join", "defense", "virginia"], "summary": "Ask them to show that their support for Sanctuary County/City/Town really means something!\nWhere:Pocahontas Building900 E Main StreetRichmond, VA 23219When: Monday, January 20, 2020, 8:00 am to 10:30 amThe more elected local officials we get to lobby on behalf of all law-abiding gun owners, the better!\nIf they want more details, give them the flyerVirginia Citizens Defense League 2020 Lobby Day FlyerAbout Virginia Citizens Defense League, Inc. (VCDL):Virginia Citizens Defense League, Inc. (VCDL).\nVCDL is an all-volunteer, non-partisan grassroots organization dedicated to defending the human rights of all Virginians.\nThe Right to Keep and Bear Arms is a fundamental human right."}, {"url": "https://www.wfxrtv.com/news/commonwealth-news/virginia-lottery-sales-in-february-down-slightly-from-last-year/", "title": "Virginia Lottery sales in February down slightly from last year", "authors": ["Robert Mcelmurray", "Dean Mirshahi", "Wfxrtv.Com Digital Desk"], "date": "2020-03-26", "keywords": ["sales", "report", "slightly", "state", "gaming", "richmond", "million", "lottery", "wfxr", "virginia"], "summary": "RICHMOND, Va. (WFXR) –– Virginia Lottery sales for February 2020 were down slightly from the same time last year, according to a new report to the general assembly.\nLottery officials say February sales topped $169 million, down $2.9 million (-1.7%) compared to February 2019.\nVirginia LotteryFor the fiscal year to date, lottery sales totaled $1,379.6 million, a decline of $127.8 million (-8.4%) compared to last year.\nAccording to the report, Virginia Lottery’s staff in Richmond has also shifted almost entirely to teleworking.\nIn the report, Kevin Hall, executive director of Virginia Lottery touched on potentially changing landscape of gaming in Virginia."}, {"url": "https://www.columbiamissourian.com/obituaries/family_obituary/franklin-booker-thomas-bt-richmond-jr-feb-2-1943-april-15-2020/article_a9e887a0-7f4d-11ea-bc62-338689a67a1f.html", "title": "Franklin Booker Thomas 'BT' Richmond Jr., Feb. 2, 1943 — April 15, 2020", "authors": ["Submitted Parker-Millard Funeral Service", "Courtesy Of Parker-Millard Funeral Services"], "date": "1943-04-15", "keywords": ["booker", "talk", "website", "comments", "2020", "dont", "bt", "jr", "15", "social", "community", "1943", "worldtable", "topic", "thomas", "franklin", "feb", "richmond", "vulgar", "stay"], "summary": "When posting comments, please follow our community guidelines:• Login with a social account on WorldTable.\n• Don't use obscene, profane or vulgar language or engage in personal attacks.\n• Stay on topic.\nDon’t hijack a forum to talk about something else or to post spam.\n• Comments on our website and social media may be published in our newspaper or on our website."}, {"url": "https://www.nbc12.com/2020/04/07/richmond-attorney-announces-run-mayor/", "title": "Richmond attorney announces run for mayor", "authors": ["Published At Pm"], "date": "2020-04-07", "keywords": ["recovering", "trust", "future", "run", "attorney", "monumental", "mayor", "tasks", "past", "richmond", "uncertain", "overcoming", "announces", "lead"], "summary": "Richmond is facing the monumental tasks of overcoming COVID-19 and then recovering once it is over.\nDo we trust the same people who have accomplished nothing in the past to lead us into this uncertain future?\nThe people of Richmond deserve better than the failures of the last 4 years continuing for another 4 years."}, {"url": "https://www.pilotonline.com/government/virginia/vp-nw-coronavirus-general-assembly-governor-updates-0403-20200403-w6nhvxetg5ajdbdh5yutwjwkxy-story.html", "title": "Virginia lawmakers may hold session in Richmond outdoors because of coronavirus", "authors": ["Marie Albiges"], "date": "2020-04-03", "keywords": ["siegel", "sites", "center", "scheduled", "richmond", "lawmakers", "session", "outdoors", "coronavirus", "hold", "suggested", "speculation", "vetoed", "safely", "universitys", "virginia"], "summary": "The General Assembly is scheduled to meet April 22 to consider the governor’s budget amendments and any bills he’s vetoed, and there has been speculation about where and how that meeting could take place safely during the coronavirus pandemic.\nSome have suggested large indoor sites, such as the Greater Richmond Convention Center and Virginia Commonwealth University’s Siegel Center."}, {"url": "https://richmondspiders.com/news/2020/4/13/spider-leadership-best-of-richmond-athletics-honored-during-virtual-spidys.aspx", "title": "Best of Richmond Athletics Honored During Virtual SPIDYS", "authors": [], "date": "2020-04-13", "keywords": ["mens", "field", "award", "ncaa", "spidys", "hockey", "honored", "womens", "lacrosse", "richmond", "program", "virtual", "team", "named", "best", "athletics"], "summary": "The 2020 version of the SPIDYs honors teams and student-athletes from the spring of 2019, fall of 2019 and winter of 2019-20.\nThe men's lacrosse program won its second-straight Southern Conference championship in 2019, advancing to the NCAA Tournament before falling in the final seconds to No.\nWheeler was also a finalist for national Freshman of the Year Jerry Rice Award.of both field hockey and women's lacrosse was named the Female Newcomer of the Year.\nFrank was named to the A-10 All-Rookie team in field hockey and scored the game-winning goal in overtime at No.\n6 Virginia in women's lacrosse in its shortened season.Redshirt junior guardand swimming'swere named recipients of the Male and Female Determination Awards."}, {"url": "https://www.wric.com/news/virginia-news/northam-signs-legislation-decriminalizing-marijuana-in-virginia/", "title": "Northam signs legislation decriminalizing marijuana in Virginia", "authors": ["Dean Mirshahi", "Laura Perrot", "Kerri O'Brien"], "date": "2020-04-13", "keywords": ["ralph", "support", "house", "report", "virginia", "marijuana", "decriminalizing", "session", "legislation", "possession", "northam", "signs"], "summary": "Ralph Northam (D) signed legislation over the weekend that decriminalizes simple possession of marijuana in Virginia, a legislative priority pushed by Democrats and backed by the governor ahead of the General Assembly session.\nUnder the new law, which will go into effect on July 1, those caught with the drug would instead pay a $25 civil penalty.\nThe legislation also makes way for a group to study and release a report on the impact of legalizing pot in Virginia.\nEbbin told 8News before the session began that he was “very optimistic” that his legislation would make it to Gov.\nCritics of Virginia’s decriminalization effort complained that the bills from the House and Senate didn’t go far enough."}, {"url": "https://patch.com/illinois/downersgrove/carmax-launches-contactless-curbside-pickup", "title": "CarMax launches contactless curbside pickup", "authors": [], "date": "2020-04-16", "keywords": ["curbside", "cars", "purchase", "experience", "used", "carmax", "vehicle", "providing", "customers", "car", "launches", "contactless", "pickup", "vehicles"], "summary": "RICHMOND, Virginia (April 14, 2020) – CarMax, Inc. (NYSE: KMX), the nation's largest retailer of used cars, today announced new customer offerings amid the COVID-19 pandemic.\nThat's why CarMax is enhancing its online shopping capabilities to include socially distanced and contactless curbside pickup at most open stores nationwide.\nCarMax also continues to offer home delivery at many open locations, where customers can complete the entire car-buying experience from home and have the vehicle delivered by a CarMax associate.\nThe new CarMax Cubside enables customers to complete the car buying and selling experience while adhering to social distancing practices.\nAbout CarMaxCarMax, the nation's largest retailer of used cars, revolutionized the automotive retail industry by driving integrity, honesty and transparency in every interaction."}, {"url": "https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2020/04/16/amid-pandemic-a-ray-of-light-for-gun-control-advocates-on-nras-home-turf", "title": "Amid Pandemic, a Ray of Light for Gun Control Advocates on NRA's Home Turf", "authors": [], "date": "2020-04-16", "keywords": ["ray", "pandemic", "advocates", "state", "states", "gun", "democratic", "turf", "amid", "senate", "laws", "light", "legislation", "control", "rights", "virginia", "nras"], "summary": "Carmen Lodato began advocating with gun control group Moms Demand Action after her mother was shot and killed in Alexandria, Virginia, in 2014.\nAdvocates like her were instrumental in getting stricter gun laws implemented this year.\nEverything follows.”A week later, on Martin Luther King Jr. Day, an estimated 22,000 gun rights activists, many heavily armed, gathered on the Capitol grounds to protest gun control legislation.\n“Contrary to what the other side is saying, the election is not a referendum on gun control,” he said.\nAs one of the fiercest and most vocal gun rights advocates in the legislative body, Republican state Sen. Amanda Chase, known for carrying a pistol into floor debates, remained opposed to any gun control measures."}, {"url": "https://www.nbc12.com/2020/04/16/virginias-new-gun-restrictions-have-been-years-making/", "title": "Virginia’s new gun restrictions have been 13 years in the making", "authors": ["Guest Column", "Published At Pm", "Published At Am"], "date": "2020-04-16", "keywords": ["13", "roaming", "state", "gun", "virginias", "unable", "right", "power", "summon", "rifle", "making", "restrictions", "tech", "thing", "virginia"], "summary": "Roaming the halls of the General Assembly in January and February 2008, we were avoided by members of both parties.\nThe power and influence of the National Rifle Association in its home state were perceived to be impenetrable.\nEven after 32 people were killed at Virginia Tech, legislators were unable to summon the political courage to do the right thing."}, {"url": "https://richmondbizsense.com/2020/03/24/which-industries-are-essential-and-non-essential-in-statewide-lockdown/", "title": "Which industries are essential and non-essential in statewide lockdown?", "authors": ["Mike Platania", "Pamela Truesdale"], "date": "2020-03-24", "keywords": ["stores", "lockdown", "retail", "guidelines", "industries", "open", "statewide", "week", "northam", "nonessential", "wheeler", "order", "construction", "shops", "essential"], "summary": "Those sounds of heavy machinery can continue, as construction made the list – along with healthcare, food and beverage, retail and other industries – of essential businesses able to maintain onsite operations following the governor’s order to shut down non-essential businesses and schools.\nAt a press conference Monday, Angela Navarro, Virginia’s deputy secretary of commerce and trade, said the constrictions do not affect the construction industry and that construction product retail stores are considered essential businesses.\nThe great news is that the jurisdictions are staying open,” Wheeler said.\nNon-essential retail shops can remain open but must adhere to social distancing guidelines and have 10 or fewer people inside at a time.\n“The sooner we take these necessary steps to slow the spread, the sooner we will all get through this."}, {"url": "https://www.nbc12.com/2020/03/17/latest-virginia-news-sports-business-entertainment-am-edt/", "title": "Latest Virginia news, sports, business and entertainment at 9:20 p.m. EDT", "authors": ["Published April", "At Am", "At Pm"], "date": "2020-03-17", "keywords": ["business", "va", "forward", "statement", "transferred", "vindication", "asalone", "latest", "teenager", "entertainment", "920", "charged", "victimized", "edt", "virginia"], "summary": "FALLS CHURCH, Va. (AP) — A former Catholic priest has been charged with sexually abusing a teenager in Virginia in a case dating back nearly 35 years, and city councilman David Grosso from the District of Columbia has come forward with a statement saying he was victimized.\nSixty-three-year-old Scott Asalone was charged in Loudoun County.\nAttorney General Mark Herring's office says Asalone was arrested Saturday in New Jersey and will be transferred to Virginia.\nAsalone was on a list last year of priests described by the Arlington Diocese as credibly accused of abuse.\nAsalone's lawyer said his client looks forward to his day in court and seeking vindication."}, {"url": "https://nmstatesports.com/news/2020/4/14/football-aggies-ink-five-more-signees-for-2020.aspx", "title": "Aggies Ink Five More Signees for 2020", "authors": [], "date": "2020-04-14", "keywords": ["aggies", "ink", "2020", "defensive", "offensive", "state", "signees", "hs", "nm", "community", "wide", "holmes", "played", "calif"], "summary": "NEW SIGNEESPREVIOUS SIGNEES++ NM State ++– Five more student-athletes, including two transfers from FBS schools, have made their commitments to play football at NM State.Defensive backs Olan Cazad Jr. and D.J.\nMcCullough, defensive tackle Darvis Holmes, offensive lineman Gabriel Preciado and tight end Anthony Roberson signed with the Aggies on Wednesday, strengthening the program's 2020 signing class.\n\"Holmes and Roberson each come to NM State from FBS programs.\nThe Imperial Beach, Calif., native spent the 2019 campaign at Southwestern CC in Chula Vista, Calif.Wednesday's additions raise NM State's group of signees to 22.\n| Coffeyville Community College6-0 | 180 | Wide ReceiverTwentynine Palms, Calif. | Saddleback College6-1 | 170 | SafetyPompano Beach, Fla. | Independence Community College6-0 | 200 | Wide ReceiverTruckee, Calif. | Truckee HS | Saddleback College6-1 | 190 | CornerbackLiberty, Mo."}, {"url": "https://cruxnow.com/church-in-the-usa/2020/04/priest-with-blog-critical-of-churchs-abuse-handling-removed/", "title": "Priest with blog critical of Church’s abuse handling removed", "authors": ["Associated Press"], "date": "2020-04-14", "keywords": ["priest", "st", "reported", "churchs", "blog", "whites", "removed", "richmond", "abuse", "church", "white", "diocese", "critical", "handling", "virginia"], "summary": "RICHMOND, Virginia — A priest in Virginia was removed from his post after maintaining a blog critical of the Catholic Church’s handling of the sexual abuse scandal.\nFather Mark White, whose blog reaches more than 1 million readers, was removed on Monday, news outlets reported.\nHe served as the priest of St. Joseph Catholic Church in Martinsville and St. Francis of Assisi in Rocky Mount.\nThe Martinsville Bulletin reported White had initially stopped his blog posts after church officials told him in February it could lead to his removal.\nWhite’s responsibilities have been handed over to another priest until a replacement can be named."}, {"url": "https://www.nytimes.com/2020/04/14/us/coronavirus-updates.html", "title": "Coronavirus Updates: Trump Halts U.S. Funding of World Health Organization", "authors": [], "date": "2020-04-14", "keywords": ["ok", "josh", "halts", "funding", "dont", "health", "updates", "right", "rosenberg", "doctor", "trump", "world", "coronavirus", "hes", "patients", "know", "dr", "organization"], "summary": "dr. josh rosenberg Right.\ndr. josh rosenberg I’ll just write — because I mean, listen, on some of these you have a real reason why.\ndr. josh rosenberg OK.\ndr. josh rosenberg OK.\ndr. josh rosenberg Right."}, {"url": "https://www.wavy.com/10-on-your-side/virginia-unemployment-during-coronavirus/", "title": "More than 106k Virginians file new unemployment claims; what you need to know if you’re suddenly jobless", "authors": ["Adrienne Mayfield", "Brett Hall", "Kaley Lynch", "Sarah Fearing"], "date": "2020-03-26", "keywords": ["youre", "filed", "suddenly", "unemployment", "initial", "virginians", "file", "106k", "claims", "week", "americans", "jobless", "number", "benefits", "need", "know"], "summary": "Unemployment by the numbersMore than 5.2 million Americans filed initial unemployment claims last week, including 106,723 Virginians, according to the U.S. Department of Labor.\nThat number is more than twice as high as the number of claims filed in mid-March when 3.3 million Americans filed initial claims, according to the DOL.\nIn the second week of April, 40,646 fewer Virginians filed initial unemployment claims than in the first week of the month.\nThat means that more than 106,000 Virginians filed initial unemployment claims in the week of April 11.\nThe week before that, 2,527 Virginians filed initial claims for unemployment benefits."}, {"url": "https://www.wric.com/weather/sights-and-sounds-central-virginias-first-snowfall-of-2020/", "title": "Live Updates: Central Virginia’s first snowfall of 2020", "authors": ["John Bernier", "Talya Cunningham", "Tyler Thrasher"], "date": "2020-02-20", "keywords": ["va", "snowfall", "2020", "8news", "snow", "reporter", "virginias", "updates", "latest", "morning", "roads", "richmond", "central", "courtesy", "live", "virginia"], "summary": "RICHMOND, Va. (WRIC) — The Latest: Snow made its first appearance of 2020 in Central Virginia Thursday evening.\n8News Digital Reporter Ben Dennis went to Waverly where the main roads were okay, but some of the side streets were very slushy.\n@8NEWS #8News #WRIC We’re in SE Virginia this morning in Waverly and Wakefield.\nThere are a few inches of snow on the ground, enough that 8News Reporter Julius Kizzee made a new snow friend.\nVIDEO: Flurries on Interstate-95 South near PetersburgWeather Alert: Snowfall in EmporiaThe winter storm brought icy conditions to Virginia roadways."}, {"url": "https://www.wric.com/in-studio-interviews/2020-virginia-international-auto-show-in-richmond-this-weekend/", "title": "2020 Virginia International Auto Show in Richmond this weekend", "authors": ["John Rogers"], "date": "2020-02-11", "keywords": ["weekend", "trucks", "2020", "cars", "international", "crossovers", "suvs", "richmond", "driving", "auto", "electric", "virginia", "vehicles"], "summary": "RICHMOND, Va. (WRIC) — The 2020 Virginia International Auto Show cruises into Richmond with hundreds of new cars, trucks, crossovers, SUVs and more.\nElectric cars are new wave, and there will be plenty of electric vehicles available- Nissan Leaf, Chevrolet Bolt, Audi e-tron and more will be at the show.\nSome new ones to check out include the 2020 Lincoln Aviator, 2020 Ford Explorer, 2020 Kia Telluride, 2020, 2020 Audi Q7 and more.\nKids can test drive small electric vehicles on their own at the Citgo Kids Test Track.\nThe 2020 Virginia International Auto Show will be held at the Greater Richmond Convention Center at 403 North Third Street."}, {"url": "https://www.wtvr.com/local-news/bernie-sanders-is-coming-to-richmond", "title": "Venue for Bernie Sanders' Richmond rally changed", "authors": [], "date": "2020-02-22", "keywords": ["arthur", "scheduled", "rally", "voters", "vermont", "sanders", "richmond", "bernie", "ashe", "senator", "changed", "virginia", "venue"], "summary": "RICHMOND, Va. -- Senator Bernie Sanders is coming to Richmond on Thursday.\nThe Vermont senator and Democratic presidential candidate will rally voters Thursday, February 27, ahead of the March 3 Virginia primary.\nThe rally will now be held at the Arthur Ashe Junior Athletic Center at 3001 N Arthur Ashe Blvd at 3:30 p.m.\nThe Richmond rally was originally scheduled for The National in downtown Richmond, but had to be moved due to the concert venue's limited capacity, Bill Neidhardt the state coordinator for the Sanders' campaign said.\nAdditionally, Sanders has rallies scheduled Saturday in Leesburg and Virginia Beach."}, {"url": "https://www.wtvr.com/eat-it-virginia/richmond-restaurant-goes-to-hell-and-back-with-gordon-ramsay", "title": "Richmond restaurant goes to Hell and Back with Gordon Ramsay", "authors": [], "date": "2020-02-17", "keywords": ["hell", "restaurant", "shane", "gordon", "goes", "scott", "ramsay", "expert", "started", "richmond", "television", "robertsthomas", "tell", "virginia"], "summary": "RICHMOND, Va. -- Shane Roberts-Thomas is a Tasmanian devil.\nAt least that's what she told a worldwide television audience when her Richmond restaurant Southern Kitchen was featured in \"Gordon Ramsay's 24 Hours to Hell and Back.\"\nco-hosts Scott Wise and Robey Martin to break down Gordon Ramsay's surprise visit to Richmond and discussed the life decisions she made that led her to open a restaurant.\nThe Gordon Ramsay experience started with a phone call.\n\"[The producers called] and they didn't say was Gordon Ramsay."}, {"url": "https://www.nbc12.com/2020/04/13/study-cdc-finds-that-covid-could-travel-shoes/", "title": "Study: CDC finds that COVID-19 could travel on shoes", "authors": ["Published At Pm"], "date": "2020-04-13", "keywords": ["tracked", "walk", "swab", "study", "shoes", "positivity", "travel", "finds", "cdc", "floor", "virus", "rate", "ward", "staff", "covid19"], "summary": "The positivity rate was relatively high for floor swab samples “perhaps because of gravity and air flow causing most virus droplets to float to the ground.\nIn addition, as medical staff walk around the ward, the virus can be tracked all over the floor, as indicated by the 100% rate of positivity from the floor in the pharmacy, where there were no patients,\" the study said."}, {"url": "https://www.wric.com/news/politics/bernie-sanders-coming-to-richmond-ahead-of-super-tuesday/", "title": "Bernie Sanders coming to Richmond ahead of Super Tuesday", "authors": ["Andrew Taylor", "Associated Press", "Scott Bauer", "Lisa Mascaro"], "date": "2020-02-22", "keywords": ["va", "national", "doors", "ahead", "northern", "rallies", "coming", "belmont", "sanders", "open", "richmond", "place", "bernie", "super", "virginia"], "summary": "RICHMOND, Va. (WRIC) — Sen. Bernie Sanders will return to Virginia days ahead of the March 3 primaries, holding rallies in Richmond and Northern Virginia.\nSanders has emerged as the front-runner for the Democratic presidential nomination and continues to perform well in national polls.\nCampaign rallies will be held at the following:Thursday, February 273:30 p.m. Richmond RallyThe National, 708 E Broad Street, Richmond, Virginia 23219 Doors open at 2:00 p.m.Saturday, February 294:00 p.m. Northern Virginia RallyWest Belmont Place at The National Conference Center – 18980 Upper Belmont Place, Leesburg, VA 20176 Doors open at 2:30 p.m.\nBoth events are free and open to the public, however, an RSVP is encouraged.\nLATEST STORIES:"}, {"url": "https://www.wtvr.com/eat-it-virginia/these-richmond-area-chefs-earned-james-beard-nominations", "title": "These Richmond-area chefs earned James Beard nominations", "authors": [], "date": "2020-02-26", "keywords": ["nominations", "james", "chef", "earned", "sister", "beard", "outstanding", "thompson", "sub", "richmondarea", "chefs", "team", "best", "virginia"], "summary": "And the food world has the James Beard Awards.\nThe James Beard Awards honor the nation's best chefs, restaurants, and food journalists.\nSunny Baweja, chef and co-owner of Lehja in Short Pump, earned a semifinalists distinction in the category of Best Chef: Mid-Atlantic.\nHe and his wife Lisa Chang have been nominated for Best Chef: Mid-Atlantic for their Fairfax, Virginia restaurant Mama Chang.\nEvrim and Evin Dogu, the brother and sister team behind Sub Rosa Bakery in Church Hill, also picked up avrim and Evin Dogu, the brother and sister team behind Sub Rosa Bakery, picked up a James Beard semifinalist nomination for Outstanding Baker."}, {"url": "https://www.nbc12.com/2020/02/28/galaxycon-richmond-convention-center/", "title": "GalaxyCon kicks off at the Richmond Convention Center", "authors": ["Adrianna Hargrove", "Published April", "At Pm", "At Am"], "date": "2020-02-28", "keywords": ["creators", "meet", "fandom", "chance", "center", "festival", "threeday", "kicks", "gamers", "cosplayers", "richmond", "gives", "voice", "galaxycon", "convention"], "summary": "The three-day festival of fandom gives people the chance to meet celebrities, creators, voice actors, cosplayers, gamers and more!"}, {"url": "https://www.nbc12.com/2020/02/13/greater-richmond-convention-center-hosting-virginia-international-auto-show/", "title": "Greater Richmond Convention Center hosting 2020 Virginia International Auto Show", "authors": ["Adrianna Hargrove", "Published Am At Am"], "date": "2020-02-13", "keywords": ["convention", "2020", "center", "greater", "international", "feb", "open", "16", "richmond", "auto", "15", "14", "public", "hosting", "virginia"], "summary": "The show will open to the public on Feb. 14 and 15 from 10 a.m. to 9 p.m. as well as Feb. 16 from 10 a.m. to 6 p.m."}, {"url": "https://www.nbc12.com/2020/02/21/blanket-snow-covers-areas-south-richmond/", "title": "Blanket of snow covers areas south of Richmond", "authors": ["Published April", "At Pm", "At Am"], "date": "2020-02-21", "keywords": ["blanket", "covers", "snow", "meteorologist", "duncan", "metro", "richmond", "south", "jim", "saw", "areas", "sussex", "nbc12"], "summary": "NBC12 meteorologist Jim Duncan said areas south of Richmond - such as Sussex and Brunswick counties - saw the most snow, while the metro Richmond area did not see much."}, {"url": "https://www.nbc12.com/2019/11/25/winter-outlook-/", "title": "Virginia’s winter outlook for 2019-2020 expected to be relatively mild", "authors": ["Jim Duncan", "Published April", "At Pm", "At Am"], "date": "2019-11-25", "keywords": ["winter", "outlook", "sprinkled", "expected", "20192020", "realm", "temperatures", "virginias", "zone", "trends", "mild", "soil", "wellknown", "signals", "science", "relatively"], "summary": "Winter outlooks (they are not “forecasts”, that dwell in the predicting-out-a-few-days ahead realm) are at best educated guesses sprinkled with science.\nThis winter, like most, falls into that zone, with few clear signals.\nEl Nino and La Nina are predicted to be neutral through the winter, but there are other considerations beyond those “well-known” ones, including ocean temperatures in other areas of the Pacific and Atlantic, soil moisture content, and our late-Fall global pattern trends."}, {"url": "https://www.wric.com/8news-digital-exclusives/sights-sounds-bernie-sanders-rally-in-richmond/", "title": "Sights & Sounds: Bernie Sanders holds campaign rally in Richmond", "authors": ["Ben Dennis", "Tyler Thrasher"], "date": "2020-02-27", "keywords": ["arthur", "whats", "holds", "campaign", "rally", "sights", "sanders", "richmond", "working", "wric", "life", "bernie", "ashe", "sounds"], "summary": "RICHMOND, Va (WRIC) — Bernie Sanders held a campaign rally in Richmond days away from the Virginia Democratic primary vote.\nA line of people wrapped around the Arthur Ashe Jr.\n“They can’t afford the basic necessities of life, and they say does anybody care what’s going on in my life?\nWell we do care.”JUST IN—4,700 people attended the Bernie Sanders rally in #Richmond, a member of the campaign’s national advance team tells me.\nEVENT DETAILS:What: Bernie Sanders Richmond rallyWhen: 3:30 p.m., Thursday, February 27Where: Arthur Ashe Junior Athletic Center, 3001 N Arthur Ashe Blvd., Richmond, VA 23230."}, {"url": "https://www.wtvr.com/news/local-news/thick-smoke-visible-in-richmond-as-emergency-res-ponders-fight-two-alarm-fire", "title": "Massive two-alarm tire fire visible throughout Richmond", "authors": [], "date": "2020-02-18", "keywords": ["videos", "visible", "seen", "recycling", "twoalarm", "massive", "tire", "crews", "richmond", "plant", "word", "school", "smoke", "thick"], "summary": "RICHMOND, Va. -- Fire crews were stationed at a Richmond Recycling plant throughout the day and night Tuesday in response to a massive two-alarm fire that drew attention throughout the city.\nThe fire could be seen from miles away from its location at a recycling plant on School St.\nPhotos and videos showed thick black smoke and flames coming from the intersection of School St. and Brook Rd.\nOfficials say that the thick smoke was the result of tires being burned in the fire.\n#MASC396 #RVA pic.twitter.com/S7hst56UI4 — Jasmin Sneed (@jasmin_sneed) February 18, 2020Fire crews are set up for a \"defensive operation,\" according to Richmond Fire."}, {"url": "https://www.nbc12.com/2020/02/12/everything-you-need-know-about-virginias-march-life-this-thursday/", "title": "Everything you need to know about Virginia’s March for Life happening Thursday", "authors": ["Published April", "At Pm"], "date": "2020-02-12", "keywords": ["happening", "capitol", "getting", "begin", "state", "actual", "virginia", "rally", "virginias", "feb", "underway", "life", "need", "know"], "summary": "The Virginia March for Life will begin with a rally against abortion at the State Capitol at 11:45 a.m. on Feb. 13, with the actual march getting underway around 12:45 p.m."}, {"url": "https://www.nbc12.com/2020/02/18/henrico-storm-spotter-compares-weather-this-february-prior-years-difference-is-stunning/", "title": "Henrico storm spotter compares weather this February to prior years - the difference is stunning", "authors": ["Nick Russo", "Published April", "At Pm", "At Am"], "date": "2020-02-18", "keywords": ["winter", "youre", "temp", "think", "spring", "prior", "storm", "teens", "right", "henrico", "weather", "difference", "compares", "rva", "sub20f", "stunning", "recordlatest", "spotter"], "summary": "If you feel like it's been a mild winter for #RVA, you're right.\nNever before have we gone *nearly* so far into winter without recording a sub-20F temp.\nThe previous record-latest occurrence?\nWhat do you think @AndrewNBC12 - any readings in the teens before spring?\npic.twitter.com/WnswjrhPLO"}, {"url": "https://wtvr.com/2020/01/31/a-list-of-black-history-month-events/", "title": "A List of Black History Month Events", "authors": [], "date": "2020-01-31", "keywords": ["history", "vmfa", "registration", "dance", "visit", "museum", "black", "events", "louis", "month", "feb", "library", "list", "virginia"], "summary": "RICHMOND, Va.-- Black History Month Events:Black History Museum & Cultural Center \"The Paradox of Liberty: Slavery at Jefferson’s Monticello, through April 18, 2020.\nVMFA After Hours: VMFA Is for LoversSat, Feb 15, 7–11:30 pm | Marble Hall & Atrium.\nThe Virginia Museum of Fine Arts is the only art museum in the United States open 365 days a year with free general admission.\nThursday, Feb. 13, 6-7 p.m. - Calvin Pearson, the founder, and president of Project 1619, an organization that promotes and shares the history of Virginia’s first Africans.\nHenrico County Black History Month EventsMovie: Harriet [henrico.us],Feb 7 at 7pm, Feb 8 at 2 & 7pm, and Feb 9 at 2pm."}, {"url": "https://wtvr.com/2020/02/01/mild-winter-temperatures-continue-into-february/", "title": "February Weather Outlook: ‘Active’ pattern features frequent fronts and storms", "authors": [], "date": "2020-02-01", "keywords": ["winter", "outlook", "va", "precipitation", "snowfall", "fronts", "typical", "storms", "temperatures", "totals", "week", "pattern", "features", "weather", "active", "frequent", "normal"], "summary": "February is expected to finish with above normal temperatures as well.\nWhile there will still be some cold weather, there are no major signs of any arctic outbreaks through mid-month.\nTemperatures for most of February's first week will be well above normal, and this will counter-balance any frigid weather late in the month.\nThe pattern for February looks to be an active one with frequent fronts and storms, but the majority of the precipitation will likely be rain.\nThe top 10 snowiest include snowfall totals ranging from 12 to over 20 inches."}, {"url": "https://www.wtvr.com/news/local-news/two-killed-in-richmond-double-shooting", "title": "Men killed outside Richmond apartment building", "authors": [], "date": "2020-02-25", "keywords": ["supportive", "building", "scene", "men", "outside", "shot", "spokesperson", "morning", "apartment", "richmond", "killed", "property", "unresponsive"], "summary": "RICHMOND, Va. -- Two men were shot and killed Tuesday morning in Richmond.\n\"Officers arrived and found two adult males in a parking lot of an apartment building, down and unresponsive.\nThe crime scene, according to police, is along northbound lanes of Jefferson Davis Highway in front of a small apartment building.\n\"Virginia Supportive Housing’s property management team learned early this morning from police that two men were found shot and unresponsive in the parking lot of building 1 of a 14-unit apartment community that we own and operate.\nAnyone with information was asked to call Major Crimes Detective Young at 804-646-3926 or at Crime Stoppers at 804-780-1000."}, {"url": "https://www.wtvr.com/weather/todays-forecast/snow-way-look-at-the-forecast", "title": "Snow headed to Virginia", "authors": [], "date": "2020-02-19", "keywords": ["winter", "va", "snowfall", "headed", "snow", "storm", "temperatures", "watch", "richmond", "area", "virginia", "cold"], "summary": "RICHMOND, Va. - Cold and dry air will continue to move into the region tonight through Thursday as strong high pressure settles into the central U.S.A quick-moving upper-level disturbance will spread snowfall through southern Virginia Thursday afternoon and evening.\nThe highest snowfall accumulations will occur along the North Carolina line into Hampton Roads, where a winter storm watch is currently in effect.\nA light accumulation is possible in the Richmond area, and with temperatures falling into the mid 20s Friday morning, slick travel will be possible.\nAnother storm system will bring a good chance of rain to the area on Monday.\nThe pattern appears mild, despite the rainfall, with highs reaching the 60s on Tuesday and Wednesday."}, {"url": "https://www.nbc12.com/2020/02/03/news-know-feb-earthquake-rumbles-louisa-richmond-year-old-shot-killed-henrico-house-fire-unseasonably-warm-temperatures/", "title": "News to Know for Feb. 3: Earthquake rumbles Louisa; 3-year-old shot, killed; Henrico house fire; Unseasonably warm temperatures", "authors": ["Published At Pm"], "date": "2020-02-03", "keywords": ["unseasonably", "voters", "verdict", "trump", "henrico", "premiere", "tens", "know", "unfold", "warm", "president", "killed", "louisa", "rumbles", "thousands", "house", "shot", "temperatures", "caucuses", "render"], "summary": "By day’s end, tens of thousands of Democrats will have participated in the famed Iowa caucuses, the premiere of more than 50 contests that will unfold over the next five months.\nThe caucuses will render the first verdict on who among dozens of candidates is best positioned to take on President Donald Trump, whom Democratic voters are desperate to beat this fall."}, {"url": "https://www.wric.com/community/greater-richmond-scans-blue-and-white-ball/", "title": "Greater Richmond SCAN’s Blue and White Ball", "authors": ["John Rogers", "Keyris Manzanares", "Amelia Heymann", "Michael Stern"], "date": "2020-02-20", "keywords": ["event", "children", "blue", "child", "greater", "ball", "young", "richmond", "treatment", "abuse", "scans", "white", "work"], "summary": "It’s a chance to help a non-profit dedicated to the prevention and treatment of child abuse.\nSCAN’s Board of Young Professionals hosts the 2020 Blue and White Ball on March 7th from 7pm to 11pm.\nAll proceeds benefit SCAN’s mission to prevent and treat child abuse and neglect throughout the Greater Richmond area.\nSCAN, or Stop Child Abuse Now, is dedicated to the prevention and treatment of child abuse and neglect and trauma in the Greater Richmond area.\nThe Blue and White Ball is hosted by SCAN’s Board of Young Professionals and provides critical funding for SCAN to serve children and families in our community."}, {"url": "https://www.wric.com/news/local-news/richmond/more-questions-raised-about-massive-richmond-fire-as-crews-battle-hot-spots-a-day-later/", "title": "More questions raised about massive Richmond fire as crews battle hot spots a day later", "authors": ["Amy Simpson", "Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-02-19", "keywords": ["recycling", "lawson", "massive", "hot", "crews", "smoke", "spots", "sold", "8news", "companies", "told", "questions", "raised", "later", "day", "vacant", "battle", "building", "richmond"], "summary": "“Materials like this can burn for weeks,” Richmond Fire Department’s Lt. Chris Armstrong told 8News on Wednesday.\nMathew Appelget with Materials Management & Recycling told 8News on Wednesday that the property was sold to Lawson Companies, a Virginia Beach developer.\nKristopher Knepper, vice president and director of development & acquisitions at Lawson Companies, confirmed Wednesday that the company had purchased the building on Dec. 20, 2019, and that Lawson Companies has plans to redevelop.\n“Thrilled to learn nobody has been injured,” Knepper told 8News.\nA Richmond police spokesperson told 8News no criminal investigation has begun at this time."}, {"url": "https://www.wtvr.com/news/local-news/body-found-near-richmond-convenience-store", "title": "Body found near Richmond convenience store", "authors": [], "date": "2020-02-25", "keywords": ["brush", "va", "southside", "taken", "rd", "store", "commerce", "richmond", "shop", "convenience", "body", "richmondthe", "near"], "summary": "RICHMOND, Va. -- A man hired to clear the brush behind a Richmond shop discovered a dead body.\nAround 3 p.m., the body was found in the brush behind the Commerce Market and Deli at 1641 Commerce Rd in Southside Richmond.\nThe body has been taken to the Medical Examiner's Office for investigation and identification."}, {"url": "https://www.nbc12.com/2020/02/27/news-know-feb-overpass-closed-bernie-sanders-rva-woman-still-missing-vcu-suspends-study-abroad-china-dry-chilly-day/", "title": "News to Know for Feb. 27: Overpass closed; Bernie Sanders in RVA; Woman still missing; VCU suspends study abroad to China; Dry, Chilly day", "authors": ["Published At Pm"], "date": "2020-02-27", "keywords": ["rally", "vcu", "overpass", "arthur", "ashe", "know", "scheduled", "north", "sanders", "missing", "national", "study", "junior", "rva", "location", "located", "feb", "woman", "suspends"], "summary": "Sanders rally was going to be held at the National, but the location has changed to the Arthur Ashe Junior Athletic Center located on North Arthur Ashe Boulevard.\nThe rally is scheduled for 3:30 p.m. Information can be found here."}, {"url": "https://www.wtvr.com/news/local-news/police-id-teen-killed-in-richmond", "title": "Police ID teen killed in Richmond", "authors": [], "date": "2020-02-18", "keywords": ["teen", "local", "id", "scene", "shot", "vehicle", "west", "shootings", "richmond", "killed", "shooting", "street"], "summary": "RICHMOND, Va. -- Richmond Police have identified the person shot and killed Monday on West Charity Street as 18-year-old Katrez T. Bryant.\nHe was transported to a local hospital where he succumbed to his injuries at 6:21 p.m.\" a Richmond Police spokesperson said.\nThe fatal in the Gilpin Court housing community was one of two deadly shootings in Richmond on Monday.\nKieshell L. Walker, a 27-year-old mother of two, was shot and killed in Richmond’s Mosby Court neighborhood less than an hour after Bryant was killed.\nDetectives are seeking information concerning a vehicle of interest seen on video near the scene of the shooting."}, {"url": "https://www.wric.com/news/local-news/richmond/police-man-shot-to-death-inside-richmond-convenience-store/", "title": "Suspect arrested for murder in Richmond convenience store shooting", "authors": ["Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-02-06", "keywords": ["market", "man", "8news", "mechanicsville", "store", "arrested", "officers", "inside", "richmond", "shooting", "suspect", "robinson", "convenience", "death", "murder"], "summary": "RICHMOND, Va. (WRIC) — The Richmond Police Department has arrested a man in connection to a homicide that happened inside a convenience store earlier this week on Mechanicsville Turnpike.\nAround 9:15 p.m. on Wednesday, February 5, officers responded to the 804 Market on Mechanicsville Turnpike for the report of a person shot.\nWhen officers arrived, they found 27-year-old Leon Robinson inside, unresponsive and suffering from gunshot wounds.\nPolice believe the suspect walked into the store and targeted Robinson.\nBREAKING: Richmond Police Chief Will Smith tells me a man was shot to the death in the back of this market on Mechanicsville Turnspike."}, {"url": "https://www.wtvr.com/news/local-news/two-killed-in-separate-richmond-shootings", "title": "Two killed in separate Richmond shootings", "authors": [], "date": "2020-02-18", "keywords": ["sources", "va", "separate", "took", "shootings", "vcu", "woman", "richmond", "killed", "say", "twoandahalf", "court", "transported"], "summary": "RICHMOND, Va. -- Two people were killed in two separate Richmond shootings on Monday.\nRichmond Police officers swarmed the intersection of Saint Peter and Charity Streets in the Gilpin Court housing projects Monday evening.\nCrime Insider sources say a man was sitting on a porch when gunfire erupted.\nCI sources say he was shot in the head and later died at VCU Medical Center.\nShortly after, a drive by shooting took place two-and-a-half miles away and in Mosby Court, according to CI sources."}, {"url": "https://www.wric.com/community/5-ways-to-celebrate-black-history-month-around-rva/", "title": "5 ways to celebrate Black History Month around RVA", "authors": ["Keyris Manzanares", "Amelia Heymann", "Michael Stern"], "date": "2020-02-03", "keywords": ["history", "african", "museum", "ways", "black", "events", "american", "month", "celebrate", "pmcost", "richmond", "rva", "virginia"], "summary": "RICHMOND, Va. (WRIC) — February is here and that means Black History Month is in full effect!\nBlack History Month TourTour the temporary exhibition ‘Determined: The 400 Year Struggle for Black Equality’ as a way to celebrate Black History Month.\nCost: FreeAges 12 & upHand-Made in RVACelebrate Black history month with some of RVA’s most talented people.\nCost: FreeBus Trip to the National Museum of African American History & CultureTake a day trip to Washington D.C. to visit the MLK Memorial and the National Museum of African American History and Culture.\nCost: $65Know of any Black History Month events going on?"}, {"url": "https://www.wtvr.com/community/a-list-events/are-you-ready-to-shiver-in-the-river", "title": "Are you ready to Shiver in the River?", "authors": [], "date": "2020-02-20", "keywords": ["registration", "5k", "james", "shiver", "leap", "richmond", "banks", "river", "litter", "birthday", "ready"], "summary": "RICHMOND, Va. -- Are you ready to Shiver in the River?\nThe annual Shiver in the River event helps eliminate litter and keeps Virginia Beautiful.\nRichmonders have a choice in three of the day’s events:A cleanup along the banks of the James River and in communities throughout RVAWalk or run the 5K Picking up litter and recyclablesEnjoy the beauty of the James River with a bit of exercise.\nThe highlight of Shiver in the River is the James River LEAP!\nEvent schedule for Saturday, February 29:9 a.m. - Registration Opens10 a.m. - Community Clean-up11 a.m. - Winter FestivalNoon - Shiver 5K1:30 p.m. - LEAP in the James3:30 p.m. - GO HOME & WARM UP!"}, {"url": "https://www.kltv.com/2020/01/20/thousands-ascend-virginia-capitol-gun-rights-rally-everything-you-need-know-live-updates/", "title": "A timeline of the 2020 gun-rights rally in Richmond", "authors": ["Published April", "At Pm", "Published March"], "date": "2020-01-20", "keywords": ["2020", "law", "timeline", "thrown", "rally", "virginias", "square", "richmond", "working", "wish", "stood", "gunrights", "wanted", "voices", "thank"], "summary": "\"Even when thrown a last-minute curveball by Governor Northam, Virginia’s Second Amendment community accepted it with grace and did what they always do -- make their voices heard while complying with the law.\nThose who wanted to go into buildings or onto Capitol Square disarmed, while those who did not wish to do so stood outside the security perimeter.\nI also want to thank the hundreds of law enforcement personnel who spent a day out in the cold, working to ensure everyone’s safety."}, {"url": "https://www.nbc12.com/2020/01/30/chick-fil-a-locations-richmond-offering-free-menu-items-every-monday-february/", "title": "Chick-Fil-A locations in Richmond offering free menu items every Monday in February", "authors": ["Adrianna Hargrove", "Published April", "At Am", "At Pm"], "date": "2020-01-30", "keywords": ["menu", "locations", "offer", "tab", "receive", "chickfila", "rewards", "richmond", "offering", "redeemed", "checkout", "free", "create", "automatically", "download", "app", "items"], "summary": "Once you download the app and create an account, you will automatically receive the offer in the “Rewards” tab, which can then be redeemed during checkout."}, {"url": "https://www.wric.com/news/local-news/richmond/bernie-sanders-rally-location-changes-due-to-high-volume-of-rsvps/", "title": "Bernie Sanders rally location changes due to ‘high volume of RSVPs’", "authors": ["Keyris Manzanares", "Sierra Fox", "Ben Dennis", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-02-25", "keywords": ["changes", "arthur", "ashe", "rsvps", "state", "rally", "center", "candidate", "sanders", "high", "volume", "richmond", "location", "bernie", "meagher", "super"], "summary": "RICHMOND, Va. (WRIC) — Bernie Sanders will be in Richmond today to rally voters ahead of Super Tuesday.\nEarlier this week, Sanders’ campaign announced the rally was moving to a larger venue due to an ‘overwhelming response.’The rally, originally going to be held at The National, is now being moved to the Arthur Ashe Junior Athletic Center.\nThe National holds roughly 1,500 while the Arthur Ashe Center can hold about 6,000 people.\n“Having a candidate come to your back yard will also spur interest in that candidate,” Meagher said.\nMeagher believes more eyes will be on the state of Virginia as the lead up to Super Tuesday continues."}, {"url": "https://www.nbc29.com/2020/02/18/virginia-wineries-association-announces-governors-cup-gold-medalists/", "title": "Virginia Wineries Association announces 2020 Governor’s Cup gold medalists", "authors": ["Riley Wyant", "Published At Pm"], "date": "2020-02-18", "keywords": ["gold", "wines", "2020", "medalists", "cup", "vintage", "judges", "quality", "wine", "governors", "varieties", "announces", "association", "tells", "wineries", "jay", "youmans", "virginia"], "summary": "The esteemed panel of judges was directed by Jay Youmans – one of only 51 Masters of Wine (MW) in the U.S. – who has overseen the competition for nine years.\nCommenting on this year’s entries, Jay Youmans said, “Virginia wines continue to impress, year over year.\nThe overall quality continues to grow, and every vintage tells a fascinating story.\nAnecdotally, in the blended wine category, the judges tasted an impressive number of quality Tannat-driven wines that demonstrate the diversity of varieties that are seeing success in Virginia.”"}, {"url": "https://www.wtvr.com/news/local-news/police-person-shot-killed-in-richmond-convenience-store", "title": "Man killed at Richmond store: 'We’re scared to go outside'", "authors": [], "date": "2020-02-06", "keywords": ["market", "man", "think", "scene", "outside", "dont", "store", "richmond", "killed", "804", "collins", "scared"], "summary": "RICHMOND, Va. -- Police are investigating after a man was killed in a Richmond convenience store on Wednesday night.\nAround 9:15 p.m., police responded to the 804 Market at 1601 Mechanicsville Turnpike for reports of a person shot.\nThe store reopened Thursday morning with crime scene tape from the night before still visible in the roadway.\n\"The children are scared to play outside and we’re scared to go outside.\"\nCollins said she's usually at the 804 Market every day, but now she doesn't think she'll be back for a while."}, {"url": "https://www.wric.com/news/local-news/richmond/child-shot-in-richmonds-hillside-court-police-say/", "title": "3-year-old killed by random gunfire in Richmond’s Hillside Court", "authors": ["Julius Kizzee", "Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-02-01", "keywords": ["family", "court", "gunfire", "8news", "3yearold", "contact", "winfree", "hillside", "willis", "random", "killed", "working", "shooting", "tragedy", "richmonds", "victim", "toddlers"], "summary": "RICHMOND, Va. (WRIC) — Richmond Police told 8News a 3-year-old was a victim of random gunfire in the city’s Hillside Court development late Saturday afternoon.\nPastor Robert Winfree of New Life Deliverance Tabernacle, said he was in close contact with the family as the events unfolded through the afternoon.\nBut, that’s all we can do.”Richmond Redevelopment and Housing Authority CEO Damon E. Duncan released a statement following the toddler’s death.\nOur deepest condolences go out to the family of the young victim.\nOur Director of Public Safety is currently working with local law enforcement to determine the events that led to this tragedy and responsible parties."}, {"url": "https://www.wric.com/news/politics/capitol-connection/decriminalizing-marijuana-has-bipartisan-support-in-virginia/", "title": "Decriminalizing marijuana has bipartisan support in Virginia", "authors": ["Jackie Defusco"], "date": "2020-02-06", "keywords": ["jail", "bipartisan", "support", "house", "dollars", "senate", "bill", "wont", "marijuana", "decriminalizing", "lawmakers", "public", "possession", "virginia"], "summary": "RICHMOND, Va (WRIC) — Many are expecting the General Assembly to decriminalize the possession of marijuana this year but lawmakers are still debating the details.\nAccording to data from the Virginia Criminal Sentencing Commission, more than 15,000 people were convicted for a first or second marijuana possession offense from July 2018 to June 2019.\nOne Senate bill makes marijuana possession a civil penalty with a fine of up to $50 dollars.\nThe Senate bill raises the bar for a more serious distribution charge from a half ounce to an ounce of marijuana.\nThe Senate bill outlines criteria for people to have convictions removed from their record."}, {"url": "https://www.wtvr.com/news/local-news/richmond/brian-robinson-arrested-804-market-murder", "title": "Man arrested for killing father of 3 at Richmond store", "authors": [], "date": "2020-02-08", "keywords": ["market", "man", "think", "insiders", "crime", "scene", "store", "arrested", "killing", "richmond", "robinson", "father", "scared", "leon"], "summary": "RICHMOND, Va. -- A 33-year-old man has been arrested for killing a father of three at a Richmond convenience store earlier this week.\nOnce on scene, police found 27-year-old Leon T. Robinson, of North Avenue, suffering from gunshot injuries.\nCrime Insiders sources said Leon Robinson was in the back of the store where there are some of those slot machine-like skill games.\nThe victim and the suspect had a verbal argument before the shooting, according to Crime Insiders sources.\nThe store reopened Thursday morning with crime scene tape from the night before still visible in the roadway."}, {"url": "https://www.wtvr.com/news/local-news/amy-klobuchar-holding-rally-in-richmond-saturday", "title": "Amy Klobuchar holding rally in Richmond Saturday", "authors": [], "date": "2020-02-27", "keywords": ["amy", "super", "event", "holding", "primary", "rally", "presidential", "open", "richmond", "hold", "klobuchar", "held"], "summary": "RICHMOND, Va. -- Democratic presidential candidate Amy Klobuchar will campaign in Richmond Saturday afternoon, three days ahead of Super Tuesday.\nThe event will be held at the Altria Theater in Richmond.\nAdditionally, the Minnesota Senator will hold a rally in Falls Church, Virginia on Friday morning.\nDoors open at 11:15 a.m.After leaving Richmond Saturday afternoon, Klobuchar will head to Norfolk for a rally.\nVirginia’s Democratic Presidential Primary will be held on Tuesday, March 3 on what’s known as Super Tuesday, when a total of 14 states will hold their primary election."}, {"url": "https://www.wtvr.com/news/local-news/woman-critically-injured-in-richmond-shooting", "title": "Woman critically injured in Richmond shooting", "authors": [], "date": "2020-02-04", "keywords": ["va", "told", "timeanyone", "vehicle", "woman", "richmond", "critically", "shooting", "word", "injured", "victim", "transported"], "summary": "RICHMOND, Va. – A woman was critically injured in a Richmond shooting Tuesday afternoon.\nOfficers responded to a report of random gunfire in the 1900 block of Carver Street at approximately 11:40 a.m.\nWhen officers arrived, they were told that a woman was shot.\nThat victim was transported to a local hospital by a private vehicle with life-threatening injuries.\nThere is no word on a suspect or motive in the shooting at this time."}, {"url": "https://www.nbc12.com/2020/03/19/news-know-march-gov-northam-issues-patron-limit-four-richmond-residents-test-positive-extended-school-closures-additional-meal-sites-students-spring-weather-two-days/", "title": "News to Know for March 19: 10-patron limit in Va.; Four in Richmond test positive; Extended school closures; Additional meal sites; Spring weather for two days", "authors": ["Published At Pm"], "date": "2020-03-19", "keywords": ["limit", "assistance", "seating", "bus", "strollers", "positive", "individuals", "spring", "space", "test", "weather", "meal", "va", "sites", "special", "passengers", "richmond", "sit", "access", "school"], "summary": "Bus passengers are instructed to enter and exit through the rear doors only and sit behind the accessibility-reserved seating area.\nFront-door access will be permitted only for passengers needing the boarding ramp or operator assistance to access the bus.\nADA accessible seating space near the front of the bus is reserved for individuals in mobility devices, individuals in need of special assistance, and families with children in strollers."}, {"url": "https://www.wsls.com/news/local/2020/03/23/watch-gov-northams-march-23-virginia-coronavirus-update/", "title": "WATCH: Gov. Northam’s March 23 Virginia coronavirus update", "authors": ["Jeff Williamson"], "date": "2020-03-23", "keywords": ["establishments", "gov", "23", "announced", "watch", "indoor", "coronavirus", "centers", "update", "public", "northam", "northams", "remain", "virginia"], "summary": "Ralph Northam delivered his daily coronavirus update Monday, announcing that all schools in Virginia will remain closed until end of the academic year.\nEstablishments include:RestaurantsDining establishmentsFood courtsFarmers marketsBreweriesMicrobreweriesDistilleriesWineriesTasting roomsThese changes will remain in statewide for at least 30 days.\nOn Saturday, Northam announced that testing criteria for coronavirus would be altered to give additional priority to medical professionals who have treated coronavirus patients and to those in longterm care facilities.\nThe latest from the health department]During Tuesday’s update, Northam announced a ban in Virginia on gatherings more than 10 people.\n[Interactive map from Johns Hopkins shows how coronavirus is spreading in real-time]"}, {"url": "https://www.wric.com/news/photos-canterbury-rehabilitation-healthcare-center/", "title": "PHOTOS: Coronavirus outbreak at Canterbury Rehabilitation & Healthcare Center", "authors": ["Laura Perrot", "The Associated Press", "Ben Dennis"], "date": "2020-04-13", "keywords": ["vec", "va", "mechanicsville", "center", "virginia", "unemployment", "rehabilitation", "laid", "weeks", "virginians", "miles", "coronavirus", "healthcare", "wric", "canterbury", "outbreak", "photos"], "summary": "MECHANICSVILLE, Va. (WRIC) -- A Mechanicsville man is facing problems getting his unemployment check after he was laid off.\nDavid Miles was laid off from his job as a cabinet maker on March 25.\nLike thousands of other Virginians, Miles filed for unemployment online with the Virginia Employment Commission.\nA couple weeks later, he got a surprising letter in the mail from VEC."}, {"url": "https://www.nbc12.com/2020/03/23/news-know-march-statewide-coronavirus-cases-rise-updated-meal-sites-three-coronavirus-deaths-va-ymca-childcare-services-heavy-rain-with-chilly-temperatures/", "title": "News to Know for March 23: Statewide coronavirus cases rise to 219; Updated meal sites; Three coronavirus deaths in Va.; YMCA childcare services; Heavy rain with chilly temperatures", "authors": ["Published At Pm"], "date": "2020-03-23", "keywords": ["states", "coronavirus", "ymca", "need", "nbc12", "know", "services", "stay", "rain", "va", "statewide", "place", "status", "sites", "united", "temperatures", "rise", "updated", "rapidly", "headlines"], "summary": "Coronavirus has dominated headlines across the United States, and the status within our country and commonwealth is changing rapidly.\nTo make it easier to stay up to date, NBC12 put everything you need to know in one place."}, {"url": "https://www.wtvr.com/news/national-news/coronavirus/covid-19-in-virginia-latest-information-for-monday-march-16", "title": "COVID-19 in Virginia: Latest information for Monday, March 16", "authors": [], "date": "2020-03-16", "keywords": ["county", "restaurants", "information", "virginia", "latest", "16", "urges", "tested", "richmond", "community", "coronavirus", "tests", "covid19"], "summary": "RICHMOND, Va. -- In an effort to provide accurate, easy-to-read information on the on-going COVID-19 outbreak and its impact on our community, we will update this post with the day's local coronavirus headlines and statistics.\nNumber of People Tested in Virginia: 489Number of Positive Tests Among People Tested in Virginia: 51Fairfax County: 10James City County: 10Arlington County: 9Loudon County: 5Virginia Beach: 4Prince William County: 3Chesterfield County: 2Alexandria: 2Spotsylvania County: 1Stafford County: 1Prince Edward County: 1Hanover County: 1Harrisonburg: 1York County: 1Latest COVID-19 headlines:VCU Medical Center announces first confirmed COVID-19 patientVirginia district, circuit courts suspend cases for three weeksVirginia's 2nd coronavirus death reportedChesterfield confirms second COVID-19 caseCatholic Diocese of Richmond suspends public Mass: 'Pray with me for an end to the pandemic'Mayor Stoney urges restaurants, bars to limit on-site service, eliminate bar seatingDoctor: Henrico coronavirus was 'community spread'How you can help hungry Henrico students during virus shutdownHanover parks remain open: 'Use with caution'Member of UVA community tests positive for coronavirusGovernor urges 'every single person' to 'stay home'Richmond area government offices to close Monday over COVID-19Virginia health commissioner on COVID-19: ‘We are looking into hundreds of contacts'COVID-19 'daily deep cleaning' limits services for Petersburg Area TransitRichmond restaurants owners seek clarity, relief for workers amid shutdown"}, {"url": "https://patch.com/virginia/fredericksburg/va-republicans-postpone-richmond-convention-due-coronavirus", "title": "VA Republicans Postpone Richmond Convention Due To Coronavirus", "authors": [], "date": "2020-03-19", "keywords": ["va", "voting", "party", "state", "scheduled", "virginia", "virginias", "vote", "richmond", "warner", "coronavirus", "republicans", "republican", "convention", "postpone"], "summary": "RICHMOND, VA — The Republican Party of Virginia's executive committee voted Wednesday night to postpone its 2020 Quadrennial State Convention due to the coronavirus, or COVID-19.\nThe Republican Party said \"its top priority is the health and well-being of Virginia's citizens.\"\nThe convention had been scheduled for May 1-2 at the Greater Richmond Convention Center.\nThe Republican Party opted not to hold a presidential primary election in Virginia as a way to support President Donald Trump's reelection bid.\n\"We will not let this setback define our 2020 efforts,\" Republican Party of Virginia Chairman Jack Wilson said Wednesday in a statement."}, {"url": "https://www.nbc12.com/2020/03/26/richmond-police-step-up-enforcement-over-covid-orders/", "title": "Richmond Police step up enforcement over COVID-19 orders", "authors": ["Henry Graff", "Published At Pm"], "date": "2020-03-26", "keywords": ["step", "weekend", "setup", "orders", "levar", "mayor", "richmond", "thats", "weather", "stoney", "rogue", "order", "enforcement", "covid19"], "summary": "“There are some people who are still rogue when you come to following some of these guidelines and that’s why with the beautiful weather that’s coming this weekend we are going to setup our enforcement of that executive order,” said Richmond Mayor Levar Stoney."}, {"url": "https://www.nbc12.com/2020/03/18/four-richmond-residents-test-positive-coronavirus/", "title": "Four Richmond residents test positive for coronavirus", "authors": ["Adrianna Hargrove", "Karina Bolster", "Published At Pm"], "date": "2020-03-18", "keywords": ["symptomatic", "expect", "positive", "point", "ways", "spread", "potential", "richmond", "test", "coronavirus", "residents", "work", "identify", "yield"], "summary": "\"To some degree, this is what we expect the work of the health department to yield,” he added.\n“When we identify a case and we go and interview potential contacts and test anyone who is symptomatic we expect to find a spread to other people.\nIn some ways, this is what the point of contact investigations is, to identify those other cases.\""}, {"url": "https://www.wsls.com/news/virginia/2020/03/24/38-new-coronavirus-cases-in-virginia-now-297-total-cases/", "title": "45 new coronavirus cases in Virginia, now 304 total cases", "authors": ["Jeff Williamson"], "date": "2020-03-24", "keywords": ["countythree", "county", "case", "45", "cases", "countyone", "304", "reported", "health", "coronavirus", "department", "total", "virginia"], "summary": "RICHMOND, Va. – There are now 304 “presumptively positive” cases of the coronavirus in Virginia as of March 24.\n[Where are Virginia’s coronavirus cases?\nThe latest from the health department]Tuesday’s 304 cases mark and increase from 259 on Monday, 222 on Sunday, 158 on Saturday, 124 on Friday, 101 cases on Thursday and 67 on Wednesday.\n[Interactive map from Johns Hopkins shows how coronavirus is spreading in real-time]These cases are “presumptively positive,” meaning they are pending confirmatory testing by the Centers for Disease Control and Prevention (CDC).\nThe Virginia Department of Health defines Southwest Virginia to include the following counties and cities:"}, {"url": "https://www.nbc12.com/2020/03/27/news-know-march-us-has-most-coronavirus-cases-world-fourth-resident-canterbury-rehab-dies-vcu-dorms-non-covid-patients-rps-laptops-students-partly-sunny/", "title": "News to Know for March 27: U.S has most coronavirus cases in world; Fourth resident at Canterbury Rehab dies; VCU dorms for non-COVID-19 patients; RPS laptops for students; Partly sunny", "authors": ["Published At Pm"], "date": "2020-03-27", "keywords": ["worlds", "sunny", "resident", "vcu", "rps", "noncovid19", "partly", "passed", "students", "infections", "testing", "world", "half", "rehab", "increases", "cases", "italy", "virus", "patients", "number"], "summary": "Increases in the number of cases have been expected as testing becomes more available.\nThe U.S. passed China with more than 85,000 cases, and Italy also exceeded 80,000, the three countries together accounting for almost half of the world's infections from the new virus."}, {"url": "https://www.nbc12.com/2020/03/29/almost-covid-cases-virginia-with-deaths/", "title": "Almost 900 COVID-19 cases in Virginia with 22 deaths", "authors": ["Published At Am"], "date": "2020-03-29", "keywords": ["volunteered", "cases", "volunteers", "state", "virginia", "22", "deaths", "900", "medical", "using", "students", "northam", "reserve", "reworking", "covid19"], "summary": "Northam says there is a need for additional medical personnel and volunteers.\nNortham also said the state is reworking licensing procedures, considering using medical students and the Virginia Medical Reserve Corps , which has more than 8,000 deployable volunteers and 1,500 people have volunteered in the past month."}, {"url": "https://www.localdvm.com/health/coronavirus/va-northam-holds-briefing-on-march-23/", "title": "Va. Governor closes schools through the current academic year, adds restrictions", "authors": ["Fareeha Rehman", "The Associated Press", "Erin Noon", "Douglas Fritz"], "date": "2020-03-23", "keywords": ["closes", "va", "academic", "adds", "virginias", "yeareffective", "restrictions", "serve", "governor", "current", "school", "northam", "stay", "wdvm", "schools", "virginia"], "summary": "RICHMOND, Va. (WDVM) — Virginia Governor Ralph Northam said Virginia’s K-12 schools will stay closed until the end of the academic school year.\nEffective at midnight on March 25, 2020, Northam said there will be additional restrictions on establishments that serve the public."}, {"url": "https://www.nbc12.com/2020/04/15/live-gov-northam-gives-update-virginia-reports-large-daily-jump-coronavirus-deaths/", "title": "Gov. Northam extends executive order closing non-essential businesses for another two weeks", "authors": ["Published At Am"], "date": "2020-04-15", "keywords": ["ralph", "officials", "businesses", "extends", "gov", "plan", "weeks", "virginias", "peak", "executive", "shape", "nonessential", "using", "university", "order", "northam", "virginia", "closing"], "summary": "On Monday, Governor Ralph Northam said Virginia’s peak will happen at the end of this month or in early May.\nAnd officials are now using a new model from the University of Virginia to help shape the plan to get back to normal."}, {"url": "https://www.wtvr.com/news/coronavirus/richmond-restaurants-united-makes-plea-we-need-your-help", "title": "Richmond Restaurants United makes plea: 'We need your help'", "authors": [], "date": "2020-03-20", "keywords": ["restaurants", "support", "makes", "united", "restaurant", "local", "businesses", "longovenwe", "right", "plea", "help", "richmond", "public", "need"], "summary": "RICHMOND, Va. -- In the wake of the COVID-19 outbreak, a collection of Richmond restaurant owners and workers has come together to form Richmond Restaurants United.\nThe mayor's office, working with some of the restaurants now involved in Richmond Restaurants United, also announced plans to explore \"options for a program to issue small, no-interest loans to support small businesses.\"\nEmily Opicka - LongovenWe need a little bit of time to coast and right now that means that we need actions that are done that are clear and concise and immediate.\nAlexia - LongovenWe need your help.\nDonita Del Rosario - LongovenWe need your help."}, {"url": "https://www.nbc12.com/2020/04/15/coronavirus-deaths-surpass-virginia-here-are-latest-numbers-state/", "title": "Coronavirus deaths surpass 200 in Virginia | Here are the latest numbers from the state", "authors": ["Published At Am"], "date": "2020-04-15", "keywords": ["secretary", "system", "state", "health", "latest", "deaths", "200", "discharge", "taking", "coronavirus", "sure", "numbers", "sickest", "surge", "care", "virginia", "surpass"], "summary": "“Our surge plan is that to make sure we have a place that when a health system is taking care of a patient, they are almost ready for discharge or towards the end of discharge we can get them out of that facility as they take care of the sickest patients,” said Dr. Daniel Carey, Virginia Secretary of Health and Human Resources."}, {"url": "https://www.wtvr.com/eat-it-virginia/mayor-hopes-to-go-cocktails-can-help-richmond-restaurants", "title": "Mayor hopes 'to-go' cocktails can help Richmond restaurants", "authors": [], "date": "2020-03-27", "keywords": ["restaurants", "beer", "money", "togo", "mayor", "help", "richmond", "wine", "sell", "food", "cocktails", "hopes", "gregory", "maybe"], "summary": "RICHMOND, Va. -- Richmond Mayor Levar Stoney has asked Virginia Governor Ralph Northam to ease state alcohol restrictions and allow restaurants to sell mixed drinks either to-go or through delivery.\nRecently, state alcohol rules were eased to allow restaurants to sell to-go wine and beer as a way to help make ends meet during the COVID-19 crisis.\nAnd maybe, maybe we can pay our rent and bills and credit card bills and stuff like that,\" Gregory said.\nWhen ordering to-go food, Gregory implored fans of Richmond restaurants to get wine or beer too.\nRestaurants around the country are losing money after dining rooms were shutdown to help prevent the spread of the virus."}, {"url": "https://rvahub.com/2020/03/18/richmond-public-school-update-3-17-20/", "title": "Richmond Public School Update 3/17/20", "authors": ["Richard Hayes", "Trevor Dickerson", "Rvahub Staff", "Rocket Werks"], "date": "2020-03-18", "keywords": ["email", "public", "31720", "know", "richmond", "rps", "food", "students", "sure", "update", "school", "ill", "need", "thank"], "summary": "Food Distribution – Again, thank you so much to RPS staff, families, and volunteers for making our food sites possible!\nOn behalf of RPS, THANK YOU!\nOnce I know for sure, I’ll let everyone know.\nOnce I know for sure, I’ll let everyone know.\nWill students need to take SOLs this year?"}, {"url": "https://www.wtvr.com/news/local-news/explore-virginias-museums-zoos-and-historical-sites-through-these-virtual-experiences", "title": "Explore Virginia's museums, zoos, and historical sites through these virtual experiences", "authors": [], "date": "2020-03-21", "keywords": ["tours", "sites", "museum", "zoos", "experiences", "virginia", "learning", "virginias", "explore", "video", "museums", "online", "website", "virtual", "zoo", "youtube", "historical"], "summary": "RICHMOND, Va. -- As Virginians adjusts to social-distancing measures and businesses and institutions close their doors, online learning experiences are growing in importance.\nThe Virginia Museum of Fine ArtsIn Richmond, the VMFA’s collection of online tours is accessible 365 days a year.\nThe museum if also offering free online video content, webinars, student learning resources, and virtual tours at VirginiaHistory.org/AtHome .\nVirginia ZooThe Virginia Zoo in Norfolk is holding Virtual Voyages every day at 2 p.m. (March 16 - 30, 2020) on its Facebook page .\nThe zoo's Virtual Voyage website also offers augmented reality tours, printable activity sheets, a YouTube video series, and more."}, {"url": "http://richmondfreepress.com/news/2020/mar/26/starting-pastor-midst-pandemic/", "title": "Starting as a pastor in the midst of a pandemic", "authors": [], "date": "2020-03-26", "keywords": ["pandemic", "pastor", "set", "churchs", "mitchell", "starting", "worked", "past", "ministry", "church", "midst", "facebook", "dr"], "summary": "“I never imagined I would start my ministry in the midst of a pandemic,” Dr. Joshua L. Mitchell said.\nMostly recently the minister to youth and college students at a mega-church in Houston, Dr. Mitchell is scheduled to formally take the pulpit on Easter Sunday, April 12.\nDr. Mitchell is a prime example of how ministers and their congregations are seeking to adjust to the emergency conditions caused by the COVID-19 pandemic.\n“Every crisis calls forth our creativity,” said Dr. Mitchell, who is the son of the Rev.\nMarlow L. Mitchell, pastor of Rising Sun Baptist Church in Washington."}, {"url": "https://www.wtvr.com/news/coronavirus/covid-19-in-virginia-live-updates-for-monday-march-30", "title": "COVID-19 in Virginia: LIVE updates for Monday, March 30", "authors": ["Jessica Peres", "Scripps National Contributor", "The Associated Press", "Wayne Covil", "Scripps National", "Kai Beech", "Bo Evans", "Lindsey Boetsch", "Justin Boggs", "Alicia Nieves"], "date": "2020-03-30", "keywords": ["30", "positive", "cases", "virginia", "updates", "health", "city", "richmond", "live", "department", "northam", "order", "covid19"], "summary": "So your local health department may have issued an alert about a case before it is added to the statewide tally released the following day.\nVirginia Governor Ralph Northam issued a stay-at-home order Monday in an effort to slow the spread of COVID-19.\nSouthside Virginia health department reports 15 COVID-19 cases, 1 deathFifteen people have tested positive for COVID-19 as of Sunday in southside Virginia communities, according to officials with the Virginia Department of Health's (VDH) Crater Health District.\nVirginia reports 890 COVID-19 cases, 110-plus hospitalizations and 22 deathsThe Virginia Department of Health released updated numbers Sunday a.m.Six localities are reporting their first cases of COVID-19, according to new data.\nSouthside Virginia health department reports first COVID-19-related deathA southside Virginia resident has died from complications linked to COVID-19, according to health department officials."}, {"url": "https://www.nbc12.com/2020/03/19/latest-virginia-news-sports-business-entertainment-am-edt/", "title": "Latest Virginia news, sports, business and entertainment at 5:20 p.m. EDT", "authors": ["Published April", "At Am", "At Pm"], "date": "2020-03-19", "keywords": ["beginning", "youre", "business", "winter", "wildlife", "520", "bears", "lynchburg", "va", "state", "latest", "entertainment", "edt", "wake", "virginia"], "summary": "LYNCHBURG, Va. (AP) — The state of Virginia has been alerting residents to the fact that bears are beginning to wake up from their winter slumber and will soon be in search of food.\nThat means they could likely be in people's backyards.\nThe News & Advance in Lynchburg reports that black bears are most active in Virginia from the beginning of April until the beginning of November.\nDan Lovelace, a wildlife biologist with the Virginia Department of Game and Inland Fisheries, said recently that there are 17,000 bears across the state.\nHe said that if you’re anywhere in Virginia, “you can say you’re pretty much in bear country.”"}, {"url": "https://www.nbc12.com/2020/03/20/richmond-plant-closes-amid-coronavirus-other-workers-wait-see-if-their-employers-will-too/", "title": "Richmond plant closes amid coronavirus, other workers wait to see if their employers will too", "authors": ["Brent Solomon", "Published At Pm"], "date": "2020-03-20", "keywords": ["quarters", "closes", "works", "workits", "workers", "amid", "employers", "woman", "richmond", "working", "coronavirus", "thats", "wait", "plant", "shouldnt", "making", "work", "virginia"], "summary": "\"We’re working in close quarters still with over 100 people on the same floor and we’re still working side by side,” said a woman who asked not to be identified.\nShe works at a Central Virginia call center.\n\"It could be anywhere from 30 to 40 people in just one area in one section of the floor…If you can give us a few days to go home while you figure out, that’s better than making us come to work…It’s not that we don’t want to work.\nWe just know we shouldn’t be together,” the employee added."}, {"url": "https://www.wtvr.com/news/coronavirus/richmond-couple-says-they-tested-positive-for-coronavirus-take-it-seriously", "title": "Richmond couple tests positive for coronavirus: 'Take it seriously'", "authors": [], "date": "2020-03-18", "keywords": ["positive", "cases", "symptoms", "seriously", "health", "tested", "richmond", "couple", "tests", "coronavirus", "papa", "covid19"], "summary": "RICHMOND, Va. -- A Richmond couple posted their positive coronavirus diagnosis on social media to warn others about the pandemic.\nThe couple, who are in their 30s, are among the first in Richmond to receive the positive diagnosis.\nAn employee on a different floor in the high-rise where he worked recently tested positive for the coronavirus.\n“Tip your delivery drivers even not during a pandemic.”Mayor Levar Stoney and Public Health Director Dr. Danny Avula announced four positive coronavirus cases during a Wednesday morning press conference.\nCOVID-19 in VirginiaVirginia Health Commissioner Dr. Norman Oliver said there are 77 cases COVID-19 cases in the Commonwealth as of 11 a.m. Wednesday."}, {"url": "https://www.wavy.com/news/local-news/richmond/abc-sales-continue-to-climb-as-the-stay-at-home-order-remains-in-effect/", "title": "ABC sales continue to climb as the stay at home order remains in effect", "authors": ["Nicole Brailer", "Jackie Defusco", "Kerri O'Brien"], "date": "2020-04-16", "keywords": ["climb", "sales", "effect", "2020", "totaled", "continue", "abc", "22", "compared", "million", "remains", "fy19", "order", "spirit", "stay", "increase"], "summary": "RICHMOND, Va. (WAVY) — According to officials, since this time last year, ABC spirit sales have increased by nearly 59% or approximately $11.1 million with the main difference being the coronavirus.\nSunday, March 22, 2020, to Saturday, March 28, 2020, compared to FY’19: sales totaled $21.5 million which is an increase of 11.6%.\nSunday, April 5, 2020, to Saturday, April 11, 2020, compared to FY’19: sales totaled just over $22 million which is an increase of 17%.\nTotal sales for March 2020: $107,075,293Total sales for March 2019: $88,245,494The total sales for March show more than a 21% increase overall.\nRestaurants typically make up between 17% and 18% of spirit sales in Virginia."}, {"url": "https://www.wtvr.com/news/local-news/central-virginia-schools-extend-school-closures-through-mid-april", "title": "Central Virginia schools extend school closures through mid-April", "authors": [], "date": "2020-03-18", "keywords": ["closures", "county", "public", "midapril", "weeks", "closed", "richmond", "extend", "central", "extending", "school", "schools", "virginia", "districts"], "summary": "RICHMOND, Va. -- School Districts throughout Central Virginia are extending their closures as the Coronavirus pandemic continues to affect the region.\nSchool districts throughout the region announced Wednesday that schools will continue to be closed through mid-April.\nBut as Virginia's Coronavirus case numbers continue to rise and social-distancing measures increase, many school districts are extending their closures.\nRichmond: Richmond Public Schools will tentatively reopen on April 13.\nHenrico: Henrico County Public Schools will extend the closure of its school facilities through Spring Break."}, {"url": "https://www.wtvr.com/news/local-news/st-paul-street-deadly-double-shooting", "title": "1 killed, 1 injured in shooting near near Northside store", "authors": [], "date": "2020-03-29", "keywords": ["word", "hall", "crime", "information", "stoppers", "store", "officers", "additional", "richmond", "killed", "shooting", "www7801000com", "injured", "northside", "near"], "summary": "RICHMOND, Va. -- Police are investigating a double shooting on Richmond's Nortside that left one man dead and another hospitalized Sunday.\n\"Major Crimes Detectives are attempting to gather additional information that may assist with this investigation.\"\nAnyone with information is urged to call Crime Stoppers at 804-780-1000, or they may visit www.7801000.com.\nThe P3 Tips Crime Stoppers app for smartphones may also be used.\nAll Crime Stoppers methods are anonymous."}, {"url": "https://www.wtvr.com/news/local-news/richmond-public-schools-works-to-distribute-laptops-to-17-000-students-without-internet", "title": "Richmond works to distribute laptops to 17,000 students without internet", "authors": [], "date": "2020-03-27", "keywords": ["works", "school", "distribute", "teaching", "kids", "internet", "17000", "schools", "richmond", "working", "try", "students", "public", "gresham", "laptops"], "summary": "RICHMOND, Va. -- As COVID-19 closes schools until the end of the year, Richmond Public Schools is working to get laptops and hot-spots distributed to 17,000 children without internet access.\nMary Gresham has been teaching in Richmond for the last 16 years.\nGovernor Northam announced this week that all public schools in Virginia would be closed for the rest of the school year.\nAccording to the U.S. Census Bureau, more than 17,000 kids under 18 in the Richmond area are without computers and internet access.\nRichmond Public Schools Superintendent Jason Kamras said they’re working to lower those numbers and has ordered around 10,000 laptops for students to use while out of school."}, {"url": "https://www.wtvr.com/news/coronavirus/virginia-governor-northam-to-make-major-announcement-at-2-p-m-presser", "title": "Virginia Governor Northam issues stay-at-home order", "authors": [], "date": "2020-03-30", "keywords": ["issues", "unless", "stayathome", "virginians", "medical", "virus", "governor", "order", "northam", "stay", "essential", "virginia"], "summary": "RICHMOND, Va. -- Virginia Governor Ralph Northam issued a stay-at-home order Monday.\n\"Please stay home as much as possible,\" Governor Northam urged Virginians.\nWe know this virus spreads primarily through human-to-human contact, and that’s why it’s so important that people follow this order and practice social distancing,\" Governor Northam said.\nLast week, Northam explained why he had not yet issued a stay-at-home order.\nNortham then responded directly about why he has not issued a stay-at-home order like some other governors."}, {"url": "https://richmondbizsense.com/2020/03/20/implosion-date-set-for-dominion-energy-tower-downtown/", "title": "Implosion date set for Dominion Energy tower downtown", "authors": ["Michael Schwartz", "David Humphrey", "Jim Nalgrin", "Matt Faris"], "date": "2020-03-20", "keywords": ["downtown", "canal", "date", "energy", "second", "set", "tower", "frazier", "600", "place", "company", "dominion", "thats", "implosion"], "summary": "Razing the 21-story, 1970s-era building is made possible by the completion last year of 600 Canal Place, the company’s glassy 20-story, 1-million-square-foot tower at 600 E. Canal St.\nFrazier did not name the company that’s handling the implosion.\nThe company previously announced and filed plans with the city for a second tower, dubbed 700 Canal Place, with a design that would mirror 600 Canal, albeit slightly shorter.\nPlans show Hourigan and Clayco as the general contractors for the second tower.\nBut for now, while onlookers wonder whether social distancing might prevent implosion watch parties come May, Frazier said Dominion still is evaluating a potential second tower."}, {"url": "https://www.wtvr.com/news/coronavirus/richmond-police-officer-tests-positive-for-virus", "title": "Richmond Police officer tests positive for virus", "authors": [], "date": "2020-03-23", "keywords": ["positive", "officer", "city", "spread", "richmond", "tests", "virus", "community", "rpd", "residents", "potential", "close", "rchd"], "summary": "RICHMOND, Va. -- A Richmond Police officer is recovering at home after she tested positive for COVID-19, according to a city spokesperson.\nThe officer, who is in her 40s, traveled to New York before getting sick.\n\"Preliminary investigation by Richmond City Health District (RCHD) and Richmond Police Department (RPD) has not determined any potential for close contact with Richmond residents during this time period.\n\"Another co-worker who had been in close contact with the officer is under self-quarantine and is self-monitoring for symptoms.\"\n“My first concern is for her and her family and the extended family of her co-workers,” Richmond Police Chief William Smith said."}, {"url": "https://www.wtvr.com/news/local-news/greenleafs-pool-room-closes-in-downtown-richmond", "title": "Greenleaf’s Pool Room closes in downtown Richmond", "authors": [], "date": "2020-03-20", "keywords": ["downtown", "closes", "business", "wouldve", "winter", "va", "sixth", "st", "pool", "soured", "richmond", "wife", "room", "greenleafs"], "summary": "RICHMOND, Va. -- Another downtown business has closed for good after a deal that would’ve put it under new ownership got soured by the COVID-19 pandemic.\nGreenleaf’s Pool Room at 100 N. Sixth St. on the ground floor of the Hotel John Marshall building has shut down and will not reopen.\nJim Gottier, who opened the pool hall in 2014 with his wife Andrea Ball, said the business has been losing money for three years.\nThat prompted him to consider closing earlier this winter, before an offer came in.\nClick here to keep reading on Richmond BizSense."}, {"url": "https://www.wtvr.com/news/local-news/richmond-public-schools-implements-food-delivery-program", "title": "Richmond Public Schools implements food-delivery sites", "authors": [], "date": "2020-03-17", "keywords": ["fooddelivery", "va", "elementary", "sites", "families", "st", "ave", "rd", "implements", "middle", "richmond", "public", "schools", "dr"], "summary": "RICHMONDA, Va. -- Richmond Public Schools has launched food-delivery sites in neighborhoods throughout the district to help feed students and families during school closures.\nIn addition to school-based distribution sites, RPS has established multiple mobile sites for families to pick up food in the wake of school closures.\nThe following food-delivery sites will operate Monday through Friday from 9:30 a.m. to 11 a.m. beginning March 18.\nArmstrong High School2300 Cool Ln, Richmond, VA 23223Binford Middle School1701 Floyd Ave, Richmond, VA 23220Blackwell Elementary School300 East 15th Street, Richmond, VA 23224Boushall Middle School3400 Hopkins Rd, Richmond, VA 23234Broad Rock Elementary School4615 Ferguson Ln, Richmond, VA 23234Chimborazo Elementary School3000 E Marshall St, Richmond, VA 232233000 E Marshall St, Richmond, VA 23223Fisher Elementary SchoolFisher Elementary School3701 Garden Rd, Richmond, VA 23235Francis Elementary SchoolFrancis Elementary School5146 Snead Rd, Richmond, VA 23224George Mason Elementary SchoolGeorge Mason Elementary School813 N 28th St, Richmond, VA 23223Ginter Park Elementary School3817 Chamberlayne Ave, Richmond, VA 232273817 Chamberlayne Ave, Richmond, VA 232271745 Catalina Dr, Richmond, VA 232241745 Catalina Dr, Richmond, VA 23224Greene Elementary School1745 Catalina Dr, Richmond, VA 232241745 Catalina Dr, Richmond, VA 23224G.W.\nCarver Elementary School *New site open 3/18/20*1110 W Leigh St, Richmond, VA 232201110 W Leigh St, Richmond, VA 23220Huguenot High School7945 Forest Hill Ave, Richmond, VA 232257945 Forest Hill Ave, Richmond, VA 23225Lucille Brown Middle School6300 Jahnke Rd, Richmond, VA 232256300 Jahnke Rd, Richmond, VA 23225Miles Jones Elementary School200 Beaufont Hills Dr, Richmond, VA 23225MLK Middle School1000 Mosby St, Richmond, VA 232231000 Mosby St, Richmond, VA 23223Oak Grove-Bellemeade Elementary School2409 Webber Ave, Richmond, VA 23224Reid Elementary School1301 Whitehead Rd, Richmond, VA 232251301 Whitehead Rd, Richmond, VA 23225Summer Hill Preschool2717 Alexander Ave, Richmond, VA 232342717 Alexander Ave, Richmond, VA 23234Wythe High School4314 Crutchfield St, Richmond, VA 232254314 Crutchfield St, Richmond, VA 23225"}, {"url": "https://www.wtvr.com/news/local-news/richmond-public-school-to-expand-meal-distribution-program", "title": "Richmond Public School to expand meal distribution program", "authors": [], "date": "2020-03-20", "keywords": ["distribution", "public", "sites", "volunteers", "expand", "hs", "es", "program", "richmond", "food", "meal", "end", "wythe", "school", "ms", "schools"], "summary": "RICHMOND, Va. -- Richmond Public Schools is expanding its meal-delivery program by using buses to bring food to 34 locations around the city.\nOn Monday RPS opened food distribution sites at 20 schools throughout the county.\nAnd on Wednesday, the school district began delivering meals directly into neighborhoods to increase access to food for families without transportation.\nOn March 23, the program will expand to 34 new locations.\nAdditionally, the 10 least utilized school distribution sites will be closed so that the food can be distributed to more active sites."}, {"url": "https://nmstatesports.com/news/2020/4/14/football-aggies-ink-five-more-signees-for-2020.aspx", "title": "Aggies Ink Five More Signees for 2020", "authors": [], "date": "2020-04-14", "keywords": ["aggies", "ink", "2020", "defensive", "offensive", "state", "signees", "hs", "nm", "community", "wide", "holmes", "played", "calif"], "summary": "NEW SIGNEESPREVIOUS SIGNEES++ NM State ++– Five more student-athletes, including two transfers from FBS schools, have made their commitments to play football at NM State.Defensive backs Olan Cazad Jr. and D.J.\nMcCullough, defensive tackle Darvis Holmes, offensive lineman Gabriel Preciado and tight end Anthony Roberson signed with the Aggies on Wednesday, strengthening the program's 2020 signing class.\n\"Holmes and Roberson each come to NM State from FBS programs.\nThe Imperial Beach, Calif., native spent the 2019 campaign at Southwestern CC in Chula Vista, Calif.Wednesday's additions raise NM State's group of signees to 22.\n| Coffeyville Community College6-0 | 180 | Wide ReceiverTwentynine Palms, Calif. | Saddleback College6-1 | 170 | SafetyPompano Beach, Fla. | Independence Community College6-0 | 200 | Wide ReceiverTruckee, Calif. | Truckee HS | Saddleback College6-1 | 190 | CornerbackLiberty, Mo."}, {"url": "https://www.nbc12.com/2020/03/27/central-virginia-unites-give-back-first-responders-working-during-pandemic/", "title": "Central Virginia unites to give back to first responders working during pandemic", "authors": ["Brent Solomon", "Published At Pm"], "date": "2020-03-27", "keywords": ["johnson", "pandemic", "going", "packages", "frontline", "nurses", "starting", "unites", "surprise", "working", "central", "mid", "doing", "work", "virginia", "responders"], "summary": "\"Starting on Wednesday, we’re going to be doing mid -eek blessings where we're going to be doing care packages for your frontline and these are your nurses and doctors that work in the ERs where we’re going to drop off surprise packages for them and blessing them for all the work they are doing,\" Johnson said."}, {"url": "https://www.wtvr.com/news/coronavirus/quirk-hotel-temporarily-closes-in-richmond", "title": "Quirk Hotel temporarily closes in Richmond", "authors": [], "date": "2020-03-20", "keywords": ["hotel", "closes", "posted", "colleagues", "west", "health", "help", "richmond", "wellbeing", "quirk", "stay", "temporarily"], "summary": "RICHMOND, Va. -- Quirk Hotel in Richmond has closed its doors as people are being urged to stay indoors and away from others in an effort to slow the spread of COVID-19.\n\"As of today, we have made the difficult decision to temporarily suspend the Quirk Hotels services, restaurants, bars and galleries,\" the hotel posted on social media.\n\"Our hearts are with our beloved Quirk Family who are impacted, and to all of those in the hospitality and service industries experiencing the same.\nWe are dedicated to doing what we can to help our colleagues during this time.\"\nQuirk Hotel opened on West Broad Street in 2015."}, {"url": "https://richmondbizsense.com/2020/03/30/the-agenda-local-government-briefs-for-3-30-20/", "title": "The Agenda: Local government briefs for 3.30.20", "authors": ["Jonathan Spiers"], "date": "2020-03-30", "keywords": ["county", "restaurants", "local", "station", "agenda", "taxes", "businesses", "aug", "henrico", "33020", "interest", "public", "covid19", "briefs"], "summary": "An ordinance designed to support Henrico businesses offers temporary relief from penalties and interest on several taxes.\nAnother ordinance offers residents temporary relief from penalties and interest on late payments of 2020 personal property taxes, machinery and tools taxes and real estate taxes.\nLate payments of taxes due between June 5 and Aug. 5 will not be charged penalties or interest, if the taxes are paid by Aug. 5.\nThe ordinance also extends the due date for the county vehicle license tax from June 5 to Aug. 5.\nHanover taps Goochland’s Budesky as next county administratorGoochland County Administrator John Budesky has been selected as Hanover’s next county administrator."}, {"url": "https://www.wavy.com/10-on-your-side/looking-for-work-companies-hiring-during-coronavirus-crisis/", "title": "Looking for work? Companies hiring during coronavirus crisis", "authors": ["Kaley Lynch", "Sarah Fearing"], "date": "2020-03-24", "keywords": ["packages", "companies", "wavy", "wavycom", "roads", "file", "coronavirus", "hiring", "crisis", "amazon", "warehouse", "work", "zip", "looking"], "summary": "(AP Photo/Ross D. Franklin, File)HAMPTON ROADS, Va. (WAVY) — Coronavirus has closed non-essential businesses, putting many Hampton Roads residents out of work during the pandemic.\nStill, some companies — national and local — are hiring.\nCompanies that are hiring:This list will be updated as job postings become available.\nCheck back at WAVY.com for more information.\nLatest Posts"}, {"url": "https://www.wtvr.com/news/coronavirus/gov-northam-expected-to-make-virginia-school-announcement-at-2-p-m-press-conference", "title": "Gov. Northam closes Virginia schools for the rest of the school year", "authors": [], "date": "2020-03-23", "keywords": ["closes", "businesses", "rest", "gov", "remain", "open", "providers", "end", "governor", "school", "northam", "essential", "schools", "virginia"], "summary": "\"Today I'm directing all schools in Virginia to remain closed at least through the end of this academic year,\" the governor announced.\nGovernor Northam called on communities, private daycare providers, community daycare providers, and schools to rally together to provide childcare to children whose parents have to go to work.\n\"I want to be clear, essential businesses will remain open,\" he said.\n\"I also want to be clear about the expectations for essential businesses that remain open,\" he said.\nSo essential businesses that remain open have a responsibility to adhere to social distancing recommendations."}, {"url": "http://m.richmondfreepress.com/news/2020/mar/19/richmond-schools-closed-until-april-13/", "title": "Richmond schools closed until April 13", "authors": [], "date": "2020-03-19", "keywords": ["court", "13", "st", "spring", "closed", "office", "richmond", "management", "food", "school", "schools"], "summary": "Richmond Public Schools will be closed for an additional two weeks through spring break, reopening Monday, April 13, because of the coronavirus pandemic.\nSuperintendent Jason Kamras made the announcement at the Richmond School Board meeting Monday night, noting, “This is an unprecedented time as we navigate the current situation.”The schools will be closed for students and staff.\nStudents were given learning activities packets when schools closed on Friday, March 13.\nRalph S. Northam ordered all Virginia public schools closed for two weeks beginning Monday, March 16, in an effort to contain the spread of the virus.\nUnder Mr. Kamras’ directive, schools will be closed for the next four weeks through the spring holiday."}, {"url": "https://townline.org/obituaries-for-thursday-march-19-2020/", "title": "OBITUARIES for Thursday, March 19, 2020", "authors": ["Website Editor"], "date": "2020-03-18", "keywords": ["maine", "family", "loved", "2020", "waterville", "passed", "wife", "obituaries", "husband", "son", "school", "19"], "summary": "SHARON E. DuBOISSIDNEY – Sharon E. DuBois, 80, passed away Tuesday, March 3, 2020, at her home, in Sidney.\nJAMES M. SHEAVASSALBORO – James “Jim” Maynard Shea, 76, passed on Saturday, February 15, 2020, in Zephyrhills, Florida.\nKATHLEEN M. KEEFERSOUTH CHINA – Kathleen M. Keefer, 57, of South China, passed away unexpectedly on Monday, March 2, 2020, at home.\nPATRICIA A. NASIEWINDSOR – Patricia Ann Nasie, 81, passed away at her home on Monday, March 2, 2020, following a brief illness.\nFamily and Friends may visit from 10 – 11 a.m., on March 20, 2020, at Gallant Funeral Home 10 Elm St., Waterville."}, {"url": "https://www.wric.com/news/local-news/richmond/vmfa-employee-tests-positive-for-covid-19/", "title": "VMFA employee tests positive for COVID-19", "authors": ["Alonzo Small", "Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2020-03-27", "keywords": ["vmfa", "employee", "positive", "2020", "virginia", "closed", "tests", "test", "vmfas", "public", "employees", "covid19"], "summary": "RICHMOND, Va. (WRIC) — The Virginia Museum of Fine Arts confirmed one of its employees tested positive for COVID-19.\nThe employee was asymptomatic and began showing symptoms on Saturday, March 14, the day after VMFA closed to the public.\nJan Hatchette, VMFA’s deputy director for communications, said in a statement “the employee sought medical attention and testing, and once positive test results were returned, on Wednesday, March 25, the employee notified their supervisor.\nVMFA immediately notified employees who work with the affected employee of the positive COVID-19 test result.”Employees in contact with the affected employee were asked to adhere to a 14-day isolation period.\nIn addition, VMFA’s public classes, programs, events, performances, and tours through April 30, 2020, have been canceled."}, {"url": "https://wtvr.com/2019/12/17/lauryn-hill-coming-to-richmond-in-march-2020/", "title": "Lauryn Hill coming to Richmond in March 2020", "authors": [], "date": "2019-12-17", "keywords": ["concert", "2020", "lauryn", "energy", "tour", "miseducation", "center", "coming", "hill", "richmond", "dominion"], "summary": "RICHMOND, Va. — Grammy-winning singer Lauryn Hill is returning to Richmond in March 2020 for a concert at the Dominion Energy Center.\nHill rose to prominence in the 1990s as a member of The Fugees.\nHill’s debut solo album The Miseducation of Lauryn Hill, released August 25, 1998, won a record breaking five Grammys Awards.\nHill’s tour stop in Richmond comes after her “The Miseducation of Lauryn Hill 20th Anniversary Tour” in 2018 and 2019.\nThe show will be held at Dominion Energy Center on Tuesday, March 3, 2020 at 8 p.m.Tickets for the concert go on sale Friday December 20 at 10 a.m.Tickets, beginning at $49.50, will be available at the Dominion Energy Center and Altria Theater box offices, DominionEnergyCenter.com, Etix.com and by phone charge at 800‐514‐ETIX (3849)."}, {"url": "https://www.sunjournal.com/2020/03/20/grocery-stores-set-up-senior-shopping-hours-amid-coronavirus-fears/", "title": "Grocery stores set aside shopping hours for seniors amid coronavirus fears", "authors": ["Email Writer"], "date": "2020-03-20", "keywords": ["stores", "aside", "set", "hour", "hours", "amid", "open", "shoppers", "store", "shopping", "coronavirus", "senior", "shop", "grocery", "reserve", "fears", "seniors"], "summary": "Maine Grocers Walmart announces it will have an hour-long senior shopping event every Tuesday.\nit will have an hour-long senior shopping event every Tuesday.\nDollar General is reserving the first hour of shopping every day for seniors at its more than 16,000 stores.\nTarget has set aside an hour every Wednesday morning for vulnerable shoppers, including the elderly and those with underlying medical conditions.\nWalmart said it will host an hourlong “senior shopping event” every Tuesday for customers 60 and older, one hour before stores open to the general public."}, {"url": "https://www.wtvr.com/news/national-news/coronavirus/coronavirus-cancels-virginia-events", "title": "Coronavirus cancels Virginia events", "authors": [], "date": "2020-03-10", "keywords": ["museum", "state", "postponed", "events", "scheduled", "festival", "conference", "veterans", "richmond", "coronavirus", "cancels", "university", "virginia"], "summary": "RICHMOND, Va. -- As the number of confirmed coronavirus cases increases in Virginia, several events scheduled to take place in the coming days and weeks have been canceled.\nThe 45th Annual Greek Festival atSaints Constantine & Helen Greek Orthodox Cathedral, www.greekfestival.com, (804) 358-5996Richmond International Film Festival postponed.\nhttps://mailchi.mp/richmondfilmfestival/official-locked-schedule-riff-2707457?e=11c90caf5fThe Virginia Museum of History & Culture, along with the VMFA, will close to the public beginning on Saturday, March 14, and remain closed through Friday, March 27.\nPlease visit our special website page VirginiaHistory.org/COVID19 [virginiahistory.us20.list-manage.com] and https://www.vmfa.museum/The Children’s Museum of Richmond all special events are being canceled or postponed.\nhttps://www.harlemglobetrotters.com/world-tour/schedule/arthur-ashe-athletic-centerThe Black History Museum & Cultural Center of Virginia will be closed beginning March 15 through March 30, 2020.https://www.blackhistorymuseum.org/"}, {"url": "https://www.henricocitizen.com/events/shopping/richmond-home-garden-show/?gde=2020-03-08", "title": "Richmond Home + Garden Show", "authors": [], "date": "2020-03-08", "keywords": ["tickets", "visit", "way", "garden", "spaces", "save", "richmond", "free", "mar", "shop", "seniors"], "summary": "The Richmond Home + Garden Show returns to Richmond Raceway from 11 a.m. to 8 p.m. Mar.\nThe event offers attendees an easy, interactive way to compare, shop and save with hundreds of local home pros in remodeling, kitchen and bath, gardening, outdoor spaces and more.\nThere also will be demonstrations, celebrity and expert appearances, contests, promotions and more.\nTickets are $7 to $9 for adults and free for ages 12 and under.\nAdmission is free for seniors 60+ on March 6."}, {"url": "https://www.nbc12.com/2020/03/08/virginia-women-veterans-week-be-held-march-/", "title": "Virginia Women Veterans Week to be held March 15-21", "authors": ["Published At Pm"], "date": "2020-03-08", "keywords": ["variety", "women", "vantull", "state", "veterans", "week", "1521", "veteran", "summit", "dvs", "virginia", "held"], "summary": "“We are especially pleased that DVS is partnering with state agencies such as the Virginia Employment Commission, veterans, and partners across the state to host a variety of Virginia Women Veterans Week activities and events such as our kickoff,” said Beverly VanTull, DVS Women Veterans Program Manager and also a U.S. Army veteran.\n“I would also like to extend an invitation for women veterans to attend the annual Virginia Women Veterans Summit to be held in Richmond on June 17 and 18 this year.”"}, {"url": "https://patch.com/illinois/chicago/pals-dont-let-pals-fall-coronavirus-hoaxes-social-media", "title": "Pals Don't Let Pals Fall For Coronavirus Hoaxes On Social Media", "authors": [], "date": "2020-03-19", "keywords": ["message", "quarantine", "national", "text", "media", "hoax", "pals", "dont", "fake", "chicago", "social", "hoaxes", "let", "coronavirus", "fall", "covid19"], "summary": "Of course, the \"real\" warning from a Chicago police commander was bogus, one of dozens of new coronavirus fake news conspiracies populating social media.\n\"Text message rumors of a national #quarantine are FAKE.\nText message rumors of a national #quarantine are FAKE.\nOn Wednesday night, I sent my knucklehead pals a link to a story debunking the phony panic-peddling text message.\n\"I know there is a hoax text going around."}, {"url": "https://www.wtvr.com/news/national-news/coronavirus/michelle-obama-appearance-at-richmond-forum-postponed", "title": "Michelle Obama appearance at Richmond Forum postponed", "authors": [], "date": "2020-03-12", "keywords": ["va", "rescheduledthe", "tickets", "postponed", "vijay", "richmond", "michelle", "forum", "stoney", "soldout", "websiteticket", "appearance", "obama", "virginia"], "summary": "RICHMOND, Va. -- Former First Lady Michelle Obama's sold-out March 24 appearance at the Richmond Forum has been postponed.\n\"In accordance with the recommendation of Mayor Levar Stoney and advisories by the Virginia Department of Health, we are regrettably postponing our March 21st and March 24th Richmond Forum programs,\" the forum posted on its website.\nTicket holders can use their tickets for when the events are rescheduled.\nThe April 18 event with Vijay Gupta has not yet been cancelled."}, {"url": "https://www.nbc12.com/2019/12/02/michelle-obama-is-coming-richmond-heres-how-you-can-get-tickets/", "title": "Michelle Obama is coming to Richmond - Here’s how you can get tickets", "authors": ["Published At Pm", "Published Am At Am"], "date": "2019-12-02", "keywords": ["tickets", "special", "programs", "speech", "coming", "middle", "program", "richmond", "michelle", "public", "heres", "obama", "schools", "regions"], "summary": "Former First Lady Michelle Obama will be coming to The Richmond Forum on Tuesday, March 24, 2020 for a special program to benefit speech and debate programs in the region’s public middle and high schools."}, {"url": "https://richmondmagazine.com/march-2020-issue/", "title": "March 2020 Issue", "authors": ["Richmond Magazine Staff"], "date": "2020-03-01", "keywords": ["spotlight", "2020", "arts", "summer", "richmond", "working", "housing", "life", "rva", "joan", "issue", "virginia"], "summary": "By Rodrigo Arriaza74 / Dining A to Z An alphabetical guide to the dishes, drinks and dining experiences that are quintessentially Richmond.\n104 / Generational Vision Chesterfield County seeks to entice millennials to move to suburbia as it plans for its future.\nSummer performing arts and film programs support skills in front of and behind the camera.\n28 / Housing The Partnership for Housing Affordability unveils a report outlining the region’s challenges and suggesting solutions.\n52 / Spotlight The Virginia Museum of Fine Arts makes room for a photography collective led by Henrico County native Louis Draper."}, {"url": "https://www.wric.com/news/virginia-news/something-in-the-water-2020-canceled/", "title": "Something in the Water 2020 canceled over coronavirus fears", "authors": ["Dean Mirshahi", "Laura Perrot", "Kerri O'Brien"], "date": "2020-03-13", "keywords": ["canceled", "va", "2020", "water", "scheduletickets", "festival", "updates", "coronavirus", "2021", "wric", "weve", "fears", "virginia"], "summary": "RICHMOND, Va. (WRIC) — The Something in the Water 2020 festival has been canceled over concerns of the coronavirus pandemic.\n“After much consideration, in partnership with the City of Virginia Beach, we’ve sadly decided to postpone SOMETHING IN THE WATER 2020,” an alert from organizers said.\n“We will return April 23-25, 2021 as part of our normal annual schedule.”Tickets for the 2020 festival will be refunded or honored for the 2021 festival.\nStay with 8News for updates to this breaking story."}, {"url": "https://www.wtvr.com/news/local-news/creighton-road-fatal-shooting-march-7-2020", "title": "Police find man shot to death in Richmond", "authors": [], "date": "2020-03-08", "keywords": ["man", "va", "crime", "used", "tips", "shot", "information", "stoppers", "underway", "richmond", "www7801000com", "death"], "summary": "RICHMOND, Va. -- An investigation is underway after a man was shot and killed on Richmond's East End Saturday night.\n\"The medical examiner will determine the manner and cause of death.\"\nIf you have information that could help detectives, call Crime Stoppers at 804-780-1000 or submit a tip online at www.7801000.com.\nThe P3 Tips Crime Stoppers app for smart phones may also be used.\nAll three Crime Stoppers methods of contact are anonymous"}, {"url": "https://www.wric.com/8news-digital-exclusives/2020-census-count-has-started-how-to-complete-the-legally-mandated-form/", "title": "2020 Census count has started: How to complete the legally mandated form", "authors": ["Ben Dennis", "Tyler Thrasher"], "date": "2020-03-12", "keywords": ["form", "2020", "contact", "youbrown", "started", "online", "complete", "wric", "brown", "census", "count", "face", "mandated", "legally"], "summary": "On March 12, the Census count began, and a push from officials to fill out the form online comes amid growing concern in the United States of the coronavirus spread.\n“That will reduce any one to one contact, any face to face contact with any of our employees if it’s not necessary.\nSo, we are advocating people to go online,” said Ron Brown, the partnership coordinator for the U.S. Census Bureau.\nThere are multiple ways to complete a census form.\nThe U.S. Census Bureau says they are currently hiring people to follow-up with those who have not submitted a form."}, {"url": "https://www.pilotonline.com/news/health/vp-nw-coronavirus-virginia-infections-nursing-homes-20200416-kzfxyec53bf5noorghqjo5uddi-story.html", "title": "In Virginia, 77% of nursing homes recently had infection control problems. Then came the coronavirus.", "authors": ["Peter Coutu"], "date": "2020-04-16", "keywords": ["talk", "reach", "petercoutupilotonlinecom", "coronavirus", "came", "member", "tell", "virginia", "77", "control", "recently", "homes", "vulnerable", "problems", "infection", "way", "nursing", "subject", "robynsiderskypilotonlinecom", "resides"], "summary": "If you or a family member resides in a long-term care facility and would like to tell your story, we’d love to talk to you.\nPlease email peter.coutu@pilotonline.com and robyn.sidersky@pilotonline.com with the subject like VULNERABLE and a little bit about yourself or your loved one.\nPlease include where they live, their age and the best way to reach you."}, {"url": "https://www.wric.com/news/canterbury-rehabilitation-healthcare-center-cited-for-health-violations-before-covid-19-outbreak/", "title": "Canterbury Rehabilitation & Healthcare Center cited for health violations before COVID-19 outbreak", "authors": ["Kerri O'Brien", "Sierra Fox", "Kirk Nawrotzky", "Nexstar Media Wire"], "date": "2020-04-10", "keywords": ["inspection", "report", "center", "violations", "received", "health", "rehabilitation", "longterm", "average", "cited", "healthcare", "facility", "canterbury", "outbreak", "significant", "care", "covid19"], "summary": "8News has uncovered that Canterbury Rehabilitation & Healthcare Center was cited for health violations prior to the recent coronavirus outbreak.\nThe inspection report also found Canterbury failed to have registered nurse coverage for a 24-hour period in September of last year.\nInspectors also cited the long-term care facility for abuse and neglect for failing to immediately report an allegation of sexual abuse.\nIn the meantime, Governor Ralph Northam announced a task force to work with long-term care facilities vulnerable to COVID-19, like Canterbury Rehab.\n“Every person in assisted living and long-term care is someone’s parent or loved one."}, {"url": "http://richmondfreepress.com/news/2020/apr/02/kym-grinnage-seven-others-inducted-virginia-commun/", "title": "Kym Grinnage, seven others inducted into Virginia Communications Hall of Fame", "authors": [], "date": "2020-04-02", "keywords": ["hall", "station", "wwbttv", "vice", "media", "seven", "communications", "president", "richmond", "vcu", "grinnage", "inducted", "editor", "kym", "fame", "virginia", "nbc12"], "summary": "Kym Grinnage, vice president and general manager of WWBT-TV NBC12, is among eight media professionals inducted March 26 into the Virginia Communications Hall of Fame.\nThe Robertson School has hosted the Hall of Fame since its inception in 1986.\nMr. Grinnage joined NBC12 in 1990 as an account executive and rose through the ranks to become the station’s leader in 2011.\nHe is the recipient of three Associated Press awards for Best Editorial and a Virginia Center for Inclusive Communities’ 2018 Humanitarian Award.\nHe was a student at VCU and started his career at WWBT-TV in Richmond, now NBC12."}, {"url": "https://richmondmagazine.com/october-2019-issue/", "title": "October 2019 Issue", "authors": ["Richmond Magazine Staff"], "date": "2019-10-01", "keywords": ["history", "school", "talks", "street", "wine", "2019", "richmond", "cheese", "students", "stephanie", "issue", "virginia"], "summary": "By Tharon Giddens78 / Changing History Jamie Bosket, president and CEO of the Virginia Museum of History & Culture, is bringing the past into the future.\nBy Eileen MellonDINE8 / Wine Down Grape-centric destinations in Richmond and beyond By Piet E. Jones9 / Cheese School Who says it’s just for eating?\nLessons in cheese making By Stephanie Ganz12 / Teenage Dream Virginia wine moves out of its awkward stage and works to find its footing.\nBy Laura Sant14 / Authority Figures Area experts share their stories from the worlds of wine and cheese.\nBy Eileen MellonThis is just a sneak peek of all the content packed into this month's issue; don't miss out, SUBSCRIBE NOW!"}, {"url": "https://kuathletics.com/nfl-draft-jayhawk-spotlight-four/", "title": "🏈 NFL Draft: Jayhawk Spotlight Four", "authors": [], "date": "2020-04-16", "keywords": ["tackles", "spotlight", "defensive", "solo", "assisted", "state", "12", "season", "jayhawks", "draft", "nfl", "career", "total", "jayhawk"], "summary": "🏈 NFL Draft: Jayhawk Spotlight Four share Twitter Facebook Mail EmptyLAWRENCE, Kan. – The 2020 NFL Draft is scheduled for April 23-25.\nKansas has 15 members of the 2019 roster that participated in KU’s Pro Day on March 5, each week the Jayhawks are highlighted in the Jayhawk Spotlight and this week Mike Lee, Darrius Moragne and Shaquille Richmond are the Jayhawk Spotlight.\nHeight: 5’9″Weight: 178 lbsHand: 8-6Arm: 29-2Wingspan: 72-5Class: SeniorHometown: New Orleans, La.\nHigh School: Landry-Walker HS Broad Jump: 10’2″Vertical: 29Career Honors: Honorable Mention All-Big 12; 2018: Preseason All-Big 12 Fourth Team (Athlon).\n2017: Preseason Fourth Team All-Big 12 (Athlon); Big 12 Commissioner’s Honor Roll and Athletic Director’s Honor Roll (spring)."}, {"url": "https://www.nbc12.com/2020/03/31/dominion-energy-riverrock-festival-canceled/", "title": "2020 Dominion Energy Riverrock festival canceled", "authors": ["Adrianna Hargrove", "Published Am At Am"], "date": "2020-03-31", "keywords": ["canceled", "park", "universal", "trail", "system", "2020", "energy", "james", "various", "festival", "ramp", "riverrock", "supported", "staff", "river", "dominion"], "summary": "Past Dominion Energy Riverrock donations have supported various projects in and around the James River Park System, including the rehabbing of the Maymont ramp on the North Bank Trail by the James River Park System staff (completed in November 2019) and a universal access ramp at Huguenot Flatwater through the James River Outdoor Coalition’s efforts."}, {"url": "https://www.virginiamercury.com/2020/04/16/virginias-new-gun-restrictions-have-been-13-years-in-the-making/", "title": "Virginia’s new gun restrictions have been 13 years in the making", "authors": ["Views Of Guest Columnists Are Their Own. To Submit An Op-Ed For Consideration", "Contact Editor Robert Zullo At"], "date": "2020-04-16", "keywords": ["change", "13", "prevention", "gun", "virginias", "violence", "ive", "making", "killed", "heard", "restrictions", "tech", "virginia", "work"], "summary": "We originally thought that just by sharing our stories, we could convince our legislators to pass a package of stronger gun violence prevention laws.\nVirginians across the commonwealth felt connected to the Virginia Tech community and were appalled and heartbroken by the tragedy.\nPeople became activists, founding gun violence prevention community groups in localities across the commonwealth.\nWith gun violence prevention as a pillar of their platform, they moved quickly to act on the issue, passing a slew of bills and funding community-based programs that will address our gun violence epidemic.\nLast Friday, Northam signed these gun violence prevention measures into law, making the Commonwealth of Virginia a safer place for its citizens and families."}, {"url": "https://www.pilotonline.com/sports/college/norfolk-state/vp-sp-nsu-nfl-draft-hopefuls-20200416-t27d55iclvc5haedojszj7mmxi-story.html", "title": "Norfolk State, Hampton University prospects lost their pro days, so they’re recording workouts, staying fit for the NFL draft", "authors": ["Ray Nimmo"], "date": "2020-04-16", "keywords": ["theyre", "prospects", "spartans", "state", "teams", "norfolk", "workouts", "university", "wouldve", "seen", "told", "recording", "really", "nfl", "pro", "standout", "staying", "started", "theyll", "type"], "summary": "“I was definitely frustrated ’cause a lot of guys from our type of schools, they don’t really get the opportunity to show what they have,” said Price, a former Catholic High standout who started all four years at safety for the Spartans.\n“A coach always told me if you can play ball, they’ll come and find you.\nI was hesitant to believe that, but as time continued, I’ve seen that teams are really interested in me.\nWith that HBCU combine, it would’ve given me so much exposure.”"}, {"url": "https://wtvr.com/2019/11/05/snow-forecast-monday-nov-11/", "title": "Zach Daniel talks November snow in Virginia forecast", "authors": [], "date": "2019-11-05", "keywords": ["upper", "little", "forecast", "snow", "talks", "cold", "snowfalls", "air", "recorded", "mid", "daniel", "virginia", "zach"], "summary": "RICHMOND, Va. -- A massive blast of cold air is headed to Virginia.\nAs of November 5, 2019, the forecast calls for that cold air to arrive on Monday, November 11.\n\"It could bring a little bit of wet snow even right here into parts of the Virginia Piedmont,\" CBS 6 chief meteorologist Zach Daniel said.\nZach followed up his forecast with a tweet that indicated the two biggest snowfalls in Richmond's recorded history both took place in early November.\n#rvawx #vawx @CBS6 — Zach Daniel (@ZachDanielCBS6) November 5, 2019This Tuesday we'll see a mix of sun and clouds, with mild afternoon readings in the mid 60s."}, {"url": "https://wtvr.com/2019/11/03/november-weather-almanac-and-outlook/", "title": "November weather almanac and outlook", "authors": [], "date": "2019-11-03", "keywords": ["produce", "outlook", "inches", "precipitation", "warmest", "almanac", "drops", "average", "month", "weather", "mid", "normal"], "summary": "RICHMOND, Va. -- November is a month where our normal high drops from the mid 60s to the mid 50s, and our normal low drops into the mid 30s.\nA typical November produces over three inches of liquid precipitation.\nHowever, certain years manage to produce at least a trace by the end of the month.\nFor November, it looks like we will settle into a pattern that may produce temperatures that average a little below normal.\nStay With CBS 6, The Weather Authority."}, {"url": "https://www.nbc12.com/2019/11/05/election-day/", "title": "Election 2019: Democrats gain control of House, Senate", "authors": ["Published At Pm", "Published Am At Am"], "date": "2019-11-05", "keywords": ["gain", "campaign", "house", "volunteers", "outcome", "rodman", "democrats", "senate", "election", "2019", "reelection", "vision", "team", "senator", "invested", "control", "thank"], "summary": "“Congratulations to Senator Dunnavant on her re-election,\" Democratic challenge Debra Rodman said.\n“It’s not the outcome that we hoped for, but I want to thank everyone who helped this campaign, including my family, volunteers, my campaign team, and everyone who invested in our vision.”"}, {"url": "https://www.wric.com/news/politics/local-election-hq/what-you-need-to-know-before-voting-on-nov-5/", "title": "PREVIEW: November elections in Virginia", "authors": [], "date": "2019-10-25", "keywords": ["general", "house", "id", "voters", "need", "preview", "elections", "majority", "nov", "map", "virginia", "districts"], "summary": "Prominent figures in politics — and even television — have campaigned for candidates or announced their intention to in Virginia.\nVoters could possibly give Virginia Democrats the majority in the state legislature for the first time in more than 20 years.\nThis possibility seems attainable for Democrats, especially after multiple House districts were redrawn.\nIt was ruled that 11 House districts were drawn in this way and a new map was ordered.\nAll registered voters in Virginia must have an acceptable form of photo ID before heading to the polls on Nov. 5."}, {"url": "https://wtvr.com/2019/11/11/snow-virginia-tuesday/", "title": "When snow will fall in Richmond on Tuesday", "authors": [], "date": "2019-11-11", "keywords": ["upper", "snow", "20s", "low", "morning", "40s", "richmond", "wet", "weather", "fall", "30s", "zach"], "summary": "RICHMOND, Va. -- A strong cold front will move through the area Tuesday, bringing us a round of showers and some gusty breezes.\nThe rain will change to wet snow on Tuesday, according to chief meteorologist Zach Daniel.\nExpect wet snow for approximately four hours between between noon and 4 p.m.\nCold, dry weather is expected Wednesday, with lows in the low to mid 20s and highs in the upper 30s to low 40s.\nThursday will bring another morning in the low 20s, but afternoon temperatures will rebound into the upper 40s."}, {"url": "https://wtvr.com/2019/11/03/woman-wounded-in-south-richmond-shooting/", "title": "Woman shot in Richmond", "authors": [], "date": "2019-11-03", "keywords": ["va", "took", "suspects", "shot", "stoppers", "woman", "richmond", "wound", "threatening", "suffering", "sundayparamedics"], "summary": "RICHMOND, Va. — Richmond Police are looking for suspects following an overnight shooting in the city’s Southside.\nOfficers found a woman, in the 2300 block of Concord Avenue, suffering from a gunshot wound to the leg at about 1:45 a.m. Sunday.\nParamedics took her to the hospital with non-life threatening injuries.\nInvestigators haven’t announced any arrests.\nAnyone with information can contact Crime Stoppers anonymously at 804-780-1000."}, {"url": "https://www.nytimes.com/2019/11/09/us/virginia-elections-democrats-republicans.html", "title": "How Voters Turned Virginia From Deep Red to Solid Blue", "authors": ["Sabrina Tavernise", "Robert Gebeloff", "Lauren Leatherby", "Graphics By"], "date": "2019-11-09", "keywords": ["district", "works", "population", "solid", "deep", "worker", "grown", "voters", "red", "america", "turned", "blue", "katkuri", "mr", "republican", "virginia"], "summary": "In the 13th Senate district, where Mr. Katkuri lives, one in five residents are immigrants.\nThe district had been Republican for longer than Mr. Katkuri had been in the United States.\nHe came in 2006 at the age of 25 as a tech worker, and lived for a while in New Jersey.\nMr. Katkuri always thought he would be a Republican in America.\n“The way he speaks, you get the feeling that you are separate,” Mr. Katkuri said."}, {"url": "https://wtop.com/gallery/media-galleries/photos-election-day-around-virginia/", "title": "PHOTOS: Election Day around Virginia", "authors": ["News Traffic Weather"], "date": "2019-11-06", "keywords": ["va", "station", "state", "voters", "virginia", "day", "senate", "polling", "election", "2019", "nov", "photos"], "summary": "All seats in the Virginia House of Delegates and State senate are up for election.\nAll seats in the Virginia House of Delegates and State senate are up for election.\n16/24 Virginia voters exit a polling station at Nottingham Elementary School on Tuesday, Nov. 5, 2019 in Arlington, Virginia.\n(Mike Morones/The Free Lance-Star via AP)18/24 Amy Laufer, Democratic candidate for Virginia State Senate, greets voters on Election Day in Fredericksburg, Va., Tuesday, Nov. 5, 2019.\nAmy Laufer, Democratic candidate for Virginia State Senate, greets voters on Election Day in Fredericksburg, Va., Tuesday, Nov. 5, 2019."}, {"url": "https://www.nbc12.com/2019/10/29/whats-your-ballot-everything-you-need-know-about-general-election/", "title": "What’s on your ballot? Everything you need to know about the 2019 General Election", "authors": ["Published At Pm", "Published Am At Am"], "date": "2019-10-29", "keywords": ["county", "whats", "district", "general", "chesterfield", "committee", "violation", "supported", "chase", "sheriff", "election", "2019", "amanda", "ballot", "republican", "need", "know"], "summary": "Republican Incumbent Amanda Chase faces Democratic Challenger Amanda Pohl.\nThe district covers parts of Chesterfield County and all of Amelia County and Colonial Heights.\nThe district has been represented by Chase since 2015.\nThe Chesterfield County Republican Committee expelled Chase from membership and sent her a letter saying since she has supported the campaign of an opponent of the Republican nominee for Sheriff, she is in violation of the Committee rules."}, {"url": "https://www.nbc12.com/2019/11/18/vcu-hosts-st-ever-richmond-indie-comic-expo/", "title": "VCU hosts 1st ever ‘Richmond Indie Comic Expo’", "authors": ["Enzo Domingo", "Published Am At Am"], "date": "2019-11-18", "keywords": ["theyre", "hosts", "youre", "tabling", "expo", "small", "special", "vcu", "1st", "richmond", "making", "theres", "telling", "indie", "showing", "comic", "work"], "summary": "“Small tabling events for indie artists – you can’t measure the importance of them.\nThis is where you’re making connections, you’re networking, you’re making sales, you’re telling people about what you do,” Duffy said.\n“For professionals, this is a break from doing huge scale projects for a bigger name brand.\nYou can show off work that is just yours, that you’re very proud of.\nThere’s something special in that you’re seeing people who really are pouring themselves in what they’re showing you.\""}, {"url": "https://wtvr.com/2019/11/07/rain-to-snow-scenario/", "title": "Virginia weather pattern still favors rain-to-snow scenario next week", "authors": [], "date": "2019-11-07", "keywords": ["favors", "highs", "temperatures", "scenario", "week", "pattern", "raintosnow", "season", "weather", "richmond", "mid", "far", "rain", "mass", "virginia", "cold"], "summary": "RICHMOND, Va. -- The pattern next week still favors a rain-to-snow scenario for Central Virginia on Tuesday, November 12, chief meteorologist Zach Daniel said.\nA strong cold front will move through the area tonight, with the coldest air mass so far this season moving into the area behind it.\nTemperatures will fall into the 20s for the first time this season in Richmond Saturday morning.\nThe rest of Saturday will be partly cloudy and continued cold, with highs in the mid to upper 40s.\nCold and dry weather is expected Wednesday and Thursday of next week."}, {"url": "https://patch.com/virginia/richmond/calendar/event/20191102/674046/richmond-hosting-2019-pokmon-regional-championships", "title": "Richmond hosting 2019 Pokémon Regional Championships!", "authors": [], "date": "2019-10-18", "keywords": ["pokémon", "tcg", "championships", "game", "points", "video", "regional", "richmond", "2019", "prizes", "players", "hosting"], "summary": "Pokémon Trading Card Game (TCG) and video game players, supporters, and Pokémon fans from around the country are invited to the 2019 Pokémon Regional Championships at the Greater Richmond Convention Center the weekend of Nov. 2nd.\nPokémon family-friendly event, competitors will battle for the coveted title of Pokémon Regional Champion, valuable Championship Points, and a portion of up to $50,000 in scholarships and prizes.\nOpen to TCG and video game players in good standing, the Pokémon Regional Championships provide players of all ages and skill levels the opportunity to compete and connect over a shared passion for Pokémon.\nPlayers that achieve a top Championship Points ranking at the end of the season will earn an invitation to compete at the 2020 Pokémon World Championships in London, England next summer.\nThe Richmond Pokémon Regional Championships begin Saturday, November 2 at 8:30 am."}, {"url": "https://wtvr.com/2019/11/12/girl-shot-in-richmond-neighborhood/", "title": "12-year-old girl shot in Richmond neighborhood", "authors": [], "date": "2019-11-12", "keywords": ["neighborhood", "sources", "bam", "crime", "girl", "shot", "child", "stoppers", "tips", "richmond", "12yearold", "say", "shooting"], "summary": "RICHMOND, Va. — A child was rushed to the hospital with life-threatening injuries after someone shot her early Tuesday morning in South Richmond.\nThose sources also say the girl was shot in the head.\nBam bam bam back to back and pretty loud and pretty close,” one neighbor recalled.\nThe P3 Tips Crime Stoppers app for smartphones may also be used.\nAll Crime Stoppers methods are anonymous."}, {"url": "https://www.wric.com/news/politics/local-election-hq/2019-elections-polls-open-in-virginia/", "title": "Live Election Day updates: Virginia Democrats seize control of the state legislature", "authors": [], "date": "2019-11-05", "keywords": ["county", "general", "house", "legislature", "state", "turnout", "voters", "updates", "seize", "democrats", "day", "senate", "election", "ballots", "majority", "live", "control", "virginia"], "summary": "Find the latest here:6:30 a.m.Republican Siobhan Dunnavant will hold on to her seat in the Virginia Senate after a tight race against Democrat Debra Rodman.\n11 p.m.Democrats hold a 21-18 lead in the Virginia Senate.\nIt is my sincere prayer that God will continue to bless our great Commonwealth.” Kirk Cox (R-Colonial Heights)9:30 p.m.Virginia Democrats have seized control of the state Senate for the first time in five years.\nHashmi is the first Muslim woman elected to the state Senate.\nVoters could possibly give Virginia Democrats the majority in the state legislature for the first time in more than 20 years."}, {"url": "https://www.henricocitizen.com/events/shopping/vintage-home-market-at-richmond-raceway-2/?gde=2019-11-16", "title": "Vintage Home Market at Richmond Raceway", "authors": [], "date": "2019-11-16", "keywords": ["market", "treasured", "visit", "vip", "tastings", "wine", "richmond", "showcase", "raceway", "shopping", "vhmrvacom", "nov", "vintage"], "summary": "The Vintage Home Market will take place Nov. 15-16 at Richmond Raceway.\nVintage, shabby, rustic, French Country, industrial and farmhouse chic dealers and artisans will showcase their treasured finds and creations.\nVIP Preview Party on Nov. 15 ($10) will be from 6 p.m. to 9 p.m. and will include live music, beer and wine tastings, and early bird shopping.\nA portion of the proceeds will be donated to the National Kidney Foundation.\nFor details, visit vhmrva.com."}, {"url": "https://www.nbc12.com/2019/11/05/first-alert-wintry-blast-likely-virginia-late-this-week-into-next-week/", "title": "First Alert Weather Days: Rain to snow Tuesday, potential record cold Wednesday", "authors": ["Nick Russo", "Jim Duncan", "Megan Wise", "Published April", "At Pm", "At Am"], "date": "2019-11-05", "keywords": ["whitened", "snow", "ruled", "alert", "days", "scenario", "roads", "potential", "record", "wet", "slushy", "weather", "surprised", "worst", "rain", "remain", "cold"], "summary": "Minor snow accumulation is expected (a dusting/coating on grassy areas can’t be ruled out if the precipitation falls hard enough).\nA few forecast models do hint at a little more snow, so don’t be surprised if the ground gets whitened.\nEven in a worst case scenario, the roads would probably remain wet and not slushy."}, {"url": "https://www.wjhl.com/news/your-local-election-hq/virginia-november-election-what-you-need-to-know/", "title": "Virginia November Election: What you need to know", "authors": ["Pheben Kassahun", "The Associated Press", "Jeff Keeling"], "date": "2019-11-04", "keywords": ["districts", "local", "id", "voters", "virginia", "election", "majority", "voter", "nov", "map", "need", "know"], "summary": "Prominent figures in politics — and even television — have campaigned for candidates or announced their intention to in Virginia.\nVoting locations:To find your polling location, you can click here or contact your local voter registration office.\nAll registered voters in Virginia must have an acceptable form of photo ID before heading to the polls on Nov. 5.\nIf you don’t have an ID, you can go to your local voter registration office and get a free Voter Photo ID, even on Election Day.\nNews Channel 11 is Your Local Election Headquarters."}, {"url": "https://www.vox.com/policy-and-politics/2019/11/1/20940538/virginia-state-legislature-elections-2019", "title": "Virginia’s state legislature elections are Democrats’ first big enthusiasm test before 2020", "authors": ["Ella Nilsen", "Nov"], "date": "2019-11-01", "keywords": ["theyre", "ballot", "house", "2020", "legislature", "state", "2017", "virginias", "democrats", "elections", "election", "test", "republicans", "enthusiasm", "big", "virginia"], "summary": "Elections for Virginia’s state legislature are Democrats’ first big enthusiasm test before the 2020 elections start.\nIn past off-years, turnout hasn’t been very high; there’s usually not a ton of interest in state legislative elections alone.\nThe perceived interest in a normally sleepy election is part of what makes this an interesting test for Democrats and Republicans alike for 2020.\nThere’s also the inescapable factor that whoever wins the state house will be in control of drawing congressional districts after the 2020 census.\n(Virginia Republicans had previously drawn maps in their party’s favor until a court struck them down as a racial gerrymander.)"}, {"url": "https://wtvr.com/2019/11/20/crash-on-downtown-expressway-in-richmond-closes-multiple-lanes/", "title": "Police: One dead in crash on Downtown Expressway", "authors": [], "date": "2019-11-20", "keywords": ["downtown", "expressway", "crash", "va", "striking", "man", "dead", "died", "i195", "richmond", "following", "westbound", "guardrail"], "summary": "RICHMOND, Va. -- A man has died following a crash on westbound I-195 Wednesday evening.\nPolice say a man driving a 2016 Cadillac Escalade was traveling westbound on I-195 when he ran off road left striking the guardrail.\nThe vehicle then went over the guardrail, striking a pole, and overturning on the driver's side in the median.\n\"Speed is being considered as a factor in the crash, which remains under investigation.\"\nTwo lanes of the Downtown Expressway in Richmond (VA-195) were closed following a crash."}, {"url": "https://wtvr.com/2019/10/25/guy-fieris-diners-drive-ins-and-dives-to-feature-richmond-restaurant-in-november/", "title": "Guy Fieri’s ‘Diners, Drive-Ins and Dives’ to feature Richmond restaurant in November", "authors": [], "date": "2019-10-25", "keywords": ["restaurants", "dives", "episode", "driveins", "eat", "restaurant", "diners", "perlys", "featured", "feature", "network", "richmond", "food", "guy", "fieris"], "summary": "RICHMOND, Va. – Celebrity chef Guy Fieri made a pit stop in Richmond last month and now we know why.\nA Richmond restaurant will be featured on the newest season of ‘Diners, Drive-Ins and Dives.’The Food Network superstar was spotted on Cary Street in the Fan and in Scott’s Addition.\nThe Richmond Times-Dispatch also reported Perly’s restaurant was on Fieri’s list of places to visit.\nAccording to a listing on the ‘Diners, Drive-Ins and Dives’ website, Richmond will be featured on November 22 episode titled \"Cruisin Capital Cities.\"\nThe episode is scheduled to air on the Food Network on November 22 at 9 p.m."}, {"url": "http://m.richmondfreepress.com/news/2019/oct/31/free-press-endorsements-2019-virginia-elections/", "title": "Free Press endorsements for 2019 Virginia elections", "authors": [], "date": "2019-10-31", "keywords": ["district", "house", "endorsements", "senate", "press", "elections", "2019", "richmond", "election", "free", "republicans", "legislative", "public", "rights", "virginia"], "summary": "All 140 seats in the Virginia Senate and House of Delegates are up for election.\nIn the city of Richmond, that includes the 5th District Richmond City Council representative, the Richmond Commonwealth’s Attorney and clerk of Richmond Circuit Court.\nThe upcoming legislative contests will be critical in Virginia because Republicans hold a slim two-vote majority in both the Senate and the House of Delegates.\nAfter careful consideration, we endorse the following candidates:Virginia SenateWe endorse veteran lawmaker Sen. Jennifer L. McClellan, a Democrat from Richmond, for re-election in the 9th Senate District.\nShe is vice chairman of the Virginia Legislative Black Caucus and has contributed much to advance initiatives and legislation important to our community."}, {"url": "https://wtvr.com/2019/11/26/arguments-are-leading-cause-of-murder-in-richmond-police-hope-civilian-officers-can-help/amp/", "title": "Arguments are leading cause of murder in Richmond, police hope civilian officers can help", "authors": [], "date": "2019-11-26", "keywords": ["homicides", "arguments", "leading", "civilian", "cases", "hope", "forward", "officers", "city", "help", "richmond", "smith", "cause", "willing", "2019", "number", "murder", "mean"], "summary": "RICHMOND, Va. — Arguments are the leading cause of homicides in Richmond, and the police department has a new program that will be rolled out to hopefully address the issue, the RPD told the City Council’s Public Safety Committee on Tuesday.\n“In many cases, it comes down to someone being willing to come forward and say what they saw and say what they know.\nA lot of times in the heat of the moment, the first six months, they may not be willing to do so.\nBut a year or two or three down the road, there may be less disincentive for them to do that.\nEither fear of repercussion or fed up with the situation at hand that they are willing to come forward and speak.”"}, {"url": "https://richmondmagazine.com/restaurants-in-richmond/food-news/week-of-nov-11-15-2019/", "title": "Richmond Food News: Week of Nov. 11-15", "authors": ["Eileen Mellon"], "date": "2019-11-14", "keywords": ["local", "1115", "opened", "open", "week", "richmond", "food", "bar", "nov", "town", "pit"], "summary": "Last week, we shared news of malts and milkshakes on Sycamore Street at Bopper’s Malt Shop, and this week there is Burnette’s Baked Goods.\nThe 25-seat outpost will open in early 2020 for lunch and dinner, and menu items will be named after Richmond landmarks.\n(Richmond BizSense)Scott’s Addition welcomed another new neighbor last week, Truckle Cheesemongers, which has set up shop inside Blue Bee Cider’s tasting room.\n(Richmond Times-Dispatch)After 15 years in business, Cha Cha’s Southwest Kitchen & Bar — previously known as Cha Cha’s Cantina — has bid farewell to Shockoe as of Nov. 11.\n(Richmond Times-Dispatch)Smoke Pit Grill, the Henrico strip-mall barbecue joint from longtime competition-circuit pitmaster Gordon Taylor and his wife, Lori, will shut its doors Nov. 30."}, {"url": "https://wtvr.com/2019/11/16/2019-richmond-marathon-results/", "title": "Richmond Marathon Results: Winners and rankings for ‘America’s Friendliest Marathon’", "authors": [], "date": "2019-11-16", "keywords": ["partners", "friendliest", "americas", "runners", "took", "health", "vcu", "richmond", "results", "nov", "marathon", "river", "rankings", "winners", "half"], "summary": "RICHMOND, Va. -- Thousands of runners braved the windy and chilly temps Saturday morning as they made their way through the River City for the 42nd annual VCU Health Richmond Marathon.\nVCU Health Richmond Marathon Winners:Ashenafi Birhana of Washington, D.C. (2:19:20)Ayantu Hailema of Ethiopia (2:36:19)Markel Richmond Half Marathon Winners:Julius Kogo of Ethiopia (1:04:45)Bethany Sachtleben of Fairfax (1:12:34 -- second consecutive win)*Sachtleben also took first in the 2017 Richmond Marathon, as well as the 2018 and 2019 Ukrop’s Monument Avenue 10k in Richmond.\nAllianz Partners 8K Winners:Lawrence Kipkoech (23:24)Gotytom Gebreslase (25:49)COMPLETE RESULTS: Richmond Marathon | Half Marathon | 8KThe Richmond Marathon, dubbed “America’s Friendliest Marathon,” is one of the top 25 qualifying races runners participate in to qualify for Boston Marathon.\nRegistration for next year's VCU Health Richmond Marathon, scheduled for Saturday, Nov. 14, 2020, is now open.\nThere is a special $75 marathon/$65 half marathon entry fee available through Thursday, Nov. 21."}, {"url": "https://richmondmagazine.com/november-2019-issue/", "title": "November 2019 Issue", "authors": ["Richmond Magazine Staff"], "date": "2019-11-01", "keywords": ["traditions", "youre", "spotlight", "museum", "music", "vcu", "look", "2019", "richmond", "issue", "richmonds", "virginia"], "summary": "107 / Fashion Forecast Look for on-trend inspiration for your winter wardrobe in our Carytown Guide, with a mix of upscale items and bargain finds.\n30 / My Take A wise protagonist knows when to step out of the spotlight and let others shine.\n48 / Q&A Bruce and Kathy Hornsby talk about their collection of Edward Hopper drawings, on loan to the Virginia Museum of Fine Arts.\nBy Elizabeth BeckerEAT & DRINK169 / Review Carmela’s172 / Ingredient Oysters174 / 5 Faves Show up to your next celebration with eye-catching party platters.\n176 / Cultural Crossover Thanksgiving traditions from local chefs177 / Quick Take Fuzzy Cactus brings a triple threat — restaurant, bar and music venue — to North Side."}, {"url": "https://www.newsleader.com/story/news/local/2019/11/06/so-what-happened-tuesday-virginia-election-day-coverage-wrap-up/4175430002/", "title": "So, what happened Tuesday? Virginia Election Day coverage wrap-up", "authors": ["Leanna Smith", "Published A.M. Et Nov."], "date": "2019-11-06", "keywords": ["county", "augusta", "state", "day", "social", "happened", "election", "wrapup", "win", "using", "twitter", "virginia", "coverage"], "summary": "All seats in the Virginia House of Delegates and State senate are up for election.\nHere is our guide to The News Leader's Election Day coverage.\nTurnout heavy in Augusta County, Staunton and WaynesboroON SOCIAL MEDIACheck out #SAWvotes on Twitter to see updates from our reporters.\nShare your Election Day stories and photos with us by using the hashtag.\nBuy Photo Keep up with the election on social media using the hashtag #SAWvotes."}, {"url": "https://www.wtvr.com/news/problem-solvers-investigations/virginia-primary-whats-being-done-to-ensure-accurate-election-results-in-virginia", "title": "Virginia Primary: what's being done to ensure accurate election results in Virginia", "authors": [], "date": "2020-03-03", "keywords": ["whats", "security", "ensure", "primary", "voters", "paper", "elections", "election", "department", "website", "results", "accurate", "piper", "virginia"], "summary": "\"When we discovered that error we took down the website so we could resolve the issue,\" Commissioner of the Virginia Department of Elections, Chris Piper, said.\nSome feared hackers had compromised the results, but Piper said that was not the case.\nAnd, heading into this year's Democratic primary, we wanted to hear from the Commissioner ourselves about the security of this election cycle.\n\"Election night results are unofficial, the're the quick entry of the results, there is a seven day process that goes on after that to canvass the results,\" Piper said.\nIf you have any concerns on election day, contact your local registrar's office or the Department of Elections."}, {"url": "https://www.wric.com/news/politics/biden-coming-to-virginia-ahead-of-nov-5-elections/", "title": "Biden coming to Virginia ahead of Nov. 5 elections", "authors": ["Dean Mirshahi", "Andrew Taylor", "Associated Press", "Scott Bauer", "Lisa Mascaro"], "date": "2019-10-22", "keywords": ["biden", "ahead", "visit", "vice", "coming", "state", "presidential", "democrats", "president", "elections", "nov", "planned", "virginia"], "summary": "RICHMOND, Va. (WRIC) — Former Vice President Joe Biden will visit Virginia days before the state elections on Nov. 5, according to his presidential campaign’s schedule, when all 140 seats in the state legislature are on the ballot.\nThe planned trip for Biden, one of the front-runners in the 2020 Democratic primary race, will be his second to Virginia since announcing his run for president.\nWith Republicans holding slim majorities in the Senate and House, Democrats could possibly take control of the General Assembly after the election.\nIt is unclear whether Biden will be campaigning for any Virginia Democrats or if his planned visit on Nov. 3 will be for his presidential campaign.\nJill Biden, the former vice president’s wife, will be in Virginia next Wednesday."}, {"url": "https://wtvr.com/2019/11/27/deer-smashes-window-lora-robins-university-of-richmond-dorm/", "title": "Deer smashes window at University of Richmond dorm", "authors": [], "date": "2019-11-27", "keywords": ["dorm", "robins", "smashes", "officials", "building", "animal", "richmond", "university", "window", "crashed", "deer"], "summary": "RICHMOND, Va. -- Photos show the damage left behind after a deer crashed through a window at a dorm at the University of Richmond Wednesday afternoon.\nUniversity officials issued an alert around 1:45 p.m. advising “Lora Robins residents please stay in room at current time.”That was because officials said an injured deer crashed through window in the c-pod.\nLora Robins is now clear, the deer ran off and is away from the building.\n— University of Richmond (@urichmond) November 27, 2019Officers tried to locate the animal in the building, but later said they believe the animal made it back outside and then raw off.\nThanksgiving break began Tuesday, so not many people were inside the dorm when the break-in happened."}, {"url": "https://www.nbc12.com/2019/11/12/forecast-first-alert-weather-day-rain-snow-followed-by-near-record-cold/", "title": "Forecast: Very cold for November on Wednesday", "authors": ["Published April", "At Pm", "At Am"], "date": "2019-11-12", "keywords": ["forecast", "sunny", "cold", "temperatures", "spots", "high", "potential", "record", "season", "weather", "temperature", "coldest"], "summary": "WEDNESDAY: First Alert Weather Day: There could be icy in spots in the early morning.\nSunny and very cold for November.\nColdest temperatures so far this season and a potential record for coldest high temperature.\nLows in the low to mid 20s, high: 38"}, {"url": "https://wtvr.com/2019/11/18/vcu-rams-ranked-in-latest-coaches-and-ap-poll/", "title": "VCU Rams ranked No.19 in Coaches Poll, No.21 in AP Poll", "authors": [], "date": "2019-11-18", "keywords": ["coaches", "no19", "25", "ap", "rams", "weeks", "vcu", "no21", "win", "week", "ranked", "poll"], "summary": "RICHMOND, Va. – After a 2-0 week and an undefeated 4-0 start to the season, the VCU Rams have returned to the top 25 in the AP Poll and made their first appearance in the Coaches Poll.\nThe Rams were ranked No.21 in this week’s AP Poll and No.19 in this week’s Coaches Poll.\nThe black and gold returned to the top 25 in the AP Poll after beginning the season ranked No.\nThe improved national rankings come after a huge 84-82 win over former VCU head coach, Will Wade, and then-No.23 ranked LSU.\nAfter a 2-0 week, @VCU_Hoops are back in the AP top 25 at #21 and are in Coaches poll at #19."}, {"url": "https://wtvr.com/2019/11/01/man-shot-blocks-away-from-richmond-elementary-school/", "title": "18-year-old arrested after contractor shot during robbery on Northside", "authors": [], "date": "2019-11-01", "keywords": ["avenue", "man", "crime", "shot", "stoppers", "arrested", "richmond", "shooting", "lifethreatening", "robbery", "street", "northside", "18yearold", "contractor"], "summary": "RICHMOND, Va. – A man has been arrested in connection to a shooting nearly two weeks ago that left a contractor in life-threatening condition.\nWorkers said a contractor was shot during the robbery in a Northside neighborhood -- just blocks away from Linwood Holton Elementary School -- on November 1.\nThose workers said they saw a man walking down the street approach their boss' van before he was shot.\nAnyone with information about this shooting is asked to contact Crime Stoppers at 804-780-1000, or they may visit http://www.7801000.com.\nThe P3 Tips Crime Stoppers app for smartphones may also be used."}, {"url": "https://shoredailynews.com/headlines/deadline-to-register-to-vote-tomorrow/", "title": "Deadline to register to vote in Virginia November election tomorrow", "authors": [], "date": "2019-10-14", "keywords": ["registration", "voting", "local", "vote", "deadline", "submitted", "election", "2019", "15", "voter", "applications", "tomorrow", "virginia", "register"], "summary": "RICHMOND, VA – The voter registration deadline for the November 5, 2019 General Election in Virginia is Tuesday, October 15, 2019.\nTo register to vote or update your voter registration information:By mail : Applications must be postmarked by October 15, 2019.: Applications must be postmarked by October 15, 2019.\nIn-person : Applications must be submitted by 5 pm on October 15, 2019.: Applications must be submitted by 5 pm on October 15, 2019.\nIn addition to registering online, eligible Virginians may also register at their local voter registration office in Accomack or Eastville.\nVoter registration applications are also available at DMV customer service centers, social service offices, public libraries and other state and local government offices."}, {"url": "https://wtvr.com/2019/11/01/weekend-events-ashland-train-day-urbanna-oyster-festival-more/", "title": "Weekend Events: Ashland Train Day & Urbanna Oyster Festival & More", "authors": [], "date": "2019-11-01", "keywords": ["weekend", "yoga", "urbanna", "oyster", "tickets", "walk", "white", "festival", "events", "w", "day", "washington", "virginianovember", "ashland", "nov", "train", "warming", "junction"], "summary": "RICHMOND, Va.–Puritan Cleaners Coats For Kids/Ballpark Warming PartyNutzy’s Ballpark to Brewery DashSaturday, Nov. 2, 11am – 2pmThe DiamondClick on the links for more information: https://www.puritancleaners.com/community/coats-for-kids/https://www.facebook.com/events/572843420119519/https://www.facebook.com/NutzysRotaryFunnRun/ https://runsignup.com/nutzyballparktobrewerydashOysters, Barbecue…Battersea1289 Upper Appomattox Street, Petersburg, VASaturday, Nov. 2, gates open at noonAdvance Tickets $40https://petersburgarea.org/events/oysters-barbecue-battersea/2019 Walk to End Alzheimer’s – RichmondRegistration at 8am, Ceremony at 9:30am, Walk at 10:00amRoute Length: 1 and 3 milesBon Secours Washington Redskins Training Center 2401 W. Leigh StRichmond, VAhttps://act.alz.org/site/TR?sid=23932&type=fr_informational&pg=informational&fr_id=12253Urbanna Oyster FestivalTown of Urbanna, VirginiaNovember 1 & 2Walking festival, Pay as you gohttps://www.urbannaoysterfestival.com/Ashland Train Day Town of AshlandSaturday, Nov. 2, 10am – 5pmPublic Parking – Ashland Junction Shopping Center67 Junction DriveSt. Anne’s Catholic Church – 105 S Snead Sthttps://www.ashlandvirginia.com/traindayAlpha Kappa Alpha presents the 13th Annual Saute and SizzleSaturday, Nov. 2, 7:08 – 11:08pmRichmond Raceway Old Dominion Building600 East Laburnum AvenueAdvance tickets only $40, tickets not sold at the doorwww.aka1908.comwww.reoaka.org/saute-sizzle/Autumn Date Night: Horseback Trail Rides, Yoga & Reggae MusicAt White Feather Trails in PowhatanHosted by True Grit Yoga & Botanica and Mighty JoshuaSunday at 2 PM – 7 PMhttps://www.facebook.com/events/691603398018548/ and https://www.facebook.com/nathaniel.whitefeather.7 and https://www.facebook.com/TrueGritYoga/?eid=ARC4cmss9gKif3MWmca-hAE8O9UacjTDrzKsZnX6gHCe-yK-P-4j4a36Ti3wxZINRCkDTKvNXv5GYfQH"}, {"url": "https://www.nbc12.com/2019/11/11/news-know-nov-snow-forecast-why-helicopters-were-flying-chesterfield-overnight-plus-veterans-day-ceremony-freebies/", "title": "News to Know for Nov. 11: Snow in the forecast; Why helicopters were flying in Chesterfield overnight; Plus, Veterans Day ceremony & freebies", "authors": ["Published At Pm"], "date": "2019-11-11", "keywords": ["sorry", "helicopters", "flying", "plus", "snow", "forecast", "blasting", "veterans", "colder", "overnight", "freebies", "week", "break", "weather", "area", "nov", "big", "know"], "summary": "We’re sorry to break it to you, but snow is back in the forecast.\nThe big story of the week, though, is much colder weather blasting into the area Tuesday."}, {"url": "https://wtvr.com/2019/11/13/2019-vcu-health-richmond-marathon/", "title": "2019 VCU Health Richmond Marathon", "authors": [], "date": "2019-11-13", "keywords": ["director", "health", "vcu", "2019", "richmond", "medical", "professor", "team", "marathon", "wwwvcuhealthorg", "dr"], "summary": "RICHMOND, Va. - The 2019 VCU Health Richmond Marathon is this Saturday, November 16th, and the VCU Medical Team will have a tent set up for runner access.\nJoining us to tell us more about the role of the VCU Medical Team on Race Day, running safety, the degree of planning that goes into the event, and the importance of exercise, are Dr. Jeff Ferguson, Marathon Director, Associate Professor, Nationally Registered Paramedic, and Dr. Mary Caldwell, Marathon Director, Assistant Professor of Physical Medicine and Rehabilitation.\nFor more information on VCU Health visit www.vcuhealth.org"}, {"url": "https://wtvr.com/2019/11/06/anthony-wheeler-obit/", "title": "Man found dead in burning Richmond building was shot multiple times", "authors": [], "date": "2019-11-06", "keywords": ["man", "burning", "va", "dead", "building", "unconscious", "shot", "multiple", "video", "week", "richmond", "wheeler", "times", "witnesses", "wounds", "warehouse"], "summary": "RICHMOND, Va. -- The man whose body was found in a burning Richmond building last week had been shot multiple times, according to Richmond Police.\nPolice identified the man as 35-year-old Anthony S. Wheeler, Charles City.\n\"At approximately 2:22 a.m. on November 1, the Richmond Fire Department responded to the 00 block of Thurman Street for the report of a warehouse fire.\nAfter the fire was suppressed, firefighters found Wheeler unconscious in the warehouse with apparent gunshot wounds,\" a Richmond Police spokesperson said.\nAnyone with information was asked to call Richmond Police Detective M. Godwin at 804-317-6922 or Crime Stoppers at 804-780-1000."}, {"url": "https://wtvr.com/2019/10/29/november-project-rva-offers-free-workouts-in-the-city/", "title": "November Project RVA offers free workouts in the city", "authors": [], "date": "2019-10-29", "keywords": ["vmfa", "welcome", "va", "workout", "way", "social", "city", "project", "workouts", "world", "free", "rva", "fitness", "stay", "offers"], "summary": "RICHMOND, Va. – November Project is a FREE fitness movement that was born in Boston as a way to stay in shape during cold New England months.\nIt’s become so popular that multiple cities around the world have joined in on the fun including right here in the River City.\nCo-Leaders Ja Jones and Chris Kerns join us to share how this program has adapted into Richmond’s culture and to do a mini workout.\nNovember Project RVA meets every Wednesday morning at 6am at the VMFA.\nAll fitness levels are welcome!"}, {"url": "https://wtvr.com/2019/11/20/broadway-in-richmond-presents-hamilton/", "title": "Broadway In Richmond presents HAMILTON!", "authors": [], "date": "2019-11-20", "keywords": ["tickets", "digital", "prior", "parking", "street", "presents", "richmond", "lottery", "hamilton", "theater", "broadway", "performance"], "summary": "RICHMOND, Va.-- HAMILTON is the story of America's Founding Father Alexander Hamilton, an immigrant from the West Indies who became George Washington's right-hand man during the Revolutionary War and was the new nation’s first Treasury Secretary.\nFeaturing a score that blends hip-hop, jazz, blues, rap, R&B, and Broadway, HAMILTON is the story of America then, as told by America now.\nDue to heavy traffic Broadway In Richmond is suggesting a few things.\nFor digital lottery for HAMILTON tickets will begin in conjunction with the show’s first performance (November 19) in Richmond at the Altria Theater.\nThe digital lottery will open at 11:00 AM on November 17 for tickets to the Tuesday, November 19 performance."}, {"url": "https://slate.com/news-and-politics/2020/01/militia-richmond-virginia-gun-rally.html", "title": "Militia groups plan to descend on Richmond for a gun rights \"boogaloo.\"", "authors": ["David J. Toscano"], "date": "2020-01-18", "keywords": ["descend", "state", "gun", "plan", "groups", "militia", "right", "rally", "virginians", "richmond", "internet", "boogaloo", "measures", "guns", "rights", "virginia"], "summary": "Militia members at the Unite the Right rally in Charlottesville.\nSince the fall election, the rhetoric around guns in Virginia has dramatically intensified.\nGun groups became further incensed in December when Democratic Congressman Donald McEachin suggested that if people did not follow the law, Northam should use the state’s National Guard to make them do so.\nDespite the rhetoric about gun confiscation and governmental overreach, most of the measures proposed by Democrats are widely supported by Virginians.\nMilitia groups across the country have promised to protest in Richmond, dressed in military camouflage and outfitted with sophisticated assault weaponry."}, {"url": "https://www.nbc12.com/2019/11/25/winter-outlook-/", "title": "Virginia’s winter outlook for 2019-2020 expected to be relatively mild", "authors": ["Jim Duncan", "Published April", "At Pm", "At Am"], "date": "2019-11-25", "keywords": ["winter", "outlook", "sprinkled", "expected", "20192020", "realm", "temperatures", "virginias", "zone", "trends", "mild", "soil", "wellknown", "signals", "science", "relatively"], "summary": "Winter outlooks (they are not “forecasts”, that dwell in the predicting-out-a-few-days ahead realm) are at best educated guesses sprinkled with science.\nThis winter, like most, falls into that zone, with few clear signals.\nEl Nino and La Nina are predicted to be neutral through the winter, but there are other considerations beyond those “well-known” ones, including ocean temperatures in other areas of the Pacific and Atlantic, soil moisture content, and our late-Fall global pattern trends."}, {"url": "https://wtvr.com/2019/11/22/death-investigation-closes-chippenham-parkway-officials-say-person-pulled-from-water/", "title": "Chippenham Parkway reopened, death investigation underway", "authors": [], "date": "2019-11-22", "keywords": ["parkway", "county", "va", "investigation", "scene", "chippenham", "closed", "underway", "henrico", "reopened", "death", "waterdetectives"], "summary": "HENRICO COUNTY, VA. -- Portions of the Northbound Chippenham Parkway from Richmond into Henrico County were closed Friday night as police conducted a death investigation, according to Henrico Police.\nCBS 6 Reporter Matthew Fultz spoke to detectives on the scene who said that they recovered someone from the water.\nDetectives are on scene of a death investigation.\nWe appreciate the communities patience while first responders remain on scene.\nhttps://t.co/sCN0Tur4rB — Henrico Police (@HenricoPolice) November 23, 2019Portions of Chippenham Parkway were closed for hours following the incident."}, {"url": "https://wtvr.com/2019/11/15/richmond-ambulance-authority-driver-charged-in-hull-street-and-belt-boulevard-crash/", "title": "Driver charged in 4-vehicle crash that overturned Richmond ambulance", "authors": [], "date": "2019-11-15", "keywords": ["crash", "officials", "investigation", "driver", "hospital", "ambulance", "naoroz", "overturned", "richmond", "4vehicle", "raa", "intersection", "charged"], "summary": "RICHMOND, Va. -- The driver of an ambulance involved in a four-vehicle crash on Richmond’s Southside Wednesday evening that left three other people injured has been charged in the crash.\nRichmond Ambulance Authority (RAA) officials said the ambulance driver was charged with failure to yield right-of-way in relation to the Nov. 13 crash at the intersection of Hull Street and Belt Boulevard.\n\"The ambulance was responding to an emergency call and had its lights and sirens on as it neared the intersection,\" RAA officials said.\nRichmond Ambulance officials confirmed Wednesday that two of their employees were taken to an area hospital with minor injuries.\n\"The Richmond Ambulance Authority is taking proper steps to review what happened to ensure the safety of our employees and the public.\""}, {"url": "https://www.newsleader.com/story/news/2020/02/25/super-tuesday-whos-ballot-virginia-and-how-vote/4859911002/", "title": "Primary guide: What to know about Super Tuesday and the Democratic primary", "authors": ["Claire Mitzel", "Leanna Smith", "Published A.M. Et Feb."], "date": "2020-02-25", "keywords": ["sen", "democratic", "primary", "won", "guide", "candidates", "voters", "presidential", "polls", "department", "super", "virginia", "know"], "summary": "(Photo: Steve Helber, AP)Virginians head to the polls today to vote for the Democratic presidential nominee.\nVirginia is among 14 states and one U.S. territory whose voters head to the polls on Super Tuesday, a popular day for presidential primaries across the nation.\nCandidates on the ballotThere are 14 Democratic candidates on the ballot, but as of March 3, many have dropped out.\nIn 2016, Hillary Clinton beat Bernie Sanders in Virginia's Democratic primary in a race among three candidates.\nVirginia is an open primary state, which means any registered voter may choose to vote in the Democratic presidential primary."}, {"url": "https://www.nbc12.com/2019/11/21/news-know-nov-convenience-store-robbed-popular-snack-recalled-one-more-sunny-day/", "title": "News to Know for Nov. 21: Convenience store robbed; popular snack recalled; one more sunny day", "authors": ["David Hylton", "Published At Pm"], "date": "2019-11-21", "keywords": ["popular", "sunny", "marshals", "sightings", "rifle", "say", "know", "searched", "store", "snack", "robbed", "convenience", "day", "killing", "mothers", "nov", "recalled", "tip", "nell"], "summary": "Acting on a tip, Marshals searched the Hollins area and found the rifle in the backyard of a home on Nell Drive.\nThey say there are no new confirmed sightings of Brown, who is accused of killing his mother’s boyfriend in Franklin County on Nov. 9."}, {"url": "https://www.theatlantic.com/politics/archive/2019/10/democrats-go-trifecta-virginia-2019-elections/599962/", "title": "The Blue Wave Faces Its First Test After 2018", "authors": ["Russell Berman"], "date": "2019-10-14", "keywords": ["issue", "party", "2018", "faces", "democratic", "herring", "fairfax", "democrats", "test", "scandals", "governor", "blue", "wave", "northam", "virginia"], "summary": "Hanging over the Democrats’ bid, however, is an issue none of its candidates want to talk about: The Scandals (yes, plural).\nWhile Northam was fighting to save his job, two women accused Fairfax, his would-be successor, of sexually assaulting them in 2000 and 2004, respectively.\nThe cascade of revelations made for a head-spinning week in Virginia and turned its Democratic Party into an object of national derision.\nThey think that voters won't care at all when it's brought up,” says John Findlay, the executive director of the Virginia Republican Party.\nMore people also approved than disapproved of the jobs Fairfax and Herring were doing."}, {"url": "http://richmondfreepress.com/news/2019/oct/31/election-day-tuesday-nov-5/", "title": "Election Day: Tuesday, Nov. 5", "authors": [], "date": "2019-10-31", "keywords": ["voting", "virginia", "day", "rides", "election", "richmond", "races", "804", "voter", "nov", "polls"], "summary": "This Tuesday, November 5, is Election Day.\ngov/registration/photo-ids-required-to-vote/Free ride to the polls: GRTC will provide free rides to the polls within the city of Richmond on its buses, Pulse and CARE vans all day on Tuesday, Election Day.\nVoters should call (804) 228-1744 by Monday, Nov. 4, to schedule a ride.\nYou can check your voter status and voting precinct at www.elections.virginia.gov or call your local voter registrar’s office.\nHere are the numbers:Richmond: (804) 646-5950Henrico: (804) 501-4347Chesterfield: (804) 748-1471Hanover: (804) 537-6080Petersburg: (804) 733-8071Your vote is your voice."}, {"url": "https://wtvr.com/2019/11/01/connecting-hearts-presents-a-hand-to-hold/", "title": "Connecting Hearts presents “A Hand to Hold”", "authors": [], "date": "2019-11-01", "keywords": ["children", "30", "connecting", "weekday", "farmer", "presents", "hand", "hearts", "cbs", "hold", "foster"], "summary": "RICHMOND, Va. – Connecting Hearts in Virginia is a local non-profit organization focused on promoting adoptions and giving children the chance to enjoy a loving home.\nCBS 6 is partnering with Connecting Hearts as they kick off their month long program, “A Hand to Hold” 30 Kids in 30 Days campaign.\nHere to tell us more about the campaign is Barry Farmer from Connecting Hearts, along with CBS 6 News Anchor, Bill Fitzgerald.\n“A Hand to Hold” begins Friday, November 1 and takes place every weekday through November 30.\nFor more information on Connecting Hearts, give them a call at 804-308-5946 or visit them online at www.connectingheartsva.org"}, {"url": "https://www.nbc12.com/2019/11/19/hit-broadway-musical-hamilton-arrives-richmond/", "title": "Hit Broadway musical ’Hamilton’ arrives in Richmond", "authors": ["Published Am At Am"], "date": "2019-11-19", "keywords": ["treasury", "dollar", "system", "officials", "rasmussen", "hit", "financial", "bill", "richmond", "musical", "hamilton", "arrives", "need", "broadway"], "summary": "“Hamilton is on the ten dollar bill, he was about to go off the ten dollar bill, until the musical came along and then the treasury department officials decided ‘we need to keep him,' Rasmussen explained.\n\"It was appropriate for him to be on the bill, he established the financial system of the country.”"}, {"url": "https://wtvr.com/2019/11/12/tuesday-virginia-weather-update/", "title": "Wintry mix on tap for Tuesday", "authors": [], "date": "2019-11-12", "keywords": ["upper", "snow", "20s", "low", "temperatures", "wintry", "morning", "tap", "mix", "30s", "lows", "rain", "zach"], "summary": "RICHMOND, Va. -- Rain will change to or mix with snow between 11 a.m. and 2 p.m. in Central Virginia.\n\"Surface temperatures will be a few degrees above freezing, so any slick spots arising from snow will be very limited,\" chief meteorologist Zach Daniel said.\nTemps will fall throughout the day and rain will briefly change to wet snow around midday.\nThursday will bring another morning in the low 20s, but afternoon temperatures will rebound into the upper 40s.\nExpect partly sunny skies Friday through Sunday, with highs averaging in the low 50s and lows in the upper 20s and low 30s."}, {"url": "https://wtvr.com/2019/11/25/celebrating-national-adoption-month/", "title": "Celebrating National Adoption Month", "authors": [], "date": "2019-11-25", "keywords": ["adoption", "youth", "society", "national", "visit", "wwwchsvaorg", "childrens", "adoptive", "celebrating", "month", "virginias", "region", "richmond", "virginia"], "summary": "RICHMOND, Va. -The Children's Home Society of Virginia is challenging all adults in the Richmond Region to consider the enormous need to provide permanent, loving homes for Virginia's at-risk children and youth.\nFor November National Adoption Month, CHS is profiling two exceptional and successful adoptive families from the Richmond Region.\nToday, Pat and Ruth Matthews and their adoptive son, Alston, tell their story.\nTo learn more about the Children's Home Society, visit www.chsva.org [chsva.org] or call 804-353-0191."}, {"url": "https://www.wric.com/news/crime/1-seriously-injured-in-richmond-shooting/", "title": "Man seriously injured in Mosby Court shooting", "authors": ["Maggie Rhoads", "Nexstar Media Wire", "Malik Lennon", "Wric Newsroom"], "date": "2019-11-30", "keywords": ["man", "mosby", "va", "taken", "seriously", "updates", "underwaystay", "richmond", "wric", "shooting", "suspect", "injured", "street", "court"], "summary": "Richmond, Va. (WRIC) — A man is in critical condition following a shooting in Mosby Court Friday night.\nRichmond Police said they responded to Coalter Street around 9:20 p.m.\nThe man was taken to the hospital with life-threatening injuries.\nThere is no suspect information at this time, police said.\nStay with us for updates."}, {"url": "https://www.nbc12.com/2019/11/25/police-looking-man-connected-richmond-robberies/", "title": "Police arrest man accused of 3 Richmond robberies", "authors": ["Published At Pm"], "date": "2019-11-25", "keywords": ["accused", "man", "jimmy", "robberies", "westover", "johns", "happened", "hills", "richmond", "gone", "nov", "stop", "street", "arrest", "w"], "summary": "The first happened at the Jimmy John’s on W Cary Street around 9 p.m. on Nov. 24.\nBland is then believed to have gone to the Fasmart on Westover Hills Boulevard around 9:40 p.m. His last stop was at the 7-Eleven on Broad Street around 12:15 a.m. Monday."}, {"url": "https://www.wric.com/news/local-news/great-8-weekend-events-richmond-marathon-mini-greek-festival-t-rex-run-and-more/", "title": "Great 8 Weekend Events: Richmond Marathon, Mini greek festival, T. Rex run and more", "authors": ["Kirk Nawrotzky", "Laura Perrot", "Ben Dennis"], "date": "2019-11-15", "keywords": ["weekend", "mini", "vintage", "point", "greek", "great", "festival", "run", "events", "16", "stony", "pmcost", "richmond", "free", "marathon", "rex"], "summary": "8News has put together a list of upcoming events this weekend you can try in the area.\nVCU Health Richmond MarathonThe 42nd running of the VCU Health Richmond Marathon is Saturday, along with the Markel Richmond Half Marathon and Allianz Partners 8K.\nWhere: Marathon starting line at 5th and Grace StreetsWhen: November 16, 8K at 7 p.m., Half Marathon at 7:30 a.m., Marathon at 7:45 a.m.\n2nd Annual Stony Point Beer FestivalGet your drink on at the second annual Stony Point Beer Festival.\nCost: $10Second Annual Richmond T. Rex RunJoin the Richmond Road Runners Club to mark the end of Richmond Marathon Weekend, as they try to set the Guinness World Record for the largest gather of people dressed as dinosaurs."}, {"url": "https://www.nbc12.com/2019/11/19/meteor-shower-outburst-possible-thursday-evening/", "title": "Meteor shower outburst possible Thursday evening", "authors": ["Nick Russo", "Published April", "At Pm", "At Am"], "date": "2019-11-19", "keywords": ["recently", "produced", "meteor", "possible", "hour", "rates", "evening", "shower", "outburst", "seconds", "spectacular", "outbursts", "meteors"], "summary": "However, in outburst years (this has happened most recently in 1995 and 1985) the shower is known to be a spectacular show with rates of 400 to 700 meteors per hour.\nIn fact, there were outbursts from this meteor shower in 1925 and 1935 which produced more than 1,000 meteors per hour.\nThat equates to 1 meteor every few seconds."}, {"url": "https://www.nbc12.com/2019/11/25/winter-outlook-/", "title": "Virginia’s winter outlook for 2019-2020 expected to be relatively mild", "authors": ["Jim Duncan", "Published April", "At Pm", "At Am"], "date": "2019-11-25", "keywords": ["winter", "outlook", "sprinkled", "expected", "20192020", "realm", "temperatures", "virginias", "zone", "trends", "mild", "soil", "wellknown", "signals", "science", "relatively"], "summary": "Winter outlooks (they are not “forecasts”, that dwell in the predicting-out-a-few-days ahead realm) are at best educated guesses sprinkled with science.\nThis winter, like most, falls into that zone, with few clear signals.\nEl Nino and La Nina are predicted to be neutral through the winter, but there are other considerations beyond those “well-known” ones, including ocean temperatures in other areas of the Pacific and Atlantic, soil moisture content, and our late-Fall global pattern trends."}, {"url": "https://wtvr.com/2019/12/25/1-killed-3-shot-in-richmonds-shockoe-bottom-christmas-shooting/", "title": "Deadly shooting outside Richmond restaurant Christmas morning", "authors": [], "date": "2019-12-25", "keywords": ["victims", "man", "sources", "shooter", "restaurant", "shot", "outside", "information", "morning", "richmond", "shooting", "deadly", "witnesses", "guard", "christmas"], "summary": "RICHMOND, Va. - Four people were shot and at least one person was killed outside a Shockoe Bottom restaurant early Christmas morning in Richmond.\nThe shooter, according to witnesses, was in line to get into the restaurant.\nOne of the shooting victims was pronounced dead at the scene.\nTwo other shooting victims were hurt, but were expected to survive the shooting.\nThose sources also said the shooting stemmed from an earlier altercation inside the restaurant."}, {"url": "https://decider.com/2020/04/15/the-innocence-files-netflix-cases/", "title": "‘The Innocence Files’ on Netflix: Your Guide to All 8 Cases", "authors": [], "date": "2020-04-15", "keywords": ["dna", "netflix", "windowclick", "case", "cases", "docuseries", "guide", "carrillo", "innocence", "files", "sarpy", "witnesses", "haynesworths", "share", "opens"], "summary": "Where to Stream: The Innocence Files Powered by ReelgoodIn its latest true crime installment, Netflix isn’t shining an accusatory light on a possible murderer or suspicious criminal.\nInstead, The Innocence Files targets the United States criminal justice system itself.\nAs thrilling and surprisingly uplifting as The Innocence Files and its exonerated cases are, each episode gives a lot of information in a very short amount of time.\nIf you’re looking for a relatively quick guide to the eight major cases in this docuseries scroll down.\nThat’s when it was discovered that Haynesworth’s DNA did not match the crime that landed him in prison."}, {"url": "https://patch.com/illinois/downersgrove/carmax-launches-contactless-curbside-pickup", "title": "CarMax launches contactless curbside pickup", "authors": [], "date": "2020-04-16", "keywords": ["curbside", "cars", "purchase", "experience", "used", "carmax", "vehicle", "providing", "customers", "car", "launches", "contactless", "pickup", "vehicles"], "summary": "RICHMOND, Virginia (April 14, 2020) – CarMax, Inc. (NYSE: KMX), the nation's largest retailer of used cars, today announced new customer offerings amid the COVID-19 pandemic.\nThat's why CarMax is enhancing its online shopping capabilities to include socially distanced and contactless curbside pickup at most open stores nationwide.\nCarMax also continues to offer home delivery at many open locations, where customers can complete the entire car-buying experience from home and have the vehicle delivered by a CarMax associate.\nThe new CarMax Cubside enables customers to complete the car buying and selling experience while adhering to social distancing practices.\nAbout CarMaxCarMax, the nation's largest retailer of used cars, revolutionized the automotive retail industry by driving integrity, honesty and transparency in every interaction."}, {"url": "https://nmstatesports.com/news/2020/4/14/football-aggies-ink-five-more-signees-for-2020.aspx", "title": "Aggies Ink Five More Signees for 2020", "authors": [], "date": "2020-04-14", "keywords": ["aggies", "ink", "2020", "defensive", "offensive", "state", "signees", "hs", "nm", "community", "wide", "holmes", "played", "calif"], "summary": "NEW SIGNEESPREVIOUS SIGNEES++ NM State ++– Five more student-athletes, including two transfers from FBS schools, have made their commitments to play football at NM State.Defensive backs Olan Cazad Jr. and D.J.\nMcCullough, defensive tackle Darvis Holmes, offensive lineman Gabriel Preciado and tight end Anthony Roberson signed with the Aggies on Wednesday, strengthening the program's 2020 signing class.\n\"Holmes and Roberson each come to NM State from FBS programs.\nThe Imperial Beach, Calif., native spent the 2019 campaign at Southwestern CC in Chula Vista, Calif.Wednesday's additions raise NM State's group of signees to 22.\n| Coffeyville Community College6-0 | 180 | Wide ReceiverTwentynine Palms, Calif. | Saddleback College6-1 | 170 | SafetyPompano Beach, Fla. | Independence Community College6-0 | 200 | Wide ReceiverTruckee, Calif. | Truckee HS | Saddleback College6-1 | 190 | CornerbackLiberty, Mo."}, {"url": "https://nymag.com/intelligencer/2020/03/a-week-with-the-coronavirus-we-knew-it-wasnt-the-flu.html", "title": "A Week With the Coronavirus: ‘We Knew It Wasn’t the Flu’", "authors": ["Aaron Short"], "date": "2020-03-21", "keywords": ["fever", "going", "things", "positive", "knew", "symptoms", "told", "york", "flu", "tested", "week", "wasnt", "started", "coronavirus", "thats"], "summary": "Fauquet, 37, had been in his Lexington Avenue office at the same time as another person who later tested positive for the coronavirus.\nHis office was at 575 Lexington and a recent article in the Daily News said that someone in the building tested positive.\nHe did not work in the WeWork where someone has tested positive.\nThere’s no real way of knowing how I got it, but he started showing symptoms first on March 12.\nWe didn’t have any at the time — that’s the big thing they’re looking for — but they got worse as the week went on."}, {"url": "https://wtvr.com/2019/12/16/bronny-james-sierra-canyon-headline-above-the-rim-classic-in-richmond/", "title": "Bronny James, Sierra Canyon headline Above the Rim Classic in Richmond", "authors": [], "date": "2019-12-16", "keywords": ["rim", "petersburg", "headline", "james", "great", "lawson", "high", "richmond", "canyon", "classic", "son", "bronny", "sierra", "marshall", "school", "play"], "summary": "RICHMOND, Va. -- Sierra Canyon, headlined by Bronny James, son of LeBron James, will be in Richmond over the weekend for a game against the John Marshall Justices in the Above the Rim Classic.\nThe high school basketball classic will showcase some of the greatest high school basketball players and teams in Virginia, California, and the District of Columbia.\nVirginia will be heavily represented by Petersburg, Henrico, Matoaca, Louisa County, and John Marshall High Schools.\nSierra Canyon from Chatsworth, California will represent a stiff test for John Marshall as the Trailblazers are ranked No.\nThe highly anticipated high school basketball event sold out more than 5,000 tickets in only nine hours."}, {"url": "https://www.nbc12.com/2019/12/09/news-know-dec-flu-is-widespread-virginia-nd-amendment-rally-richmond-today-distracted-driving-crackdown-vote-expected/", "title": "News to Know for Dec. 9: Flu is widespread in Virginia; 2nd Amendment rally in Richmond today; Distracted driving crackdown vote expected", "authors": ["Published At Pm"], "date": "2019-12-09", "keywords": ["rally", "flu", "virginia", "know", "expected", "stripped", "tampering", "russian", "wada", "widespread", "today", "vote", "world", "sanctions", "richmond", "driving", "tests", "ruling", "slate", "russias"], "summary": "Russia’s hosting of world championships in Olympic sports also faces being stripped after the WADA executive committee approved a full slate of recommended sanctions for tampering with a Moscow laboratory database.\nRussian athletes will be allowed to compete in major events only if they are not implicated in positive doping tests or their data was not manipulated, according to the WADA ruling."}, {"url": "https://wtvr.com/2019/12/11/richmond-ballets-the-nutcracker-blessing-of-the-animals/", "title": "Richmond Ballet’s The Nutcracker & Blessing of the Animals", "authors": [], "date": "2019-12-11", "keywords": ["tea", "va", "13", "ballets", "shockoe", "richmond", "1pm", "animals", "blessing", "working", "pets", "nutcracker"], "summary": "RICHMOND, Va.– Richmond Ballet’s The Nutcracker with Richmond Symphony at Dominion Energy Center, 600 East Grace Street, Richmond, December 13 through December 23.\nStoner Winslett celebrates her 40th season as Artistic Director staging her acclaimed version of The Nutcracker.\nThe Blessing performed by Reverend Karen Thompson of Thompson’s Border Collies will be at Shockoe Slip Fountain (Morgan Fountain) in front of The Martin Agency (1 Shockoe Plaza, Richmond, Va.\nThe event recognizes working animals and celebrates the joy of companion animals so deck Your Dogs with Bows and Holly.\nGifts of pet food will be collected and donated to Richmond Animal Care and Control, and Carrots and apples are appreciated by the Police Horses."}, {"url": "https://wtvr.com/2019/12/21/monte-banks-dead-north-29th-street-homicide/", "title": "Police ID man killed in Richmond shooting", "authors": [], "date": "2019-12-21", "keywords": ["man", "block", "id", "crime", "shot", "information", "stoppers", "north", "29th", "2000", "richmond", "killed", "shooting", "street"], "summary": "RICHMOND, Va. -- Authorities have released the name of a man killed in a shooting in Richmond's Creighton Court neighborhood Friday night.\nOfficers were dispatched to the 2000 block of North 29th Street for a report of a person shot at 10:15 p.m., according to Richmond Police spokesperson Gene Lepley.\nWhen police arrived, they found 35-year-old Monte Banks, of the 2000 block of North 29th Street, lying on the ground, Lepley said.\nAnyone with information about this homicide is asked to call RPD Detective Anthony Coates at 804-646-0729 or contact Crime Stoppers at 804-780-1000, on-line at http://www.7801000.com or the smartphone P3 app.\nAll Crime Stoppers methods are anonymous."}, {"url": "https://insidethemagic.net/2020/04/disney-buys-26-acres-near-magic-kingdom-ba1/", "title": "Disney Buys MORE Land Near Magic Kingdom in Walt Disney World", "authors": [], "date": "2020-04-01", "keywords": ["buys", "acres", "disney", "purchase", "walt", "purchased", "magic", "kingdom", "world", "land", "near"], "summary": "This just in: Disney World has reportedly purchased even more land near Magic Kingdom, even though this is a tumultuous time for the company.\nAccording to a report released today by Orlando Business Journal, Celebration Co. — an entity related to The Walt Disney Company — bought 26.3 acres of land near Magic Kingdom on March 31.\nOrange County records show that the land purchased at the end of March 2020 is located very close to Magic Kingdom, the original Walt Disney World Resort theme park.\nDisney purchased almost 1,000 acres of land near Celebration in 2018.\nAnd then in late fall 2019, Disney purchased over 200 acres near Magic Kingdom."}, {"url": "https://wtvr.com/2019/12/11/89th-annual-richmond-nativity-pageant/", "title": "89th Annual Richmond Nativity Pageant", "authors": [], "date": "2019-12-11", "keywords": ["va", "sponsored", "annual", "talk", "richmond", "nativity", "wwwrichmondnativitypageantcom", "temple", "soon", "visiting", "pageant", "89th"], "summary": "RICHMOND, Va. – The Richmond Nativity Pageant returns soon and this year, the show has a new, indoor location - Scottish Rite Temple, which is located at 4204 Hermitage Road.\nPaige Quilter, Director of the Pageant, is with us this morning to talk about the 89th Annual Pageant.\nThis free event will take place on December 22 at 7 pm and will feature a cast and crew of over 200 people.\nLearn more about the Richmond Nativity Pageant by visiting www.richmondnativitypageant.com or call 804-355-3800.\n{THIS SEGMENT IS SPONSORED BY THE RICHMOND NATIVITY PAGEANT}"}, {"url": "https://wtvr.com/2019/11/19/rumors-of-war-vmfa/", "title": "Rumors of War celebration in Richmond on December 10", "authors": [], "date": "2019-11-19", "keywords": ["vmfa", "rumors", "war", "sculpture", "american", "yes", "celebration", "say", "richmond", "wileys", "virginia"], "summary": "RICHMOND, Va. — The Virginia Museum of Fine Arts (VMFA) announced it would “celebrate the permanent installation of Kehinde Wiley’s sculpture Rumors of War” on December 10.\n“Mounted proudly on its large stone pedestal, Rumors of War is the artist’s direct response to the ubiquitous Confederate sculptures that populate the United States, particularly in the American South,” a VMFA spokesperson said.\nWe creative people create more…And today we say yes to something that looks like us.\nWe say yes to inclusivity.\nWe say yes to broader notions of what it means to be an American.”"}, {"url": "https://www.timesfreepress.com/news/politics/story/2019/dec/13/panel-calls-virginia-purge-dozens-old-racist-laws/510606/", "title": "Panel calls for Virginia to purge dozens of old racist laws from official legal record", "authors": ["Sarah Rankin", "Associated Press"], "date": "2019-12-13", "keywords": ["report", "law", "purge", "dozens", "states", "official", "panel", "record", "old", "commission", "richmond", "laws", "legislative", "racist", "northam", "work", "legal", "virginia"], "summary": "RICHMOND, Va. (AP) — The laws are still on the books in Virginia: Blacks and whites must sit in separate rail cars.\nThe measures have not been enforced for decades, but they remain in the state's official legal record.\nThe commission, which issued an interim report Thursday and will continue its work, said the laws should be repealed in the legislative session that begins in January.\nRalph Northam pledged to work with fellow Democrats who will control the General Assembly to do so.\nThe commission planned to continue its \"careful and deliberate review\" and would \"await orderly judicial or legislative actions,\" the report said."}, {"url": "https://www.nbc12.com/2019/11/14/holiday-happenings-central-virginia/", "title": "2019 holiday happenings in Central Virginia", "authors": ["Published Am At Am"], "date": "2019-11-14", "keywords": ["theatre", "snowman", "naughty", "missing", "ivan", "holiday", "2019", "central", "list", "nice", "swift", "private", "happenings", "info", "virginia"], "summary": "Drifty’s Naughty or Nice List: The Naughty or Nice List is missing but Private Ivan Einstein is on the case, and Drifty the Snowman gets to help.\nMore info on the show at Swift Creek Mill Theatre >"}, {"url": "https://www.nbc12.com/2019/12/04/richmond-joins-global-climate-strike-dec/", "title": "Richmond joins Dec. 6 Global Climate Strike", "authors": ["Adrianna Hargrove", "Published At Pm"], "date": "2019-12-04", "keywords": ["park", "climate", "strike", "monroe", "source", "joins", "gather", "state", "cason", "dec", "strikers", "global", "richmond", "patricia"], "summary": "Strikers will gather Dec. 6 in Monroe Park at 1 p.m and will march to the State Capitol at 1:30 p.m.\nThe strike will then begin at 2 p.m at the belltower.\n(Source: Patricia Cason)"}, {"url": "https://wtvr.com/2019/12/27/richmond-restaurant-owner-shares-message-following-fatal-christmas-shooting/", "title": "Richmond restaurant owner shares message following fatal Christmas shooting", "authors": [], "date": "2019-12-27", "keywords": ["fatal", "message", "restaurant", "investigation", "wing", "abc", "virginia", "violence", "richmond", "shooting", "following", "bar", "guard", "shares", "christmas", "owner"], "summary": "RICHMOND, Va. -- The owner of Wing Bar in Richmond said he remained shaken after a shooting inside his restaurant early Christmas morning.\n\"I send my prayers out to everybody, all of the families and say that Wing Bar is here for any of y'all.\"\nThe shooting, according to Crime Insider sources, stemmed from an earlier altercation inside the restaurant.\nWing Bar had its Virginia ABC license suspended Friday.\nVirginia ABC said it believed that there was a \"continued threat to public safety\" at the restaurant."}, {"url": "https://www.wric.com/news/local-news/richmond/2-richmond-shootings-in-30-minute-span-leave-3-injured/", "title": "2 Richmond shootings in 30-minute span leave 3 injured", "authors": ["Ben Dennis", "Keyris Manzanares", "Dean Mirshahi", "Nick Conigliaro"], "date": "2019-12-11", "keywords": ["located", "minutes", "block", "hospital", "taken", "shootings", "leave", "officers", "richmond", "span", "shooting", "injured", "street", "30minute"], "summary": "RICHMOND, Va. (WRIC) — Three people were shot in two separate shootings that occurred within a span of 30 minutes on Tuesday night, according to Richmond Police.\nAccording to officers, the first shooting happened around 7:50 p.m. in the area of the 2500 block of Whitcomb Street.\nAn adult male was located and taken to the hospital with non-life threatening injuries.\nThirty minutes later, officers were called to the first block of E. 12th Street for a double shooting.\nThere is no suspect information for both shootings at this time, according to police."}, {"url": "https://wtvr.com/2019/12/26/2019-capital-city-kwanzaa-festival/", "title": "2019 Capital City Kwanzaa Festival", "authors": [], "date": "2019-12-26", "keywords": ["society", "folklore", "elegba", "festival", "cultural", "city", "door5", "2019", "richmond", "capital", "kwanzaa"], "summary": "RICHMOND, Va.--2019 Capital City Kwanzaa FestivalSaturday, December 28, 2019, 1:00 p.m. - 8:00 p.m.Martin Luther King, Jr. Middle School, 1000 Mosby Street Richmond,Kwanzaa is celebrated from December 26, 2019, through January 1, 2020, and the Capital City Kwanzaa Festival is sponsored by Richmond's Cultural Ambassador, The Elegba Folklore Society, a not-for-profit cultural arts and education organization, with the city of Richmond, Dominion, Wells Fargo, CBS 6 and Radio One Richmond with Culture Works and the Arts & Cultural Funding Consortium.\nThe festival features OSHUN, Dr. Runoko Rashidi, Tunji Band, Elegba Folklore Society Dancers and Drummers, Happiness Dance Studio, The African Market, Nia Sessions, and Watoto Kwanzaa.\n$7, Door.$5 Students (12-18) & Seniors (65+), Advance.\n$6, Door.$5 Group Rates, 10 or more.\nFor more information call 804-644-3900 or visit http://efsinc.org"}, {"url": "https://wtvr.com/2019/12/20/weekend-events-miracle-of-christmas-live-at-the-zoo-richmond-nativity-pageant/", "title": "Weekend Events: Miracle of Christmas-Live at the Zoo, Richmond Nativity Pageant", "authors": [], "date": "2019-12-20", "keywords": ["santa", "weekend", "lights", "visit", "information", "events", "dec", "richmond", "nativity", "zoo", "christmaslive", "free", "street", "miracle", "pageant", "toy"], "summary": "The 2019 pageant will be Overflow parking is available at Grange Hall Elementary School with free shuttle service to the zoo.\nRichmond Nativity Pageant Sunday, Dec. 22, 7pmThe annual Richmond Nativity Pageant returns this year, at a new, indoor location – The Scottish Rite Temple, at 4202 Hermitage Road in Richmond.\nFor more about the Richmond Nativity Pageant by visiting www.richmondnativitypageant.com or call 804-355-3800.\nLegendary Santa at the Children’s Museum of Richmond through Tuesday, Dec. 24, 2626 W. Broad Street in Richmond, a Richmond legend for the entire family can see.\nThe toy drive will be held at the Pig & Brew Restaurant location 1313 Hull Street, Richmond."}, {"url": "https://www.wric.com/community/rva-illuminates-event-will-light-up-city-sky-for-holiday-season/", "title": "Join 8News for ‘RVA Illuminates’ at Kanawha Plaza", "authors": ["Wric Newsroom", "Keyris Manzanares", "Amelia Heymann", "Michael Stern"], "date": "2019-12-05", "keywords": ["market", "park", "plaza", "illuminates", "kanawha", "8news", "event", "parking", "fun", "open", "richmond", "rva", "join"], "summary": "RICHMOND, Va. (WRIC) — Formerly known as the Grand Illumination, this year the City of Richmond is in charge of newly-named ‘RVA Illuminates.’The same event that you’ve loved for years is back TONIGHT — Friday, December 6th — at a new location: Kanawha Plaza!\nAll of the parking decks from previous years are still open, and this year there will be a shuttle provided by GRTC.\nThere will be free parking and shuttles to and from Kanawha Plaza at City Stadium and a second stop near Byrd Park behind John B. Cary Elementary at Reuger’s Playground.\nThe fun will be going on simultaneously, and you can see Santa, hear more music, and have more fun at the 17th Street Market.\nWATCH: Richmond special events manager talks ‘RVA Illuminates’"}, {"url": "https://wtvr.com/2019/12/10/the-nutcracker-presented-by-richmond-ballet/", "title": "“The Nutcracker” Presented by Richmond Ballet", "authors": [], "date": "2019-12-10", "keywords": ["va", "visit", "st", "sponsored", "ballet", "wwwrichmondballetcomthis", "richmond", "presented", "segment", "virginia", "nutcracker"], "summary": "RICHMOND, Va. – Emily Morgan, Costume Director for the Richmond Ballet, give us a behind the scenes look at The Nutcracker, its costumes, and the choreography of their backstage operations.\nThe Nutcracker will play at the Dominion Energy Center for the Performing Arts on 600 E Grade St., Richmond, Virginia on December 13 – 23.\nFor additional information, call 804-344-0906 or visit www.richmondballet.com.\n{THIS SEGMENT IS SPONSORED BY THE RICHMOND BALLET}"}, {"url": "https://wtvr.com/2019/12/10/wednesday-am-snow/", "title": "Snow arrives in Virginia early Wednesday morning", "authors": [], "date": "2019-12-10", "keywords": ["eat", "snow", "way", "early", "morning", "richmond", "wet", "arrives", "area", "virginiathe", "rain", "virginia", "cold"], "summary": "RICHMOND, Va. -- Rain will increase Tuesday night, becoming moderate to heavy at times, as an Arctic cold front moves into Virginia.\nThe rain will change to snow from northwest to southeast as the colder air makes its way through the area.\nThe changeover will occur in the Richmond area around 3:30 a.m., with wet snow continuing until around 8 a.m.\nThe snow will melt on contact initially, but could cover the grassy surfaces and result in a few slick spots on area roads for the morning commute.\nSkies will rapidly clear Wednesday morning, with mostly sunny and cold conditions for the rest of the day."}, {"url": "https://wtvr.com/2019/12/20/police-seek-witnesses-in-richmond-hit-and-run/", "title": "Police seek witnesses in Richmond hit-and-run that left man severely injured", "authors": [], "date": "2019-12-20", "keywords": ["crash", "man", "severely", "rock", "hitandrun", "drago", "vehicle", "stoppers", "seek", "injured", "richmond", "say", "804", "witnesses", "east", "left"], "summary": "RICHMOND, Va. – Richmond Police are seeking anyone who witnessed a hit-and-run crash last week that left a man critically injured.\nPolice believe the crash occurred sometime between 10:30 p.m. and 11:15 p.m. on December 13.\nPolice say a 64-year-old man was hit by a vehicle in the 3900 block of East Broad Rock Road in South Richmond.\nThe victim was found lying on the corner of McGuire Drive and East Broad Rock Road.\nThe Richmond Police Department’s Special Operations Division-Traffic Crash Team is investigating the crash."}, {"url": "https://wtkr.com/2019/12/26/virginia-state-police-reports-9-traffic-deaths-in-5-days-on-virginia-highways/amp/", "title": "Virginia State Police reports 9 traffic deaths in 5 days on Virginia highways", "authors": [], "date": "2019-12-26", "keywords": ["crashes", "crash", "drivers", "traffic", "state", "days", "virginias", "highways", "deaths", "rockingham", "richmond", "safe", "reports", "virginia"], "summary": "Between Saturday, December 21 and Wednesday, December 25, nine people lost their lives in six crashes on Virginia’s highways.\nThe six reported crashes occurred in Goochland, Loudoun, Richmond and Rockingham counties and the cities of Chesapeake and Newport News.\nThe state police are reminding all drivers to be alert and drive distraction-free at all times while behind the wheel.\nYear to date, preliminary data reports 800 adults, teenagers and children have been killed in traffic crashes across Virginia.\nAlert and safe drivers can help keep this number from increasing within the final days of 2019."}, {"url": "https://wtvr.com/2019/12/01/central-virginias-december-outlook/", "title": "First look at Christmas Parade forecast; December weather outlook", "authors": [], "date": "2019-12-01", "keywords": ["outlook", "little", "precipitation", "forecast", "temperatures", "parade", "month", "week", "look", "richmond", "weather", "christmas", "near", "normal"], "summary": "RICHMOND, Va. -- November temperatures ended up a little over 4 degrees below normal.\nOur first week of December will have near or slightly below normal temperatures.\nWhile we will still have some cold weather this month, extended computer models are showing a milder trend as the month wears on.\nDecember's temperature outlook from the National Weather Service has a large portion of the country with temperatures averaging above normal.\nThe precipitation outlook for our area is near normal, but the potential for above-normal values are just to our northwest."}, {"url": "https://richmondbizsense.com/2019/12/23/riding-high-richmonds-commercial-development-year-in-review-for-2019/", "title": "Riding high: Richmond’s commercial development year in review for 2019", "authors": ["J. Elias O'Neal"], "date": "2019-12-23", "keywords": ["hotel", "st", "building", "center", "data", "high", "project", "development", "commercial", "review", "riding", "2019", "million", "square", "construction", "richmonds"], "summary": "From apartments to data centers to hotels, the region’s commercial development market experienced exceptional growth across many sectors in 2019.\nHenrico data center growthHenrico County has become one of the state’s fastest-growing areas for data center development, a trend that continued throughout 2019, particularly in the county’s White Oak Technology Park.\nThe new, larger plan calls for construction of 1.1 million square feet.\nBetween its eastern campus expansion and Project Isaac, QTS is set to deliver about 2.3 million square feet of new data center space to the area.\nThe $175 million project would create 700 full-time jobs, 140 or so of which would be executive-level positions."}, {"url": "https://wtvr.com/2019/12/03/ashley-berry-family-speaks/", "title": "Richmond firefighter killed protecting son: ‘Her last act of love’", "authors": [], "date": "2019-12-03", "keywords": ["va", "protecting", "hopewell", "shot", "act", "berry", "richmond", "killed", "firefighter", "son", "love", "street", "berrys", "thing", "lt"], "summary": "RICHMOND, Va. -- Richmond Fire Lt. Ashley Nicole Berry was protecting her young son from gunfire when she was shot and killed in Hopewell on Thanksgiving night, family members disclosed in a Tuesday morning press conference.\nShe was there with her son,\" Berry's father Waverly Berry said.\n\"A public viewing will be held for Lt. Berry on Friday, December 6, 2019 at Mimms Funeral Home.\nDonations will be accepted at either Richmond Fire Police Credit Union locations (900 Hermitage Road or 200 W. Grace Street, Richmond, Virginia, 23220), telephone 804-354-0673.\nPublic VigilThursday December 5, 2019Huguenot High School7945 Forest Hill Avenue, Richmond, VA 232255:30 p.m. - 7 p.m.Public ViewingFriday, December 6, 2019Mimms Funeral Home1827 Hull Street, Richmond, VA 232249 a.m. - 8 p.m.Celebration of Life CeremonySaturday, December 7, 2019Second Baptist Church300 Broad Rock Boulevard, Richmond, VA 23234Noon"}, {"url": "https://theblackwallsttimes.com/2019/12/12/richmond-gets-a-new-soaring-statue-this-one-with-hair-locks/", "title": "Richmond gets a new soaring statue, this one with hair-locks", "authors": ["The Black Wall St Times"], "date": "2019-12-12", "keywords": ["hairlocks", "rumors", "gets", "war", "black", "soaring", "statue", "sculpture", "city", "richmond", "monument", "confederate", "virginia"], "summary": "The statue titled Rumor’s of War by artist Kehinde Wiley gets fully unveiled after the tarp covering the statue got stuck for a while at the Virginia Museum of Fine Arts in Richmond, Va., Tuesday, Dec. 10, 2019.\n“Rumors of War” was Wiley’s response to the Confederate monuments that pepper the U.S. and the South in particular.\nHe said he was inspired to create “Rumors of War” after seeing a massive equestrian monument honoring Confederate Gen. J.E.B.\nAdvertisementsBoth the Stuart statue and “Rumors of War” feature horses in virtually the same pose, with one front leg lifted.\n(AP Photo/Steve Helber)Richmond’s mayor told the crowd the statue shows the city that is moving on from its past."}, {"url": "https://www.nbc12.com/2019/12/30/shootings-richmond-up-percent-rpd-continues-arrests-high-profiles-cases/", "title": "Shootings in Richmond up 32% in 2019; RPD continues arrests in high-profiles cases", "authors": ["Kelly Avellino", "Published At Pm"], "date": "2019-12-30", "keywords": ["rpd", "need", "know", "whitfield", "suspects", "continues", "live", "highprofiles", "remember", "32", "2019", "lives", "killing", "arrests", "cases", "took", "shootings", "richmond", "markiya"], "summary": "“I want (the suspects charged with killing Markiya) to remember every day her name,” said Whitfield.\n“I want them to see her face when they close their eyes.\nThey need to know what they took from us.\nOur lives will never be the same.\nWe have to live with this until we are dead and gone.”"}, {"url": "https://wtvr.com/2019/12/17/lauryn-hill-coming-to-richmond-in-march-2020/", "title": "Lauryn Hill coming to Richmond in March 2020", "authors": [], "date": "2019-12-17", "keywords": ["concert", "2020", "lauryn", "energy", "tour", "miseducation", "center", "coming", "hill", "richmond", "dominion"], "summary": "RICHMOND, Va. — Grammy-winning singer Lauryn Hill is returning to Richmond in March 2020 for a concert at the Dominion Energy Center.\nHill rose to prominence in the 1990s as a member of The Fugees.\nHill’s debut solo album The Miseducation of Lauryn Hill, released August 25, 1998, won a record breaking five Grammys Awards.\nHill’s tour stop in Richmond comes after her “The Miseducation of Lauryn Hill 20th Anniversary Tour” in 2018 and 2019.\nThe show will be held at Dominion Energy Center on Tuesday, March 3, 2020 at 8 p.m.Tickets for the concert go on sale Friday December 20 at 10 a.m.Tickets, beginning at $49.50, will be available at the Dominion Energy Center and Altria Theater box offices, DominionEnergyCenter.com, Etix.com and by phone charge at 800‐514‐ETIX (3849)."}, {"url": "https://www.nbc12.com/2019/12/13/th-annual-james-river-parade-lights-set-delight-thousands/", "title": "27th Annual James River Parade of Lights set to delight thousands", "authors": ["Victoria Doss", "Published Am At Am"], "date": "2019-12-13", "keywords": ["varinaenon", "lights", "27th", "set", "james", "delight", "parade", "annual", "city", "richmond", "thousands", "boats", "river", "bridge", "decorate"], "summary": "Boaters will decorate their boats with thousands of lights, then parade along 14-miles of river front from the City of Richmond to the Varina-Enon Bridge."}, {"url": "http://richmondfreepress.com/news/2019/dec/20/holiday-schedule/", "title": "Holiday schedule", "authors": [], "date": "2019-12-20", "keywords": ["county", "eve", "25", "officesclosed", "dec", "holiday", "day", "closed", "24", "23", "schedule", "christmas"], "summary": "In observance of Christmas, Wednesday, Dec. 25, please note the following:Government officesState and federal offices:Closed Christmas Eve, Tuesday, Dec. 24, and Christmas Day, Wednesday, Dec. 25.\nCity of Richmond offices:Closed Monday, Dec. 23, Christmas Eve, Tuesday, Dec. 24, and Christmas Day, Wednesday, Dec. 25.\nHenrico County offices:Closed Christmas Eve, Tuesday, Dec. 24, and Christmas Day, Wednesday, Dec. 25.\nChesterfield County offices: Closed Christmas Eve, Tuesday, Dec. 24, and Christmas Day, Wednesday, Dec. 25.\nGRTCBuses operate on Sunday schedule on Christmas, Wednesday, Dec. 25Banks and financial institutionsClosed Christmas Day, Wednesday, Dec. 25."}, {"url": "https://wtvr.com/2019/12/29/ring-in-2020-early-at-the-science-museum-of-virginia/", "title": "Ring in 2020 early at the Science Museum of Virginia", "authors": [], "date": "2019-12-29", "keywords": ["youth", "event", "eve", "2020", "tickets", "museum", "early", "ball", "celebrate", "children", "science", "ring", "stay", "virginia"], "summary": "RICHMOND, Va. -- Want to celebrate the new year but don't want to stay up till midnight?\n\"Noon Years Eve\" at the Science Museum of Virginia is ringing in the new year early with a family-friendly event running from 10 a.m. to 1 p.m. on Tuesday, December 31.\nNoon Year’s Eve is included in Museum admission, which is $15.50 for adults, $13.50 for youth and seniors and $10 for preschool-age children.\nThe Museum will open 30 minutes early at 9a.m.\nAfter the festivities conclude, guests may stay in the Museum to explore four floors of interactive experiences and exhibits, including the “Bionic Me” touring exhibition which will leave the Museum on Sunday, Jan. 5."}, {"url": "https://richmondbizsense.com/2019/12/31/the-bizsense-crystal-ball-things-to-watch-in-2020/", "title": "The BizSense Crystal Ball: Things to watch in 2020", "authors": ["Michael Schwartz", "Michael Dodson", "Garry Whelan", "Charles Frankenhoff", "Tim Harper", "Jeff Ensley", "Matt Faris"], "date": "2019-12-31", "keywords": ["neighborhood", "things", "2020", "continue", "ball", "watch", "city", "bizsense", "development", "interesting", "crystal", "richmond", "likely", "medical"], "summary": "Nevertheless, we polished the ol’ crystal ball well enough to give you this guide for 2020.\nWe see it less as a list of things we think will occur next year than what we think you need to watch for.\nWe’ll see what happens…CannabisStatewide discussions about the future of medical and recreational marijuana are likely to come to a head in 2020.\nSouth RichmondWe can point to Manchester, but a lot of South Richmond is hopping with activity that likely will continue in 2020.\nBrookland ParkBrookland Park is a neighborhood that’s been interesting to watch for the last couple of years and that will continue in 2020."}, {"url": "https://www.theguardian.com/us-news/2019/dec/10/richmond-virginia-kehinde-wiley-statue-confederate-monument", "title": "Virginia museum unveils Kehinde Wiley work in response to Confederate statues", "authors": ["Araceli Cruz"], "date": "2019-12-10", "keywords": ["unveils", "vmfa", "kehinde", "response", "museum", "carolina", "black", "war", "statue", "wiley", "richmond", "monument", "confederate", "south", "statues", "work", "virginia"], "summary": "The enormous statue outside the Virginia Museum of Fine Arts (VMFA) in Richmond is almost three storeys tall.\nAccording to the museum, the sculpture is a direct response to the Confederate statues that line Monument Avenue just a few blocks away.\nThe first was taken down in New Orleans as a response to a shooting at the Emanuel African Methodist Episcopal church in Charleston, South Carolina, in June 2015.\nIn June this year, the New York Times reported that some Confederate statues have been auctioned.\nLast week a Confederate monument in Nashville was vandalized, the words “They were racists” spray-painted across it."}, {"url": "https://www.nbc12.com/2020/01/28/richmond-international-airport-sees-record-number-passengers/", "title": "Richmond International Airport sees record number of passengers in 2019", "authors": ["Published At Pm"], "date": "2020-01-28", "keywords": ["airport", "going", "140", "international", "sees", "passengers", "pounds", "record", "richmond", "2019", "total", "million", "number", "saw", "cargo", "increase"], "summary": "In 2019, the airport also saw an increase in total cargo, going up by 1.0 percent to 140 million pounds."}, {"url": "https://www.nbc12.com/2020/02/18/henrico-storm-spotter-compares-weather-this-february-prior-years-difference-is-stunning/", "title": "Henrico storm spotter compares weather this February to prior years - the difference is stunning", "authors": ["Nick Russo", "Published April", "At Pm", "At Am"], "date": "2020-02-18", "keywords": ["winter", "youre", "temp", "think", "spring", "prior", "storm", "teens", "right", "henrico", "weather", "difference", "compares", "rva", "sub20f", "stunning", "recordlatest", "spotter"], "summary": "If you feel like it's been a mild winter for #RVA, you're right.\nNever before have we gone *nearly* so far into winter without recording a sub-20F temp.\nThe previous record-latest occurrence?\nWhat do you think @AndrewNBC12 - any readings in the teens before spring?\npic.twitter.com/WnswjrhPLO"}, {"url": "https://www.wric.com/news/rva-holiday-headquarters-your-guide-to-festive-events-across-central-virginia/", "title": "RVA Holiday Headquarters: Your guide to festive events across Central Virginia", "authors": ["Catherine Shelor", "Kirk Nawrotzky", "Nexstar Media Wire"], "date": "2019-11-22", "keywords": ["park", "headquarters", "tree", "events", "guide", "holiday", "parade", "festive", "pmcost", "richmond", "central", "rva", "free", "light", "christmas", "virginia", "freedec"], "summary": "RICHMOND, Va. (WRIC) — The holiday season is upon us and there is no shortage of festive events and happenings going on in and around Central Virginia.\nNov. 15 to Dec. 31– Illuminate Light Show & Santa’s VillageVisit Virginia’s largest drive-thru Christmas light show all synchronized to music.\nCost: FreeDec. 4– Prince George County Christmas Tree LightingWhere: Prince George Regional Heritage Center Lawn, 6406 Courthouse RoadWhen: 7 p.m.\nCost: $14-$35 for kids, $14-$60 for students, $20-$20 for adultsDec. 6– Louisa Christmas Tree LightingFeatures a tree lighting, musical performances, ornament decorating and more.\nCost: Free to attendDec. 7– Spotsylvania Holiday ParadeThe theme for the 41st Annual Christmas Parade is Twas the Night Before Christmas."}, {"url": "https://wtvr.com/2019/12/19/bikes-for-christ-give-away-2019/", "title": "Bikes for Christ Give-Away 2019", "authors": [], "date": "2019-12-19", "keywords": ["weekend", "worship", "va", "giveaway", "2019", "praise", "roaddonations", "church", "bike", "free", "christ", "bikes"], "summary": "RICHMOND, Va.-- Bikes for Christ Give-Away, Saturday, December 21stWorship and Praise Church in Henrico is once again offering hundreds of free bikes to kids ages 5-12 this weekend.\nTo receive a free bike, parents must register their child in advance by calling the church at 804-648-8031 between 10am and 2pm.\nThe bike giveaway is at 12 noon Dec. 21 at Worship and Praise Church 3826 Nine Mile Road.\nDonations of bikes can be made on the day of the bike give-away or by going to the campaign’s GO-FUND ME page “BIKES-FOR-CHRIST-2019”, https://www.gofundme.com/f/bikes-for-christ-2019"}, {"url": "https://www.wric.com/news/man-seriously-hurt-in-southside-richmond-shooting/", "title": "Man seriously hurt in southside Richmond shooting", "authors": ["Jake Britton", "Kirk Nawrotzky", "Nexstar Media Wire"], "date": "2019-12-30", "keywords": ["man", "va", "southside", "sure", "seriously", "shot", "hurt", "richmond", "wric", "shooting", "updateslatest", "word", "timeif", "suspect"], "summary": "RICHMOND Va., (WRIC) —- A man is seriously hurt after being shot in Richmond’s southside, Sunday night.\nRichmond Police said they were called to the 6000 block of Glenway Court around 8:40 p.m.\nWhen officers arrived they found a man who had been shot with life-threatening injuries.\nThere’s no word about a shooting suspect at this time.\nIf you know anything, give Richmond Police a call."}, {"url": "https://www.wric.com/news/crime/woman-shot-in-richmonds-southside-police-say/", "title": "25-year-old woman shot in Richmond’s southside, police say", "authors": ["Julia Heimlich", "Nexstar Media Wire", "Malik Lennon", "Wric Newsroom"], "date": "2019-12-07", "keywords": ["va", "southside", "taken", "shot", "stoppers", "25yearold", "woundthe", "updates", "woman", "say", "wric", "suffering", "suspect", "richmonds", "timeanyone"], "summary": "RICHMOND, Va. (WRIC) — A woman is recovering after a shooting last night in Richmond’s southside.\nOfficers were called to the 3000 block of Laurelbrook Drive around 10 p.m. Friday, December 6.\nWhen they arrived, they found a 25-year-old woman suffering a gunshot wound.\nThe woman was taken to the hospital and is expected to be okay.\nAnyone with information is asked to contact Crime Stoppers at 804-780-1000."}, {"url": "https://wtvr.com/2019/12/19/decemberween-returns-to-diversity-thrift-to-celebrate-new-years-eve-in-style/", "title": "‘Decemberween’ returns to Diversity Richmond to celebrate New Years Eve in style", "authors": [], "date": "2019-12-19", "keywords": ["event", "returns", "eve", "va", "arts", "decemberween", "style", "space", "annual", "diversity", "celebrate", "richmond", "community", "art", "nonprofit", "showcases"], "summary": "RICHMOND, Va. — One of Richmond’s most eccentric New Year’s Eve celebrations returns this December to ring in the new year in style (and costumes.)\nParty Liberation Front’s (PLF) annual ‘Decemberween’ event returns for 2020, bringing their annual over-the-top New Year celebration to the LGBTQ+ community center Diversity Richmond.\nThe Party Liberation Foundation, a 501(c)3 non-profit, is dedicated to cultivating a creative community by funding and facilitating art creation, art grants, art and performance education, and free public events in Richmond VA and beyond.\nDecemberween is the group’s annual fundraiser to support their efforts throughout the year.\nDiversity Richmond, the non-profit behind the community center, is a leader in the effort to create a permanent and sustainable non-profit in Richmond dedicated to serving the LGBTQ+ community, their families and allies."}, {"url": "https://wtvr.com/2019/12/18/2019-early-signing-day-in-rva/", "title": "2019 Early Signing Day in RVA", "authors": [], "date": "2019-12-18", "keywords": ["carolina", "east", "early", "college", "day", "xc", "wells", "signing", "wednesdays", "2019", "richmond", "vmi", "rva", "johnson", "williams"], "summary": "Richmond, Va. – Wednesday opened the early signing day for National Letters of Intent and a handful of schools had athletes sign scholarship offers.\nBelow is a partial list and some sights and sounds from Wednesday’s ceremoniesATLEETyler Warren – Penn State (football)Alex Oliver – VMI (Football)COLLEGIATECharles Armstrong – Middlebury College (football)Trey Boll – Wake Forest (football)Gilbert Deglau – Davidson (football)Hayden Johnson – Gettysburg College (track)Charlotte Palmore – Amherst College (lacrosse)Clay Ryan – Denison University (XC and track)Edward Sinnott – Dickinson College (lacrosse)J.D.\nSpotts – Randolph-Macon (lacrosse)Quin Timmerman – Furman (lacrosse)Nigel Williams – Northwestern (football)DINWIDDIED’Anta Johnson – East Carolina (football)HIGHLAND SPRINGSMalcolm Greene – Clemson (football)A.J.\nWells – JMU (football)Suirad Ware – East Carolina (football)Evan Robinson – VMI (football)Daytione Smith – Marshall (football)THOMAS DALEChris Tyree – Notre Dame (football)Jasiah Williams – Richmond (football)Cole Garrett – VMI (baseball)Max Trias – LaSalle (swimming)Jacob Craig – Charleston (volleyball)"}, {"url": "https://www.wric.com/news/local-news/henrico-county/child-critically-injured-in-henrico-shooting-police-say/", "title": "Investigators search for clues after 2-year-old critically injured in Henrico County shooting", "authors": ["Amy Simpson", "Alonzo Small", "Amelia Heymann", "Ben Dennis", "Keyris Manzanares"], "date": "2019-12-11", "keywords": ["county", "investigators", "2yearold", "8news", "told", "tips", "clues", "shot", "shots", "henrico", "critically", "shooting", "winston", "injured", "street", "search"], "summary": "HENRICO COUNTY, Va. (WRIC) — A two-year-old remains in critical condition following a shooting in Henrico County Tuesday night.\nPhoto of 2-year-old Lavier (Photo: GoFundMe)On Wednesday, investigators returned to the scene to scour for clues.\nThe Winston Street home was visibly riddled with bullets and the back window of a car was shot out next door.\nThat’s an innocent baby.”Several neighbors told 8News the 2-year-old, Lavier, is a twin.\nOne neighbor told 8News they saw a car pull up moments before the shots rang out."}, {"url": "https://www.wric.com/news/man-shot-on-richmonds-southside-hour-after-gas-station-shooting/", "title": "Man in critical condition after being shot in the head, police say", "authors": ["Tyra Whitney", "Kirk Nawrotzky", "Nexstar Media Wire"], "date": "2019-12-01", "keywords": ["head", "man", "va", "condition", "taken", "shot", "went", "westover", "updates", "richmond", "say", "wric", "wound", "suffering", "word", "critical"], "summary": "RICHMOND Va (WRIC) — Richmond police are investigating a second shooting on the City’s Southside.\nOfficers went to the 400 block of Westover Hills Boulevard around 3 Sunday Afternoon.\nPolice found a man suffering from a gunshot wound.\nHe was taken to the hospital with life-threatening injuries.\nNo word yet on if any of the Southside shootings are related."}, {"url": "https://richmondbizsense.com/2019/12/27/open-house-the-highest-priced-home-sales-of-2019/", "title": "Open House: The highest-priced home sales of 2019", "authors": ["Jonathan Spiers", "Robert A. Steele", "Charles Frankenhoff", "Garry Whelan"], "date": "2019-12-27", "keywords": ["sale", "sales", "house", "represented", "road", "open", "2019", "listed", "highestpriced", "million", "richmond", "river", "price", "listing"], "summary": "(tie) 6337 Ridgeway Road, Richmond – $1.75 millionThe nearly 80-year-old, 5,000-square-foot Dutch Colonial facing the seventh fairway of the Country Club of Virginia topped September sales.\nTiffany Stevens with Coach House Realty listed the five-bedroom, 5½-bathroom home, while Chris Small with Small & Associates represented the buyer.\n4309 Cambridge Road, Richmond – $1.9 millionThe 5,600-square-foot colonial in Richmond’s Windsor Farms sold above its May list price of $1.59 million.\nTotaling 6,700 square feet on 3 acres, the four-bedroom, 5½-bathroom house was listed by Jamie Younger with Virginia Properties Long & Foster.\n2421 River Road W., Goochland – $3.1 millionThe 16,000-square-foot River Run Manor went under contract in June after nearly five years as the priciest listing in the region."}, {"url": "https://www.nbc12.com/2019/12/04/street-closures-no-parking-zones-announced-dominion-energy-christmas-parade/", "title": "Street closures, no parking zones announced for 2019 Dominion Energy Christmas Parade", "authors": ["Published April", "At Pm"], "date": "2019-12-04", "keywords": ["closures", "energy", "museum", "parking", "science", "expected", "parade", "announced", "zones", "2019", "proceed", "dominion", "organizers", "seventh", "street", "east", "christmas", "virginia"], "summary": "The parade will begin at 10 a.m at the Science Museum of Virginia and proceed east on Broad Street toward Seventh Street.\nAccording to parade organizers, 100k people are expected to attend the parade."}, {"url": "https://wtvr.com/2019/12/07/watch-richmond-christmas-parade-2019/", "title": "🎄Watch Dominion Energy Christmas Parade on CBS 6 and WTVR.com", "authors": [], "date": "2019-12-07", "keywords": ["energy", "parade", "wtvrcom", "watch", "cbs", "serve", "richmond", "thousands", "dominion", "paul", "christmas", "richmonds"], "summary": "WATCH LIVE: Click here to watch the Dominion Energy Christmas ParadeRICHMOND, Va. — One of Richmond’s most notable living veterans will lead off the 36th annual Dominion Energy Christmas Parade on Broad Street in Richmond Saturday morning.\n“We’re excited to announce that Commander Paul Galanti will serve as this year’s grand marshal at the Dominion Energy Christmas Parade.\nThe Dominion Energy Christmas Parade is open to the public and free for all spectators.\n“We’re honored to sponsor Richmond’s premier Christmas parade for the tenth year,” Dominion Energy Charitable Foundation President Hunter A. Applewhite said.\nThe parade will also be rebroadcast on CBS 6 from 9 a.m. to 11 a.m. on Christmas Day."}, {"url": "https://wtkr.com/2020/01/21/virginia-gun-sales-dramatically-increase-in-2019-i-didnt-think-i-would-ever-be-buying-one/", "title": "Virginia gun sales dramatically increase in 2019: ‘I didn’t think I would ever be buying one’", "authors": [], "date": "2020-01-21", "keywords": ["proposed", "going", "sales", "didnt", "think", "buying", "dramatically", "wright", "bills", "gun", "virginia", "hill", "stauffer", "protect", "2019", "laws", "increase"], "summary": "RICHMOND, Va. (WTVR) - 66-year-old Ida Wright decided today was the day she was going to buy her first hand gun.\n“I didn’t think I would ever be buying a gun, but things are changing so drastically,” Wright says.\nStores like Southern Gun World in Chesterfield County say gun sales have drastically increased over the past few weeks.\n“They were motivated.”According to statistics, December gun sales totaled nearly 74 thousand, a 47% increase over sales in December 2018.\nHill says the proposed bills are providing incentives for gun owners to take action."}, {"url": "https://www.nbc12.com/2019/12/21/health-officials-investigating-potential-measles-exposures-central-virginia-richmond-airport/", "title": "Health Officials investigating potential measles exposures in Central Virginia, Richmond Airport", "authors": ["Brian Thompson", "Published At Pm"], "date": "2019-12-21", "keywords": ["potential", "central", "measles", "virginia", "spreads", "second", "exposures", "investigating", "appear", "airport", "officials", "symptoms", "usually", "stages", "watery", "seventh", "health", "richmond", "begins", "stage"], "summary": "Measles symptoms usually appear in two stages.\nIn the first stage, most people have a fever of greater than 101 degrees, runny nose, watery red eyes and a cough.\nThe second stage begins around the third to seventh day when a rash begins to appear on the face and spreads over the entire body."}, {"url": "https://www.nbc12.com/2019/12/17/vdh-more-than-flu-related-deaths-virginia/", "title": "VDH: More than 250 flu-related deaths in Virginia", "authors": ["Published At Pm"], "date": "2019-12-17", "keywords": ["151", "state", "peak", "deaths", "week", "vdh", "season", "flurelated", "high", "number", "91", "250", "virginia"], "summary": "In the first week of December, there were 151 flu-related deaths in the state.\nLast year, there were no more than 91 flu-related deaths in a week and that high number was during the peak of the season."}, {"url": "https://www.nbc12.com/2019/12/26/this-day-richmond-theater-burns-killing-more-than-people-including-virginias-governor/", "title": "On This Day: Richmond Theater burns, killing more than 70 people including Virginia’s Governor", "authors": ["Rachel Depompa", "Published At Pm"], "date": "2019-12-26", "keywords": ["listen", "heroes", "including", "virginias", "day", "weeks", "save", "learn", "richmond", "killing", "burns", "70", "risked", "governor", "lives", "theater", "podcast"], "summary": "To learn more about the Richmond Theater fire and to hear about heroes who risked their lives to save dozens of others, listen to this week’s episode of the How We Got Here podcast:"}, {"url": "http://richmondfreepress.com/news/2019/dec/06/soul-santa-returns-dec-7-and-14-black-history-muse/", "title": "Soul Santa returns Dec. 7 and 14 to Black History Museum", "authors": [], "date": "2019-12-06", "keywords": ["history", "tours", "wwwblackhistorymuseumorg", "returns", "museum", "stdetails", "black", "dec", "youngsters", "taking", "14", "santa", "w", "virginia", "soul"], "summary": "Soul Santa is returning to the Black History Museum and Cultural Center of Virginia from noon to 4 p.m. Saturday, Dec. 7, and again on Saturday, Dec. 14.\nHe will be taking photos with youngsters at the free event.\nNo registration is needed.\nThe museum also will have arts and crafts projects for the children and tours will be available at the museum, 122 W. Leigh St.\nDetails: www.blackhistorymuseum.org or (804) 780-9093."}, {"url": "https://richmondbizsense.com/2019/12/26/order-up-richmond-restaurant-news-roundup-for-2019/", "title": "Order up: Richmond restaurant news roundup for 2019", "authors": ["J. Elias O'Neal"], "date": "2019-12-26", "keywords": ["restaurant", "st", "center", "retail", "opened", "open", "richmond", "2019", "place", "location", "roundup", "order", "w", "chesterfield"], "summary": "California-based Burgerim announced plans to open its first Henrico County location at the Publix-anchored Nuckols Place retail development at 5400 Wyndham Forest Drive in March.\nTexas-based Rusty Taco opened its first East Coast location in the Westchester Commons shopping center at 15816 Westchester Commons Main St. in Chesterfield.\nLocal restaurant groups expandSeveral local restaurant groups made big leaps to expand their concepts across the region.\nNo stranger to expansion, EAT Restaurant Partners signed a lease to open a second Hot Chick Fried Chicken Joint in Winterfield Crossing.\nSigning offOn a personal note, I’ll be handing off restaurant coverage in the New Year to my BizSense comrade Mike Platania."}, {"url": "https://www.wric.com/news/local-news/family-hurt-in-powhite-parkway-crash-pray-for-daughters-recovery/", "title": "Family hurt in Powhite Parkway crash pray for daughter’s recovery", "authors": ["Laura Perrot", "Kirk Nawrotzky", "Ben Dennis"], "date": "2019-12-30", "keywords": ["parkway", "crash", "family", "walk", "praying", "recovery", "median", "pray", "hurt", "redding", "members", "daughters", "car", "times", "recover", "shell", "powhite"], "summary": "CHESTERFIELD COUNTY, Va. (WRIC) — A Chesterfield family is praying for a miracle after all five family members were hurt in a crash on Powhite Parkway last week.\nAll five family members — father Jeremy, mother Megan, 16-year-old Kayleigh, 11-year-old Addison and 10-year-old Jeremiah — were hurt.\nRedding said the other four family members have been released from medical care with injuries such as burns and lacerations.\nKayleigh has been awake at times and is able to talk to her family.\n“That’s all we can do is pray that she’ll recover, that she’ll walk again, that she will walk away with just a bad memory,” said Redding."}, {"url": "https://www.wric.com/traffic/holiday-event-road-closures-parking-restrictions-expected-this-weekend/", "title": "Holiday event road closures, parking restrictions expected this weekend", "authors": ["Julius Kizzee", "Wric Newsroom", "Keyris Manzanares", "Alonzo Small"], "date": "2019-12-06", "keywords": ["closures", "weekend", "leigh", "event", "going", "expected", "sure", "parking", "holiday", "road", "parade", "broad", "richmond", "restrictions", "street", "christmas"], "summary": "RVA Illuminates and the Dominion Energy Christmas Parade is expected to bring thousands of onlookers to the streets of Richmond – causing a number of street closures and no parking zones.\n8News spoke with residents ahead of the festive weekend to see how they’re planning to navigate through the holiday events – and keep their cars safe.\n“I’m going to the Christmas parade tomorrow morning,” said Sean Holloran, a Richmond resident.\n2019 Dominion Energy Christmas Parade Traffic Advisory:The parade will begin at 10:00 a.m. at the Science Museum of Virginia and proceed east on Broad Street toward Seventh Street.\nMajor city thoroughfares such as Broad Street and Leigh Street will be affected."}, {"url": "http://richmondfreepress.com/news/2019/dec/06/new-rva-illuminates-kick-holiday-season-dec-6-kana/", "title": "New 'RVA Illuminates' to kick off holiday season Dec. 6 at Kanawha Plaza", "authors": [], "date": "2019-12-06", "keywords": ["plaza", "kanawha", "illuminates", "tree", "st", "event", "kick", "holiday", "dec", "parade", "city", "shockoe", "season", "rva", "free", "street", "details"], "summary": "Free shuttle service for the event will run from City Stadium to Kanawha Plaza starting at 5 p.m., with the last shuttle returning at 9 p.m.\nThe free event will feature a very special guest from the North Pole.\nThe annual holiday parade, led by grand marshal and Richmond’s most notable veteran, Cmdr.\nFor many RVA residents, the free event kicks off the Christmas season.\nDec. 7 – Hopewell Holiday Boat Parade 2019, 5:30 to 8 p.m. Hopewell City Marina, 1051 Riv- erside Ave."}, {"url": "https://www.politifact.com/factchecks/2019/dec/20/facebook-posts/twitter-bots-spread-white-supremacists-bogus-story/", "title": "Twitter bots spread white supremacist’s bogus story about Virginia’s proposed assault weapons ban", "authors": ["December"], "date": "2019-12-20", "keywords": ["proposed", "supremacists", "bogus", "evidence", "northam", "virginia", "bots", "ban", "spread", "bill", "weapons", "facebook", "white", "turner", "post", "assault", "dec", "virginias", "twitter"], "summary": "Ahead of a potential vote on an assault weapons ban in Virginia, some Facebook users are posting misinformation about the legislation.\nThe Facebook post, which has been shared nearly 10,000 times, was flagged as part of the company’s efforts to combat false news and misinformation on its News Feed.\nWhile a variety of gun control legislation has been introduced in Virginia, one bill is particularly relevant to the Facebook post and tweet: Virginia Senate Bill 16.\nThe measure, which was introduced in late November, would ban the possession, transport and sale of assault weapons.\nThe bill includes six definitions for \"assault weapons,\" which include anything from a semi-automatic rifle to a shotgun with a revolving cylinder."}, {"url": "https://wtvr.com/2019/12/17/the-2019-capital-city-kwanzaa-festival/", "title": "The 2019 Capital City Kwanzaa Festival", "authors": [], "date": "2019-12-17", "keywords": ["school", "society", "visit", "festival", "city", "wwwefsincorg", "2019", "capital", "kwanzaa", "street", "tells", "richmonds", "virginia"], "summary": "December is a month full of festive holidays.\nWe are fast approaching the kickoff of Hannukah on December 22, Christmas on December 25, and Kwanzaa on December 26.\nThe Elegba Folklore Society, Richmond’s Cultural Ambassador, presents the 2019 Capital City Kwanzaa Festival on Saturday, December 28 from 1 pm to 8 pm at Martin Luther King, Jr. Middle School, located at 1000 Mosby Street in Richmond, Virginia.\nJanine Bell, the festival coordinator, tells us about one of the largest Kwanzaa celebrations on the east coast.\nFor festival information, visit www.efsinc.org."}, {"url": "https://www.nbc12.com/2019/12/31/news-know-dec-search-convicted-felon-gun-violence-spikes-cavs-come-up-short-orange-bowl/", "title": "News to know for Dec. 31: Search for convicted felon; gun violence spikes in 2019; Cavs come up short in Orange Bowl", "authors": ["Published At Pm"], "date": "2019-12-31", "keywords": ["violence", "ivy", "orange", "know", "richard", "gun", "discovered", "fired", "spikes", "convicted", "short", "carter", "holes", "samantha", "search", "felon", "dec", "morning", "idea"], "summary": "Richard and Samantha Carter said they had no idea someone had fired into their Ivy Avenue home until the bullet holes were discovered Saturday morning.\nNow they would like to know who did it."}, {"url": "https://wtvr.com/2019/12/20/free-annual-community-christmas-day-dinner/", "title": "Free annual Community Christmas Day Dinner", "authors": [], "date": "2019-12-20", "keywords": ["va", "congregation", "day", "annual", "underway", "dinner", "richmond", "community", "volunteer", "free", "street", "beth", "christmas", "w", "ahabah"], "summary": "RICHMOND, Va. – Community Christmas Day Dinner preparations are underway now through December 23rd for Bridging RVA’s 5th annual dinner, which will be held at Congregation Beth Ahabah on December 25th from 10am to 3pm.\nLast year, nearly 700 Richmond-area residents in need of a hot meal and fellowship attended.\nCongregation Beth Ahabah is located at 111 W. Franklin Street in Richmond.\nTo learn more about the event and volunteer opportunities, click here."}, {"url": "https://wtvr.com/2019/12/27/the-beacon-theatre-hopewell-rva-puppetfest/", "title": "The Beacon Theatre, Hopewell & RVA ​Puppetfest", "authors": [], "date": "2019-12-27", "keywords": ["theatre", "triangle", "hopewell", "tickets", "puppetfest", "730pmtickets", "beacon", "2020doors", "evening", "2019doors", "630pm", "richmond", "rva", "performance"], "summary": "RICHMOND, VA.–The Beacon Theatre in Hopewell, 401 North Main Street, Hopewell, VA.For tickets or a complete list of concerts visit or call the Box Office: 804-446-3457 orhttp://thebeacontheatreva.com/schedule-2/ or http://www.beaconvatickets.comConcerts:New Potato Caboose – An Evening WithFriday, December 27, 2019, Doors: 6:30pmPerformance: 7:45pmTickets: $20-$30 Advance/$25-$35 Doorhttps://www.facebook.com/NewPotatoCaboose/Delbert McClintonSaturday, December 28, 2019Doors: 6:30pm, Performance: 7:30pmTickets: $32-$47 Advance/$37-$52 DoorMasters of Motown Christmas Show – An Afternoon WithSunday, December 29, 2019Doors: 3:30pm, Performance: 4:30pmTickets: $25-$30 Advance/$30-$35 DoorThe Legendary Wailers – Featuring Junior Marvin – An Evening WithMonday, December 30, 2019Doors: 6:30pm, Performance: 7:45pmTickets: $17-$25 Advance/$22/$30 DoorSammy KershawFriday, January 10, 2020Doors: 6:30pm, Performance: 7:30pmTickets: $37-$50 Advance/$42-$55 DoorFIREFALLFriday, January 17, 2020Doors: 6:30pm, Performance: 7:30pmTickets: $27-$37 Advance/$32-$42 DoorPOCOFriday, January 24, 2020Doors: 6:30pm, Performance: 7:30pmTickets: $30-$40 Advance/$35-$45 DoorLonestarFriday, February 7, 2020Doors: 6:30pm, Performance: 7:30pmTickets: $35-$50 Advance/$40-$55 DoorDon Felder – Formerly of The Eagles – An Evening WithSaturday, February 8, 2020Doors: 6:30pm,Showtime: 7:30pmTickets: $42-$65 Advance/$47-$70 DoorDirty Dozen Brass Band + Nathan & The Zydeco Cha ChasMardi Gras Boogaloo 2020Sunday, February 23, 2020Doors: 6:30pm, Performance: 7:00pmTickets: $25-$37 Advance/$30-$42 Door6th Annual RVA ​ Puppetfest December 27, 2019, January 4, 2020Puppets Off Broad Street is back for the 6th annual RVA Winter Puppetfest!\nFamily fun with puppet shows by award-winning performers at Richmond Triangle Players’ Robert B. Moss Theatre.\nShows include “The Velveteen Rabbit,” original works like “Cardboard Explosion,” and tongue-twisting ventriloquism with Tyrone Travis.\nAll performances are held at Richmond Triangle Players’ Robert B. Moss Theatre, located at 1300 Altamont Avenue tickets are $10 each with no extra fees.\nTickets are available in advance at https://www.puppetsoffbroadstreet.org/about-rva-winter-puppetfest.html or can also be purchased at the door or call 804-852-2810."}]