[{"url": "https://www.kgun9.com/news/coronavirus/coronavirus-latest-updates-cases-in-arizona", "title": "Coronavirus: Latest updates, cases in Arizona", "authors": [], "date": "2020-03-21", "keywords": ["department", "pima", "updates", "coronavirus", "health", "county", "confirmed", "covid19", "positive", "arizona", "latest", "cases"], "summary": "APRIL 9, 2020The number of coronavirus cases in Arizona surpassed 3,000 cases Thursday.\nMaricopa County now has more than 1,000 confirmed cases, with 280 cases in Pima County.\nAPRIL 2, 2020:There are now more more than 1,500 confirmed cases of coronavirus in Arizona.\nRead more: https://t.co/Y9bG7ixs23 1/ — Doug Ducey (@dougducey) March 26, 2020MARCH 25, 2020There are now 401 confirmed cases of coronavirus in Arizona, with 49 cases in Pima County, according to the latest AZDHS update.\nMARCH 24, 2020There have been six coronavirus-related deaths in Arizona, the Arizona Department of Health Services says."}, {"url": "https://www.kgun9.com/news/coronavirus/businesses-establishments-required-to-close-in-local-emergency", "title": "Which businesses, establishments are required to close in local emergency?", "authors": [], "date": "2020-03-22", "keywords": ["businesses", "public", "required", "similar", "emergency", "health", "close", "local", "declared", "food", "covid19", "tucson", "establishments"], "summary": "breweries, microbreweries, distilleries, wineries, tasting rooms, special licensees, clubs, and other similar businesses and establishments that serve alcoholic beverages or liquor for consumption on-site.\nMuseumsGyms, fitness centers, recreation centers, indoor sports and exercise facilities, exercise studios, yoga and barre studios, and any other similar businesses.\nMarch 11, 2020Governor Doug Ducey declared a state public health emergency in Arizona in response to the spread of the coronavirus.\nJanuary 31, 2020Health and Human Services Secretary Alex M. Azar II declared a public health emergency for the U.S., according to U.S. Department of Public Health and Human Sevices.\nJanuary 30, 2020The International Health Regulations Emergency Committee of the World Health Organization declared COVID-19 outbreak a public health emergency concern, according WHO."}, {"url": "https://news.clearancejobs.com/2020/04/15/raytheon-missile-systems-awarded-9-million-to-procure-digital-focal-plane-array-prototype-for-navy-and-air-force/", "title": "Raytheon Missile Systems Awarded $9 Million to Procure Digital Focal Plane Array Prototype for Navy and Air Force", "authors": [], "date": "2020-04-15", "keywords": ["raytheon", "2020", "procure", "focal", "contracting", "plane", "million", "force", "navy", "prototype", "fiscal", "systems", "performed", "missile", "funds", "contract", "support", "awarded", "work"], "summary": "Fiscal 2020 operations and maintenance (Navy) funds in the amount of $9,624,915; fiscal 2020 working capital (Navy) funds in the amount of $2,435,821; fiscal 2020 other procurement (Navy) funds in the amount of $1,410,800; and fiscal 2020 aircraft procurement (Navy) funds in the amount of $590,600 will be obligated at time of award, $9,624,915 of which will expire at the end of the current fiscal year.\nRaytheon Missile Systems, Tucson, Arizona, was awarded a $9,224,337 modification (P00074) to exercise an option to previously awarded cost-plus-fixed-fee contract N00019-15-C-0121 to procure a Digital Focal Plane Array prototype for the Navy and Air Force.\nAIR FORCEThe Boeing Co., Seattle, Washington, has been awarded an $84,000,000 firm-fixed-price contract modification (P00068) to previously awarded contract FA8625-16-C-6599 for VC-25B technical publications.\nFiscal 2020 civil construction funds in the amount of $15,885,000 were obligated at the time of the award.\nFiscal 2020 military construction, Army funds in the amount of $7,633,085 were obligated at the time of the award."}, {"url": "http://www.dailysportscar.com/2020/04/14/john-horsman-1934-2020.html", "title": "John Horsman: 1934-2020 – dailysportscar.com", "authors": ["Graham Goodwin"], "date": "2020-04-14", "keywords": ["cars", "racing", "mans", "ford", "19342020", "horsman", "john", "gulf", "le", "dailysportscarcom", "porsche", "team"], "summary": "DSC received the following statement from the family of John Horsman this morning:Sadly, we announce the passing of John Horsman, who had suffered from heart and kidney complications.\n————-John Hargreaves Horsman was born 22nd November 1934, to Roy and Barbara Horsman, in Oldham, Lancashire.\nThrough the combined efforts of, John Wyer, team manager David Yorke, and John Horsman, in addition to its back to back Le Mans 24 Hours victories, the team also won the coveted World Sports Car Championships in 1968, 1970 and 1971.\nJohn also returned to Le Mans four more times as part of Vern Schuppan’s team.\nIn 1983, John and Janet moved to Tucson where John worked with Australian Bib Stillwell at Learjet and with Bib’s amateur racing team, in historic racing events."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://patch.com/arizona/tucson/new-arizona-laws-go-effect-2020", "title": "New Arizona Laws Going Into Effect In 2020", "authors": [], "date": "2020-01-03", "keywords": ["rule", "start", "2020", "primary", "wage", "overtime", "opioid", "laws", "going", "prescriptions", "arizona", "workers", "minimum", "effect"], "summary": "ARIZONA — The start of the new year also brings the start of several new Arizona laws going into effect in 2020, affecting the minimum wage, primary elections, opioid prescriptions and more.\nHere are some of the changes for 2020:Related coverage: New Overtime Rule Could Affect Up To 20,000 AZ Workers In New Year"}, {"url": "https://www.kold.com/2020/01/10/az-weekend-jan/", "title": "AZ Weekend, Jan. 10", "authors": ["Angelica Carrillo", "Published At Pm", "Published Pm At Pm", "Published Am At Am"], "date": "2020-01-10", "keywords": ["shows", "lineup", "hall", "tickets", "az", "days", "centennial", "weekend", "jan", "online"], "summary": "The other show is at Centennial Hall.\nTickets for that can be found online along with the lineup for the next 10 days of shows."}, {"url": "https://www.kold.com/2020/03/19/sba-offer-disaster-assistance-small-businesses-amid-covid-impact/", "title": "SBA to offer disaster assistance to small businesses amid COVID-19 impact", "authors": ["Published At Pm"], "date": "2020-03-19", "keywords": ["impact", "businesses", "amid", "loans", "private", "rate", "covid19", "repayments", "financial", "offer", "small", "sba", "payments", "assistance", "interest", "disaster"], "summary": "Eligibility for Economic Injury Disaster Loans is based on the financial impact of COVID-19.\nThe interest rate is 3.75 percent for small businesses.\nThe interest rate for private non-profit organizations is 2.75 percent.\nSBA offers loans with long-term repayments in order to keep payments affordable, up to a maximum of 30 years and are available to entities without the financial ability to offset the adverse impact without hardship."}, {"url": "https://www.kold.com/2020/04/07/covid-fact-finders-answering-your-questions/", "title": "COVID-19 Fact Finders: Answering Your Questions", "authors": ["Shaley Sanders", "Published At Pm"], "date": "2020-04-07", "keywords": ["imported", "virus", "goods", "spread", "finders", "questions", "associated", "unknown", "unlikely", "weeks", "covid19", "answering", "fact", "period"], "summary": "There is still a lot that is unknown about COVID-19 and how it spreads.\nThis virus is thought to be spread most often by respiratory droplets.\nAlthough the virus can survive for a short period on some surfaces, the CDC says it is unlikely to be spread from products or packaging that are shipped over a period of days or weeks at ambient temperatures.\nCurrently, there is no evidence to support transmission of COVID-19 associated with imported goods and there have not been any cases of COVID-19 in the United States associated with imported goods."}, {"url": "https://www.kold.com/2020/01/31/az-weekend-jan/", "title": "AZ Weekend, Jan. 31", "authors": ["Angelica Carrillo", "Published At Pm", "Published Pm At Pm", "Published Am At Am"], "date": "2020-01-31", "keywords": ["guide", "know", "az", "visit", "31", "official", "need", "tucson", "gem", "weekend", "jan", "online"], "summary": "Visit Tucson has the Official Tucson Gem Show Guide online and has everything you need to know on each show and how to get there."}, {"url": "https://theathletic.com/1741320/2020/04/13/break-em-down-thoughts-on-6-returning-scholarship-players-for-sean-miller/", "title": "Break 'em down: Thoughts on 6 returning scholarship players...", "authors": ["C.J. Holmes"], "date": "2020-04-13", "keywords": ["scholarship", "way", "wildcats", "transferring", "wouldve", "thoughts", "201920", "em", "players", "23", "williams", "mannion", "arizona", "unavailable", "break", "returning"], "summary": "We’ll never know how Arizona’s 2019-20 postseason would’ve played out.\nThe Wildcats will have to find a way to replace most of their production, and Sean Miller’s six returning scholarship players will be relied on heavily to accomplish that.\nJemarl Baker Jr.2019-20: Sophomore | 5.7 ppg, 2.3 rpg, 2.3 apgBaker was originally expected to sit out the 2019-20 season after transferring from Kentucky last May.\nHowever, he was ruled immediately eligible by the NCAA in October, giving Arizona an additional primary ballhandler to play behind Nico Mannion.\nBaker’s favorable ruling was huge for Arizona in terms of backcourt depth, especially in retrospect: Mannion needed help."}, {"url": "https://www.kgun9.com/news/local-news/arizona-minimum-wage-jumps-to-12-on-jan-1-2020", "title": "Arizona minimum wage jumps to $12 on Jan. 1, 2020", "authors": [], "date": "2019-12-18", "keywords": ["206", "12", "state", "jump", "2020", "hour", "voters", "wage", "jumps", "arizona", "workers", "jan", "minimum", "supreme"], "summary": "TUCSON, Ariz. — Minimum wage workers in Arizona are set to get a pay bump next month.\nStarting Jan. 1, 2020, the minimum wage in the state jumps to $12 an hour, a dollar jump from the current minimum of $11.\nRELATED: Prop 206: Arizona approves minimum wage increaseProp 206 called for gradual, annual increases in the minimum wage until it hit the $12 mark in 2020.\nRELATED: Arizona Supreme Court rejects minimum wage challengeThe 2016 measure passed in Arizona by 59 percent of voters, with 41 percent opposed.\nRELATED: Paid time off for all Arizona employeesIn Flagstaff, the minimum wage will jump even higher on Jan. 1 -- to $13 an hour, per its own city law."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20200131/637857/13th-annual-gem-jam-festival-returns-to-tucson-arizona", "title": "13th Annual Gem & Jam Festival Returns to Tucson, Arizona", "authors": [], "date": "2019-09-09", "keywords": ["returns", "music", "lineup", "annual", "desert", "jam", "options", "festival", "camping", "wwwgemandjamcom", "tucson", "gem", "13th", "mineral", "arizona"], "summary": "After taking a year hiatus for 2019, fan-favorite festival Gem & Jam Festival is excited to announce its return and with it the phase one lineup.\nThis past Spring Gem & Jam announced that it indeed would be returning and that planning was well underway.\nCamping options are available starting at free walk-in camping with a $20 parking fee, car camping and RV options with hook ups.\nGem & Jam Festival is an all ages event.\nGem & Jam is produced by Fog City Productions, Legion of Bloom Music, and Mammoth Music Group."}, {"url": "https://www.azcentral.com/story/travel/arizona/road-trips/2020/01/16/10-best-free-things-do-downtown-tucson-southern-arizona-transportation-museum-turquoise-trail/4431177002/", "title": "Free things to do in Tucson: 10 activities you can do with no money", "authors": ["Roger Naylor", "Special For The Republic", "Published A.M. Mt Jan."], "date": "2020-01-16", "keywords": ["activities", "west", "free", "money", "historic", "n", "things", "trail", "visit", "museum", "pass", "tucson", "arizona"], "summary": "Here’s a list of fun and free things to do in Tucson to coax you toward the Old Pueblo.\nTucson Museum of Art and Historic BlockJust like the name implies, there’s too much great stuff for one building to contain the treasures of Tucson Museum of Art and Historic Block.\nVisit for free from 5 to 8 p.m. on the first Thursday of each month.\nLearn more at everything the city offers at Visit Tucson: 800-638-8350, www.visittucson.org.\nSaguaro National Park West, Tucson Mountain District, 2700 N. Kinney Road."}, {"url": "https://www.kold.com/2020/01/28/check-your-tickets-one-unclaimed-ticket-sold-tucson/", "title": "CHECK YOUR TICKETS: One unclaimed $50,000 ticket sold in Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-28", "keywords": ["taking", "jackpot", "hit", "value", "sold", "million", "unclaimed", "tickets", "powerball", "won", "wisconsin", "place", "check", "tucson", "jan", "50000", "ticket"], "summary": "The next Powerball drawing is taking place Wednesday, Jan. 29 with an estimated $394 million jackpot ($274.6 million cash value).\nThis is the highest the Powerball jackpot has been since last March when a $768.4 million jackpot was hit in Wisconsin.\nThis will also be the first Powerball jackpot won in 2020!"}, {"url": "https://www.kgun9.com/news/local-news/hundreds-gather-downtown-for-tucson-womens-march-2020", "title": "Hundreds gather downtown for Tucson Women's March 2020", "authors": [], "date": "2020-01-18", "keywords": ["really", "downtown", "change", "women", "2020", "gather", "think", "womens", "hundreds", "rights", "going", "tucson", "whats", "states"], "summary": "TUCSON, Ariz. — Women and their allies gathered across the united states for the fourth annual Women's March Saturday.\nThe main event was held in Washington D.C., but there was a march in Tucson as well where hundred gathered downtown to emphasize the Equal Rights Amendment.\nTucson Women's March organizer Karine Garcia said \"Until that is fixed, we are going to continue to speak up.\nPushing unity and strength the 2020 Tucson Women's March was filled with positive energy and demand for change, but for marchers like Christian Dickenson the push for change shouldn't stop at this march.\nTucson Women's March attendee Christian Dickenson said \"Things like this, like this women's march are absolutely fantastic and they're great but, i think there needs to be more."}, {"url": "https://www.kold.com/2020/01/16/martin-luther-king-jr-day-closures-southern-arizona/", "title": "Martin Luther King Jr. Day closures in southern Arizona", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-16", "keywords": ["services", "request", "customer", "martin", "luther", "closures", "message", "day", "wwwtucsonazgovesd", "southern", "submitting", "leave", "king", "offices", "arizona", "service", "jan", "jr"], "summary": "City offices will be closed on Monday, Jan. 20; however, customers may leave a message for Environmental and General Services Customer Service at 791-3171 or by submitting a service request at www.tucsonaz.gov/esd and they will be contacted no later than the next business day.\nCustomer Service will be available on Saturday, Jan. 25 from 8:00 a.m. - 3:00 p.m."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/01/24/things-to-do-this-weekend-jan-24-26", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Propublica", "Justin Elliott", "Kristen Doererfor", "Logan Burtch-Buus"], "date": "2020-01-24", "keywords": ["enlargeclick", "park", "learn", "kids", "day", "25", "n", "weeklys", "dispatch", "tucson", "arizona", "jan", "daily", "range"], "summary": "click to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeIt’s a big weekend over at Dillinger Brewing Company, where they’re busting out cans of a spacey brew and celebrating their birthday.\nFriday, Jan. 24, and Saturday, Jan. 25.\n7:30 p.m. Saturday, Jan. 25 at Catalina Foothills High School, 4300 E. Sunrise Drive.\n7 p.m. on Friday, Jan. 24, and Saturday, Jan. 25.\nCocktail reception begins at 6, dinner is at 7 and show is at 8 p.m. Saturday, Jan. 25."}, {"url": "https://www.hotrod.com/events/roadkill-zip-tie-drags-tucson-dragway/", "title": "Roadkill Zip-Tie Drags Tucson Dragway", "authors": ["Motor Trend Group Llc", "Johnny Hunkins"], "date": "2020-02-04", "keywords": ["ziptie", "track", "race", "line", "racing", "roadkill", "drags", "car", "open", "tucson", "cars", "dragway"], "summary": "That’s right, we’re meeting up for another Roadkill Zip-Tie Drags Powered by Panduit at Tucson Dragway on January 17-18, 2020, and here’s everything you need to know to join us.\nEmail EVENTS@Roadkill.comOfficial Rules For Roadkill Zip-Tie Drags January 17-18 2020 At Tucson DragwayROADKILL ZIP-TIE DRAGS 2019: THE OFFICIAL RULESThe Roadkill Zip-Tie Drags are coming to Tucson Dragway in Arizona on January 17-18, 2020!\nThose who enter must be paid racer entries to the Roadkill Zip-Tie Drags event.\nIn every round, the fans must drive the vehicle they entered into the Roadkill Zip-Tie Drags.\nRoadkill Zip-Tie Drags – January 17-18 – Tucson Dragway – Register Now!"}, {"url": "https://whotv.com/news/john-wayne-movie-sets-live-on-in-arizona-sunshine/", "title": "John Wayne Movie Sets Live on in Arizona Sunshine", "authors": ["Roger Riley", "Maria Lisignoli", "Amber Alexander", "Cnn Wire"], "date": "2020-01-20", "keywords": ["freese", "live", "movie", "productions", "sets", "tv", "sunshine", "old", "john", "tucson", "arizona", "rio", "wayne", "film"], "summary": "“John Wayne would come in to Rio Rico and stay with Fitzgerald family,” said Marty Freese, who is an Old Tucson movie historian.\nIt draws John Wayne fans and fans of 60s TV westerns, before the internet, YouTube or Netflix were ever thought of.\n“John Wayne and Walter Brennan are going to blow up the warehouse.\n“In McLintock, a 1962 film, Wayne chased Maureen O’Hara right through the doorway.\nFor those wanting to see more about Wayne, you can do that by driving to the John Wayne Birthplace Museum in Winterset."}, {"url": "https://www.kold.com/2020/01/16/arizona-release-football-schedule/", "title": "Arizona releases 2020 football schedule", "authors": ["Arizona Athletics", "Published March", "At Am", "At Pm"], "date": "2020-01-16", "keywords": ["straight", "season", "second", "wildcats", "2020", "week", "schedule", "oct", "open", "releases", "washington", "versus", "football", "arizona"], "summary": "Arizona will play two Friday night games on the season.\nThe first comes on Oct. 9 at home versus Colorado, with the second one set for Oct. 23 at Washington.\nThe Wildcats will also open their season in “Week 0” for the second straight season.\nArizona will host Hawai’i to open the season on Aug. 29."}, {"url": "https://www.kold.com/2020/01/24/pima-county-sheriffs-department-investigate-midtown-shooting/", "title": "Pima County Sheriff’s Department investigate midtown shooting", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-24", "keywords": ["scene", "department", "transported", "midtown", "shooting", "pcsd", "fresco", "pima", "release", "north", "county", "sheriffs", "deputies", "investigate", "victim", "hospital", "responded"], "summary": "Deputies responded to the 4600 block of north Camino Aire Fresco at around 9:11 p.m., according to a release from PCSD.\nWhen deputies arrived on scene, they found one victim who was transported to the hospital."}, {"url": "https://www.kgun9.com/news/state/kanye-west-bringing-awaken-2020-church-service-to-tempes-sun-devil-stadium-how-to-get-tickets", "title": "Kanye West bringing 'Awaken 2020' church service to Tempe's Sun Devil Stadium: How to get tickets", "authors": [], "date": "2020-01-08", "keywords": ["herzog", "devil", "nation", "west", "state", "including", "kanye", "church", "2020", "held", "tickets", "event", "stadium", "bringing", "service", "tempes", "awaken"], "summary": "Called \"Awaken 2020,\" the free 12-hour event will be hosted at Arizona State University's Sun Devil Stadium on Saturday, Jan. 18, 2020, from 10 a.m. - 10 p.m.\nOver the last few months, West has held church services at various venues around the state, including Detroit and Houston.\n\"This January 18th, 2020 at Sun Devil Stadium in Phoenix, Arizona, it’s time for you to be part of the Jesus awakening that is shifting HISTORY.\nIn addition to West, speakers include Brian Welch, Daniel Kolenda, David Herzog, Stephanie Herzog, Lou Engle, Guilleromo Maldonado, Cindy Jacobs, and several others.\nCLEAR BAG POLICYBecause the event is being held at ASU's Sun Devil Stadium, the stadium's \"clear bag policy\" will be in effect, a spokesperson confirmed to ABC15."}, {"url": "https://247wallst.com/special-report/2020/04/13/states-with-the-most-tornadoes-5/", "title": "States With the Most Tornadoes – 24", "authors": [], "date": "2020-04-13", "keywords": ["total", "tornado", "ef5", "tornadoes", "damage", "24", "scale", "figures", "level", "property", "states"], "summary": "States With the Most Tornadoes Charles B. StockdaleThis Easter Sunday, an onslaught of tornadoes tore across Southern states, resulting in at least 19 deaths.\nTornadoes do not typically result in injury or loss of life, though they all produce at least some level of damage.\nApproximately 1,200 tornadoes form in the United States each year.\nProperty damage figures are not available for years prior to 1996, and crop damage figures are not available before 2006.\nClick here to see the states with the most tornadoes"}, {"url": "https://www.kold.com/2019/12/31/new-laws-going-into-effect/", "title": "New laws going into effect in 2020", "authors": ["Bud Foster", "Published At Pm"], "date": "2019-12-31", "keywords": ["opioids", "potential", "track", "state", "help", "prevent", "2020", "paper", "opioid", "laws", "written", "prescriptions", "going", "effect"], "summary": "There will be no more paper prescriptions written for opioids.\nThey must all be done electronically now.\nIt will help the state keep better track of opioid use and potential abuse.\nIt will also prevent fraud which is sometimes associated with the paper prescriptions."}, {"url": "https://www.kold.com/2020/01/09/gun-shot-strikes-business-tucsons-southeast-side/", "title": "Gunshot strikes business on Tucson’s southeast side", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-09", "keywords": ["public", "officer", "nearby", "investigators", "tpd", "shot", "magos", "single", "strikes", "business", "gunshot", "southeast", "suspects", "tucsons", "jan"], "summary": "Frank Magos, a public information officer with TPD, said in an email that police were called at around 2 p.m. Thursday, Jan. 9, 2020 about a single gun shot that hit a nearby business.\nMagos said no one was injured and investigators do not have any suspects at this time."}, {"url": "https://www.kold.com/2020/01/11/tucson-police-identify-victim-midtown-shooting-suspect-large/", "title": "Tucson police identify victim in midtown shooting, suspect at large", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-11", "keywords": ["suspect", "midtown", "shooting", "large", "tpd", "sandoval", "release", "press", "identify", "road", "suspects", "ricardo", "tucson", "victim"], "summary": "Investigators with the Tucson Police Department identified 29-year-old Ricardo Sandoval as the victim of a shooting on Jan. 9, 2020 on the 3100 north Castro Avenue, near Oracle Road and Fort Lowell Road, according to a press release from TPD.\nPolice do not have anyone in custody, nor do they have any suspects at this time."}, {"url": "https://www.kold.com/2020/01/03/ninth-anniversary-tucson-tragedy-be-commemorated-jan/", "title": "Ninth anniversary of Tucson tragedy to be commemorated Jan. 8", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-03", "keywords": ["remind", "tragedy", "participation", "tell", "important", "memorial", "moment", "anniversary", "tucsonans", "responded", "commemorated", "history", "tucson", "jan", "ninth"], "summary": "The memorial will tell the story of the tragedy and how Tucsonans responded and also remind future generations how our community came together at an important moment in history and how we all can continue to build a better democracy through active participation and civic discourse."}, {"url": "https://www.abc15.com/entertainment/events/yelps-best-places-to-eat-in-2020-three-arizona-restaurants-make-the-list", "title": "Yelp's Best Places To Eat in 2020: Three Arizona restaurants make the list", "authors": [], "date": "2020-01-07", "keywords": ["best", "cafe", "madrigal", "eat", "2020", "listing", "restaurants", "n", "2019", "yelps", "tucson", "list", "places", "arizona", "phoenix"], "summary": "PHOENIX — If you're looking to try some new restaurants, or simply some new-to-you eateries, Yelp has unveiled its annual listing of the top restaurants in the United States to try in 2020.\nThree restaurants in Arizona made the list:#5: Cocina Madrigal, 4044 S 16th St., Phoenix, AZ 850404044 S 16th St., Phoenix, AZ 85040 #53: Barista del Barrio , 1002 N. Grande Ave., Tucson, Arizona 85745, 1002 N. Grande Ave., Tucson, Arizona 85745 #73: Indian Gardens Cafe & Market, 3951 N. State Route 89a, Sedona, Arizona 86336Cocina Madrigal, which specializes in Mexican cuisine, made Yelp's list in 2019.\nIt is the first time that Barista del Barrio, a small cafe in Tucson, and Indian Gardens Cafe & Market in Sedona made the list.\nIf you need some more inspiration, OpenTable revealed its listing of the top restaurants of 2019 in December.\nThat listing featured four high-end restaurants in Arizona: Kai, Steak 44, Ocean 44, and Cafe Monarch."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20200117/736667/tucson-biological-wellness-open-house", "title": "Tucson Biological Wellness Open House", "authors": [], "date": "2020-01-07", "keywords": ["wellnesstucsonbiocomwe", "learn", "theretucson", "staff", "wellness", "special", "wellness1601", "house", "detoxification", "open", "tucson", "biological"], "summary": "Come join us at Tucson Biological Wellness on January 17th from 4:00 to 7:00 pm.\nMeet our staff and learn all about the modalities we have to offer.\nDr. Shabez will have a special discussion on Detoxification for All at 6:00 pm.\nLearn what is detoxification and how you can do it.\nTucson Biological Wellness1601 N Tucson Blvd #37Tucson, AZ 85716(520) 900-1808https://tucsonbiologicalwellness.com/"}, {"url": "https://www.kold.com/2020/01/13/just-deputies-respond-shooting-northwest-tucson/", "title": "UPDATE: Sheriff’s department identifies victim of apartment shooting", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-13", "keywords": ["scene", "update", "department", "wounds", "taken", "identifies", "shooting", "pcsd", "apartment", "release", "nonlifethreatening", "press", "road", "sheriffs", "victim", "men", "responders"], "summary": "First responders were called to an apartment complex on Mona Lisa Road at around 11:30 p.m. where they found two men with non-life-threatening gunshot wounds, according to PCSD a press release.\nThe two men were taken to the hospital but Mincy was found dead at the scene."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/01/10/things-to-do-this-weekend-jan-10-12", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Propublica", "Justin Elliott", "Kristen Doererfor", "Logan Burtch-Buus"], "date": "2020-01-10", "keywords": ["shows", "enlargeclick", "art", "beer", "weeklys", "pueblo", "blvd", "dispatch", "tucson", "jan", "daily", "range", "st", "11"], "summary": "click to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeThree cheers for this very Tucson festival, which provides avant-garde and nontraditional performing artists a chance to perform in a low-risk, low-cost setting.\nFriday, Jan. 10, and Saturday, Jan. 11.\n21+The French Alliance of Tucson (Alliance Française de Tucson) is bringing a French culinary tradition to Tucson.\nAfterwards, you’ll be able to answer “Orange you glad you spent your Saturday morning this way?” with a confident “Yes!” 9 to 11 a.m. Saturday, Jan. 11.\nHimmel Park, 1000 N. Tucson Blvd."}, {"url": "https://tucsonfoodie.com/2020/01/30/10th-annual-arizona-beer-week-2020/", "title": "10th annual Arizona Beer Week returns to Tucson, events listed", "authors": ["Matt Sterner"], "date": "2020-01-30", "keywords": ["read", "events", "returns", "brewing", "week", "beer", "feb", "10th", "tap", "vida", "brewings", "listed", "pairing", "tucson", "arizona", "tooth", "company", "annual"], "summary": "FRIENDS Trivia Night at Crooked Tooth Brewing CompanyFrom 7 – 9 p.m., Crooked Tooth Brewing will be hosting a FRIENDS Trivia night.\nThe participating breweries on tap will be Dragoon Brewing Company, Pueblo Vida Brewing Company, and Tombstone Brewing Company.\nSentinel Peak Brewing Company is turning up the heat with its annual Crawfish Boil from 11 a.m. – 10:30 p.m.\nBeer Pairing Dinner with Pueblo Vida Brewing Company at Anello PizzeriaThis beer pairing dinner will have two different seating times at 5:30 p.m. and 7:30 p.m.\n1912 Brewing Company & Tombstone Brewing Company CollaborationCome taste the creation the two breweries put together."}, {"url": "https://www.kold.com/2020/01/06/tpd-investigating-first-homicide/", "title": "UPDATE: Tucson man accused of fatally stabbing older sister", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-06", "keywords": ["holly", "update", "tpd", "near", "country", "accused", "silverlake", "south", "ortega", "stabbing", "straw", "fatally", "older", "tucson", "sister", "man", "mirna"], "summary": "The TPD said he attacked his sister — 43-year-old Mirna Ortega — at a home in the 2400 block of South Holly Straw, which is near Silverlake and Country Club."}, {"url": "https://www.kold.com/2020/01/01/no-arizona-begin-road-southern-cal/", "title": "No. 18 Arizona to begin 2020 on road at Southern Cal", "authors": ["Arizona Athletics", "Published April", "At Am", "At Pm"], "date": "2020-01-01", "keywords": ["score", "making", "vs", "player", "2020", "southern", "game", "pac12", "44", "texas", "18", "cal", "points", "begin", "arizona", "road", "scored"], "summary": "McDonald broke the Arizona single-game scoring record on Nov. 17 with 44 points on the road vs. No.\n22 Texas, becoming the 11th player in Pac-12 history to score at least 44 points in a game.\nShe was incredibly efficient, making 14 of her 18 attempts while making all 14 of her free throws.\n44 points is the second-most any player in the country has scored this season and only 10 other players in the country have scored 40 in one game.\nThe last Pac-12 player to score 44 points in a game was Kelsey Plum (Feb. 25, 2017)."}, {"url": "https://www.kold.com/2020/01/01/update-least-two-shot-house-party-midtown-tucson/", "title": "UPDATE: At least two shot at house party in midtown Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-01", "keywords": ["update", "expected", "midtown", "taken", "shot", "tpd", "fighting", "person", "according", "party", "life", "house", "survive", "tucson", "hospital"], "summary": "At least two people were taken to the hospital.\nOne person is fighting for their life while the other is expected to survive, according to the TPD."}, {"url": "https://tucsonfoodie.com/2020/01/13/savor-southern-arizona-food-wine-festival-2020/", "title": "SAVOR Southern Arizona Food & Wine Festival at Tucson Botanical Gardens", "authors": ["Matt Sterner"], "date": "2020-01-13", "keywords": ["botanical", "wineries", "brewing", "southern", "restaurants", "tickets", "savor", "wine", "local", "taste", "food", "festival", "breweries", "tucson", "arizona", "gardens"], "summary": "SAACA, Local First Arizona and Tucson Botanical Gardens are hosting the annual SAVOR Southern Arizona Food and Wine Festival from noon – 3 p.m. on Saturday, February 8.\nSAVOR showcases the diversity of food and ingredients by bringing more than 60 of the region’s best chefs, wineries, breweries, and local restaurants together.\nWith so many local restaurants, breweries, and wineries popping up in the region it’s hard to keep track and taste them all, but that’s why this festival is so well supported.\nTickets are $79 per person and that includes samples from all wineries, breweries, distilleries, restaurants, and food purveyors.\nVIP Tickets are also available at $125 per person and gets you in one hour early, scores you reserved parking, access to all Tucson Botanical Gardens exhibits, and everything that comes with the General Admission access."}, {"url": "https://www.kold.com/2020/01/20/update-pedestrian-injured-january-collision-dies-nearly-two-weeks-later/", "title": "UPDATE: Pedestrian injured in January collision dies nearly two weeks later", "authors": ["Published At Pm"], "date": "2020-01-20", "keywords": ["scene", "update", "happened", "underway", "drivers", "remained", "investigation", "later", "pedestrian", "injured", "say", "impaired", "dies", "weeks", "collision", "nearly", "factor", "speed"], "summary": "Both drivers remained at the scene and cooperated with the investigation, which is still underway.\nPolice say neither driver was impaired and speed does not appear to be a factor in the collision, which happened just before 1:30 p.m."}, {"url": "https://www.kgun9.com/news/local-news/authorities-arrest-11-after-investigation-targeting-tucson-drug-traffickers", "title": "DEA: 11 arrested after investigation targeting Tucson drug traffickers", "authors": [], "date": "2020-01-29", "keywords": ["dea", "enforcement", "operation", "traffickers", "investigation", "luis", "arrested", "targeting", "trafficking", "drug", "organization", "tucson", "arizona", "11"], "summary": "TUCSON, Ariz. — Authorities arrested 11 people Tuesday after a year-long joint investigation into alleged Tucson drug traffickers, according to the Drug Enforcement Administration.\nThe year-long joint investigation operated by the DEA’s Sierra Vista Resident Office along with the Arizona Department of Public Safety’s Border Strike Force was part of the alleged drug trafficking activities of Luis Agustin Montaño Hernandez and his organization, according to DEA.\nThe investigation started in December 2018, the Luis Agustin Montaño Hernandez drug trafficking operation was identified as an organization working primarily in the Tucson area, according to DEA.\nAll evidence seized from the enforcement operation will go to the Arizona Attorney General’s Office for review and charges.\nThe DEA asks anyone with information about suspected drug trafficking to contact DEA or any law enforcement in Arizona."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20200120/746634/martin-luther-king-day-march", "title": "Martin Luther King Day March", "authors": [], "date": "2020-01-17", "keywords": ["street", "martin", "luther", "way", "tech", "day", "uas", "south", "set", "king", "east", "park", "walk", "celebration"], "summary": "The MLK MarchMONDAY | Jan. 20 | 8:00 amThe march will begin at Martin Luther King Way, near South Kino Parkway and East 36th Street at the UA's Tech Park.\nParticipants will walk to Reid Park at East 22nd Street and South Country Club Road for a celebration at the park's outdoor performance center.\nThe celebration is set to run from about 10 a.m. to 3 p.m."}, {"url": "https://www.kold.com/2020/01/18/silver-alert-issued-tolleson-man/", "title": "UPDATE: Silver Alert issued for Tolleson man cancelled", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-18", "keywords": ["sorrento", "update", "issued", "moreno", "kia", "cancelled", "left", "jan", "drove", "silver", "sent", "alert", "henry", "gray", "tolleson", "man"], "summary": "Henry Moreno, 81, left his home in Tolleson, Arizona at around 2:15 p.m. Friday, Jan. 17, 2020, according to a alert sent from DPS.\nHe drove away in a gray 2015 KIA Sorrento."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/01/10/support-your-miss-rodeo-arizona-queen-this-saturday", "title": "Support Your Miss Rodeo Arizona Queen This Saturday", "authors": ["Staff Report", "Tara Foulkrod", "Kathleen B. Kunz", "Logan Burtch-Buus"], "date": "2020-01-10", "keywords": ["miss", "rodeo", "follow", "2020", "support", "event", "queen", "williams", "children", "20", "adults", "arizona"], "summary": "click to enlargeThe Miss Rodeo Arizona Pageant has been around for over 60 years selecting rodeo queens to represent communities throughout the state and promote rodeos and the western way of life.This year’s queen for 2020 is Shelby Williams, a Pima Community College student and graduate of Marana High School.On Saturday, Jan. 11, Williams will be crowned during the 2020 Miss Rodeo Arizona Coronation, taking place at the Tucson Rodeo Grounds T-Barn from 5 to 9 p.m.Along with the crowning of Williams, there will be plenty of fun with entertainment by the Pinnacle Peak Pistoleros, food by Little Mexico Restaurant and drinks sponsored by Coca Cola.This event is Williams' largest fundraising opportunity of the year, with all proceeds raised going to help offset her travel costs when she heads to Miss Rodeo America in December.Seating is limited, but there are still tickets available on her website, here for $20 for adults and $15 for children 10 and under.Tickets can also be purchased at the door the day of for $25 for adults and $20 for children 10 and under.This is a family event with no alcohol and the dress is casual/western.For more information about Miss Rodeo Arizona visit www.missrodeoarizona.org.To follow Williams on her rodeo adventure, follow her on Facebook at www.facebook.com/shelby.wiliiams"}, {"url": "https://www.kgun9.com/news/local-news/tucson-gem-show-2020-parking-and-transportation-guide", "title": "Tucson Gem Show 2020: parking and transportation guide", "authors": [], "date": "2020-01-30", "keywords": ["guide", "shuttle", "transportation", "way", "2020", "visit", "gemride", "garages", "tucson", "gem", "vary", "parking", "locations"], "summary": "TUCSON, Ariz. — There are several gem show locations to visit all around Tucson, making transportation and parking confusing.\nGemRide ShuttleOne way to navigate the gem show map is to take the GemRide Shuttle!\nThis free shuttle system runs from Jan 30 - Feb. 16 and connects convenient parking with 43 show locations on four routes.\nParking Garages & LotsMultiple downtown garages are nearby GemRide pickup locations.\nThey include:There are also 11,000 parking spaces along the Sun Link Streetcar line, on the street or in other lots and garages."}, {"url": "https://www.kold.com/2020/01/13/country-cause-helps-family-devastated-by-house-fire-tucson/", "title": "“Country for a Cause” helps family devastated by house fire in Tucson", "authors": ["Hannah Tiede", "Published At Pm"], "date": "2020-01-13", "keywords": ["helps", "really", "devastated", "thing", "good", "sweet", "country", "kids", "dont", "mean", "marriage", "trouble", "rough", "house", "tucson", "cause", "family"], "summary": "“After 18 years marriage, that was the only thing I could get in my name,\" she said.\n“It's been a really rough year for my kids.\n[Now, with this fire] they don’t deserve it, I mean they are good kids.\nThey don’t get in trouble; they are sweet kids.”"}, {"url": "https://kvoa.com/news/local-news/2020/01/08/arizona-lawmakers-introduce-bills-to-turn-jan-8-memorial-into-national-memorial/", "title": "Arizona lawmakers introduce bills to turn Jan. 8 memorial into national memorial", "authors": ["Anthony Victor Reyes"], "date": "2020-01-08", "keywords": ["shook", "national", "nation", "tribute", "memorial", "mcsally", "today", "bills", "resilience", "introduce", "lawmakers", "tucson", "turn", "jan", "arizona"], "summary": "TUCSON - Arizona lawmakers are working on turning the soon-to-be-completed January 8th memorial into a national memorial.\nThe grand opening for the memorial was projected to be held on Jan. 8, 2021.\n“The heartbreaking attack that took place nine years ago today didn’t just impact my hometown of Tucson, it shook the nation.\n“I am proud to work with my Arizona colleagues on introducing this legislation shining a light, nationally, on the good resilience that can defeat hateful violence.”If approved, the memorial would become a national memorial once it is completed.\n“Nine years ago today, a horrific attack in Tucson shook our community to the core."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/01/17/things-to-do-this-weekend-jan-17-19", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Propublica", "Justin Elliott", "Kristen Doererfor", "Logan Burtch-Buus"], "date": "2020-01-17", "keywords": ["enlargeclick", "congress", "weeklys", "event", "dillinger", "18", "19", "food", "dispatch", "tucson", "jan", "daily", "range", "film"], "summary": "click to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeAre you ever watching a live hockey game and thinking, \"This is fun, but I just really wish my dog could be here, because that would make it so much better\"?\nGates open at 3:30 p.m. on Friday, Jan. 17, and 7 a.m. on Saturday, Jan. 18.\n10 a.m. to 5 p.m. Saturday, Jan. 18, and 11 a.m. to 4 p.m. Sunday, Jan. 19.\nSaturday Jan. 18, and Sunday, Jan. 19.\n7:30 p.m. Saturday, Jan. 18, and 2 p.m. Sunday, Jan. 19."}, {"url": "https://patch.com/arizona/tucson/full-wolf-moon-eclipse-livestream-how-watch-tucson", "title": "Full Wolf Moon, Eclipse Livestream: How To Watch In Tucson", "authors": [], "date": "2020-01-10", "keywords": ["moon", "lunar", "sky", "watch", "eclipse", "wolf", "know", "theres", "livestream", "telescope", "tucson", "howl", "penumbral"], "summary": "And speaking of howling and moons, did you know that January's full moon is called the wolf moon?\nThere are at least a couple of theories, which we'll get into, but if you're going to howl at the moon, you need to know how to dress.\nIn Tucson, the moon rises at 5:44 p.m. on Friday and sets at 8:17 a.m. on Saturday.\nSo, why is this weekend's attraction called the wolf moon?\nThe more pervasive story is that early Native American tribes began calling it the wolf moon because the animal's howl penetrated their winter camps on cold January nights."}, {"url": "https://www.kold.com/2020/01/24/community-food-bank-southern-arizona-taking-unused-fresh-citrus/", "title": "Community Food Bank of Southern Arizona taking unused, fresh citrus", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-01-24", "keywords": ["taking", "public", "community", "fresh", "southern", "locations", "bank", "food", "dropoff", "donations", "citrus", "jan", "unused", "arizona"], "summary": "The Community Food Bank of Southern Arizona will take donations from the public at two drop-off locations on Saturday, Jan. 25, 2020."}, {"url": "https://www.kgun9.com/news/local-news/2019-tucson-weather-in-review", "title": "2019 Tucson weather in review", "authors": [], "date": "2020-01-03", "keywords": ["month", "airport", "average", "snow", "2019", "weather", "monsoon", "tucson", "review", "rain", "wettest"], "summary": "TUCSON, Ariz. — Every year brings its share of beautiful, hot, cold, interesting and sometimes exciting weather to Tucson.\nThat set the stage for what was going to be an interesting year of weather and another challenging year for weather forecasters.\nAccording to the Tucson National Weather Service, 2019 marked the 21st straight year of above average yearly temperatures.\nFebruary 22nd brought widespread snow to southeastern Arizona and we even recorded 1.9” of snow at the Tucson International Airport.\nAt the Tucson International Airport, the monsoon rain total was 5.06” which fell about an inch below the average 6.08” rain total."}, {"url": "https://tucsonfoodie.com/2020/01/31/best-things-tucson-foodie-team-tasted-january-2020/", "title": "Here are the best things the Tucson Foodie team tasted in January 2020", "authors": ["Tucson Foodie"], "date": "2020-01-31", "keywords": ["sauce", "best", "order", "2020", "market", "restaurant", "things", "alfredo", "dish", "im", "foodie", "favorite", "tucson", "eating", "team", "tasted"], "summary": "Here are the Tucson Foodie staff picks of the best things we tasted in January.\nSmoked Beet Sandwich at 5 Points Market & Restaurant – Now, this is a damn good sandwich.\nZucchini Noodle Pasta Primavera at Renee’s Organic Oven – Ask anyone at Tucson Foodie and they’ll tell you about my aversion to Alfredo.\nKouign-Amann from 5 Points Market & Restaurant – Buttery, crispy pastry with caramelized edges, a herbed goat cheese custard filling, rosemary lingering on the tongue.\nKouign-Amann from 5 Points Market & Restaurant – Why did it take me this long to try a kouign-amann?"}, {"url": "https://azcapitoltimes.com/news/2020/03/19/the-covid-19-surge-is-coming-to-arizona-unless-we-take-steps-now/", "title": "The COVID-19 surge is coming to Arizona – unless we take steps now", "authors": ["Guest Opinion"], "date": "2020-03-19", "keywords": ["surge", "number", "unless", "hospitals", "testing", "numbers", "exponential", "infected", "action", "covid19", "coming", "arizona", "steps", "cases"], "summary": "The COVID-19 surge is coming to Arizona – unless we take steps nowIn just one hour on March 17, the number of confirmed COVID-19 cases in the U.S. increased by ~600.\nThe exponential explosion of COVID-19 infections is what creates the public health emergency seen in Italy and Wuhan, China.\nTo illustrate, let’s consider that each person who gets COVID-19 will, under unrestricted conditions, infect two to three people.\nThe recent actions of several Arizona municipalities and counties, closing restaurants and bars to slow the spread, is a good start.\nFor example, the percent lethality is the number of dead divided by the number of cases."}, {"url": "https://www.azdesertswarm.com/basketball/2020/4/15/21221704/nico-mannion-arizona-basketball-season-breakdown-2020-freshman-nba-draft-scouting-report-analysis", "title": "Arizona basketball season player review: Nico Mannion", "authors": ["Brian J. Pedersen", "Apr"], "date": "2020-04-15", "keywords": ["nico", "shot", "player", "wildcats", "game", "freshman", "games", "basketball", "world", "season", "mannion", "arizona", "review", "hes", "assists"], "summary": "And that’s if he ended up having a masterful season, which he didn’t.\nWhile Mannion gave Arizona the kind of scoring punch and decisiveness it hadn’t had at the point in some time, that didn’t always translate into the best results.\nBut by no means did Mannion have a bad season in his one and only with the UA.\nQuotableMiller on Mannion: “In fairness to him, it’s a world of expectations that are almost impossible to meet.\nIt’s just we’re all holding him to this standard of excellence of today’s world college basketball and it just takes time.”What’s next?"}, {"url": "https://tucsonfoodie.com/2020/02/12/mardi-gras-tucson-2020/", "title": "Celebrate Mardi Gras 2020 with food, booze & fun times", "authors": ["Matt Sterner"], "date": "2020-02-12", "keywords": ["celebrate", "live", "booze", "times", "read", "fun", "brewing", "music", "2020", "crawfish", "party", "specials", "food", "mardi", "drink", "gras"], "summary": "Mardi Gras, also known as Fat Tuesday or Shrove Tuesday, includes the practice of the last night of eating rich foods before fasting for Lent.\nFriday, February 21First Annual Mardi Gras Festival at the Slaughterhouse1102 W. Grant Rd.\nThe Parish cooks up whole alligators on Mardi Gras, and this year isn’t any different.\nMardi Gras Party at Westbound267 S. Avenida del ConventoFrom 5 – 8 p.m., Westbound is throwing a Fat Tuesday bash.\nBlue Willow Restaurant & Gift Shop2616 N. Campbell Ave.All day, Blue Willow Restaurant & Gift Shop will be offering Mardi Gras specials including the essential dishes ordered during the holiday."}, {"url": "https://nymag.com/urbanist/2020/02/tucson-arizona-travel-guide-things-to-do-where-to-stay.html", "title": "The Urbanist’s Guide to Tucson", "authors": ["Elizabeth Thompson"], "date": "2020-02-05", "keywords": ["guide", "built", "national", "midcentury", "downtown", "historic", "local", "house", "urbanists", "desert", "tucson", "broadway"], "summary": "In 2015, Tucson was the first “city of gastronomy” to be named in the U.S. by the U.N. Educational, Scientific, and Cultural Organization.\nThere’s also the Tucson Amateur Astronomy Association, which hosts regular star parties open to the public.\nConfusing Tucson with its rival 90 minutes to the north, however, will result in a terse correction from a local.\nSome of the city’s rougher-hewn charm is captured beautifully on local photographer Kristine Peashock’s Instagram account Tucson Ordinary.\nIt’s in the charming historic district, Barrio Viejo, and is the place to stay if you want to experience Tucson like a local."}, {"url": "https://tucsonfoodie.com/2020/01/31/february-2020-food-events/", "title": "February 2020 Food Events: Workshops, Wine Festivals & Beer Celebrations", "authors": ["Matt Sterner"], "date": "2020-01-31", "keywords": ["workshops", "festivals", "celebrations", "events", "read", "beer", "2020", "person", "chef", "wine", "event", "local", "food", "youll", "youve", "tacos"], "summary": "You’ve got choices that include food workshops for couples, pop-up beer dinners, all-you-can-eat tacos, a beer crawl, and wine festivals.\nThe food and beer menu has yet to be released, but you can grab your tickets now.\n2020 Tucson Craft Beer Crawl 15feb1:00 pm5:00 pm2020 Tucson Craft Beer CrawlNearly 30 participating breweries1:00 pm - 5:00 pm Arizona Event Details The adventure allows you to explore new areas of downtown, new beer, and perhaps favorite beer you've already tried in locations you've already seen.\nEither way, it's a fun experience more Event Details The adventure allows you to explore new areas of downtown, new beer, and perhaps favorite beer you’ve already tried in locations you’ve already seen.\nSunday, February 16Throughout the event you’ll get to hang out with hunky firefighters and law enforcement members, all while drinking wine and eating chocolate."}, {"url": "https://www.abc15.com/news/region-central-southern-az/tucson/possible-mini-moon-orbiting-earth-spotted-by-tucson-astronomers", "title": "Possible 'mini-moon' orbiting Earth spotted by Tucson astronomers", "authors": [], "date": "2020-02-28", "keywords": ["earth", "sky", "pruyne", "orbiting", "object", "survey", "astronomers", "orbit", "spotted", "possible", "tucson", "minimoon", "wierzchos", "tiny"], "summary": "TUCSON, AZ — Tucson astronomers have discovered a possible \"mini-moon\" orbiting Earth!\n\"These events are really rare,\" said Wierzchos, and astronomer at Cataline Sky Survey in Tucson.\n\"This is maybe the second, maybe the third asteroid out of one million known that has entered the orbit of Earth.\"\nEarth has a new temporarily captured object/Possible mini-moon called 2020 CD3.\nOn the night of Feb. 15, my Catalina Sky Survey teammate Teddy Pruyne and I found a 20th magnitude object."}, {"url": "https://www.kold.com/2020/02/14/az-weekend-feb/", "title": "AZ Weekend, Feb. 14", "authors": ["Angelica Carrillo", "Published At Pm", "Published Pm At Pm", "Published Am At Am"], "date": "2020-02-14", "keywords": ["feb", "vaqueros", "rodeo", "tucsons", "oldest", "mutton", "opens", "az", "traditions", "tucson", "prorodeo", "weekend", "14"], "summary": "One of Tucson’s oldest traditions kicks off this weekend.\nThe 95th La Fiesta de los Vaqueros - the Tucson Rodeo opens on Saturday at 11 a.m. with mutton bustin’ and the junior rodeo followed by the ProRodeo competition beginning at 2 p.m."}, {"url": "https://www.kold.com/2020/02/26/tucson-police-searching-missing-vulnerable-adult/", "title": "UPDATE: ‘Missing vulnerable adult’ found safe", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-26", "keywords": ["update", "report", "vulnerable", "spread", "missing", "adult", "went", "thank", "pimasheriff", "word", "yesterday", "safe"], "summary": "🚨UPDATE: MISSING VULNERABLE ADULT *FOUND*🚨Good news this morning on Mr. Barr who went missing yesterday.\nWe are happy to report he was found late last night alive & well!\nThank you to everyone that helped spread the word and @PimaSheriff Deputies for the assistance!\npic.twitter.com/iKetGPIDig"}, {"url": "https://kvoa.com/news/local-news/2020/02/26/video-meteor-captured-falling-through-tucson-sky-on-southeast-side/", "title": "VIDEO: Meteor captured falling through Tucson sky on southeast side", "authors": ["Anthony Victor Reyes"], "date": "2020-02-26", "keywords": ["meteor", "s", "sky", "wasnt", "object", "zooming", "video", "southeast", "falling", "youtuber", "captured", "tucson", "paris"], "summary": "TUCSON - If you looked up at the sky early Wednesday morning, you may have noticed something spectacular.\nOn Wednesday, YouTuber S Paris captured an object zooming through the sky on his dashcam at around 5:30 a.m.\nIn the video's description, S Paris believes the object that came down is a meteor.\nWith the sun still down, the video showcased a clear visual of the meteor flying through the sky.\nAccording to YouTuber, the video was captured on the southeast side of Tucson."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/02/07/things-to-do-this-weekend-feb-7-9", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Tara Foulkrod", "Kathleen B. Kunz", "Logan Burtch-Buus"], "date": "2020-02-07", "keywords": ["feb", "art", "way", "n", "weeklys", "come", "museum", "dispatch", "tucson", "arizona", "gardens", "daily", "range", "exhibit"], "summary": "This exhibition at the Tucson Desert Art Museum, put on in partnership with the Greater Southern Arizona Chapter Buffalo soldiers, depicts their daily activities in an effort to preserve their legacy.\nTucson Desert Art Museum, 7000 E. Tanque Verde Road.\nOpening reception is 5 to 7 p.m. on Friday, Feb. 7, at Yume Japanese Gardens, 2130 N. Alvernon Way.\n$70.If you like seeing Tucson art, this is one great way to see a whole lot of it in a weekend.\nTucson Museum of Art and Historic Block, 140 N. Main Ave.Can you ever really know too much about trains?"}, {"url": "https://petergreenberg.com/2020/02/21/radio-guest-list-canyon-ranch-resort-spa-in-tucson-arizona-february-22-2020/", "title": "Peter Greenberg Travel Detective", "authors": ["Peter Greenberg", "Peter Greenberg Worldwide"], "date": "2020-02-21", "keywords": ["art", "canyon", "local", "greenberg", "peter", "detective", "travel", "ranch", "horwitch", "reveals", "tucson", "history", "speaks"], "summary": "This week, Eye on Travel comes from the Canyon Ranch in Tucson, Arizona.\nWe’ll have a report on travel and sleeping (or lack of it) from Dr. Stephen Brewer, Canyon Ranch Medical Director.\nThere’s all this and more as Eye on Travel broadcasts from the Canyon Ranch Tucson.\nMaria DelliVeneri, Clinical Lead Certified Athletic Trainer at Canyon Ranch Tucson, talks about everything movement: regenerative tools, joint injuries and other physical abilitations.\nRussel Michel, Executive Chef at Canyon Ranch Tucson, tells us about the resort’s unique menu development and nutritional content using plant-forward cuisine."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/02/28/things-to-do-this-weekend-feb-29-march-1", "title": "Things to Do, This Weekend, Feb. 29 - March 1", "authors": ["Tw Fun", "Games Desk", "Propublica", "Justin Elliott", "Kristen Doererfor", "Logan Burtch-Buus"], "date": "2020-02-28", "keywords": ["feb", "tucson", "n", "celebrating", "history", "food", "museum", "tea", "things", "arizona", "weekend", "29"], "summary": "2:30 to 3:30 p.m. Saturday, Feb. 29.\n11 a.m. to 4 p.m. Saturday, Feb. 29.\nOpening 4 p.m. Saturday, Feb. 29.\nHistory on Tap is an annual event by Los Amigos, Friends of Arizona History, Inc., and the AHS Southern Arizona Chapter Board to support the Arizona Historical Society’s Arizona History Museum.\nThis is a celebration of “all things found.” 7:30 to 9:30 p.m. Saturday, Feb. 29."}, {"url": "https://tucsonfoodie.com/2020/02/29/best-things-we-tasted-february-2020/", "title": "Here are the best things the Tucson Foodie team tasted in February 2020", "authors": ["Tucson Foodie"], "date": "2020-02-29", "keywords": ["beef", "sauce", "best", "brunch", "way", "2020", "chicken", "chocolate", "things", "2019", "article", "foodie", "tucson", "bread", "team", "tasted"], "summary": "Read our December 2019 article Copper Rock Craft Eatery now open at DoubleTree on Alvernon (PHOTOS).\nRead our November 2019 article Guide to 34 pizzerias in Tucson: grab yourself a slice.\nRead our February 2020 article El Chinito Gordo offers a lively modern vibe with instant culinary classics.\nRead our February 2020 article Visual Guide to 14 Egyptian Dishes at Alexandria’s Pearl.\nRead our January 2020 article Erman brothers to launch sexy bar “Portal Cocktails” on Fourth Ave.Want more?"}, {"url": "https://247wallst.com/special-report/2020/04/13/states-with-the-most-tornadoes-5/", "title": "States With the Most Tornadoes – 24", "authors": [], "date": "2020-04-13", "keywords": ["total", "tornado", "ef5", "tornadoes", "damage", "24", "scale", "figures", "level", "property", "states"], "summary": "States With the Most Tornadoes Charles B. StockdaleThis Easter Sunday, an onslaught of tornadoes tore across Southern states, resulting in at least 19 deaths.\nTornadoes do not typically result in injury or loss of life, though they all produce at least some level of damage.\nApproximately 1,200 tornadoes form in the United States each year.\nProperty damage figures are not available for years prior to 1996, and crop damage figures are not available before 2006.\nClick here to see the states with the most tornadoes"}, {"url": "https://www.kold.com/2020/01/08/schedule-tucson-sun-cup-released/", "title": "Schedule for Tucson Sun Cup released", "authors": ["Special To Kold News", "Published April", "At Am", "At Pm"], "date": "2020-01-08", "keywords": ["total", "point", "zero", "schedule", "win", "released", "winner", "matches", "visit", "points", "tucson", "cup", "teams"], "summary": "The Visit Tucson Sun Cup winner will be determined by total points earned in three matches.\nTeams will earn three points for a win, one point for a draw, and zero points for a loss."}, {"url": "https://patch.com/arizona/tucson/valentine-s-day-2020-deals-restaurants-flowers-tucson", "title": "Valentine's Day 2020: Deals On Restaurants, Flowers In Tucson", "authors": [], "date": "2020-02-08", "keywords": ["flowers", "2020", "day", "variety", "restaurants", "offering", "waffle", "special", "restaurant", "deals", "valentines", "chain", "flower", "tucson"], "summary": "TUCSON, AZ — With Valentine's Day right around the corner, couples across the nation are eyeing their bank accounts to determine how much they can spend on the loving holiday.\nMany national chain restaurants in Tucson are offering, or plan to offer, limited-time deals for Valentine's Day.\nValentine's Day 2020: Best Gifts For Men5 Different Ways To Celebrate Valentine's Day This YearIf you know a great discount that isn't on the list, feel free to add it in the comments section below.\nChili's: Get a $25 meal for two on Valentine's Day.\nWaffle House: It's a restaurant chain not exactly known for its fine dining, but it all changes at your local Waffle House for Valentine's Day."}, {"url": "https://tucsonfoodie.com/2020/01/30/10th-annual-arizona-beer-week-2020/", "title": "10th annual Arizona Beer Week returns to Tucson, events listed", "authors": ["Matt Sterner"], "date": "2020-01-30", "keywords": ["read", "events", "returns", "brewing", "week", "beer", "feb", "10th", "tap", "vida", "brewings", "listed", "pairing", "tucson", "arizona", "tooth", "company", "annual"], "summary": "FRIENDS Trivia Night at Crooked Tooth Brewing CompanyFrom 7 – 9 p.m., Crooked Tooth Brewing will be hosting a FRIENDS Trivia night.\nThe participating breweries on tap will be Dragoon Brewing Company, Pueblo Vida Brewing Company, and Tombstone Brewing Company.\nSentinel Peak Brewing Company is turning up the heat with its annual Crawfish Boil from 11 a.m. – 10:30 p.m.\nBeer Pairing Dinner with Pueblo Vida Brewing Company at Anello PizzeriaThis beer pairing dinner will have two different seating times at 5:30 p.m. and 7:30 p.m.\n1912 Brewing Company & Tombstone Brewing Company CollaborationCome taste the creation the two breweries put together."}, {"url": "https://www.kgun9.com/news/local-news/john-legend-2020-tour-to-stop-in-tucson", "title": "John Legend 2020 tour to stop in Tucson", "authors": [], "date": "2020-02-06", "keywords": ["website", "tony", "tour", "2020", "winning", "yearlegend", "legend", "john", "status", "weeks", "tucson", "stop", "vegaslegend"], "summary": "TUCSON, Ariz. — Multi-platinum recording artist John Legend is making a stop in the Old Pueblo this year.\nLegend is hitting the AVA Amphitheater at Casino Del Sol on Sept. 20 as part of his \"Bigger Love 2020 Tour.\"\nIt's legend's only stop in Arizona on the tour, before a stop in Los Angeles and after a stop in Las Vegas.\nLegend has sold millions of albums over his career, and is one of the few performers to earn EGOT status -- winning an Emmy, Grammy, Oscar and Tony award.\nHis song \"All of Me\" sat on the Billboard Hot 100 for 59 weeks in 2014 and 2015."}, {"url": "https://www.kold.com/2020/02/02/tucson-police-responding-shooting-east-side/", "title": "UPDATE: Suspect arrested in east side shooting involving 5-year-old", "authors": ["Hannah Tiede", "Published At Pm"], "date": "2020-02-02", "keywords": ["took", "update", "suspect", "shooting", "useful", "5yearold", "stour", "arrested", "yearold", "afternoon", "witnesses", "pictwittercom2y6zysiqyy", "involving", "east", "team"], "summary": "This 5 year-old took a bullet to the head Sun afternoon while a suspect was shooting at another person in the 5400blk of E 30th St.Our dedicated team made an arrest this afternoon but we still need help from witnesses & those who might have useful info.\nPlease call 520-88 CRIME.\npic.twitter.com/2y6zysIQyy"}, {"url": "https://www.kgun9.com/news/local-news/rillito-park-racetrack-opens-for-2020-winter-meet", "title": "Rillito Park Racetrack opens for 2020 Winter Meet", "authors": [], "date": "2020-02-08", "keywords": ["heritage", "rillito", "university", "pima", "racetrack", "meet", "2020", "opening", "opens", "winter", "open", "weekend", "park"], "summary": "TUCSON, Ariz. — The Rillito Park Racetrack is now open for the 2020 Winter Meet.\nThe 2020 Winter Meet will have seven weekends including 14 days of live racing from Feb. 8 through Mar.\nThe gates will open at 10 a.m. on race days and close after the last Simulcast race.\nFebruary Schedule:February 8 , Opening weekend, February 9 , Opening weekend, February 15 , University of Arizona weekend, February 16 , University of Arizona weekend, February 22 , Pima County Fair weekend, February 23 , Pima County Fair weekend, February 29, Budweiser Clydesdale's weekendMarch Schedule:March 1 , Budweiser Clydesdale's weekend, March 7 , Charity weekend, March 8 , Charity weekend, March 14 , Heritage weekend, March 15 , Heritage weekend, March 21 , Closing weekend, March 22, Closing weekendFor more information about the Rillito Park Racetrack, click here."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/02/21/things-to-do-this-weekend-feb-21-23", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Propublica", "Justin Elliott", "Kristen Doererfor", "Logan Burtch-Buus"], "date": "2020-02-21", "keywords": ["enlargeclick", "22", "feb", "free", "21", "n", "weeklys", "includes", "cat", "donut", "dispatch", "tucson", "daily", "range"], "summary": "click to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeMaynards Market & Kitchen is hosting a special wine tasting event celebrating everyone’s favorite southwestern European peninsula.\n7 p.m. Friday, Feb. 21, and Saturday, Feb. 22.\nLast year, they gave out prizes ranging from “Best Hand Applique” to “Best Use of Color.” 9 a.m. to 5 p.m. Friday, Feb. 21, and Saturday, Feb. 22.\nExhibit opens Friday, Feb. 21 at the Flandrau Science Center & Planetarium, 1601 E. University Blvd.\n2 p.m. Saturday, Feb. 22, and 7 p.m. Wednesday, Feb. 26."}, {"url": "https://kvoa.com/news/top-stories/2020/02/28/crews-battle-2-story-building-fire-on-tucsons-west-side/", "title": "TFD: 8 displaced after apartment fire on Tucson’s west side", "authors": ["Julia Leon"], "date": "2020-02-28", "keywords": ["w", "sgtdugan", "sergeant", "morning", "west", "apartment", "tfd", "pete", "prince", "residents", "tucson", "tucsons", "displaced", "rd"], "summary": "TUCSON – Eight residents were displaced after a two-alarm apartment fire Friday on Tucson’s west side.\nTucson Fire Department crews were dispatched to the 500 block of W. Prince Road after receiving multiple 911 calls reporting smoke and flames coming from the complex.\n🚨 TRAFFIC ALERT 🚨Prince Rd, just west of Oracle, is shut down in both directions due to an apartment fire at 570 W Prince Rd.\npic.twitter.com/7wH2oLMgsa — Sergeant Pete Dugan (@SgtDugan) February 28, 2020🚨TRAFFIC ALERT UPDATEPrince Rd has reopened following the early morning fire at 570 W Prince.\n— Sergeant Pete Dugan (@SgtDugan) February 28, 2020Stay with News 4 Tucson for more updates."}, {"url": "https://www.kold.com/2020/02/13/investigators-identify-three-killed-interstate-collision/", "title": "Investigators identify three killed in Interstate 19 collision", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-13", "keywords": ["investigators", "officials", "killed", "rear", "nogales", "interstate", "vehicle", "identify", "wrote", "slowed", "19", "traffic", "twovehicle", "road", "collision"], "summary": "The two-vehicle collision happened at mile marker 18 on Interstate 19 at around 3:10 p.m. Feb. 11, 2020.\nInvestigators said driver 18-year-old Nicole Diaz from Nogales was rear ended by another vehicle while traffic slowed because of another collision up the road, DPS officials wrote in an email."}, {"url": "https://www.kold.com/2020/02/24/man-indicted-shooting-young-tucson-girl/", "title": "Suspect arraigned in connection with shooting of young Tucson girl", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-24", "keywords": ["related", "suspect", "shooting", "shot", "way", "riding", "target", "connection", "williams", "tucson", "young", "victim", "arraigned", "girl"], "summary": "Authorities said the young girl, who was shot while riding in a car with her grandmother, is not related or connected to Williams in any way.\nThe Tucson Police Department said the other victim was the target of the shooting."}, {"url": "https://www.kold.com/2020/01/31/az-weekend-jan/", "title": "AZ Weekend, Jan. 31", "authors": ["Angelica Carrillo", "Published At Pm", "Published Pm At Pm", "Published Am At Am"], "date": "2020-01-31", "keywords": ["guide", "know", "az", "visit", "31", "official", "need", "tucson", "gem", "weekend", "jan", "online"], "summary": "Visit Tucson has the Official Tucson Gem Show Guide online and has everything you need to know on each show and how to get there."}, {"url": "https://patch.com/arizona/tucson/super-bowl-2020-chain-restaurants-tucson-offering-deals", "title": "Super Bowl 2020: Chain Restaurants In Tucson Offering Deals", "authors": [], "date": "2020-02-01", "keywords": ["wings", "free", "offering", "2020", "super", "restaurants", "bowl", "set", "deals", "wild", "chain", "tater", "tucson"], "summary": "TUCSON, AZ — The Kansas City Chiefs are ready to do battle with the San Francisco 49ers in Super Bowl 2020 in Miami on Sunday.\nSeveral national-chain restaurants in Tucson are now offering limited-time deals for the Super Bowl.\nBuffalo Wild Wings: It's a deal predicated on the actual events of the Super Bowl.\nIf the game goes into overtime, Buffalo Wild Wings will give away free wings at all of its restaurants in the United States.\nPizza Hut: The pizza chain is an official sponsor of the NFL, and the restaurant is offering its Meat Lovers Pizza for 30 percent off from now until Super Bowl Sunday."}, {"url": "https://www.kold.com/2020/02/06/tucson-police-investigate-midtown-armed-robbery/", "title": "Tucson police investigate midtown armed robbery", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-06", "keywords": ["public", "officer", "midtown", "point", "magos", "robbery", "robbed", "investigate", "woman", "armed", "tucson", "quik", "road", "mart"], "summary": "Officer Francisco Magos, a public information officer with the Tucson Police Department, said in an email that a woman robbed a Quik Mart, located at 1250 E. Fort Lowell Road, at knife point just before 5 p.m. Wednesday."}, {"url": "https://kvoa.com/news/2020/02/09/catholic-community-remembers-tucson-priest/", "title": "Catholic community remembers Tucson priest", "authors": ["Mark Mingura"], "date": "2020-02-09", "keywords": ["monica", "community", "priest", "catholic", "2020", "raul", "saint", "great", "parish", "valenciagarcia", "nogales", "tucson", "heart", "remembers"], "summary": "TUCSON - The Roman Catholic Diocese of Tucson announced that Father Raul Valencia-Garcia has died after he was involved in a two-vehicle collision on Interstate 19 Friday morning.\nValencia-Garcia was the pastor at Saint Monica Roman Parish, where he had been since July of 2011.\nThis was Valencia-Garcia's second time being assigned to the Saint Monica parish.\nWhen he became a newly ordained priest in 2003 Saint Monica was his first assignment.\nHe was as they say small, short in stature but had a great great great heart that really encouraged, motivated."}, {"url": "https://patch.com/arizona/tucson/9-tucson-valentine-s-day-2020-events-take-your-honey", "title": "8 Tucson Valentine's Day 2020 Events To Take Your Honey To", "authors": [], "date": "2020-02-11", "keywords": ["events", "university", "2020", "honey", "day", "dinner", "tickets", "valentines", "ste", "musical", "tucson", "st", "lemmon"], "summary": "TUCSON, AZ — Valentine's Day 2020 in Tucson brings many events for those wanting to do something besides a movie night out or Netflix at home with their honey.\n170, Tucson — A celebration with artists, food and fun from 5 to 7 p.m. Acoustic harpist Vanessa Myers performs during the reception.\nAlan Parsons Live Project, Fox Tucson Theatre, 17 W. Congress St., Tucson — The Alan Parsons Project band was born in 1975, part of Britain's soft rock and progressive musical movement.\nThey will regale their Valentine's Day audience with laid-back tunes in a multimedia performance starting at 8 p.m. $35 to $100.\nValentine's Day Dance, El Casino Ballroom, 437 E. 26th St., Tucson — Dance to the sounds of The Festival Band & DJ Albert B, while enjoying a $5 spaghetti dinner plate from 7 to 9:30 p.m. $7 cover charge."}, {"url": "https://www.kold.com/2020/02/08/president-donald-trump-host-rally-phoenix-feb/", "title": "President Donald Trump to host rally in Phoenix Feb. 19", "authors": ["Kold News Staff", "Published April", "At Am", "Published March", "At Pm"], "date": "2020-02-08", "keywords": ["officer", "rally", "feb", "women", "state", "president", "operating", "trump", "successes", "donald", "promises", "19", "transformed", "arizona", "host", "phoenix"], "summary": "“President Trump has transformed the economy of Arizona, creating more than 238,600 jobs in the state since he was elected,” said Michael Glassner, Chief Operating Officer of Donald J. Trump for President, Inc. “President Trump has delivered on his promises and he looks forward to celebrating those successes with the great men and women of Arizona.”"}, {"url": "https://www.kold.com/2020/02/22/collision-blocks-lanes-interstate/", "title": "UPDATE: Collision on Interstate 10 cleared", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-22", "keywords": ["update", "officials", "fourth", "transportation", "interstate", "sixth", "limited", "left", "lanes", "cleared", "avenue", "westbound", "collision"], "summary": "Officials with the Arizona Department of Transportation said in an email that details are limited but they said the crash blocked the left two lanes on westbound Interstate 10 at Fourth Avenue and Sixth Avenue exit."}, {"url": "https://www.kold.com/2020/02/19/plenty-events-planned-tucson-navy-week/", "title": "Plenty of events planned in Tucson for Navy Week", "authors": ["Special To Kold News", "Published At Pm"], "date": "2020-02-19", "keywords": ["starting", "provide", "plenty", "events", "week", "roadrunners", "present", "support", "tcc", "stockton", "navy", "puck", "tucson", "uss", "planned"], "summary": "6:30 p.m.: USS Tucson Commander Doug Pratt will do the puck drop starting the Tucson Roadrunners’ game against the Stockton Heat at the TCC.\nNavy personnel will provide Color Guard support and present the National Anthem."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2020/02/25/things-to-do-tuesday-feb-25", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Propublica", "Kristen Doererfor", "Logan Burtch-Buus", "Tara Foulkrod"], "date": "2020-02-25", "keywords": ["shows", "feb", "music", "brunch", "25", "theres", "weeklys", "includes", "magic", "gras", "dispatch", "tucson", "mardi", "daily", "range"], "summary": "8 p.m. to midnight on Tuesday, Feb. 25.\n6 to 8:30 p.m. Tuesday, Feb. 25.\nNo reservations needed, first come first served.There’s always something kind of sexy about magic shows.\n8 p.m. Tuesday, Feb. 25.\nAt 191 Toole...Hosted by harpistAt Monterey Court...Celebrate Mardi Gras on Fat Tuesday at Westbound.keep the party going.hosts this family-friendly event..."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20200214/729297/valentines-day", "title": "Tucson, AZ Patch", "authors": [], "date": "2019-12-23", "keywords": ["patch", "menu", "views", "romantic", "tucsons", "day", "wine", "wow", "valentines", "az", "loved", "tucson", "weekend"], "summary": "Spend Valentine’s Day weekend with your loved one at Tucson’s Most Romantic Dining Spot.\nThis Valentine's Day we will be featuring our expertly crafted Grill dinner menu with a few Chef-created Specials sure to wow your taste buds.\nOur special Valentine's Day menu will be available all weekend long beginning Friday, February 14th through Sunday, February 16th.\nEnjoy the spectacular views, romantic ambiance and decadent food with your loved one by your side Friday, Saturday or Sunday evening.\nPair your dinnner with a glass or bottle of wine from our award-winning, 800-label wine list."}, {"url": "https://www.kold.com/2020/02/27/university-arizona-permanently-close-confucius-institute-citing-new-federal-policies/", "title": "University of Arizona to permanently close Confucius Institute, citing new federal policies", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-27", "keywords": ["month", "permanently", "university", "state", "universities", "nation", "release", "citing", "confucius", "close", "soon", "institute", "federal", "policies", "institutes", "missouri", "arizona"], "summary": "Institutes as the University of Maryland and the University of Missouri announced last month they would close soon, according to the release.\nArizona State University is one of more than a dozen of universities across the nation to close their institutes over the last two years."}, {"url": "https://patch.com/arizona/tucson/city-tucson-presidents-day-2020-trash-recycling-changes", "title": "Tucson Presidents Day 2020: Trash, Recycling, City Office Changes", "authors": [], "date": "2020-02-13", "keywords": ["trash", "presidents", "recycling", "day", "city", "changes", "2020", "schedule", "residents", "office", "tucson", "service", "online"], "summary": "TUCSON, AZ — Monday is Presidents Day, which brings local and federal government closures.\nFor city residents, Presidents Day 2020 in Tucson also brings trash and recycling schedule changes.\nCommercial and residential trash and recycling collection for Tucson residents will not occur on Presidents Day, but will be delayed by one day.\nCustomers doing so will be contacted by a City employee \"no later than the next business day,\" City officials reported.\nPresidents Day was originally created back in 1885 to commemorate George Washington's birthday, but the holiday was expanded over time to honor all U.S. presidents."}, {"url": "https://www.kgun9.com/news/local-news/weather-updates-track-rainfall-across-southern-arizona", "title": "Track rainfall across Southern Arizona", "authors": [], "date": "2020-02-22", "keywords": ["expected", "track", "rainfall", "washes", "updates", "southern", "moisture", "weather", "tucson", "arizona", "weekend", "weekendthe"], "summary": "TUCSON, Ariz. — Live updates of moisture and rainfall moving across Southern Arizona this weekend.\nThe National Weather Service in Tucson says light to moderate rainfall continues across southeastern Arizona, and heavy rains are expected to develop later this afternoon.\nMount Lemmon has received approximately 2.24\" of rain, and the rest of metro Tucson has seen about 0.25\"-0.50\" of rainfall, according to NWS.\nMinor street flooding and flowing washes is to be expected, NWS Tucson says.\nHOURLY FORECAST: Here is what to expectSunday 5:00 a.m.11:00 a.m.7:00 a.m.3:00 a.m.RELATED: A soggy start to the weekend as lots of moisture arrives from the Pacific"}, {"url": "https://kvoa.com/news/2020/02/06/digging-deeper-raids-target-tucson-drug-trafficking-organization/", "title": "DIGGING DEEPER: Raids target Tucson drug trafficking organization", "authors": ["Lupita Murillo", "Paul Birmingham"], "date": "2020-02-06", "keywords": ["digging", "transport", "raids", "illegally", "sell", "conduct", "charges", "target", "narcotic", "trafficking", "drug", "andor", "organization", "tucson", "x2", "deeper"], "summary": "The Digging Deeper team uncovered court documents that give new insight into the drug trafficking activities of Orlando and Luis Montano-Hernandez.\nIn all of the 11 people arrested, they're facing over 40 charges ranging from various drug charges to money laundering.\nThat's where Tracey Trevena was arrested and charged with multiple drug charges and illegally conducting an enterprise.\nInvestigators learned the Montano-Hernandez organization used multiple phones and numbers to aid them in their drug distribution efforts.\nBelow are the names and charges provided by the Pima County Jail:Montano-Hernandez, Luis - Narcotic Drug -Possess for Sale, Narcotic Drug -Manufacture, Narcotic Drug -Transport and/or Sell x8, Dangerous Drug -Transport and/or Sell x2, Money Laundering -Conceal Proceeds, Illegally Conduct EnterpriseHernandez, Orlando - Narcotic Drug -Transport and/or Sell x5, Illegally Conduct Enterprise, Failure to Appear 2nd degree (Original charge: DSL)Tapia, Tatiana - Narcotic Drug -Transport and/or Sell x2, Dangerous Drug -Transport and/or Sell x2, Illegally Conduct EnterpriseTapia, Jesus - Narcotic Drug -Possess for Sale, Narcotic Drug -Manufacture; Narcotic Drug -Transport and/or Sell; Illegally Conduct EnterpriseRubio, Antonio - Money Laundering -Conceal Proceeds;Illegally Conduct EnterpriseTrevena, Tracey - Narcotic Drug -Transport and/or Sell x2; Dangerous Drug -Transport and/or Sell x2; Illegally Conduct EnterpriseRuiz, Irene (Norzagaray, Irene) -- Narcotic Drug -Transport and/or Sell; Illegally Conduct EnterpriseTaylor, Raymond - Narcotic Drug -Transport and/or Sell; Illegally Conduct EnterpriseNavallaz, Carlos - Narcotic Drug -Transport and/or Sell; Illegally Conduct EnterpriseKehn, William - Narcotic Drug -Transport and/or Sell; Illegal Control of EnterpriseStirnweis, Jeffrey - Narcotic Drug -Transport and/or Sell x2; Illegally Conduct Enterprise"}, {"url": "https://www.kgun9.com/news/local-news/border-tunnel-discovered-underneath-nogales", "title": "Border tunnel discovered underneath Nogales", "authors": [], "date": "2020-02-27", "keywords": ["border", "cbparizona", "cbp", "tunnel", "discovered", "crossborder", "underneath", "nogales", "tucson", "mexican", "law"], "summary": "TUCSON, Ariz. - Authorities discovered a border tunnel connected to a storm drain underneath Nogales, Ariz. and Nogales, Son.\nAccording to U.S. Customs and Border Protection, it's the 126th cross-border tunnel discovered in the Tucson Sector.\nAmerican authorities discovered the tunnel in partnership with Mexican law enforcement.\n126th illicit cross-border tunnel discovered in the #Tucson Sector.\nThe tunnel was found by #BorderPatrol agents and Mexican law enforcement under the streets of Ambos Nogales."}, {"url": "https://www.kold.com/2020/02/19/tucson-rural-metro-fire-responds-hiker-rescue-ventana-canyon-trail/", "title": "Tucson Rural Metro Fire responds to hiker rescue at Ventana Canyon Trail", "authors": ["Kold News Staff", "Published At Pm"], "date": "2020-02-19", "keywords": ["responds", "metro", "injury", "fell", "suffered", "canyon", "rural", "trail", "hiker", "rescue", "mile", "chief", "john", "walka", "tucson", "ventana", "man"], "summary": "The hiker, a man in his 70s, fell down about a mile into the trail and suffered an injury to his arm, according to Battalion Chief John Walka."}, {"url": "https://www.kold.com/2020/02/24/huge-police-presence-north-tucson-neighborhood/", "title": "UPDATE: Man arrested following fugitive standoff in north Tucson", "authors": ["Published At Pm"], "date": "2020-02-24", "keywords": ["update", "members", "deployed", "white", "residence", "windows", "task", "arrested", "north", "standoff", "fugitive", "force", "bean", "bag", "tucson", "man", "following", "walk"], "summary": "Task force members established a location for White in north Tucson and began surveillance when they saw him walk into a residence.\nTask Force members surrounded the residence and used sirens and public address systems in an attempt to have White come out.\nWhite refused to comply until Task Force members deployed a bean bag shotgun to break several windows of the residence.\nShortly after a 2nd bean bag round was deployed, White and an adult female voluntarily came out of the home and were arrested."}, {"url": "https://kvoa.com/news/top-stories/2020/02/26/tpd-homicide-investigation-underway-on-tucsons-south-side/", "title": "1 dead, 2 injured after shooting on Tucson’s south side", "authors": ["Julia Leon"], "date": "2020-02-26", "keywords": ["transported", "s", "campbell", "shooting", "university", "tucsonpolice", "south", "injured", "dead", "tucson", "valencia", "tucsons", "man"], "summary": "TUCSON – A man is dead and two others are injured after a shooting on Tucson’s south side early Wednesday morning.\nAccording to Tucson Police Department, a man in his 20s was pronounced dead at the scene at 6280 S. Campbell Avenue, near Bilby and Valencia roads.\nAnother man with life-threatening injuries was transported to Banner- University Medical Center Tucson.\nPolice say that a third man, who had been shot, showed up at a different hospital.\nHomicide investigation S. Campbell."}, {"url": "https://instoremag.com/select-jewelry-show-tucson-education-line-up/", "title": "Select Jewelry Show Tucson Education Line Up", "authors": ["Instore Staff"], "date": "2020-01-27", "keywords": ["shows", "jewelry", "palumbo", "hucker", "opportunity", "line", "manufacturers", "select", "education", "tucson", "meet", "retailers"], "summary": "(PRESS RELEASE) Select Jewelry Show Tucson is a new addition to the successful line up of fall shows held at the Ritz-Carlton in Dallas, Washington DC, and Connecticut.\nThe new Tucson event is being held at the luxurious Westin La Paloma Resort in Tucson, Arizona on February 2-3, 2020.\nSelect offers jewelers an opportunity to meet with 63 of the jewelry industry’s top-tier designers and manufacturers.\nThe Select Tucson schedule of February 2-3, Sunday and Monday works perfectly for better retailers coming to town for Tucson’s important gem shows.\nIt does not interfere or overlap with the main Tucson shows."}, {"url": "https://www.kold.com/2020/02/25/cologuard-classic-returns-tucson/", "title": "Cologuard Classic returns to Tucson", "authors": ["Brooke Chaplain", "Published At Pm"], "date": "2020-02-25", "keywords": ["away", "returns", "classic", "proceeds", "conquistadores", "million", "weve", "event", "cologuard", "given", "tucson", "began", "hoping", "600000"], "summary": "“We’ve given over 36 million away since the Conquistadores began and we’re hoping the proceeds from this event will be about $600,000,” she said."}, {"url": "https://www.kold.com/2020/02/24/fatal-collision-shuts-down-traffic-south-side-intersection/", "title": "UPDATE: Deceased person identified in south side fatal collision", "authors": ["Published At Pm"], "date": "2020-02-24", "keywords": ["scene", "update", "officer", "interviews", "deceased", "person", "determined", "responded", "fatal", "roadway", "south", "impaired", "factor", "identified", "collision", "speed"], "summary": "A DUI Officer responded to the scene and determined the driver was not impaired at the time of the collision.\nInterviews in conjunction with roadway evidence determined that speed does not appear to be a factor in this collision."}, {"url": "https://patch.com/arizona/tucson/tucson-rodeo-parade-3rd-performance", "title": "Tucson Rodeo Performances, Finals: Schedule, Events, Info", "authors": [], "date": "2020-02-20", "keywords": ["purchase", "events", "rodeo", "feb", "performances", "schedule", "rodeo1230", "barn", "rodeo2", "coors", "info", "tucson", "bags", "finals", "ticket"], "summary": "TUCSON, AZ — The Tucson Rodeo is well underway, and the finale this weekend is sure to make for some great entertainment.\nPatch has compiled some need-to-know information about the Tucson Rodeo for anybody who wants to attend, from parking and safety information, to bag policies and a schedule.\nHere's the need-to-know for the Tucson Rodeo:Parking at the Tucson Rodeo Grounds is $7.\nHere's the remaining schedule, obtained from the Tucson Rodeo website.\n*Access with purchase of a rodeo ticket plus $5 per person; includes admission to after-rodeo Coors Barn Dance."}, {"url": "https://www.kold.com/2020/03/31/stay-at-home-order-issued-arizona-tucsonans-respond/", "title": "Stay-at-home order issued for Arizona; Tucsonans respond", "authors": ["Hannah Tiede", "Published At Pm"], "date": "2020-03-31", "keywords": ["issued", "having", "respond", "order", "smile", "tucsonans", "oaxaca", "think", "nice", "stayathome", "room", "need", "maneuver", "hardest", "arizona", "stores"], "summary": "“I think the hardest part is in the stores not having the amount of room you need to maneuver and keep the six feet, but I think everyone is doing their best and with a smile; which is nice,” Oaxaca said."}, {"url": "https://www.bizjournals.com/phoenix/news/2020/04/15/raytheon-announces-pay-cuts-furloughs-as-pandemic.html", "title": "", "authors": [], "date": "2020-04-15", "keywords": [], "summary": ""}, {"url": "https://www.oxygen.com/true-crime-buzz/where-is-emanuel-book-richardson-from-the-scheme-now", "title": "How Was 'Book' Richardson Involved With The NCAA Basketball Bribery Scandal And Where Is He Now?", "authors": [], "date": "2020-04-07", "keywords": ["coach", "book", "assistant", "according", "college", "scandal", "ncaa", "dawkins", "basketball", "coaches", "richardson", "players", "bribery", "dangelo", "involved"], "summary": "Arizona's assistant coach Book Richardson watches as Arizona plays New Mexico State in the second half of an NCAA college basketball game on Wednesday, Dec. 11, 2013.\nArizona's assistant coach Book Richardson watches as Arizona plays New Mexico State in the second half of an NCAA college basketball game on Wednesday, Dec. 11, 2013.\nAlong the way, college coaches were used to funnel money to players as well, such as University of Arizona assistant coach Emanuel \"Book\" Richardson.\nDawkins bragged in the documentary about calling assistant coaches like Richardson daily.\nRichardson was working as an assistant coach for the University of Arizona under head coach Sean Miller at the time."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/10/25/things-to-do-in-tucson-this-weekend", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Christopher Boan"], "date": "2019-10-25", "keywords": ["730", "enlargeclick", "comedy", "theatre", "terrorfest", "special", "oct", "weeklys", "improv", "horror", "dispatch", "tucson", "daily", "range"], "summary": "This year, Tucson TerrorFest is partnering with Tucson Comic-Con, the Fox Theatre and more, to be bigger than ever.\nTucson TerrorFest 2019 runs from Thursday, Oct. 24 to Sunday, Oct. 27.\nImprov with The Riveters and The Openers at 7:30 p.m. and The Soapbox at 9 p.m. at Tucson Improv Movement (TIM) ($5).\nThis year, Tucson TerrorFest is partnering with Tucson Comic-Con, the Fox Theatre and more, to be bigger than ever.\nclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeclick to enlargeGrapes to Glass."}, {"url": "https://tucsonfoodie.com/2019/10/01/october-food-events-2019/", "title": "October Food Events: Spooky dinners, free meals & outdoor food festivals", "authors": ["Matt Sterner"], "date": "2019-10-01", "keywords": ["festivals", "read", "events", "free", "fall", "town", "wine", "event", "bar", "dinners", "food", "festival", "outdoor", "spooky", "tucson", "meet", "meals"], "summary": "Admission is free to get into the Fall Festival, and you’ll just pay as you go/weave in and out of the various scents from the vendors.\nAdmission is free to get into the Fall Festival, and you’ll just pay as you go/weave in and out of the various scents from the vendors …read more.\nFriday, October 18 – Sunday, October 20Willcox Wine Country Fall Festival 2019The annual event returns with a Wine Benefit Dinner and weekend-long festival.\nThe Wine Festival takes place from 11 a.m. – 5 p.m. from Saturday, October 19 – Sunday, October 20.\nSunday, October 27Grapes to Glass Wine Festival at Maynards Market & KitchenEach of the wineries will be pouring a red and a white wine tastings from their portfolio and then selling bottles to take home."}, {"url": "https://www.kgun9.com/news/local-news/tucson-meet-yourself-2019-everything-you-need-to-know", "title": "Tucson Meet Yourself 2019: Everything you need to know", "authors": [], "date": "2019-09-23", "keywords": ["closed", "street", "avenue", "know", "church", "2019", "event", "cultural", "need", "festival", "tucson", "meet"], "summary": "Takoyaki Balls: a Tucson Meet Yourself stapleAccording to festival organizers, 120,000 people are expected to attend during the three day event.\nWednesday, October 9, 2019, 6 p.m. through Sunday, October 13, 2019, midnight – Church Avenue will be closed from Pennington Street to Alameda Street.\nFriday, October 11, 2019, 6 p.m. through Sunday, October 13, 2019, midnight – Church Avenue will be closed from Alameda Street to Congress Street.\nDowntown Tucson will host “Tucson Meet Yourself” this weekend.\nTurkish coffee: A Tucson Meet Yourself traditionWho's performing this year?"}, {"url": "https://somd.com/news/headlines/2020/23526.php", "title": "Local Navy Contract Awards", "authors": ["Virtually Everything", "Southern Maryland Online"], "date": "2020-04-15", "keywords": ["services", "virginia", "awards", "oklahoma", "aircraft", "funds", "local", "procurement", "llc", "navy", "contract", "fiscal", "work"], "summary": "WASHINGTON$6,106,000,000(April 15, 2020)—The U.S. Department of Defense recently announced the following contract awards that pertain to local Navy activities., is awarded amodification (P00006) to a previously-awarded firm-fixed-price contract N00019-18-C-1061 to procure eight General Electric F414-400 spare engines, 11 afterburner modules and 12 low pressure turbine modules for the Navy F/A-18 Super Hornet fighter aircraft.\nFiscal 2020 aircraft procurement (Navy) funds in the amount $51,520,476 will be obligated at time of award, none of which will expire at the end of the current fiscal year.\nFiscal 2020 aircraft procurement (Navy) funds of $9,696,091 will be obligated at time of award, none of which will expire at the end of the current fiscal year.\nThis modification changes the contract type of the Stand-off Land Attack Missile — Expanded Response (SLAM-ER) Phase I obsolescence redesign from a cost-plus-incentive-fee type contract to a firm-fixed-price type contract.\nFiscal 2020 weapons procurement (Navy) funds in the amount of $15,151,392; fiscal 2019 weapons procurement (Navy) funds in the amount of $11,363,544; and fiscal 2019 research, development, test and evaluation (Navy) funds in the amount of $3,787,848 will be obligated at time of award, none of which will expire at the end of the fiscal year."}, {"url": "https://patch.com/arizona/tucson/whats-open-closed-tucson-columbus-day-2019", "title": "What's Open/Closed In Tucson On Columbus Day 2019", "authors": [], "date": "2019-10-11", "keywords": ["peoples", "mall", "columbus", "indigenous", "day", "2019", "holiday", "openclosed", "museum", "washington", "reported", "tucson", "whats"], "summary": "TUCSON – The Washington Post reported Thursday that Washington, D.C. Council member David Grosso this week initiated \"emergency legislation\" to rename Columbus Day as Indigenous Peoples' Day.\nLikewise, ABC News reported that more than 100 cities have already renamed the holiday as Indigenous Peoples' Day.\nBut in Arizona, the holiday we still call Columbus Day hits this Monday, Oct. 14, and with it, questions about what we can do and where we can go for entertainment, banking, pet adoptions and more in Tucson that day.\nThough most of the museums and places of business we contacted will be open on Columbus Day, a few won't.\nstores:Safeway – OPENCostco – OPENWalmart – OPENFry's – OPENMalls:Park Place Mall – OPENFoothills Mall – OPENLa Encantada – OPENTucson Mall – OPENPet adoptions:"}, {"url": "https://patch.com/arizona/tucson/8-things-do-tucson-labor-day-2019", "title": "8 Things To Do In Tucson On Labor Day 2019", "authors": [], "date": "2019-08-30", "keywords": ["tours", "labor", "community", "race", "tour", "day", "things", "2019", "registration", "520", "tucson", "pet"], "summary": "TUCSON, AZ – With so many businesses and organizations' offices closed on Labor Day, Tucson is still in holiday-happenings mode on Labor Day, this Monday, Sept. 2.\nThe Museum is open from 9 a.m. to 5 p.m., and Labor Day general admission is $3.\nLabor Day Warrior Training Camp, 9 a.m. to 3 p.m., Playformance, 119 E. Toole Ave., Tucson.\nLabor Day Community Bash, 11 a.m. to 3 p.m., Tucson Jewish Community Center, 3800 E. River Road, Tucson.\nLabor Day is free day at the JCC, so before and after the bash, the community can use the JCC's fitness center, tennis courts and indoor playspace at no cost."}, {"url": "https://www.businessinsider.com/stephanie-grisham-life-bio-photos-trump-press-secretary-melania-2020-4", "title": "Inside former White House press secretary Stephanie Grisham's rocky rise to the top of the Trump administration", "authors": ["Ellen Cranley"], "date": "2020-04-07", "keywords": ["ladys", "rocky", "secretary", "track", "state", "white", "press", "rise", "wing", "grisham", "house", "trumps", "stephanie", "inside", "grishams", "trump"], "summary": "Stephanie Grisham was announced in June as President Donald Trump's newest press secretary.\nThe native Arizonian cut her teeth working for state lawmakers and on Sen. Mitt Romney's unsuccessful 2012 presidential campaign.\nGrisham was first lady Melania Trump's communications director before becoming Trump's press secretary.\nWhen the East Wing announced Tuesday she was moving back to work in the first lady's office, Grisham left behind a track record of controversy from her tense relationship with the White House press corps.\nSee how Grisham rose to press secretary position, making history as the fourth woman ever to serve in the role."}, {"url": "https://www.kold.com/2019/09/30/vp-mike-pence-visit-arizona-this-week/", "title": "UPDATE: Road open after Vice President Mike Pence speaks in Green Valley", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-09-30", "keywords": ["update", "pence", "urge", "passage", "pictwittercomnwa7ltd6ro", "green", "proving", "usmca", "vicepresident", "pass", "speaker", "speaks", "pelosi", "valley", "road", "president", "vice", "mike", "trade", "open"], "summary": "#vicepresident #mikepence in #greenvalley at the #Caterpiller Proving Grounds to urge passage of the #usmca trade agreement.\nTime has come for #Congress to pass it and pass it this year he said.\nSays Speaker #Pelosi should bring it to the floor.\n⁦@budfoster⁩ @koldNews 13 pic.twitter.com/nWA7LTD6ro"}, {"url": "https://www.kgun9.com/news/local-news/9-spooky-tucson-events-to-get-you-in-the-halloween-spirit", "title": "9 spooky Tucson events to get you into the Halloween spirit", "authors": [], "date": "2019-10-01", "keywords": ["spirit", "events", "halloween", "oct", "pumpkin", "event", "zoo", "youre", "looking", "spooky", "pacc", "tucson"], "summary": "TUCSON, Ariz. — There are several Halloween-themed events in Tucson this month!\nWhether you're looking for something kid-friendly, or something a little scarier, there's something for everyone.\nTerror in the Corn | Every Friday and Saturday in Oct. | 6:00 p.m. - MidnightIf you're looking to test your scare-limit, this is one spooky place.\nTrunk or Treat at PACC | Oct. 19 | 10:00 a.m. - 2:00 p.m.You celebrate Halloween and adopt a new pet at this event!\nBoo at the Zoo | Oct. 25-27 | 6:00 p.m. - 8:00 p.m.Reid Park is getting in on the Halloween fun this year."}, {"url": "https://news.clearancejobs.com/2020/04/15/raytheon-missile-systems-awarded-9-million-to-procure-digital-focal-plane-array-prototype-for-navy-and-air-force/", "title": "Raytheon Missile Systems Awarded $9 Million to Procure Digital Focal Plane Array Prototype for Navy and Air Force", "authors": [], "date": "2020-04-15", "keywords": ["raytheon", "2020", "procure", "focal", "contracting", "plane", "million", "force", "navy", "prototype", "fiscal", "systems", "performed", "missile", "funds", "contract", "support", "awarded", "work"], "summary": "Fiscal 2020 operations and maintenance (Navy) funds in the amount of $9,624,915; fiscal 2020 working capital (Navy) funds in the amount of $2,435,821; fiscal 2020 other procurement (Navy) funds in the amount of $1,410,800; and fiscal 2020 aircraft procurement (Navy) funds in the amount of $590,600 will be obligated at time of award, $9,624,915 of which will expire at the end of the current fiscal year.\nRaytheon Missile Systems, Tucson, Arizona, was awarded a $9,224,337 modification (P00074) to exercise an option to previously awarded cost-plus-fixed-fee contract N00019-15-C-0121 to procure a Digital Focal Plane Array prototype for the Navy and Air Force.\nAIR FORCEThe Boeing Co., Seattle, Washington, has been awarded an $84,000,000 firm-fixed-price contract modification (P00068) to previously awarded contract FA8625-16-C-6599 for VC-25B technical publications.\nFiscal 2020 civil construction funds in the amount of $15,885,000 were obligated at the time of the award.\nFiscal 2020 military construction, Army funds in the amount of $7,633,085 were obligated at the time of the award."}, {"url": "https://www.kgun9.com/news/local-news/iconic-train-making-tucson-stop", "title": "Iconic train making Tucson stop", "authors": [], "date": "2019-10-14", "keywords": ["making", "iconic", "locomotive", "historic", "display", "big", "pacific", "union", "boy", "tucson", "train", "stop", "4014"], "summary": "TUCSON, Ariz. — Union Pacific's Big Boy No.\nThe steam locomotive will arrive at Tucson Historic Train Depot on Toole Ave. Thursday from 10:10 - 10:40 a.m.Friday, it will be on display at E Silverlake Road & E Fairland Stravenue from 9 a.m. - 3p.m.\n4014 is the only Big Boy that is still operating, according to Union Pacific, who owns the train.\nAfter its stop in Tucson, it'll be continuing to El Paso, Texas.\nAccording to Union Pacific, the event will not be ADA accessible, due to the historic nature of the equipment."}, {"url": "https://www.kold.com/2019/10/19/crews-battle-major-shed-fire-northwest-side/", "title": "Crews battle major shed fire on northwest side", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-19", "keywords": ["district", "battle", "multiple", "northwest", "830", "shed", "went", "major", "debris", "sheds", "control", "flames", "crews"], "summary": "The Northwest Fire District said multiple sheds and debris went up in flames, but the fire was under control by 8:30 a.m."}, {"url": "https://www.kold.com/2019/10/19/multiple-wrong-way-drivers-cause-havoc-chandler/", "title": "Multiple wrong-way drivers cause havoc in Chandler", "authors": ["Az Family", "Published At Pm"], "date": "2019-10-19", "keywords": ["risk", "wrongway", "closure", "santan", "multiple", "drivers", "wb", "onramps", "cause", "havoc", "traffic", "theyre", "putting", "chandler"], "summary": "\"On-ramps are not for escaping traffic,\" said ADOT in a tweet.\n\"These drivers who didn't heed our many closure announcements headed into the closure on L-202 WB Santan.\nNow they're putting other drivers at risk by driving [the] wrong-way up the McClintock on-ramp.\""}, {"url": "https://www.kold.com/2019/10/25/az-weekend-oct/", "title": "AZ Weekend, Oct. 25", "authors": ["Angelica Carrillo", "Published At Pm", "Published Pm At Pm", "Published Am At Am"], "date": "2019-10-25", "keywords": ["little", "25", "oct", "reid", "bears", "zoo", "dress", "az", "ones", "real", "parks", "lions", "boo", "weekend"], "summary": "Dress your little lions and bears up to see the real ones at Reid Park’s Boo at the Zoo."}, {"url": "https://www.kold.com/2019/10/30/police-investigating-homicide-near-benson-highway/", "title": "UPDATE: Police arrest 3 teens in connection to homicide near Benson Highway", "authors": ["Published At Pm"], "date": "2019-10-30", "keywords": ["teens", "update", "highway", "murder", "tpd", "near", "robbery", "release", "benson", "raul", "located", "arrested", "later", "homicide", "connection", "jimenez", "lizola", "arrest"], "summary": "Police first arrested 17-year-old Raul Lizola on March 8 after he was located and interviewed by investigators, according to a news release from TPD.\nauthorities arrested 16-year-old Fabian Jimenez a few days later on March 12, both boys were arrested and charged with armed robbery, aggravated robbery and first -degree murder."}, {"url": "https://tucsonfoodie.com/2019/10/01/film-fest-tucson-2019-giveaway/", "title": "Film Fest Tucson 2019: Win two pairs of all-access passes to the festival", "authors": ["Kate Severino"], "date": "2019-10-01", "keywords": ["winners", "allaccess", "win", "films", "passes", "pairs", "2019", "tickets", "youve", "festival", "pass", "tucson", "fest", "film"], "summary": "The much-anticipated Film Fest Tucson is almost here.\nDouble the chances: win & winStand a chance to win a pair of all-access passes in today’s giveaway.\nAll-access pass: what is it?\nAn all-access pass is your ticket to as many screenings as you can get to during the 2019 festival (and it gets you into the panels and annual Desert Pitch competition).\nSIGN UP IN THE BAR ABOVE TO WINSign up by entering your name and email address in the yellow bar across the top of your screen for a chance to win a pair of all-access tickets to Film Fest Tucson 2019."}, {"url": "https://www.kold.com/2019/10/28/molino-fire-burning-acres-catalina-mountains/", "title": "UPDATE: Molino Fire 80 percent contained, crews released to assist elsewhere", "authors": ["Published At Pm"], "date": "2019-10-28", "keywords": ["update", "public", "assist", "national", "report", "80", "patrol", "contained", "resources", "released", "remains", "monitor", "molino", "low", "visible", "smoke", "crews"], "summary": "Smoke may be visible over the next few days as low fire activity remains with hotspots well within the interior of the burned area of the fire.\nFire resources from the Coronado National Forest will continue to patrol and monitor the fire.\nThe public is asked to please not report this fire."}, {"url": "https://patch.com/arizona/tucson/216-ufo-sightings-arizona-so-far-2019-what-they-saw", "title": "216 UFO Sightings In Arizona So Far In 2019: What They Saw", "authors": [], "date": "2019-12-31", "keywords": ["objects", "far", "sky", "national", "flying", "lights", "saw", "reporting", "216", "2019", "ufo", "reports", "reported", "sightings", "arizona"], "summary": "ARIZONA – The National UFO Reporting Center gets witness accounts of unidentified flying objects every year from people in Arizona and elsewhere around the country.\nThousands of reports of unidentified flying objects, or UFOs, are filed every year.\nIn Arizona, while the clock ticks down to Jan. 1, 2020, so far 216 reports have been filed in 2019.\nMeanwhile the city of Phoenix had 5 UFO sightings reported in December, the most recent of which happened on Dec. 20 and was reported the same day.\nRead more Arizona UFO reports at the National UFO Reporting Center's website."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20191026/675020/halloween-themed-disney-junior-playdate", "title": "Halloween Themed Disney Junior Playdate", "authors": [], "date": "2019-10-18", "keywords": ["activities", "learn", "including", "halloween", "fun", "playdate", "event", "disney", "11", "character", "themed", "junior"], "summary": "Tucson Premium Outlets invites the communityto a Halloween-themed Disney Junior Play Date.\nCome in costume and enjoy fun Vamprinia andother Disney Junior themed activities like face painting, crafts, treats, andmore.\nDuring the event, families will be able to participate in a variety of activities including a craft project to create their own Disney Junior character mask and a Halloween themed photo booth.\nThe fun starts at 11 a.m. in front of Market Hall on Mountain Court.\nThis event does not include live character appearances."}, {"url": "https://www.kold.com/2019/10/29/documents-reveal-new-details-brutal-attack-familys-home-tucsons-northwest-side/", "title": "Documents reveal new details of brutal attack at family’s home on Tucson’s northwest side", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-29", "keywords": ["attack", "brutal", "leonard", "times", "familys", "northwest", "women", "shot", "documents", "stabbed", "fired", "knife", "injured", "shotgun", "neck", "tucsons", "reveal", "details"], "summary": "One of the women was able to get a knife and stabbed Leonard several times in the face and neck.\nOne of the women then got a shotgun and fired a shot, but no one was injured."}, {"url": "https://www.kgun9.com/news/community/vista-semanal/local/film-fest-tucson-2019-is-the-place-to-be", "title": "Film Fest Tucson 2019 is the place to be", "authors": ["Photo Courtesy Of Film Fest Tucson"], "date": "2019-10-07", "keywords": ["q", "catch", "short", "filmmaker", "films", "2019", "place", "check", "youll", "tucson", "fest", "film"], "summary": "TUCSON, Ariz. — Much like the previous years, Film Fest Tucson has managed to gather some of the most creative, edgy, and superb films to hit the screen.\nYou'll be able to catch a screening of The Last Picture Show (1971) and his 1950 classic western Winchester '73.\nPhoto courtesy of Film Fest TucsonAnother short film you'll want to check out is Cactus Boy.\nIt was completely shot in Tucson and Marana by London filmmaker Chris Brake.\nYou can check out the full schedule now to figure out what you'll feast your eyes on first."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/10/11/things-to-do-this-weekend-in-tucson", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk"], "date": "2019-10-11", "keywords": ["12", "free", "oct", "weeklys", "theres", "ice", "festival", "dispatch", "tucson", "gardens", "tea", "daily", "range", "11"], "summary": "The event is hosted by members of Yelp Tucson and Tucson Foodie, and includes a Q&A with one of the directors.\nHis work is on display throughout the month, but the reception is 5 to 7 p.m. Friday, Oct. 11.\n2 to 4 p.m. Thursday, Oct. 10; 10:30 a.m. to noon, Saturday, Oct. 12; 2 to 4 p.m. Saturday, Oct. 12.\nThe whole festival runs 11 a.m. to 10 p.m. Friday, Oct. 11 and Saturday, Oct. 12, and 11 a.m. to 6 p.m. Sunday, Oct. 13.\n2 to 4 p.m. Thursday, Oct. 10; 10:30 a.m. to noon, Saturday, Oct. 12; 2 to 4 p.m. Saturday, Oct. 12."}, {"url": "https://www.abc15.com/entertainment/events/rick-and-mortys-rickmobile-set-to-make-a-return-to-phoenix-in-october", "title": "Rick and Morty's Rickmobile set to make a return to Phoenix in October", "authors": [], "date": "2019-09-04", "keywords": ["rick", "rickmobile", "drafthouse", "trucks", "oct", "set", "visit", "mortys", "tucson", "arizona", "chandler", "return", "alamo", "phoenix"], "summary": "PHOENIX — Editor's note: The RIckmobile will be at Alamo Drafthouse Chandler from 6 p.m. - 9 p.m. (not 3 p.m. - 9 p.m. as mistakenly reported).\nThe mobile pop-up store is scheduled to visit the Phoenix area on Oct. 22 and the Tucson area on Oct. 23.\nAccording to an online schedule, the Rickmobile will be at the Alamo Drafthouse Cinema in Chandler, 4955 S Arizona Ave., near Arizona Avenue and Chandler Heights Blvd, from 6 p.m. - 9 p.m. on Oct. 22.\n(On the truck's last visit to Arizona in 2017, it also stopped at the Alamo Drafthouse Cinema in Chandler.)\nSome of the new items this year include a beach towel, a bottle opener, and a body pillow, a spokesperson said."}, {"url": "https://kvoa.com/uncategorized/2019/10/31/spooky-season-strikes-again-for-halloween-2019-heres-how-you-can-celebrate/", "title": "Spooky Halloween events, celebrations in Tucson", "authors": ["Carla Litto"], "date": "2019-10-31", "keywords": ["tours", "celebrations", "events", "halloween", "amwhere", "azcost", "oct", "pmwhere", "31", "spooky", "tucson", "information", "details"], "summary": "TUCSON – Halloween is a holiday that gives Tucson locals an opportunity to *pumpkin* spice things up.\nFor more information and details: https://bit.ly/2PzA5R8Phantasia | Tucson’s Biggest Halloween PartyWhen: Thursday, Oct. 31 – Friday, Nov. 3 | 8 p.m. – 3 a.m.Where: 31 E Toole Ave, Tucson, AZCost: Tickets range from $10-$20.\nshordie shordie and lil burryWhen: Thursday, Oct. 31 | 10 p.m. – 2 a.m.Where: Club Encore, 5851 E Speedway Blvd, Tucson, AZCost: General Admission- $10.99+$2.50 fee VIP (Line Skip)- $30+$3.76 fee2nd annual Halloween bash promises to be one of the best events in the history of Tucson.\n| 18+For more information and details: https://bit.ly/2NpBya5Halloween Glow at The HutWhen: Thursday, Oct. 31 | 7 p.m.Where: The Hut Tucson 305 N 4th Ave, Tucson, AZFeat.\nHeads Halloween PartyWhen: Thursday, Oct. 31 | 9 p.m. – 2 a.m.Where: Mr."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/10/16/things-to-do-wednesday-oct-16", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk"], "date": "2019-10-16", "keywords": ["page", "weeklys", "switch", "mobile", "version", "dispatch", "tucson", "daily", "range"], "summary": "Switch to the mobile version of this page."}, {"url": "https://www.kold.com/2019/10/02/beto-orourke-host-town-hall-near-university-arizona/", "title": "WATCH: Beto O’Rourke hosts town hall near the University of Arizona", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-02", "keywords": ["orourke", "university", "watch", "near", "tour", "presidential", "town", "hall", "run", "wass", "set", "ua", "hosts", "beto", "arizona", "preparation"], "summary": "O’Rourke’s town hall was held Sunday, Oct. 6 at Gentle Ben’s Brewing, located at 865 E. University Blvd.\nIt was set to run 3-5 p.m.\nThe town hall wass hosted in conjunction with the UA Democrats and is part of a nation-wide tour in preparation for next year’s presidential election."}, {"url": "https://www.abc15.com/entertainment/events/union-pacifics-big-boy-steam-locomotive-to-make-public-stops-in-gila-bend-and-tucson", "title": "Union Pacific's Big Boy steam locomotive to make public stops in Gila Bend and Tucson", "authors": [], "date": "2019-10-15", "keywords": ["public", "stops", "locomotive", "train", "gila", "oct", "big", "mohawk", "pacific", "18", "able", "steam", "boy", "tucson", "union", "stop", "trains", "pacifics"], "summary": "One of Union Pacific's iconic steam-powered locomotives is scheduled to make public stops in Mohawk, Gila Bend, and Tucson this week, part of a commemorative tour across the southwestern United States.\nHere is the train's schedule:Oct. 16: 10 a.m. - 10:30 a.m. in Mohawk, Arizona at the Interstate 8 eastbound rest area.\nAccording to a news release from Union Pacific, the Big Boy locomotive was built specifically for Union Pacific to help its trains \"handle the steep terrain between Cheyenne, Wyoming and Odgen, Utah.\"\n4014, the train that people will be able to see, is the only operating train of its kind in the world, and the only one still owned by Union Pacific, according to the news release.\nVisit Union Pacific's website for more information."}, {"url": "https://www.kold.com/2019/10/02/bales-hay-fire-near-san-xavier-mission/", "title": "Fire burning near San Xavier Mission will continue to send smoke over parts of Tucson", "authors": ["Published At Pm"], "date": "2019-10-02", "keywords": ["near", "mission", "protecting", "reported", "send", "parts", "neighboring", "san", "xavier", "partners", "burning", "tucson", "public", "continue", "tohono", "oodham", "nation", "swiftly", "norris", "smoke"], "summary": "“The Nation is grateful that this major fire has been swiftly contained with no reported injuries,\" said Tohono O’odham Nation Chairman Ned Norris Jr. \"The Tohono O’odham Fire Department and our partners from neighboring agencies did an admirable job protecting the public, and the Nation will be investigating the cause of this fire.”"}, {"url": "https://theaviationgeekclub.com/usaf-plans-to-retire-42-a-10-warthogs-at-davis-monthan-arizona-lawmaker-says/", "title": "‘USAF plans to retire 42 A-10 Warthogs at Davis-Monthan,’ Arizona lawmaker Says", "authors": ["Gabriele Barison"], "date": "2020-04-07", "keywords": ["aircraft", "a10", "lawmaker", "usaf", "harm", "force", "military", "fleet", "air", "plans", "retire", "warthogs", "davismonthan", "a10s", "arizona", "42"], "summary": "“I find it incredibly alarming that the Air Force would put out plans without properly briefing Congress nor transparency about the replacement process and timelines,” her statement said.\nThe Air Force finished re-winging 173 A-10s in 2019 through the Enhanced Wing Assembly program, which began in 2011.\n2, 2020 wrote the House Armed Services Committee asking it to “prohibit divestment or retirement of any A-10 aircraft” in this latest move by the USAF.\nFormer Rep. Ron Barber said cutting half the A-10 fleet would have a “devastating effect” on Davis-Monthan and on Tucson, stressing the base’s importance to the city’s economy.\nPhoto credit: U.S. Air Force"}, {"url": "https://www.kold.com/2019/10/08/gunfire-erupts-during-party-near-university-arizona/", "title": "Gunfire erupts during party near University of Arizona", "authors": ["Melissa Egan", "Published At Pm"], "date": "2019-10-08", "keywords": ["university", "near", "muzzle", "thirty", "lot", "party", "didnt", "gunfire", "erupts", "going", "plus", "gun", "guy", "arizona", "stop", "rounds"], "summary": "“And a guy, with a gun up and you could just see the muzzle fire going off.\nI assume there was a lot of people around, because it just didn’t stop.\nIt was about thirty plus rounds going off,\" Camp said."}, {"url": "https://www.kold.com/2019/10/21/fourth-annual-jeepers-back-blue-event-take-place-this-weekend/", "title": "Fourth annual Jeepers Back the Blue event to take place this weekend", "authors": ["Published At Pm"], "date": "2019-10-21", "keywords": ["fourth", "support", "lot", "vehicle", "place", "event", "blue", "ryan", "need", "offroad", "tucson", "jeepers", "weekend", "park", "jeep", "contact", "annual"], "summary": "You do not need a jeep to attend, but if you have a Jeep or off-road vehicle that you would like to park on the lot in support of our Police, please contact Ryan Armstrong of the Tucson Jeep Club."}, {"url": "https://www.kold.com/2019/10/12/workers-vote-strike-asarco-mine-sites-arizona-texas/", "title": "Workers vote to strike at ASARCO mine sites in Arizona, Texas", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-12", "keywords": ["strike", "steelworkers", "vote", "silverbell", "texas", "asarco", "union", "unite", "smelter", "arizona", "workers", "sites"], "summary": "The strike is part of a bigger protest involving 2,000 ASARCO employees at mine sites in both Arizona and Texas, according to a press release from the Unite Steelworkers Union.\nIn Arizona, ASARCO operates the Silverbell Mine in Marana, Mission Mine in Sahuarita and the Ray Mine and Hayden smelter in central Arizona."}, {"url": "https://www.kold.com/2019/10/01/firefighters-called-rv-fire-northwest-side/", "title": "Firefighters called to RV fire on northwest side", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-01", "keywords": ["scene", "district", "morning", "northwest", "kold", "oct", "rv", "tucson", "called", "firefighters"], "summary": "TUCSON, Ariz. (KOLD News 13) - Firefighters from Northwest Fire District were called to the scene of a fire in an RV on Tuesday morning, Oct. 1."}, {"url": "https://tucsonfoodie.com/2019/09/19/oktoberfest-2019/", "title": "Oktoberfest 2019 Lineup: Ready or not, beer we come", "authors": ["Matt Sterner"], "date": "2019-09-19", "keywords": ["lineup", "brewing", "beer", "special", "oktoberfest", "come", "german", "2019", "event", "ready", "facebook", "visit", "food", "information"], "summary": "Aside from the incredible weather, there’s going to be German beer, traditional German food, a live German band, and plenty of fun over a span of multiple days.\nThere’s going to be a lot of family-friendly fun, German-style beer, food trucks, face painting, balloon twisting, and live music until midnight.\nFor more information, visit Arizona Beer House’s Facebook event page.\nThe JW Marriott Starr Pass Resort and Spa is throwing a late Oktoberfest Beer Festival this year, and it’s complete with a beer garden.\nThe Oktoberfest Beer Festival is open to guests and to the public."}, {"url": "https://www.kgun9.com/news/local-news/serious-injury-wreck-slows-traffic-at-alvernon-and-22nd", "title": "Alvernon and 22nd reopens after serious injury wreck", "authors": [], "date": "2019-10-21", "keywords": ["injury", "reopens", "worked", "serious", "slowed", "wreck", "vehicles", "say", "22nd", "traffic", "alvernon", "tucson", "road", "swan"], "summary": "TUCSON, Ariz. - A serious injury wreck slowed traffic at a midtown intersection Monday.\nThe road reopens in the 9 a.m. hour.\nPolice say two vehicles were involved in the crash.\nBroadway and Swan worked as alternates while traffic was slowed."}, {"url": "https://www.kold.com/2019/10/16/tucson-lantern-festival-jeopardy/", "title": "Questions continue after lantern festival is rescheduled again, ticket holders upset", "authors": ["Published At Pm"], "date": "2019-10-16", "keywords": ["prefer", "holders", "upset", "setup", "lantern", "continue", "tethered", "traditional", "city", "rescheduled", "questions", "event", "attendees", "nontethered", "festival", "tucson", "ticket"], "summary": "The park was reserved and permit applications were submitted to the Special Events office for the event a long time ago.\nHowever, this event is being moved to a new date at the request of our attendees who would prefer to see a non-tethered release in Tucson.\nAs I am sure you already know a Sky Lantern must be tethered within the city of Tucson.\nWe did modify this event to use tethered lanterns instead of the traditional non-tethered lanterns that people in the area love to see and modify our applications to reflect this change.\nHowever, after asking our attendees if they would prefer we to continue with the tethered lantern set-up or move to gain permission to host a traditional lantern festival attendees stated that they would prefer to move the date and gain permission to host a traditional non-tethered festival."}, {"url": "https://www.kgun9.com/news/local-news/2019-tucson-weather-in-review", "title": "2019 Tucson weather in review", "authors": [], "date": "2020-01-03", "keywords": ["month", "airport", "average", "snow", "2019", "weather", "monsoon", "tucson", "review", "rain", "wettest"], "summary": "TUCSON, Ariz. — Every year brings its share of beautiful, hot, cold, interesting and sometimes exciting weather to Tucson.\nThat set the stage for what was going to be an interesting year of weather and another challenging year for weather forecasters.\nAccording to the Tucson National Weather Service, 2019 marked the 21st straight year of above average yearly temperatures.\nFebruary 22nd brought widespread snow to southeastern Arizona and we even recorded 1.9” of snow at the Tucson International Airport.\nAt the Tucson International Airport, the monsoon rain total was 5.06” which fell about an inch below the average 6.08” rain total."}, {"url": "https://patch.com/arizona/tucson/rent-arizona-prices-climbed-2019", "title": "Rent In Arizona: Prices Climbed In 2019", "authors": [], "date": "2020-01-20", "keywords": ["climbed", "report", "mesa", "rental", "costs", "cities", "rent", "2019", "increased", "prices", "arizona", "phoenix"], "summary": "ARIZONA — Rent costs are on the rise across the nation, according to the first National Rent Report of 2020, compiled by Apartment List.\nNationally, rent costs increased 1.4 percent from December 2018 to December 2019; however, some cities actually are bucking the trend and seeing rent costs fall.\nArizona is among the states where rent costs increased in 2019.\nAccording to the report, rent increased 3.5 percent from December 2018 to December 2019.\nAccording to the report, Mesa, Arizona, had the fastest year-over-year rent growth among cities with a population of 250,000 or more."}, {"url": "https://www.kold.com/2019/10/21/pcsd-report-shooting-near-oracle-rudasill/", "title": "Authorities: One injured, suspect on run following shooting at Mr. An’s in Tucson", "authors": ["Craig Reck", "Published At Pm"], "date": "2019-10-21", "keywords": ["mr", "remain", "suspect", "closed", "shooting", "sign", "run", "restaurant", "oct", "ans", "night", "injured", "repairs", "tucson", "authorities", "following", "word", "posted"], "summary": "A sign posted to the door of the restaurant indicated that the business was closed for repairs on Monday, Oct. 21, a day after the Sunday night shooting.\nThere was no word on how long the restaurant would remain closed."}, {"url": "https://www.kold.com/2019/10/08/tucson-clears-air-over-proposition/", "title": "Tucson clears the air over Proposition 205", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-08", "keywords": ["measure", "temporary", "border", "tour", "customs", "clears", "donna", "205", "air", "proposition", "texas", "gay", "tucson", "patrol"], "summary": "Border Patrol agents hold a news conference prior to a media tour of a new U.S. Customs and Border Protection temporary facility near the Donna International Bridge, Thursday, May 2, 2019, in Donna, Texas.\nThe Tucson general election will have a sanctuary city measure on the ballot which details how Tucson police can interact with Border Patrol and Immigration and Customs Enforcement if the measure is passed.\n(AP Photo/Eric Gay) (Source: Eric Gay)"}, {"url": "https://www.kold.com/2019/10/22/mexico-man-dies-southern-arizona-hospital/", "title": "CBP: Detainee from Mexico dies in southern Arizona hospital", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-22", "keywords": ["transported", "mexican", "sector", "tucsonarea", "cbp", "southern", "south", "detainee", "realized", "dies", "mexico", "tucson", "arizona", "processing", "patrol", "hospital", "needed"], "summary": "On Sunday afternoon the 49-year-old Mexican immigrant was detained south of Casa Grande by Tucson Sector Border Patrol agents.\nDuring processing, authorities realized the man needed medical attention and transported him to a Tucson-area hospital."}, {"url": "https://patch.com/arizona/tucson/scottsdale-citys-updates", "title": "Scottsdale City's Updates", "authors": [], "date": "2019-10-24", "keywords": ["rodeo", "updates", "scottsdale", "oct", "city", "n", "event", "old", "runs", "information", "citys", "nov"], "summary": "Scottsdale Contemporary Month runs Oct. 26-Nov. 25.\nScottsdale International Film Festival runs Nov. 1-10.\nCelebrate Scottsdale Dia de los Muertos family event, Nov. 2.\nFOR YOUR INFORMATIONYes, Virginia, there is an Old Town Scottsdale Rodeo Museum.\nPopular Services: Brush & Bulk Collection | Passports | Utility BillingThis press release was produced by the City of Scottsdale."}, {"url": "https://www.kold.com/2019/10/16/recognizing-star-rothschild-honors-tucson-born-barbara-eden-tenwest-fest/", "title": "Recognizing a star: Rothschild honors Tucson-born Barbara Eden at TenWest fest", "authors": ["Dan Marries", "Published At Pm"], "date": "2019-10-16", "keywords": ["eden", "star", "tenwest", "barbara", "pasture", "tucson", "steps", "sitting", "tucsonborn", "went", "yes", "recognizing", "rothschild", "honors", "remember", "thank", "remembered", "great", "fest"], "summary": "“I have great great memories of Arizona and Tucson which my mother didn’t believe that I remembered Tucson.\nI do because I remember the house; I remember sitting on the cement steps that went into our kitchen,\" Eden said.\n\"And there was a horse in the pasture beyond us.\nSo, yes, I’m happy to be back and thank you so much for this.”"}, {"url": "https://www.kold.com/2019/10/11/tucson-council-increases-age-minimum-purchase-tobacco-nicotine-products/", "title": "Tucson council increases age minimum to purchase tobacco, nicotine products", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-11", "keywords": ["ward", "steve", "tobacco", "measure", "age", "tucson", "increases", "purchase", "member", "supports", "nicotine", "minimum", "lung", "surveyed", "population", "council", "support", "products", "society"], "summary": "“We have surveyed, the Lung Association has surveyed, the Cancer Society has surveyed,” said Ward 6 Council member Steve Kozachik, one of the four to support the measure.\n“And just about 70 percent of the population supports what we did.”"}, {"url": "https://www.kold.com/2019/10/07/two-injured-shooting-near-university-arizona-campus/", "title": "Two injured in shooting near University of Arizona campus", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-07", "keywords": ["showed", "shooting", "university", "uninvited", "near", "shot", "multiple", "party", "injured", "unknown", "suspects", "tucson", "arizona", "st", "campus", "rounds"], "summary": "An adult male and female were shot by uninvited guests that showed up to a party on the block of 1700 E. 9th St., according to information from the Tucson Police Department.\nMultiple rounds were fired by the unknown suspects."}, {"url": "https://www.kold.com/2019/10/18/flu-season-kicks-off-fast-paced-start/", "title": "Flu season kicks off to a fast-paced start", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-18", "keywords": ["flu", "start", "symptoms", "means", "spread", "person", "transmitted", "fastpaced", "sneeze", "sick", "talk", "small", "season", "possible", "kicks"], "summary": "The flu is spread from person to person through small droplets that are transmitted when people cough, sneeze or talk, according to ADHS.\nMany adult infect others within one day of infection or five to six days after they are already sick — that means its possible to get infected before symptoms kick in."}, {"url": "https://www.kold.com/2019/10/09/sierra-vista-police-investigating-fatal-shooting/", "title": "UPDATE: Police identify victims involved in a shooting in Sierra Vista", "authors": ["Published At Pm"], "date": "2019-10-09", "keywords": ["update", "vista", "detectives", "shooting", "shot", "wound", "turning", "sierra", "gunshot", "identify", "sabo", "dead", "victims", "romo", "gun", "head", "involved"], "summary": "Two detectives found Romo dead from a gunshot wound to the head and Sabo with a gunshot wound to head but still breathing.\nIt appears Romo shot Sabo in the head before turning the gun on himself."}, {"url": "https://www.kold.com/2019/10/31/journey-is-back-tour-coming-arizona/", "title": "Journey touring next year and coming to Arizona", "authors": ["Published At Pm"], "date": "2019-10-31", "keywords": ["making", "tour", "touring", "perform", "kold", "13", "stop", "coming", "arizona", "tucson", "journey", "ariz"], "summary": "TUCSON, Ariz. (KOLD News 13) - Journey will tour the U.S. next year and is making a stop in Arizona to perform in June!"}, {"url": "https://www.kold.com/2019/10/01/welcome-home-veterans-return-tucson-after-honor-flight/", "title": "Welcome Home: Veterans return to Tucson after Honor Flight", "authors": ["Melissa Egan", "Published At Pm"], "date": "2019-10-01", "keywords": ["helped", "sloane", "welcome", "thats", "meant", "couldnt", "veterans", "million", "veteran", "honor", "involved", "wanted", "tucson", "flight", "friend", "return"], "summary": "“It meant a million bucks or better because I have always wanted to get involved with what I had done, but I couldn’t go and couldn’t do it until a friend of mine helped me, and that’s what made me go,\" said U.S. Army Veteran Don Sloane."}, {"url": "https://www.azcentral.com/story/news/local/arizona-weather/2019/10/01/2019-arizona-monsoon-season-one-of-driest-ever/2268114001/", "title": "The 2019 Arizona monsoon was a bust. Here's how dry it was", "authors": ["Weldon B. Johnson", "Published A.M. Mt Oct."], "date": "2019-10-01", "keywords": ["heres", "sky", "driest", "2019", "normal", "bust", "weather", "inches", "monsoon", "season", "service", "arizona", "dry", "rain", "phoenix"], "summary": "The monsoon season, as declared by the National Weather Service since 2008, runs from June 15 through Sept. 30.\nLast week's rain, fueled in part by the remnants of Hurricane Lorena, was not really monsoon rain, she said.\nMonsoon rain, she said, would only add up to 0.43 inches, the amount recorded before Sept. 23.\n\"There’s no question about that.”The monsoon seasonThough some sticklers for tradition didn't like it, the weather service established a defined monsoon season in 2008 for several reasons.\n“We were all hoping for a least a nice normal monsoon after a wet winter."}, {"url": "https://www.kold.com/2019/10/21/woman-bitten-after-feeding-javelina-table-scraps-west-tucson/", "title": "Woman bitten after feeding javelina table scraps in west Tucson", "authors": ["Published At Pm"], "date": "2019-10-21", "keywords": ["table", "remind", "illegal", "calling", "west", "bitten", "javelina", "game", "say", "az", "woman", "tucson", "fish", "8003520700", "scraps", "feeding"], "summary": "AZ Game and Fish would like to remind everyone that feeding javelina is illegal and if you see something, say something by calling 800-352-0700."}, {"url": "https://www.kold.com/2019/10/12/shocking-hear-that-police-believe-ua-student-fell-his-death-residence-hall/", "title": "“Shocking to hear that.”: Police believe UA student fell to his death in residence hall", "authors": ["Melissa Egan", "Published At Pm"], "date": "2019-10-12", "keywords": ["hall", "hear", "tough", "unfortunate", "shocking", "community", "student", "happened", "sure", "imagine", "believe", "ua", "residence", "really", "dorm", "im", "death", "schmidt", "fell"], "summary": "“It really is unfortunate.\nI feel, like, at least in my dorm it’s a good community,\" said Schmidt.\n\"So I’m sure if something like that had happened at our dorm it would have been devastating because we are such a community, so I can imagine it be really tough for people in this area.”"}, {"url": "https://www.azpm.org/p/home-articles-news/2019/10/11/159885-council-takes-step-toward-raising-tobacco-age-in-tucson/", "title": "Tucson takes step toward raising tobacco age within city", "authors": ["Steve Jess"], "date": "2019-10-11", "keywords": ["voted", "ordinance", "step", "council", "retailers", "raising", "city", "age", "plan", "tobacco", "tucson", "raise", "limits", "takes"], "summary": "LISTENThe Tucson City Council narrowly voted Thursday to move ahead with a plan to raise the age for buying tobacco and vaping products from 18 to 21.\nCouncil members debated the merits of going ahead with an ordinance that only raises the tobacco age inside city limits, when the original plan was for a joint effort that also involved Pima County.\nHe suggested that council member Steve Kozachik, who favors it, was trying to drive business out of Tucson.\n\"So, basically what you're telling me is that the retailers outside of the city limits are more important to you than the retailers inside the city limits.\"\nThe council voted 4-3 to bring the plan up for a formal vote at its Oct. 22 meeting."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/10/11/xoxo-where-to-rock-this-weekend-oct-11-13", "title": "XOXO: Where to Rock, this weekend, Oct. 11 - 13", "authors": ["Xavier Omar Otero", "Tara Foulkrod", "Kathleen B. Kunz", "Logan Burtch-Buus"], "date": "2019-10-11", "keywords": ["music", "rock", "theatre", "country", "roots", "traditional", "oct", "rialto", "enlarge", "tucson", "xoxo", "weekend", "evening", "hotel", "13", "11"], "summary": "click to enlarge Hatebreedclick to enlarge X-Ratedclick to enlarge RazaFestOne of country music's biggest DIY success stories, neo-traditional singerdons his Red Bandana (Big Label, 2019).\nAt the Rialto Theatre.\nAt Irene's Holy Donuts...Featuring flatpicking champion, multi-instrumentalist(Poco and The Decemberists),make their debut on the stage at Monterey Court for an evening of bluegrass and traditional music.\nAt the Rialto Theatre.\nEDM artists\"Swing\" into the Rialto Theatre for a lil' sip."}, {"url": "https://www.lpi.usra.edu/planetary_news/2019/09/18/the-pi-launchpad-from-science-idea-to-nasa-mission/", "title": "The PI Launchpad: From Science Idea to NASA Mission", "authors": ["Julie Tygielski"], "date": "2019-09-18", "keywords": ["participants", "nasa", "launchpad", "university", "pi", "workshop", "mission", "smd", "idea", "science", "tucson", "pool"], "summary": "If you are a researcher in any NASA Science Mission Directorate (SMD) discipline who wants to take your career to the next level but have not yet held a leadership position on mission proposals or large science teams, this is the workshop for you.\nJoin us November 18 – 20, 2019 in Tucson, AZ for Launchpad: an expenses-paid three-day workshop that will teach you the skills to get your mission idea off the ground.\nNASA’s Science Mission Directorate (SMD), in partnership with the University of Arizona and the Heising-Simons Foundation, will host Launchpad to guide participants through turning their science question into a mission concept.\nParticipants will also have time for networking and personal reflection as they mature their mission concepts.\nWe are interested in broadening the pool of potential NASA space mission PI’s."}, {"url": "https://www.kold.com/2019/10/11/restaurant-report-card-inspectors-find-more-than-food-one-tucson-kitchen/", "title": "Restaurant Report Card: Inspectors find more than food in one Tucson kitchen", "authors": ["Melissa Egan", "Published At Pm"], "date": "2019-10-11", "keywords": ["inspectors", "thawing", "sitting", "report", "temperature", "thrown", "card", "restaurant", "food", "room", "tucson", "kitchen", "rolls", "warm", "states"], "summary": "The inspector also observed food, like egg rolls and cabbage, sitting out at room temperature in the 70-degree range that had to be thrown away.\nThe report states employees didn’t check the temperature of food during a delivery, which was also too warm, and some meat was thawing at room temperature."}, {"url": "https://www.kold.com/2019/10/31/pedestrian-struck-by-vehicle-east-side/", "title": "One deceased, another with serious life-threatening injuries after two separate pedestrian involved collisions occurred in Tucson this morning", "authors": ["Kold News Staff", "Published April", "At Am", "At Pm"], "date": "2019-10-31", "keywords": ["driver", "lifethreatening", "irvington", "deceased", "separate", "tucson", "turn", "crossing", "morning", "injuries", "eastbound", "occurred", "road", "lopez", "serious", "universal", "pedestrian", "pickup", "involved", "truck"], "summary": "According to interviews conducted by officers and detectives, a blue 1997 Chevrolet pickup was traveling eastbound on Irvington Road.\nAt that time, Lopez was crossing Irvington Road, from south to north.\nThere is no painted crosswalk where Lopez was crossing at that intersection.\nThe pickup was merging into the eastbound lanes of Irvington Road from the universal left turn lane when it struck the pedestrian.\nA DUI officer responded and determined that the driver of the truck was not impaired at the time of the collision."}, {"url": "https://www.kold.com/2019/10/13/police-pedestrian-hit-tucsons-south-side/", "title": "UPDATE: Pedestrian dies after being struck by vehicle Saturday night", "authors": ["Craig Reck", "Published At Pm"], "date": "2019-10-13", "keywords": ["update", "struck", "loving", "martini", "remember", "pedestrian", "vehicle", "night", "soon", "planning", "texas", "ones", "dies", "sister", "man", "mattered"], "summary": "Loved ones remember Martini as loving man who had a hard life, but always cared for the people who mattered most to him.\nWith family in Texas, he was planning to move out there soon, according to his sister."}, {"url": "https://www.kold.com/2019/10/30/one-tucson-couple-goes-all-out-halloween/", "title": "Tucson couple goes all out for Halloween", "authors": ["Hannah Tiede", "Published At Pm"], "date": "2019-10-30", "keywords": ["setup", "halloween", "sound", "trains", "touch", "goes", "town", "pumpkin", "tables", "spans", "set", "tucson", "couple", "village"], "summary": "With the touch of a button, a Halloween village set comes to life.\nIt spans three full-sized tables and includes a pumpkin patch, an amusement park and a town.\nThree trains move around the perimeter of the setup and most of the homes have sound effects and lights."}, {"url": "https://theundefeated.com/features/samuel-puryear-howards-new-golf-coach-knows-how-to-win/", "title": "Samuel Puryear, Howard’s new golf coach, knows how to win", "authors": ["Nathaniel Easington"], "date": "2020-04-15", "keywords": ["coach", "university", "thats", "samuel", "win", "lot", "golf", "howard", "think", "puryear", "youre", "looking", "things", "knows", "hbcu", "howards"], "summary": "Samuel Puryear Jr., Howard University’s new men’s and women’s golf coach, is returning to his HBCU roots.\nSo, you’re looking at a lot of video, which you do anyway, but now that’s your only way to do it.\nSo now you’re looking at a golf resume.\nYou’re looking at junior tournaments and you’re looking at golf video.\nI think you’re looking at students from coast to coast, honestly."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://www.kgun9.com/news/political/elections-local/tucson-election-2019-live-updates", "title": "Tucson Election 2019: Full results", "authors": [], "date": "2019-11-05", "keywords": ["romero", "election", "kgun9", "city", "2019", "county", "mayor", "regina", "results", "tucson", "drop"], "summary": "TUCSON, Ariz. — The results are in for the 2019 Tucson Election!\nCongratulations Regina Romero (@TucsonRomero)—we need more Latinas to run, and win!\nhttps://t.co/ewmZQcQoFu — Julián Castro (@JulianCastro) November 6, 2019Congratulations to @TucsonRomero on her historic election as the first Latina and first woman mayor of Tucson, Arizona!\nhttps://t.co/PKHMLFy0l9 pic.twitter.com/OgASEUuGjZ — KGUN9 On Your Side (@kgun9) November 6, 20198:11 p.m.8:06 p.m.Regina Romero projected winner in Tucson mayoral race.\nJUST IN: Tucson City Councilmember Regina Romero has been elected to serve as the city's next mayor, according to unofficial results released by the city Tuesday evening."}, {"url": "https://www.freep.com/story/money/cars/ford/2020/04/11/ford-coloring-book-mazes-coronavirus/5128451002/", "title": "Ford designer's daughter colored his top-secret Bronco sketches — and it sparked an idea", "authors": ["Phoebe Wall Howard", "Published A.M. Et April"], "date": "2020-04-11", "keywords": ["sketches", "designers", "bronco", "topsecret", "kids", "colored", "daughter", "meyer", "book", "ford", "ketchum", "sparked", "coloring", "working", "idea", "work", "parents"], "summary": "She inspired her automotive designer daddy to make coloring book pages for other work-from-home parents during the pandemic.\nHe is a Ford designer working on the new Bronco when not making coloring book images for work-at-home parents during the COVID-19 pandemic.\nAngry Ranger is one coloring page in a collection created by Ford automotive designers for parents and kids stuck at home.\nKevin Ketchum is one of 18 Ford designers who created coloring pages for children.\n\"We make it more coloring book oriented versus an illustration for a manual or a glam shot for a magazine,\" Ketchum said."}, {"url": "https://www.kold.com/2019/11/23/crash-slows-traffic-interstate/", "title": "Crash slows traffic on Interstate 19", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-23", "keywords": ["department", "blocking", "transportation", "interstate", "slows", "near", "left", "crash", "northbound", "19", "traffic", "valencia", "road", "lane"], "summary": "The crash is blocking the left northbound lane near Valencia Road, according to a tweet from the Arizona Department of Transportation."}, {"url": "https://www.kgun9.com/weather/live-updates-rain-pounds-tucson-heavy-snow-in-mountains", "title": "LIVE UPDATES: Heavy mountain snow, valley rain falling around Tucson", "authors": [], "date": "2019-11-21", "keywords": ["amthe", "live", "mountain", "highway", "closed", "updates", "21", "snow", "heavy", "falling", "mountains", "lemmon", "valley", "tucson", "mount", "road", "rain"], "summary": "Some passing snow showers will bring a little additional accumulation to the snow that has already fallen.\nThe National Weather Service is reporting six inches of snow at the Mount Lemmon peak.\nHeavy snowfall is blanketing Mount Lemmon.\nThe Road to Mount Lemmon is closed to the public and open only to residents.\nCATALINA HIGHWAY IS CLOSED: @PimaSheriff have officially closed the Catalina Highway up to Mount Lemmon this morning."}, {"url": "https://www.kold.com/2019/11/21/everything-you-need-know-about-el-tour-de-tucson/", "title": "Everything you need to know about 2019 El Tour de Tucson", "authors": ["Published April", "At Am", "At Pm"], "date": "2019-11-21", "keywords": ["remain", "closed", "fourth", "street", "avenue", "know", "tour", "sixth", "2019", "need", "beginning", "el", "23", "tucson", "nov", "broadway"], "summary": "Beginning Friday, Nov. 22, at 5 p.m., Sixth Avenue will be closed south of Broadway Boulevard to 22nd Street and will remain closed until Saturday, Nov. 23, at 6 p.m., with 12th Street to 14th Street remaining closed until 10 p.m. Beginning Saturday, Nov. 23, at 5 a.m., 15th Street from Sixth Avenue to Fourth Avenue, and Fourth Avenue from 15th Street to Broadway, will remain closed until 8 a.m. Also on Saturday, the bus lane of eastbound Broadway from Fourth Avenue to Barraza-Aviation Parkway will be closed from 7 a.m. to 8 a.m."}, {"url": "https://patch.com/arizona/tucson/rent-arizona-prices-climbed-2019", "title": "Rent In Arizona: Prices Climbed In 2019", "authors": [], "date": "2020-01-20", "keywords": ["climbed", "report", "mesa", "rental", "costs", "cities", "rent", "2019", "increased", "prices", "arizona", "phoenix"], "summary": "ARIZONA — Rent costs are on the rise across the nation, according to the first National Rent Report of 2020, compiled by Apartment List.\nNationally, rent costs increased 1.4 percent from December 2018 to December 2019; however, some cities actually are bucking the trend and seeing rent costs fall.\nArizona is among the states where rent costs increased in 2019.\nAccording to the report, rent increased 3.5 percent from December 2018 to December 2019.\nAccording to the report, Mesa, Arizona, had the fastest year-over-year rent growth among cities with a population of 250,000 or more."}, {"url": "https://www.kgun9.com/news/local-news/tucson-elections-guide-2019-what-you-need-to-know", "title": "Tucson elections guide 2019: What you need to know", "authors": [], "date": "2019-11-04", "keywords": ["600", "guide", "w", "election", "elections", "700", "know", "center", "n", "2019", "need", "az", "voting", "office", "tucson"], "summary": "TUCSON, Ariz. — The 2019 Tucson general election takes place Tuesday, Nov. 5.\nTucson Election 2019: Live updatesTo make voting day less stressful, here's the official KGUN9 guide:Can I still mail in my ballot?\nBallots may be dropped off at a voting location on election day only.\n*IMPORTANT NOTE* There are two separate elections happening on Nov. 5 within Pima County: the City of Tucson Election and the 2019-Pima County Jurisdictional Election.\nElection results will be available after 8:00 p.m.For more information on election results, stay with KGUN9 and KGUN9.com."}, {"url": "https://www.ncronline.org/news/earthbeat/what-does-climate-change-demand-catholic-education", "title": "What does climate change demand of Catholic education?", "authors": ["Apr"], "date": "2020-04-10", "keywords": ["demand", "change", "catholic", "high", "does", "school", "odowd", "downs", "laudato", "education", "climate", "schools", "students", "si"], "summary": "Bishop O'Dowd living lab 2 c.JPG Two Bishop O'Dowd High School students enjoy the Oakland, California, campus' Living Lab.\nIn February, Michael Downs met with a group of student leaders at a Catholic high school to discuss their experience with environmental education.\nCreation Team Bishop O'Dowd c.jpg The creation care team at Bishop O'Dowd High School, Oakland, Califorina (Courtesy of Bishop O'Dowd High School)For the past half-decade, Salpointe Catholic High School in Tucson, Arizona, has dedicated itself fully to answering this question.\n\"Looking at challenges for tomorrow, will there be a core organization to bring Catholic schools together to talk about this?\nTimothy Uhl, superintendent of Montana Catholic Schools and host of the podcast \"Catholic School Matters,\" told EarthBeat that climate change is not taught very much at schools in his state."}, {"url": "https://www.kold.com/2019/11/29/storm-spawns-severe-weather-warnings-power-lines-down-marana/", "title": "Storm spawns weather warnings, damage, cancellations and postponements", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-29", "keywords": ["twin", "cancellations", "west", "storm", "silverbell", "roads", "damage", "poles", "power", "saguaro", "weather", "warnings", "traffic", "spawns", "road", "postponements"], "summary": "Police closed roads because of broken power poles near Twin Peaks Road and Saguaro Highlands Drive, west of Silverbell Road.\nIt was not clear whether or not the storm caused the poles to break or if it was a traffic collision."}, {"url": "https://www.kold.com/2019/11/09/tucson-fire-department-tackles-mobile-home-fire/", "title": "Tucson Fire Department tackles mobile home fire", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-09", "keywords": ["department", "west", "report", "release", "tfd", "press", "mobile", "lowell", "neighbor", "tucson", "road", "tackles", "responded"], "summary": "At around 12:44 a.m. fire crews responded to a mobile home fire at the 1700 block of west Fort Lowell Road, according to a TFD press release.\nA neighbor called 911 dispatchers to report the fire and attempted to put it out with a garden hose."}, {"url": "https://news.azpm.org/p/news-articles/2019/11/5/161343-tucson-election-sanctuary-city-initative/", "title": "Tucson votes 'no' on sanctuary city initiative", "authors": ["Azpm"], "date": "2019-11-05", "keywords": ["votes", "sanctuary", "election", "prop", "livier", "voters", "city", "initiative", "205", "results", "tucson"], "summary": "Prop 205 - Tucson Sanctuary City initiative Updated Nov 12, 2019 2:51 P.M.\nResponse % Votes Yes 30.22% 29,285 No 69.78% 67,631LISTENInitial election results Tuesday night showed more than 70% of voters rejected an initiative to make Tucson a sanctuary city.\nVIEW LARGER Zaira Livier speaks at a gathering to watch the results of the Nov. 5, 2019 Tucson election that saw voters reject an initiative to make Tucson a sanctuary city.\nZaira Livier speaks at a gathering to watch the results of the Nov. 5, 2019 Tucson election that saw voters reject an initiative to make Tucson a sanctuary city.\nSanctuary city initiative organizer on the movement's goalsTPD Chief Magnus on sanctuary city initiative on ballotLawmakers prepping punishment for Tucson if voters approve sanctuary city lawTop issues for Tucson voters ahead of the primaryWhere do candidates stand on the issues?"}, {"url": "https://www.kgun9.com/news/local-news/2019-tucson-weather-in-review", "title": "2019 Tucson weather in review", "authors": [], "date": "2020-01-03", "keywords": ["month", "airport", "average", "snow", "2019", "weather", "monsoon", "tucson", "review", "rain", "wettest"], "summary": "TUCSON, Ariz. — Every year brings its share of beautiful, hot, cold, interesting and sometimes exciting weather to Tucson.\nThat set the stage for what was going to be an interesting year of weather and another challenging year for weather forecasters.\nAccording to the Tucson National Weather Service, 2019 marked the 21st straight year of above average yearly temperatures.\nFebruary 22nd brought widespread snow to southeastern Arizona and we even recorded 1.9” of snow at the Tucson International Airport.\nAt the Tucson International Airport, the monsoon rain total was 5.06” which fell about an inch below the average 6.08” rain total."}, {"url": "https://www.kold.com/2019/11/02/tucson-prepares-th-annual-all-souls-procession/", "title": "Tucson prepares for 30th annual All Souls Procession", "authors": ["Bud Foster", "Published At Pm"], "date": "2019-11-02", "keywords": ["souls", "started", "really", "street", "middle", "know", "30th", "pay", "procession", "instead", "didnt", "prepares", "sidewalks", "tucson", "annual", "walking"], "summary": "“Once it became 25 or 30, and we started walking in the middle of the street instead of on the sidewalks, the police started to pay attention,” she said.\n“They really didn’t know what to do with us.”"}, {"url": "https://www.kold.com/2019/11/16/tucson-police-department-investigates-homicide-near-grant-road/", "title": "UPDATE: Tucson Police Department identifies homicide victim near Grant Road", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-16", "keywords": ["update", "near", "party", "witness", "department", "homicide", "outside", "unit", "tucson", "young", "teens", "identifies", "shots", "grant", "road", "victim", "altercation", "tpds", "based"], "summary": "Based on an investigation by officers and detectives with TPD’s Gang Unit, investigators determined an altercation ensued outside a house where teens and young adults were hosting a party.\nDuring multiple people were outside during the altercation, where several shots were fired and Abdullahi was hit, based on witness interviews."}, {"url": "https://www.kold.com/2019/11/02/collisions-irvington-road-cause-major-shut-downs-power-outages/", "title": "Collisions on Irvington Road caused major shut downs, power outages", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-02", "keywords": ["scene", "transported", "public", "tpd", "tucson", "power", "pete", "sgt", "downs", "major", "outages", "caused", "traffic", "shut", "road", "collisions", "responded", "irvington"], "summary": "Tucson Police Department traffic investigators responded to a hit-and-run collision at Irvington Road and Campbell Avenue involving a pedestrian on Friday, Nov. 1, 2019.\nPete Dugan, a public information officer with TPD, said the driver fled the scene and man who was hit was transported to the hospital with life-threatening injuries."}, {"url": "https://www.kold.com/2019/11/08/collision-interstate-causes-serious-injuries/", "title": "Collision on Interstate 10 causes serious injuries", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-08", "keywords": ["officials", "causes", "interstate", "suffered", "serious", "unclear", "injuries", "dps", "vehicles", "victims", "troopers", "westbound", "collision", "responded"], "summary": "At around 7:38 p.m., DPS troopers responded to westbound lanes on Interstate 10 near milepost 254, according to an email by DPS.\nIt’s still unclear how many vehicles or people were involved, but officials with DPS said victims suffered serious injuries."}, {"url": "https://kvoa.com/uncategorized/2019/11/22/el-tour-de-tucson-2019-what-to-know/", "title": "El Tour de Tucson 2019: What to know", "authors": ["News Tucson"], "date": "2019-11-22", "keywords": ["closed", "street", "avenue", "know", "tour", "sixth", "2019", "event", "ride", "el", "tucson", "information"], "summary": "El Tour de Tucson will kick off its ride day Saturday – more than 6,000 riders are expected to attend.\nSchedule for the 37th El Tour de Tucson Ride Day:For more information about El Tour 3-day Festival & Expo/Packet Pickup click hereAbout the event:Banner – University Medicine will host El Tour De Tucson 2019.\nAccording to El Tour de Tucson, each year approximately 10 million dollars are raised.\nEl Tour de Tucson Festival & Expo closures – On Tuesday, Sixth Avenue was closed from 12th Street to 13th Street.\nFurther information about El Tour de Tucson, including a route map, click HERE."}, {"url": "https://www.kold.com/2019/11/16/residents-west-interstate-without-power-water/", "title": "UPDATE: Power, water restored to residents west of Interstate 10", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-16", "keywords": ["teps", "update", "website", "west", "rio", "interstate", "restored", "power", "drive", "road", "replacement", "repairs", "past", "residents", "outage", "water"], "summary": "Customers between Ironwood Hill Drive just past Anklam Road, between El Rio Drive and Painted Hills Drive were without power for part of the afternoon on Saturday, Nov. 16, 2019, according to an outage map on TEP’s website.\nThe outage was caused by either equipment repairs or replacement."}, {"url": "https://www.kold.com/2019/11/01/az-weekend-nov/", "title": "AZ Weekend, Nov. 1", "authors": ["Angelica Carrillo", "Published At Pm", "Published Pm At Pm", "Published Am At Am"], "date": "2019-11-01", "keywords": ["living", "little", "main", "fest", "angels", "night", "event", "az", "happen", "weekend", "nov", "procession"], "summary": "The Night of the Living Fest (Nov. 1-2) and The Procession of the Little Angels (Nov. 2) all happen before the main event on Sunday, Nov. 3."}, {"url": "https://www.nytimes.com/2019/11/06/us/arizona-tucson-sanctuary-city.html", "title": "Tucson Rejects Sanctuary Status as Places Across U.S. Vote on Their Futures", "authors": ["Jacey Fortin", "Emily S. Rueb"], "date": "2019-11-06", "keywords": ["peoples", "website", "rejects", "sanctuary", "vote", "voters", "futures", "local", "initiative", "immigration", "strong", "proposition", "status", "tucson", "turn", "places"], "summary": "In Arizona, a red state known for its strict immigration policies, Tucson has earned a reputation as a spot of blue.\nBut at the ballot box on Tuesday, voters overwhelmingly rejected an initiative to turn Tucson into a sanctuary city for migrants.\nThe initiative, Tucson Families Free and Together, or Proposition 205, would have restricted police officers’ ability to detain people based on immigration status and prohibited certain collaborations between local and federal authorities, among other things.\nThe goals included “protecting all people’s constitutional and civil rights through reducing arrests” and “creating strong directives against profiling and strong separations between immigration enforcement and local government functions,” the People’s Defense Initiative, the advocacy group behind the proposition, said on its website."}, {"url": "https://www.kgun9.com/news/local-news/arizonas-2019-school-report-cards-are-out", "title": "Arizona's 2019 school report cards are out", "authors": [], "date": "2019-11-01", "keywords": ["cards", "district", "report", "state", "yeartaking", "arizonas", "school", "2019", "schools", "grades", "letter", "tucson", "unified", "districts"], "summary": "TUCSON, Ariz. -- The new school report cards are out.\nThe Arizona State Board of Education released the letter grades Thursday, for the 2018-19 school year.\nTaking a look at our region's largest district, Tucson Unified School District, 17 of the 81 schools improved at least one letter, while 12 moved down.\nNearly 20 percent of TUSD schools received grades lower than a C.You can find a complete list of the school grades for all the districts in our state here.\nAll districts have the opportunity to appeal grades until November 15, 2019."}, {"url": "https://www.kgun9.com/news/local-news/cold-wet-el-tour-de-tucson-this-saturday-what-you-need-to-know", "title": "El Tour de Tucson rides again this Saturday, what you need to know", "authors": [], "date": "2019-11-20", "keywords": ["closed", "park", "street", "avenue", "know", "tour", "start", "mile", "need", "el", "riders", "tucson", "rides"], "summary": "The 37th El Tour de Tucson attracts over 9,000 riders of all ages in a ride that stretches as far as 100 miles.\nHere's what you need to know:Can I still participate for El Tour de Tucson?\nRELATED: New start time for Platinum Riders at El Tour De TucsonThe RouteEl Tour de Tucson starts at three different locations around town depending on which ride participants enter.\nEl Tour de Tucson's Expo will be happening in Armory Park this year so come out and check it out.\nhttps://t.co/unC7f4U5a8 pic.twitter.com/PISmPrtN8g — Park Tucson (@ParkTucson) November 22, 2019FESTIVAL PARKING MAPFor more information on El Tour de Tucson, visit perimeterbicycling.com."}, {"url": "https://kvoa.com/uncategorized/2019/11/05/city-of-tucson-2019-proposition-results/", "title": "Southern Arizona proposition results 2019", "authors": ["Carla Litto"], "date": "2019-11-05", "keywords": ["district", "total", "bond", "election", "southern", "school", "2019", "tax", "proposition", "results", "valley", "arizona", "override", "unified", "budget"], "summary": "1YES: 791 | 56.06%NO: 620 | 43.94%What is SPECIAL BUDGET OVERRIDE ELECTION NOGALES UNIFIED SCHOOL DISTRICT NO.\nNogales Unified School District No.\n1 of Santa Cruz County, Arizona (the “District”), will hold a special 8% maintenance and operation budget override election.\nUnified School District No.\nTOMBSTONE UNIFIED SCHOOL DISTRICT BOND ELECTIONREGISTERED VOTERS – TOTAL: 5,003BALLOTS CAST – TOTAL: 1,678BALLOTS CAST – BLANK: 0VOTER TURNOUT – TOTAL PERCENT: 33.54%BOND APPROVAL, YES: 745 | 44.40%NO: 933 | 55.60%What is the TOMBSTONE UNIFIED SCHOOL DISTRICT BOND?"}, {"url": "https://www.kold.com/2019/11/02/update-pedestrian-hit-and-run-irvington-road-turns-fatal-driver-still-large/", "title": "UPDATE: Pedestrian hit-and-run on Irvington Road turns fatal, driver still at large", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-02", "keywords": ["update", "tires", "driver", "stop", "irvington", "turns", "large", "told", "titan", "road", "scene", "hitandrun", "pedestrian", "fatal", "vehicle", "pickup", "witnesses", "westbound", "truck"], "summary": "Witnesses at the scene told police the male driver did not stop after the collision and continued westbound, according to the release.\nPolice are looking for a large, dark-colored pickup truck, lifted with off-road tires.\nInvestigators found metallic navy blue vehicle parts at the scene that are believed to belong to a Nissan Titan pickup."}, {"url": "https://www.kgun9.com/news/political/elections-local/regina-romero-projected-winner-in-tucson-mayoral-race", "title": "Regina Romero winner in Tucson mayoral race", "authors": [], "date": "2019-11-06", "keywords": ["romero", "race", "female", "win", "city", "candidate", "winner", "mayor", "regina", "mayoral", "serve", "tucson", "latina"], "summary": "TUCSON, Ariz. — Former Tucson City Councilmember Regina Romero has been elected to serve as the city's next mayor, according to unofficial results released by the city Tuesday evening.\nRomero will be Tucson's first female and first Latina mayor.\nRELATED: Profile: Tucson Democratic Mayor Candidate Regina RomeroRomero has represented Ward 1 on the City Council since 2007.\nTucson made history today and elected the city's first Latina mayor.\nhttps://t.co/JVNqPkSgzd — Kathy Hoffman (@kathyhoffman_az) November 6, 2019Congratulations Regina Romero (@TucsonRomero)—we need more Latinas to run, and win!"}, {"url": "https://www.theguardian.com/us-news/2019/nov/20/arizona-activist-migrants-trial-scott-warren", "title": "Arizona activist who gave migrants humanitarian aid acquitted in second trial", "authors": ["Associated Press"], "date": "2019-11-20", "keywords": ["warren", "border", "activist", "second", "acquitted", "group", "months", "trial", "agents", "migrants", "gave", "aid", "humanitarian", "arizona", "water", "men"], "summary": "It was the second trial for Warren; a mistrial was declared last June after a jury deadlocked on harboring charges.\nJurors refuse to convict activist facing 20 years for helping migrants Read moreWarren was stoic after the verdict was read.\n“They paid rapt attention while we were putting on our defense and while the prosecution was putting on its case, and they decided that humanitarian aid is not always a crime, the way the government wanted it to be.\nThe group drops off water for migrants in the desert and runs a camp to aid injured migrants.\n“We need to work within the spirit of humanitarian aid and within the confines of the law,” Warren said."}, {"url": "https://www.kold.com/2019/11/28/police-investigating-collision-near-tucson-mall/", "title": "UPDATE: Collision in north Tucson involving motorcycle turns fatal", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-28", "keywords": ["scene", "update", "oracle", "detectives", "motorcycle", "turns", "fatal", "north", "involving", "road", "traffic", "unit", "tucson", "turn", "westbound", "collision", "responded"], "summary": "Detectives with the Tucson Police Traffic Investigations Unit responded to the scene to continue the investigation.\nAccording to interviews conducted by officers and detectives, a driver of a 2015 Ford Escape was northbound on Oracle Road in the left turn lane making a westbound turn onto Auto Mall Drive."}, {"url": "https://www.kold.com/2019/10/24/veterans-day-events-deals-discounts/", "title": "VETERANS DAY: Events, deals, discounts and more across southern Arizona", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-10-24", "keywords": ["tonto", "national", "events", "discounts", "forest", "way", "day", "veterans", "southern", "waive", "deals", "offices", "arizona", "nov", "11"], "summary": "Tonto National Forest: Office and all Ranger District offices will close on Monday, Nov. 11, in observance of the Veterans Day holiday.\nOffices will resume regular business hours Nov. 12.\nThe Tonto National Forest also will waive fees at several day-use recreation sites on Nov. 11, in honor of veterans.\nAccording to Forest Supervisor Neil Bosworth, the fee-free day is the Tonto’s way of saying “thank you” to all who served in the military."}, {"url": "https://www.kold.com/2019/11/15/officials-investigate-armed-robbery-with-shots-fired-tucsons-northwest-side/", "title": "UPDATE: Two men in custody following armed robbery, gun battles in Tucson area", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-15", "keywords": ["update", "suspect", "area", "near", "following", "twin", "general", "tucson", "gun", "robbery", "silverbell", "battles", "peaks", "men", "scene", "later", "suspects", "armed", "custody", "hours"], "summary": "One of the suspects was captured near the scene of the Dollar General.\nHours later, the other suspect was take into custody near Silverbell and Twin Peaks."}, {"url": "https://azbigmedia.com/business/business-leaders/newsmakers/burns-mcdonnell-opens-new-office-adds-jobs-in-tucson/", "title": "Burns & McDonnell opens new office, adds jobs in Tucson", "authors": ["Az Business Magazine"], "date": "2019-11-15", "keywords": ["burns", "engineering", "clients", "opens", "firm", "jobs", "mcdonnell", "construction", "office", "tucson", "arizona", "growth", "adds"], "summary": "Burns & McDonnell, a 100% employee-owned engineering, architecture and construction firm, joined the Tucson Metro Chamber of Commerce and clients to cut the ribbon on its new office building in Tucson, Arizona.\nThe firm has grown 20% in Arizona this year and plans to create another 15 new jobs in Tucson and 30 jobs in Phoenix by 2021.\nTo accommodate its growth, Burns & McDonnell moved to its 3,247-square-foot office at 3501 E. Speedway Blvd.\n“We’re so pleased Burns & McDonnell has chosen to expand in Tucson,” says Amber Smith, president and CEO for Tucson Metro Chamber.\nThe Tucson Metro Chamber looks forward to helping Burns & McDonnell thrive in Tucson.”The Burns & McDonnell offices in Arizona have more than 100 employee-owners and are backed by a global team of 7,000 employees with more than 50 offices around the world."}, {"url": "https://www.kgun9.com/news/political/elections-local/prop-409-results-tucsonans-reject-proposed-salary-increase-for-mayor-councilmembers", "title": "PROP 409 results; Tucsonans reject proposed salary increase for mayor, councilmembers", "authors": [], "date": "2019-11-06", "keywords": ["votes", "prop", "councilmembers", "reject", "tucsonans", "city", "mayor", "409", "proposed", "results", "increase", "tucson", "yes", "yearthe", "salary"], "summary": "TUCSON, Ariz. — Tucsonans voted on a proposed increase in salary Tuesday for the mayor and city councilmembers in the 2019 November election in Pima County.\nVoters rejected Prop 409 in Tucson, which proposed an increase in city mayor's salary from $42,000 to $63,128 per year, and a city council salary increase from $24,000 to $42,081 per year.\nThe results were 32,971 'yes' votes and 48,623 'no' votes totaling 81,594.\nWhen calculated hourly and divided 52 hours per year; mayor makes $20.10 per hour and councilmembers make $11.54 per hour.\nThe last voter-approved increase was in 1999."}, {"url": "https://www.kold.com/2019/11/20/police-investigate-shooting-tucsons-east-side/", "title": "UPDATE: Two arrests made in connection to east side teen murder", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-20", "keywords": ["update", "murder", "shooting", "teen", "left", "ruggiero", "serious", "killed", "n", "night", "connection", "thought", "east", "man", "arrests", "involved"], "summary": "The two are also thought to be involved in another shooting that happened the same night Ruggiero was killed, according to police.\nJust hours after the initial shooting, police believe Gallardo and Aguirre were involved in a shooting at 2470 N. Campbell Ave. that left one man in the hospital with serious injuries."}, {"url": "https://patch.com/arizona/tucson/216-ufo-sightings-arizona-so-far-2019-what-they-saw", "title": "216 UFO Sightings In Arizona So Far In 2019: What They Saw", "authors": [], "date": "2019-12-31", "keywords": ["objects", "far", "sky", "national", "flying", "lights", "saw", "reporting", "216", "2019", "ufo", "reports", "reported", "sightings", "arizona"], "summary": "ARIZONA – The National UFO Reporting Center gets witness accounts of unidentified flying objects every year from people in Arizona and elsewhere around the country.\nThousands of reports of unidentified flying objects, or UFOs, are filed every year.\nIn Arizona, while the clock ticks down to Jan. 1, 2020, so far 216 reports have been filed in 2019.\nMeanwhile the city of Phoenix had 5 UFO sightings reported in December, the most recent of which happened on Dec. 20 and was reported the same day.\nRead more Arizona UFO reports at the National UFO Reporting Center's website."}, {"url": "https://tucsonfoodie.com/2019/11/20/thanksgiving-tucson-2019/", "title": "Thanksgiving Tucson 2019: Where to gobble up yummy meals or take them to go", "authors": ["Matt Sterner"], "date": "2019-11-20", "keywords": ["thanksgiving", "turkey", "menu", "buffet", "gobble", "dinner", "person", "2019", "yummy", "old", "visit", "520", "tucson", "information", "meals"], "summary": "For more information and to view the full Thanksgiving menu, visit agustinkitchen.com.\nThe Azul Restaurant & Lounge inside the Westin La Paloma Resort & Spa is throwing its annual Thanksgiving buffet.\nThe Dutch Eatery & Refuge is offering a “take and bake” Thanksgiving dinner.\nThe Take and Bake Thanksgiving Dinner for 6 people is $125, and Heat and Serve Thanksgiving Dinner is $25 per person.\nwill be open at 11 a.m.They’ll be serving up a Thanksgiving Dinner Plate for $15."}, {"url": "https://www.kold.com/2019/11/21/list-holiday-closures-across-southern-arizona/", "title": "LIST: Holiday closures across southern Arizona", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-21", "keywords": ["closed", "closures", "dont", "southern", "place", "holiday", "add", "showing", "favorite", "list", "arizona"], "summary": "You don’t want to add to that by showing up to find your favorite place is closed."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/11/08/things-to-do-this-weekend-in-tucson", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Christopher Boan"], "date": "2019-11-08", "keywords": ["celebrate", "galaxy", "beer", "double", "anniversary", "weeklys", "nov", "vida", "hops", "dispatch", "tucson", "theyre", "ipa", "daily", "range"], "summary": "High five to Pueblo Vida!\nThey’re taking all weekend to celebrate their big day, and releasing nine (9!)\nBrews will include the “Vida Beer” Premium Southwest Lager; their first anniversary double IPA with El Dorado, Galaxy and Simcoe hops; their second anniversary double IPA with Galaxy and Nelson hops; their third anniversary double IPA with Mosaic, Galaxy and Idaho 7 hops.\nThey’re also hosting food from local restaurants like Tumerico and Buddha Belly Pizza Kitchen.\nFriday, Nov. 7 through Sunday, Nov. 10."}, {"url": "https://www.kold.com/2019/11/23/pedestrian-killed-near-intersection-broadway-boulevard-pantano-road/", "title": "UPDATE: Pedestrian killed on Pantano Road identified", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-23", "keywords": ["update", "pantano", "rafferty", "west", "struck", "street", "pedestrian", "vehicle", "identified", "woman", "traffic", "tucson", "road", "killed", "cross", "witness"], "summary": "The woman, identified as 57-year-old Elizabeth Rafferty, was killed on Friday, Nov. 22, 2019 after she was struck by a vehicle while attempting to cross the street.\nAccording to witness interviews, Tucson Police Department traffic detectives determined Rafferty attempted to cross Pantano Road from east to west."}, {"url": "https://www.kgun9.com/news/local-news/rain-and-thunderstorm-warnings-continue-across-pima-county-live-updates", "title": "Flood and winter storm warnings continue across Pima County", "authors": [], "date": "2019-11-29", "keywords": ["tell", "continue", "way", "pima", "staying", "pandemic", "business", "restaurant", "openif", "owner", "county", "winter", "warnings", "small", "open", "storm", "flood"], "summary": "FREE LISTING: Tell us how your small business or eatery is staying openIf you are a small business owner, restaurant, bar, or brewery staying open in a new way during the pandemic and would like to be included on our map of open eateries, or our alphabetical list of open businesses, please fill out this form and we will include you."}, {"url": "https://www.kgun9.com/news/local-news/trump-re-election-campaign-makes-stop-in-tucson", "title": "Trump re-election campaign makes stop in Tucson", "authors": [], "date": "2019-11-21", "keywords": ["reelection", "parscale", "manager", "country", "theyre", "donald", "2016", "makes", "campaign", "tucson", "trumps", "stop", "trump"], "summary": "TUCSON, Ariz. -- President Donald Trump's 2020 Presidential campaign made a stop in Tucson Thursday.\nLara Trump and Parscals worked to fire up the crowd and paint a picture of how they plan to re-elect Donald Trump.\nLara Trump told the audience she helped the Trump campaign carry her home state of North Carolina in 2016.\nBrad Parscale said Donald Trump's 2016 campaign succeeded even though the organization was put together as the campaign went on.\nHe says the campaign is developing phone apps to help people who want to volunteer for the Trump campaign improve their training and co-ordination to make the campaign more effective."}, {"url": "https://www.kold.com/2019/11/29/tell-mel-dont-hurry-hire-contractor-after-severe-weather-southern-arizona/", "title": "Tell Mel: Don’t hurry to hire a contractor after severe weather in Southern Arizona", "authors": ["Melissa Egan", "Published At Pm"], "date": "2019-11-29", "keywords": ["website", "license", "southern", "mel", "list", "pick", "arizona", "tell", "wanted", "hurry", "hire", "worked", "registrars", "dont", "weather", "trying", "look", "state", "contractor", "severe"], "summary": "The website also includes the Registrar’s Most Wanted List.\nYou can take take a look at several contractors who worked without a license and got caught or may still be trying to pick up jobs across the state."}, {"url": "https://www.kgun9.com/news/local-news/unemployment-rate-for-arizona-declines-to-4-7-in-november", "title": "Unemployment rate for Arizona declines to 4.7% in November", "authors": [], "date": "2019-12-19", "keywords": ["services", "declines", "adding", "47", "unemployment", "sector", "utilities", "transportation", "business", "rate", "jobs", "increase", "arizona", "7700"], "summary": "PHOENIX (AP) - Arizona's unemployment rate dropped a tenth of a percentage point to 4.7% in November following an increase of over 34,000 jobs during the month.\nThe state Office of Economic Opportunity said Thursday said 3 million people were employed in nonfarm jobs in November 2019, up 2.4% percent from October.\nThe private sector accounted for nearly all of the month's employment growth, adding 34,200 jobs in November.\nThat's well above the 10-year average gain of 26,400 jobs.The business sector adding the most jobs with an increase of 18,300 during November was trade, transportation and utilities, followed by professional and business services with 7,700 more jobs and education and health services with an additional 7,700 jobs."}, {"url": "https://www.kold.com/2019/11/27/crews-extinguish-house-fire-citys-south-side/", "title": "Crews extinguish house fire on city’s south side", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-27", "keywords": ["scene", "minutes", "extinguish", "units", "smoke", "saw", "received", "release", "tfd", "press", "south", "house", "citys", "crews"], "summary": "Crews received the call at 2:16 p.m. and arrived on scene three minutes later, according to a press release from TFD, where they saw smoke and flames coming from the front door.\nCrews were able to extinguish the blaze in 20 minutes with the help of nine units and 23 firefighters on scene."}, {"url": "https://kvoa.com/uncategorized/2019/11/08/veterans-day-2019-tucson-to-honor-u-s-heroes/", "title": "Veterans Day 2019: Tucson to honor U.S. heroes", "authors": ["News Tucson"], "date": "2019-11-08", "keywords": ["heroes", "served", "day", "veterans", "ways", "support", "2019", "specials", "tucsonbelow", "honor", "sharing", "military", "nations", "tucson"], "summary": "TUCSON – There are many ways to show your support and honor our nation’s former and current military members for Veterans Day on Monday throughout Tucson.\nBelow is a list of events and specials that are sharing appreciation to those who have served our country.\nEVENTS:SPECIALS:"}, {"url": "https://patch.com/arizona/tucson/thanksgiving-tucson-check-your-fridge-recalled-food", "title": "Thanksgiving In Tucson: Check Your Fridge For Recalled Food", "authors": [], "date": "2019-11-26", "keywords": ["thanksgiving", "containing", "romaine", "represented", "inspection", "products", "fridge", "pork", "food", "check", "plastic", "tucson", "lettuce", "recalled"], "summary": "TUCSON, AZ — Hosting Thanksgiving dinner for family and friends in Tucson is a special affair, and you won't want to ruin the meal by accidentally serving food that has been recalled for contamination or a lack of inspection.\nRomaine LettuceAvoid romaine lettuce harvested from the Salinas, California, growing region, as a recent E. coli outbreak is linked to the product.\nMost romaine lettuce products are labeled with a harvest location, so make sure to read the label before serving that lettuce to the family.\nThe specific products recalled are available here.\nRaw PorkMorris Meat Packing Co. recently recalled a massive 515,000 pounds of raw pork products due to a lack of inspection."}, {"url": "https://www.kold.com/2019/11/30/residents-calculate-damage-done-big-thanksgiving-storm/", "title": "Residents calculate damage done from big Thanksgiving storm", "authors": ["Karly Tinsley", "Published At Pm"], "date": "2019-11-30", "keywords": ["thanksgiving", "spirit", "clean", "calculate", "worse", "damage", "grateful", "big", "knowing", "going", "residents", "things", "storm"], "summary": "The damage is going to take some time to clean up.\nBut in the spirit of Thanksgiving, everyone is grateful knowing things could have been much worse."}, {"url": "https://www.kold.com/2019/11/04/bomb-threat-prompts-evacuation-two-county-buildings/", "title": "UPDATE: Officials declare all clear after bomb scare prompts evacuation in downtown Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-04", "keywords": ["update", "officials", "downtown", "investigators", "wires", "sticking", "department", "clear", "prompts", "declare", "unattended", "tucson", "evacuation", "return", "forced", "determined", "scare", "bomb", "kold"], "summary": "TUCSON, Ariz. (KOLD News 13) - The Tucson Police Department said that investigators have determined that an unattended backpack with wires sticking out of it was not a bomb, and people who were forced out of their buildings can return."}, {"url": "https://www.kold.com/2019/11/06/vietnam-veterans-traveling-memorial-wall-comes-tucson/", "title": "Vietnam veterans traveling memorial wall comes to Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-06", "keywords": ["traveling", "tribute", "memorial", "wall", "veterans", "replica", "tall", "version", "comes", "washington", "scale", "tucson", "vietnam"], "summary": "The traveling tribute wall is an 80 percent, 360-foot scale version of the Vietnam Veterans Memorial Wall in Washington D.C.\nThe traveling replica is 8 feet tall and is the largest of its kind in the country."}, {"url": "https://www.kgun9.com/news/local-news/25th-annual-parade-of-lights-to-shine-november-30th", "title": "25th Annual Parade of Lights to shine November 30th", "authors": [], "date": "2019-11-07", "keywords": ["downtown", "thousands", "lights", "30th", "entries", "tree", "shine", "25th", "parade", "weeks", "tucson", "tucsons", "creativity", "annual"], "summary": "TUCSON, Ariz. -- The date is set for Tucson's 25th Annual Parade of Lights that kicks off five weeks of holiday festivities in the Old Pueblo.\nThe Parade of Lights is an event that allows companies, families, schools and groups to share their creativity with the community.\nIt’s a real team-building activity that brings people together and encourages amazing artistic expression,” said Kathleen Eriksen, President & CEO of the Downtown Tucson Partnership.\nThere will be a Tree Lighting Ceremony at 5:30 p.m., and the Parade of Lights at 6:30 p.m.\nDowntown will be decorated with thousands of lights, and free streetcar rides will be available all day long."}, {"url": "https://www.lpi.usra.edu/planetary_news/2019/09/18/the-pi-launchpad-from-science-idea-to-nasa-mission/", "title": "The PI Launchpad: From Science Idea to NASA Mission", "authors": ["Julie Tygielski"], "date": "2019-09-18", "keywords": ["participants", "nasa", "launchpad", "university", "pi", "workshop", "mission", "smd", "idea", "science", "tucson", "pool"], "summary": "If you are a researcher in any NASA Science Mission Directorate (SMD) discipline who wants to take your career to the next level but have not yet held a leadership position on mission proposals or large science teams, this is the workshop for you.\nJoin us November 18 – 20, 2019 in Tucson, AZ for Launchpad: an expenses-paid three-day workshop that will teach you the skills to get your mission idea off the ground.\nNASA’s Science Mission Directorate (SMD), in partnership with the University of Arizona and the Heising-Simons Foundation, will host Launchpad to guide participants through turning their science question into a mission concept.\nParticipants will also have time for networking and personal reflection as they mature their mission concepts.\nWe are interested in broadening the pool of potential NASA space mission PI’s."}, {"url": "https://patch.com/arizona/tucson/tucson-thanksgiving-travel-forecast-winter-storm-watch", "title": "Tucson Thanksgiving Travel Forecast: Winter Storm Watch Issued", "authors": [], "date": "2019-11-25", "keywords": ["thanksgiving", "issued", "chance", "degrees", "temperature", "watch", "temperatures", "rain", "skies", "night", "winter", "travel", "cloudy", "tucson", "forecast", "storm", "nov"], "summary": "TUCSON, AZ — The National Weather Service has issued a winter storm watch that could affect Tucson area Thanksgiving drivers Thursday night through Friday night.\nHere's the Thanksgiving forecast to help you plan when to — and not to — travel in the Tucson area this week.\nWednesday night, the Tucson area's chance of rain increases to 50 percent while skies remain mostly cloudy and temperatures drop to 50 degrees.\nThursday, Nov. 28 (Thanksgiving): Thanksgiving Day's cloudy skies bring a 50 percent chance of scattered showers.\nSaturday, Nov. 30: Mostly cloudy skies and temperatures up to 54 degrees usher in a 20 percent chance of isolated showers."}, {"url": "https://www.kold.com/2019/11/23/el-tour-de-tucson-announces-winners/", "title": "UPDATE: El Tour de Tucson announces 2019 winners, standings", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-23", "keywords": ["taking", "winners", "update", "second", "tour", "salomon", "overall", "rider", "line", "2019", "flagstaff", "el", "woman", "announces", "tucson", "gun", "finishing", "standings"], "summary": "The top female rider is Betsabee Salomon, who finished 48th overall clocking in at 4:04:38.2.\nAnne Donley from Denver was the second woman to cross the finish line taking home 69 overall, finishing in 4:13:33.2.\nAmy Chandos from Flagstaff came in as the third woman and 79th overall with a 4:13:49.3 gun time."}, {"url": "https://www.azcentral.com/story/sports/college/ua/2019/11/23/arizona-football-dominated-every-facet-loss-utah/4289784002/", "title": "Arizona football dominated in every facet in loss to Utah", "authors": ["Michael Lev", "Arizona Daily Star", "Published P.M. Mt Nov."], "date": "2019-11-23", "keywords": ["loss", "second", "wildcats", "utes", "week", "huntley", "game", "facet", "utah", "ua", "football", "dominated", "arizona", "yards"], "summary": "Just another lopsided loss for the staggering Arizona Wildcats.\nThe Utes dominated the Wildcats from start to finish, winning 35-7 in front of an announced crowd of 35,991.\nArizona will not participate in a bowl game for the second time in as many seasons under Kevin Sumlin.\nUtah led 14-0 at halftime – a score that did not fully reflect the degree to which the Utes controlled the action.\nArizona will not participate in a bowl game for the second time in as many seasons under Kevin Sumlin."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20191129/702117/patagonias-18th-annual-holiday-art-walk", "title": "Patagonia's 18th Annual Holiday Art Walk", "authors": [], "date": "2019-11-18", "keywords": ["tours", "treatsjackrabbit", "unique", "art", "2019", "holiday", "booths", "weather", "arts", "patagonias", "storefront", "18th", "visual", "walk", "annual"], "summary": "ARTISAN BOOTHS AND SHOPS WITH UNIQUE HOLIDAY GIFTSMERCHANTS OFFERING HOLIDAY TREATSJACKRABBIT BARBECUEOPERA HOUSE TOURS STARTING AT 11 AMMINI CONCERTSHoliday shopping specials from storefront merchants to independent artist booths.\nEnjoy our beautiful weather in nature's paradise.\nBring the whole family.\nOn Friday November 29, 2019 at 11:00 am (ends Saturday November 30, 2019 at 4:00 pm)Website : https://go.evvnt.com/553546-0?pid=4509Category: Arts | Visual Arts | Galleries / Art"}, {"url": "https://patch.com/arizona/tucson/five-finger-death-punch-will-perform-tucson-arena-nov-5", "title": "Five Finger Death Punch Will Perform At Tucson Arena On Nov. 5", "authors": [], "date": "2019-07-30", "keywords": ["arena", "rock", "perform", "tour", "known", "bad", "grace", "finger", "death", "days", "tucson", "punch", "nov"], "summary": "TUCSON, AZ — Five Finger Death Punch is coming to Arizona's Tucson Arena on Nov. 5.\nTickets are on sale now for the show, accompanied by rockers Three Days Grace and Bad Wolves.\nFive Finger Death Punch will be joined by Canadian multi-platinum rock band Three Days Grace and the hardcore Bad Wolves.\nFive Finger Death Punch, or 5FDP, is known for putting on a killer show.\nThree Days Grace will join 5FDP for the tour, playing songs off of their six studio albums."}, {"url": "https://patch.com/arizona/tucson/best-places-shop-black-friday-tucson", "title": "Best Places To Shop On Black Friday In Tucson", "authors": [], "date": "2019-11-21", "keywords": ["best", "highest", "goods", "shop", "wallethub", "average", "discount", "deals", "tucson", "black", "places", "retailers"], "summary": "TUCSON, AZ – Shopping on Black Friday has become an American tradition, and the consumer holiday is right around the corner.\nThe personal finance website WalletHub recently released its 2019's Best Places to Shop on Black Friday.\nBut JCPenney took the top spot in the best average discount for products related to computers and phones, packaged goods, and toys.\nSome other highlights from the report:Walmart has the highest average discount on all books, movies and music products, at 73.18 percent.\nTo determine the retailers offering the best money-saving bargains this Black Friday, WalletHub analyzed nearly 8,000 deals in the 2019 Black Friday ads from 29 of the biggest U.S. retailers."}, {"url": "https://www.kgun9.com/news/local-news/2019-city-of-tucson-elections-guide", "title": "Where and how to vote in the 2019 City of Tucson primary election", "authors": [], "date": "2019-07-24", "keywords": ["website", "election", "ward", "seven", "vote", "mail", "primary", "city", "2019", "ballot", "tucson", "general"], "summary": "TUCSON, Ariz. — The 2019 City of Tucson General Election will be held on November 5.\nWhen is the Primary Election?\nYou must be registered to vote by July 29 for the Primary Election and by October 7 for the General Election.\nBallots will be mailed on August 2 for the Primary Election and on October 10 for the General Election.\nThe deadline to send in a ballot by mail is August 21 for the Primary Election and by October 30 for the General Election."}, {"url": "https://www.kold.com/2019/11/05/tractor-trailer-fire-causes-traffic-delay-eastbound-i-/", "title": "UPDATE: I-10 eastbound open again following tractor trailer fire", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-05", "keywords": ["update", "closed", "430", "tractor", "onramp", "orange", "eastbound", "quickly", "trailer", "incident", "grove", "open", "i10", "following"], "summary": "The fire was quickly put out but as of 4:30 p.m., the Orange Grove on-ramp has been closed due to the incident."}, {"url": "https://news.azpm.org/p/news-articles/2019/11/5/161352-democrats-sweep-tucson-city-council-elections/", "title": "Democrats sweep Tucson City Council elections", "authors": ["Jake Steinberg"], "date": "2019-11-05", "keywords": ["green", "democrats", "sweep", "ward", "elections", "council", "city", "candidate", "party", "lee", "elected", "defeated", "santa", "tucson", "republican"], "summary": "LISTENThree City Council seats were up for grabs on election night, and the Democrats took them all.\nWard 1 candidate Lane Santa Cruz was elected to succeed Democrat Regina Romero, who won the race for mayor.\nShe defeated Republican Sam Nagy and Green Party candidate Matthew Smith.\nHe defeated Republican Ewart Williams and Green Party candidate William Peterson.\nLee defeated Republican Michael Hicks and Green Party candidate Cara Bissell."}, {"url": "https://www.kgun9.com/news/local-news/tucson-police-dept-holding-active-shooter-awareness-presentation", "title": "Tucson Police Dept. holding active shooter awareness presentation", "authors": [], "date": "2019-11-21", "keywords": ["awareness", "dept", "warning", "west", "tpd", "thats", "shooter", "presentation", "holding", "westside", "training", "tickets", "strategies", "tucson", "active"], "summary": "TUCSON, Ariz. — The Tucson Police Department is holding an active shooter awareness presentation November 21.\nThe free event runs from 6-8 p.m. at the Westside Police Service Center.\nThat's at 1310 West Miracle Mile, Tucson, AZ.\nAccording to TPD, the training will \"discuss preparedness strategies, potential warning signs and actual methods to consider if you are confronted with an active shooter.\"\nPrinted tickets are required."}, {"url": "https://www.kold.com/2019/11/14/oro-valley-police-serious-crash-closes-parts-shannon-road/", "title": "UPDATE: Authorities identify two killed in crash on Shannon Road in Oro Valley", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-14", "keywords": ["update", "oro", "driver", "killed", "rearended", "treatment", "crash", "suffered", "refused", "life", "identify", "injuries", "valley", "shannon", "authorities", "threatening", "road", "ovpd", "vehicle"], "summary": "The OVPD said the driver of the vehicle that rear-ended Festerling and Garcia refused treatment while the driver of the other vehicle suffered injuries that were not life threatening."}, {"url": "https://patch.com/arizona/tucson/calendar/event/20191124/703167/pies-for-paws", "title": "Pies for Paws", "authors": [], "date": "2019-11-19", "keywords": ["voted", "thanksgiving", "week", "win", "watermark", "event", "yugendollsgmailcom", "dogs", "pies", "pie", "paws"], "summary": "To kick off Thanksgiving week, the 2nd annual Pies For Paws benefit will be held at The Watermark at Continental Ranch, 8689 North Silverbell Road, this Sunday, November 24, 2-4pm.\nDining With The Dogs has always been a popular form of fundraiser and now Arizona Greyhound Rescue and their service dogs, Heartfelt Hounds, have refined the event a bit, focusing on specialty deserts and calling it PIES FOR PAWS.\nThere’s a $20 entry fee to attend the event and taste a sample of every pie in the competition.\nFirst and Second Place pie bakers will win prizes while the fan favorite pie will be voted on by the public samplersPublic Registration:- online at bit.ly/2Bdb3is- via e-mail to yugendolls@gmail.com- by phone to 520 647-4557"}, {"url": "https://www.kold.com/2019/11/11/questions-with-headliners-dusk-music-festival/", "title": "7 questions with the headliners of DUSK Music Festival", "authors": ["Lisette Larson", "Lauren Renteria", "Published At Pm"], "date": "2019-11-11", "keywords": ["dusk", "zachary", "thing", "music", "headliners", "questions", "talks", "say", "festival", "yall", "unspoken", "arizona", "band", "z", "wants"], "summary": "“Arizona is a place that we will never say no to doing anything,” said lead singer Zachary Charles.\n“It’s unspoken, nobody talks about it; nobody wants to say this is a thing, but the whole Arizona the state but the band is A R I Z O N A and y’all just happen to like the band makes the bond stronger.”"}, {"url": "https://www.kold.com/2019/11/09/collision-blocks-westbound-traffic-interstate/", "title": "UPDATE: Lanes open as collision slows westbound traffic on Interstate 10, one person sent to hospital", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-09", "keywords": ["update", "transported", "happened", "interstate", "slows", "near", "person", "unclear", "sent", "lanes", "crash", "severe", "road", "traffic", "open", "westbound", "hospital", "irvington"], "summary": "The crash happened near the Irvington Road exit, according to ADOT.\nIt’s unclear how severe the crash was, but one person was transported to the hospital."}, {"url": "https://kvoa.com/news/local-news/2019/11/29/tornado-warning-issued-for-northeastern-pima-county/", "title": "UPDATE: TWC cancels Tornado Warning for Pima, Pinal", "authors": ["News Tucson"], "date": "2019-11-29", "keywords": ["update", "tornado", "warning", "degrees", "pinal", "tons", "pima", "warmer", "temperatures", "near", "day", "sunshine", "warm", "couple", "cancels", "twc", "yesterday"], "summary": "Another beautiful day with tons of sunshine!\nTemperatures will be a couple of degrees warmer than yesterday but near average.\nWe’ll continue to warm…"}, {"url": "https://www.azcentral.com/story/entertainment/events/2019/10/30/all-souls-procession-tucson-everything-you-need-to-know/3913987002/", "title": "Tucson's All Souls Procession: How to take part, where to park and what it all means", "authors": ["Tirion Morris", "Published A.M. Mt Oct."], "date": "2019-10-30", "keywords": ["souls", "means", "urn", "trucks", "stage", "event", "food", "finale", "tucson", "tucsons", "park", "procession", "takes"], "summary": "The All Souls Procession in Tucson, however, takes this theme to a new level.\nFrom those new to Tucson to those who've lived in the Old Pueblo for years, the All Souls Procession is an event eagerly awaited every year.\nFirst, attend the pre-procession partyStarted in 1990, the All Souls Procession is an annual event on the first Sunday of November.\nThere also are food trucks at the end of the procession for those who prefer to eat later.\nWhat to know about walking in the procession2016 All Souls Procession in Tucson, AZ."}, {"url": "https://patch.com/arizona/tucson/8-things-do-tucson-labor-day-2019", "title": "8 Things To Do In Tucson On Labor Day 2019", "authors": [], "date": "2019-08-30", "keywords": ["tours", "labor", "community", "race", "tour", "day", "things", "2019", "registration", "520", "tucson", "pet"], "summary": "TUCSON, AZ – With so many businesses and organizations' offices closed on Labor Day, Tucson is still in holiday-happenings mode on Labor Day, this Monday, Sept. 2.\nThe Museum is open from 9 a.m. to 5 p.m., and Labor Day general admission is $3.\nLabor Day Warrior Training Camp, 9 a.m. to 3 p.m., Playformance, 119 E. Toole Ave., Tucson.\nLabor Day Community Bash, 11 a.m. to 3 p.m., Tucson Jewish Community Center, 3800 E. River Road, Tucson.\nLabor Day is free day at the JCC, so before and after the bash, the community can use the JCC's fitness center, tennis courts and indoor playspace at no cost."}, {"url": "https://www.kold.com/2019/11/30/man-dies-downtown-hit-and-run-police-searching-suspect/", "title": "UPDATE: Police ID victim, search for driver in deadly hit and run", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-30", "keywords": ["update", "hit", "street", "id", "report", "sixth", "deadly", "run", "responded", "road", "torinese", "driver", "search", "westbound", "victim", "stumbled", "congress", "truck"], "summary": "They responded to a report of a middle-aged man who had stumbled into the road near the intersection of Congress Street and Sixth Avenue around 2:40 a.m. on Saturday, Nov. 30, 2019.\nTorinese laid in the street for a while, police said, and pickup truck ran him over and continued driving westbound on Congress."}, {"url": "https://arizonasports.com/story/2291178/coronavirus-cancellation-timeline-ifl-cancels-season/?show=comments", "title": "Coronavirus cancellation timeline: IFL cancels rest of season", "authors": ["Arizona Sports"], "date": "2020-04-14", "keywords": ["amthe", "canceled", "coronavirus", "cancellation", "timeline", "announced", "scheduled", "draft", "championship", "games", "season", "event", "ifl", "league", "cancels", "rest"], "summary": "April 13IFL cancels rest of seasonThe Indoor Football League announced they are canceling the rest of its season.\nFor their schedule, the IFL had only gotten two games into their season, with a game each taking place on March 7 and 8.\nThe Arizona Rattlers did not even play a game in the season, with their season debut originally scheduled for March 12.\nThe league was scheduled to open training camps April 26 and the regular season was set to begin May 15.\nIFL (2:13 p.m.)The IFL is suspending play following Saturday night’s games in Oakland and San Diego, the league announced Thursday."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/11/27/tucsons-holiday-ice-rink-opens-this-friday", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tucson Weekly Staff", "Tara Foulkrod", "Kathleen B. Kunz", "Logan Burtch-Buus"], "date": "2019-11-27", "keywords": ["sundayopen", "street", "socks", "week", "weeklys", "rink", "open", "cost", "skate", "dispatch", "tucson", "skating", "daily", "range"], "summary": "click to enlargeThe City of Tucson is opening its inaugural outdoor ice skating rink on Friday, located at 45 N. 5th Ave., across the street from Hotel Congress.The rink, which will open at 4 p.m., will operate from Nov. 29 to Jan. 5, and will be open seven days a week, except for Christmas Day.The rink will be available to the public and for private events during off-hours, with the facility operating from 4-10 p.m. on Monday-Friday, noon-10 p.m. on Saturday and noon-7 p.m. on Sunday.Open skate will cost $15 for adults and $10 for children 12 and under, with skate rental included in that cost.\nSocks are required and gloves are highly recommended.All purchases must be made at the rink, with no discounts given out for bringing your own skates.\nFor more information on the rink and to make a reservation, call (520)-791-4101."}, {"url": "https://www.azcentral.com/story/news/local/arizona-weather/2019/11/27/live-updates-storm-rain-expected-thanksgiving-day-arizona/4307882002/", "title": "Arizona travel updates: Crashes back up traffic on Interstates 10, 17 and 40", "authors": ["The Republic", "Published P.M. Mt Nov."], "date": "2019-11-27", "keywords": ["expected", "closed", "interstates", "crashes", "near", "updates", "snow", "40", "17", "weather", "travel", "traffic", "arizona", "service", "storm", "rain", "phoenix"], "summary": "3 p.m.: Crashes delay traffic on Interstates 10 and 40Two traffic collisions blocked traffic on Interstate 10 on Sunday afternoon.\nA southwestern Cochise County flood warning for small streams was extended until 10:30 a.m. Thursday, the weather service said.\nStorms up north will bring strong winds, with gusts reaching as high as 50 mph and blowing snow expected, Rogers said.\nNoon Wednesday: Travel should be avoidedThe worst travel times for the holiday weekend will be during the Thursday to Friday period, Weather Service meteorologists said Wednesday.\nThis will be the most hazardous winter weather conditions and travel should be avoided,\" according to the Weather Service forecast for Friday."}, {"url": "https://www.kold.com/2019/11/05/missing-ripon-girl-believed-be-arizona-man-arrested/", "title": "Missing Wisconsin girl found at Tucson Goodwill", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-05", "keywords": ["suspect", "records", "traveled", "goodwill", "missing", "talin", "wisconsin", "sexual", "charged", "seconddegree", "warrant", "ross", "tucson", "online", "girl"], "summary": "Authorities believe Garza traveled to Arizona with suspect Talin Ross, 21.\nRoss is charged with second-degree sexual assault of a child under 16.\nOnline court records show he was charged Friday, Nov. 1, and an arrest warrant was issued the same day."}, {"url": "https://news.azpm.org/p/news-articles/2019/11/1/161121-tucsons-pedestrian-fatality-problem/", "title": "Tucson's pedestrian fatality problem", "authors": ["Nick O'Gara"], "date": "2019-11-01", "keywords": ["pedestrians", "country", "number", "fatalities", "fatality", "pedestrian", "deaths", "say", "traffic", "tucson", "tucsons", "getting", "problem"], "summary": "A troubling trend is playing out on Tucson's streets: It's getting deadlier for pedestrians.\nTucson's increase in pedestrian fatalities is dramatic over the last five years, and around the country the number of pedestrian fatalities has been on the rise for the last 10 years or so, following a decades-long decline.\nAll other traffic deaths combined are decreasing, and cars appear to be getting safer for their drivers and passengers.\nArizona, California, Florida, Georgia and Texas made up 46% of all the pedestrian traffic deaths, according to 2018 numbers from the Governor's Highway Safety Association.\nSeveral experts say solving the problem goes beyond getting pedestrians and drivers to pay more attention, and includes reconsidering how we design cities, roads and transit systems."}, {"url": "https://www.kold.com/2019/11/21/man-found-shot-eegees-midtown-tucson/", "title": "UPDATE: Man found shot at eegee’s in midtown Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-21", "keywords": ["update", "appear", "midtown", "shot", "tpd", "shooting", "asked", "eegees", "random", "does", "88crime", "tucson", "information", "man"], "summary": "The TPD said it does not appear to be a random shooting, but anyone with information is asked to call 88-CRIME"}, {"url": "https://www.kold.com/2019/11/06/witnesses-say-lighting-strike-precedes-power-outage-tep-investigating/", "title": "Thunderstorms cause power outages throughout Tucson area", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-06", "keywords": ["mall", "park", "midvale", "area", "near", "neighborhood", "power", "weather", "outages", "tep", "outage", "reported", "tucson", "thunderstorms", "cause"], "summary": "TEP reported more outages about an hour later affecting more than 2,000 customers - 1,641 in the Midvale Park neighborhood and 762 near the El Con Mall.\nThe cause of the Midvale Park outage was determined to be damage caused by weather."}, {"url": "https://www.kold.com/2019/11/12/strange-lights-seen-over-phoenix/", "title": "Strange lights seen over Phoenix", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-11-12", "keywords": ["appeared", "read", "viewers", "videos", "lights", "seeing", "article", "azfamilycom", "strange", "seen", "reported", "entire", "phoenix"], "summary": "An article in azfamily.com said the lights appeared at about 7 p.m.\nSome viewers reported seeing up to 15 lights.\nRead the entire article and see more videos HERE."}, {"url": "https://www.afcea.org/content/raytheon-supporting-evolved-sea-sparrow-missile", "title": "Raytheon is Supporting the Evolved Sea Sparrow Missile", "authors": [], "date": "2020-04-15", "keywords": ["evolved", "raytheon", "missile", "2020", "support", "sparrow", "essm", "modification", "navy", "contract", "work", "tucson", "sea", "supporting", "program"], "summary": "Raytheon Co., Tucson, Arizona, is awarded a $13,718,000 cost-plus-fixed-fee modification to previously awarded contract N00024-16-C-5433 to exercise options in support Evolved Sea Sparrow Missile (ESSM) Design Agent, in-service support and technical engineering support services.\nThe ESSM program is an international cooperative effort to design, develop, test and procure ESSM missiles and provides enhanced ship defense.\nFiscal 2020 operations and maintenance (Navy); 2020 research, development, testing, and evaluation (Navy); 2020 and 2019 other country funds; 2020 weapons procurement (Navy); and FMS funding in the amount of $11,931,401 will be obligated at time of award, and $4,868,809 will expire at the end of the current fiscal year.\nThis contract modification was not competitively procured in accordance with 10 U.S. Code 2304(c)(4).\nThe Naval Sea Systems Command, Washington, District of Columbia, is the contracting activity."}, {"url": "https://patch.com/arizona/tucson/rent-arizona-prices-climbed-2019", "title": "Rent In Arizona: Prices Climbed In 2019", "authors": [], "date": "2020-01-20", "keywords": ["climbed", "report", "mesa", "rental", "costs", "cities", "rent", "2019", "increased", "prices", "arizona", "phoenix"], "summary": "ARIZONA — Rent costs are on the rise across the nation, according to the first National Rent Report of 2020, compiled by Apartment List.\nNationally, rent costs increased 1.4 percent from December 2018 to December 2019; however, some cities actually are bucking the trend and seeing rent costs fall.\nArizona is among the states where rent costs increased in 2019.\nAccording to the report, rent increased 3.5 percent from December 2018 to December 2019.\nAccording to the report, Mesa, Arizona, had the fastest year-over-year rent growth among cities with a population of 250,000 or more."}, {"url": "https://packerswire.usatoday.com/gallery/nfl-invites-58-top-prospects-to-participate-virtually-in-2020-draft/", "title": "NFL invites 58 top prospects to participate virtually in 2020 draft", "authors": ["Zach Kruse", "April", "Pm Et"], "date": "2020-04-10", "keywords": ["virtually", "packers", "58", "weighed", "wire", "2020", "prospects", "won", "type", "nfl", "watkinswhat", "draft", "touches", "wingspan", "invites", "participate", "team"], "summary": "The Green Bay Packers must use the 2020 NFL Draft to provide the finishing touches on a team that won 13 regular-season games and got within one game of the Super Bowl during Matt LaFleur’s first season as head coach.\nBetween now and the draft, Packers Wire will periodically break down one top prospect fitting the Packers’ roster needs.\nUp next is Southern Miss receiver Quez Watkins:What he can do– Long, lean body type.\nWeighed in at the combine at 185.\nRan 4.35 in the 40-yard dash, with one of the best 10-yard splits in..."}, {"url": "https://patch.com/arizona/tucson/216-ufo-sightings-arizona-so-far-2019-what-they-saw", "title": "216 UFO Sightings In Arizona So Far In 2019: What They Saw", "authors": [], "date": "2019-12-31", "keywords": ["objects", "far", "sky", "national", "flying", "lights", "saw", "reporting", "216", "2019", "ufo", "reports", "reported", "sightings", "arizona"], "summary": "ARIZONA – The National UFO Reporting Center gets witness accounts of unidentified flying objects every year from people in Arizona and elsewhere around the country.\nThousands of reports of unidentified flying objects, or UFOs, are filed every year.\nIn Arizona, while the clock ticks down to Jan. 1, 2020, so far 216 reports have been filed in 2019.\nMeanwhile the city of Phoenix had 5 UFO sightings reported in December, the most recent of which happened on Dec. 20 and was reported the same day.\nRead more Arizona UFO reports at the National UFO Reporting Center's website."}, {"url": "https://www.10best.com/destinations/arizona/tucson/attractions/things-to-do-in-december/", "title": "10 Best Holiday Attractions in Tucson to Bask in Southwestern Glow", "authors": [], "date": "2019-12-06", "keywords": ["glow", "attractions", "chul", "twinkling", "best", "avenue", "lights", "tohono", "bask", "garden", "holiday", "southwestern", "winter", "tucson"], "summary": "Winter is the high season in Tucson, thanks to the city's great weather and unique Southwestern cultural attractions.\nFor a uniquely Southwestern holiday light display, head over to Tohono Chul Park for Holiday Nights at Tohono Chul.\nFor six special evenings, Tohono Chul is transformed into a winter wonderland complete with a million holiday lights and a special desert snowman.\nAnother great destination for holiday lights is the Tucson Botanical Garden, which hosts the annual Luminaria Nights at Tucson Botanical Garden.\nThe parade features a cavalcade of floats wrapped in twinkling holiday lights."}, {"url": "https://www.kgun9.com/news/local-news/flood-advisory-issued-for-tucson-surrounding-areas", "title": "Strong Thunderstorm could bring hail, strong winds to Southern Arizona", "authors": [], "date": "2019-12-09", "keywords": ["winds", "picacho", "bring", "storms", "southern", "hail", "verde", "tanque", "strong", "mile", "markers", "county", "valley", "thunderstorm", "tucson", "arizona", "peak"], "summary": "https://t.co/6AZKA9gJs9 #azwx pic.twitter.com/dG5KFmMJot — NWS Tucson (@NWSTucson) December 9, 20191:35 p.m.Pima County updated its list of road closures:Wentworth Road @ Tanque Verde Creek.\nTanque Verde Loop from Tanque Verde to Speedway.\nThe range extends from Picacho Peak State Park to 15 miles southest of Avra Valley.\npic.twitter.com/X2jgwvC81d — April Madison (@AprilMadisonWX) December 9, 20198:25 a.m.Pima County announced that the intersection of Wentworth Road and Tanque Verde Creek was closed.\nI-10 between mile markers 236 and 276, as well as I-19 between mile markers 53 and 63, Route 86 between mile markers 152 and 171 and route 77 between mile markers 70 and 97 are all included."}, {"url": "https://www.kold.com/2019/12/28/video-southern-arizona-residents-get-chance-play-snow/", "title": "VIDEO: Southern Arizona residents get chance to play in snow", "authors": ["Bud Foster", "Published At Pm"], "date": "2019-12-28", "keywords": ["photos", "chance", "viewers", "kold", "southern", "video", "snow", "shots", "sent", "share", "going", "residents", "arizona", "play", "13"], "summary": "Below are photos and video sent to KOLD News 13 by our viewers.\nShare you shots by going HERE."}, {"url": "https://www.kgun9.com/news/local-news/2019-tucson-weather-in-review", "title": "2019 Tucson weather in review", "authors": [], "date": "2020-01-03", "keywords": ["month", "airport", "average", "snow", "2019", "weather", "monsoon", "tucson", "review", "rain", "wettest"], "summary": "TUCSON, Ariz. — Every year brings its share of beautiful, hot, cold, interesting and sometimes exciting weather to Tucson.\nThat set the stage for what was going to be an interesting year of weather and another challenging year for weather forecasters.\nAccording to the Tucson National Weather Service, 2019 marked the 21st straight year of above average yearly temperatures.\nFebruary 22nd brought widespread snow to southeastern Arizona and we even recorded 1.9” of snow at the Tucson International Airport.\nAt the Tucson International Airport, the monsoon rain total was 5.06” which fell about an inch below the average 6.08” rain total."}, {"url": "https://www.kold.com/2019/12/31/here-are-southern-arizonas-most-read-local-stories/", "title": "Here are southern Arizona’s most-read local stories of 2019", "authors": ["Published At Pm"], "date": "2019-12-31", "keywords": ["tempe", "times", "street", "shot", "arizonas", "alhashemi", "southern", "vehicle", "2019", "local", "mostread", "troopers", "arizona", "trooper", "tried"], "summary": "An Arizona state trooper fatally shot a suspect during a brutal attack in Tempe late Thursday, Dec. 19.\nArizona DPS said it began around 11:50 p.m. when the trooper saw Mohamed Ahmed E A Al-Hashemi knock over a street sign on Rural Road, which is south of Loop 202.\nThe trooper tried to get the 25-year-old Al-Hashemi to get out of the street several times before ordering him to the ground.\nAl-Hashemi refused and allegedly charged the trooper’s vehicle and kicked the hood.\nDuring a physical altercation between the trooper and Al-Hashemi, the trooper then shot and killed him."}, {"url": "https://somd.com/news/headlines/2020/23526.php", "title": "Local Navy Contract Awards", "authors": ["Virtually Everything", "Southern Maryland Online"], "date": "2020-04-15", "keywords": ["services", "virginia", "awards", "oklahoma", "aircraft", "funds", "local", "procurement", "llc", "navy", "contract", "fiscal", "work"], "summary": "WASHINGTON$6,106,000,000(April 15, 2020)—The U.S. Department of Defense recently announced the following contract awards that pertain to local Navy activities., is awarded amodification (P00006) to a previously-awarded firm-fixed-price contract N00019-18-C-1061 to procure eight General Electric F414-400 spare engines, 11 afterburner modules and 12 low pressure turbine modules for the Navy F/A-18 Super Hornet fighter aircraft.\nFiscal 2020 aircraft procurement (Navy) funds in the amount $51,520,476 will be obligated at time of award, none of which will expire at the end of the current fiscal year.\nFiscal 2020 aircraft procurement (Navy) funds of $9,696,091 will be obligated at time of award, none of which will expire at the end of the current fiscal year.\nThis modification changes the contract type of the Stand-off Land Attack Missile — Expanded Response (SLAM-ER) Phase I obsolescence redesign from a cost-plus-incentive-fee type contract to a firm-fixed-price type contract.\nFiscal 2020 weapons procurement (Navy) funds in the amount of $15,151,392; fiscal 2019 weapons procurement (Navy) funds in the amount of $11,363,544; and fiscal 2019 research, development, test and evaluation (Navy) funds in the amount of $3,787,848 will be obligated at time of award, none of which will expire at the end of the fiscal year."}, {"url": "https://azbigmedia.com/business/economic-development/here-are-arizonas-biggest-economic-development-wins-of-2019/", "title": "Here are Arizona’s biggest economic development wins of 2019", "authors": ["Steve Burks"], "date": "2019-12-03", "keywords": ["economic", "biggest", "arizonas", "million", "center", "2019", "jobs", "facility", "create", "plans", "wins", "development", "employees", "tucson", "arizona", "company"], "summary": "Inc. plans to create 25 new jobs in the Chandler community and expects to be fully operational by the winter of 2019.\nThe new $200+ million facility, which is slated to begin operation in the back half of 2020.\nThe company plans to create 350 jobs at all levels, including customer care associates, supervisors, and managers.\nThe company plans to create 100 new jobs, which will primarily be assembly and warehouse workers.\nThe economic impact of the new Tucson distribution center is anticipated to be $181 million over the next five years."}, {"url": "https://patch.com/arizona/tucson/city-tucson-holiday-2019-trash-recycling-changes", "title": "City Of Tucson Holiday 2019 Trash And Recycling Changes", "authors": [], "date": "2019-12-19", "keywords": ["trash", "day", "recycling", "city", "changes", "2019", "holiday", "dec", "service", "residents", "tucson", "collection", "jan"], "summary": "TUCSON, AZ — Similar to other Tucson residents who will enjoy Christmas Day and New Year's Day with loved ones at holiday gatherings while indulging in festive holiday food and drink, City of Tucson employees will have Dec. 25 and Jan. 1 off from work too.\nSo the regularly scheduled commercial and residential trash and recycling collection for Tucson residents will not occur on those two days.\nInstead:Those with a regular Wednesday collection day will now have their trash and recycling picked up on Thursday both weeks.\nCustomers doing so will be contacted by a City employee \"no later than the next business day,\" City officials reported.\nTo keep track of the City of Tucson's holiday trash and recycling collection schedule, the free RecycleCoach App can be downloaded by smartphone owners, or go to www.tucsonaz.gov/esd."}, {"url": "https://www.kold.com/2019/12/07/tucson-police-investigate-west-side-shooting/", "title": "Tucson police investigate west side shooting", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-07", "keywords": ["scene", "w", "dugan", "shooting", "west", "way", "shot", "mail", "vehicle", "investigate", "tucson", "man", "tried", "st"], "summary": "Based on evidence from the scene, Dugan said investigators believe the man was shot at 1000 W. Congress St.\nIt seems as though the man drove down Grande Avenue, hitting mail boxes along the way, before arriving at the apartment complex.\nDugan said the man looks like he tried to get out of his car then collapsed beside the vehicle."}, {"url": "https://www.kold.com/2019/12/12/collision-speedway-boulevard-lands-two-people-hospital/", "title": "UPDATE: Collision on Speedway Boulevard proves fatal; another seriously injured", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-12", "keywords": ["update", "taken", "tpd", "threatening", "passed", "serious", "male", "fatal", "injured", "injuries", "seriously", "speedway", "proves", "driver", "boulevard", "suffering", "collision", "nonlife"], "summary": "According to information from the TPD, both adult drivers were taken to the hospital with serious injuries.\nThe female driver passed away from her injuries and the male driver is suffering from serious non-life threatening injuries."}, {"url": "https://www.abc15.com/weather/live-updates-storms-bring-rain-and-snow-to-parts-of-arizona", "title": "LIVE UPDATES: Storms bring rain and snow to parts of Arizona", "authors": [], "date": "2019-12-27", "keywords": ["shows", "live", "azwx", "radar", "parts", "bring", "updates", "storms", "nws", "snow", "weather", "tucson", "arizona", "27", "rain", "phoenix"], "summary": "PHOENIX — We are in Weather Action Mode Thursday night and Friday as more storms bring rain and snow in the high country, that could impact holiday travel.\nRELATED: Storm brings rain and snow tonight!\nSnow and rain are expected to continue across Arizona through tomorrow.\n#azwx pic.twitter.com/7i5YnKbX1z — NWS Phoenix (@NWSPhoenix) December 27, 20199:25 p.m.925 PM Radar loop ending at 915 PM shows rain & snow ongoing across much of AZ.\n#azwx pic.twitter.com/CdUAZasK8Y — NWS Tucson (@NWSTucson) December 27, 20197:48 p.m."}, {"url": "https://www.kold.com/2019/12/19/police-identify-homicide-victim-killed-downtown-brawl/", "title": "Police identify homicide victim killed in downtown brawl", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-19", "keywords": ["downtown", "street", "relative", "brawl", "near", "release", "press", "identify", "south", "homicide", "garcia", "jason", "tucson", "victim", "killed"], "summary": "Investigators identified 25-year-old Jason Garcia as the victim of the fight on Dec. 8, 2019.\nGarcia, who was accompanied by a relative, was involved in an altercation with at least two other people near the intersection of south Fifth Street and east Congress Street, according to a press release from the Tucson Police Department."}, {"url": "https://www.kold.com/2019/12/22/tpd-woman-shot-midtown-tucson/", "title": "TPD: Woman shot in midtown Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-22", "keywords": ["midtown", "dugan", "tpd", "shot", "situation", "detectives", "searching", "according", "speak", "accidental", "woman", "witnesses", "suspects", "tucson", "officers"], "summary": "Officers were not searching for any suspects, according to Dugan.\nHe said the situation seemed to be accidental, but detectives still want to speak with other witnesses."}, {"url": "https://www.kold.com/2019/12/04/tucson-police-respond-shooting-midtown/", "title": "UPDATE: Tucson police detain two suspects involved in midtown shooting", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-04", "keywords": ["update", "custody", "midtown", "purchase", "shooting", "detain", "shot", "robbery", "dugan", "suspects", "tucson", "victim", "meet", "online", "involved", "property"], "summary": "Dugan said the two suspects, who are now in police custody, arranged to meet the victim online to purchase property from him.\nThe victim was shot in what police believe was an attempted robbery."}, {"url": "https://tucsonfoodie.com/2019/12/11/christmas-2019-restaurants-serving-festive-meals/", "title": "Christmas Eve & Christmas Day 2019: 10+ restaurants serving festive meals", "authors": ["Matt Sterner"], "date": "2019-12-11", "keywords": ["calling", "menu", "serving", "day", "christmas", "restaurants", "regular", "2019", "dinner", "visit", "eve", "festive", "520", "information", "meals"], "summary": "The Coronet is throwing an “Oy Humbug” Christmas Eve dinner in addition to their regular menu.\nDOWNTOWN Kitchen + Cocktails is closed on Christmas Day but is offering a meal that reflects the flavors of Tucson and the best of the season on Christmas Eve.\nIn addition to Harvest’s regular menu, they’ll be featuring the following on Christmas Eve.\nWhether you’d like to celebrate the holidays on Christmas Eve or Christmas Day, the restaurant has you covered with two days of great food.\nThis Christmas Eve, Tavolino Ristorante Italiano is serving a “Feast of the Seven Fishes” multi-course dinner for $65 per person."}, {"url": "https://www.kold.com/2019/12/15/tpd-police-investigate-officer-involved-shooting-midtown/", "title": "UPDATE: Two dead following incident at apartment complex in midtown Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-15", "keywords": ["update", "midtown", "complex", "shot", "samantha", "apartment", "release", "parsons", "incident", "dead", "outside", "victor", "relationship", "tucson", "following", "stated"], "summary": "The Tucson Police Department said Victor A. Parsons, who has a long criminal history, was fatally shot.\nA news release from the agency stated Parsons was inside an apartment when he fired on officers outside.\nSamantha A. Boyd, who was in a relationship with Parsons, was later found dead in Parsons’ apartment."}, {"url": "https://www.kold.com/2019/12/30/everything-you-need-know-about-arizona-bowl/", "title": "Everything you need to know about the Arizona Bowl", "authors": ["Published At Pm"], "date": "2019-12-30", "keywords": ["starts", "watch", "know", "person", "bowl", "game", "dish", "pregame", "need", "info", "arizona", "kickoff", "tv", "ticket"], "summary": "Pregame starts at 2 p.m. and the kick-off will be at 2:30 p.m.\nTicket info can be found HERE.\nIf you can’t make it in person, you can watch the game on channel 221 for Direct TV, 158 for Cox, 312 for Dish, and 594 for Comcast."}, {"url": "https://www.kold.com/2019/12/17/first-alert-forecast-cold-start-windy-end/", "title": "FIRST ALERT FORECAST: Cold start, windy end!", "authors": ["Published April", "At Pm", "At Am"], "date": "2019-12-17", "keywords": ["70s", "start", "highs", "week", "cold", "windy", "day", "temps", "alert", "end", "winter", "forecast", "weekend", "warm", "steadily"], "summary": "Temps steadily warm through the week and into the weekend with highs for the first day of winter in the 70s."}, {"url": "https://www.kgun9.com/weather/winter-weather-advisory-issued-for-southern-arizona-mountains", "title": "Winter Weather Advisory Issued for Southern Arizona mountains", "authors": [], "date": "2019-12-23", "keywords": ["wind", "issued", "warning", "weatherhourly", "white", "southern", "mount", "mountains", "weather", "winter", "advisory", "feet", "arizona", "7000"], "summary": "TUCSON, Ariz. - The National Weather Service issued a a Winter Weather Advisory for Southern Arizona mountains.\nA Winter Weather Advisory above 7000 feet, from 8 AM Tuesday to 1 AM Wednesday morning pic.twitter.com/pTAWzsQBWi — April Madison (@AprilMadisonWX) December 23, 2019The warning will be in effect from 8 a.m. Tuesday to 1 a.m. Wednesday above 7,000 feet elevation.\nAreas affected include Hannagan Meadow, Mount Graham, Mount Lemmon and Summerhaven, as well as the White Mountains, Catalinas and Rincons.\nSnowfall of 5 to 10 inches, as well as wind gusts as high as 35mph are possible.\nMORE WEATHERHourly Forecast7 Day RadarTravel ForecastWeather Alerts"}, {"url": "https://kvoa.com/news/local-news/2019/12/13/winterhaven-lights-up-tucson-starting-saturday/", "title": "Winterhaven lights up Tucson until Dec. 29", "authors": ["Anthony Victor Reyes"], "date": "2019-12-13", "keywords": ["community", "lights", "canned", "dec", "holiday", "food", "festival", "visit", "tucson", "road", "getting", "winterhaven", "29"], "summary": "Luckily for holiday celebrants, the 70th annual Winterhaven Festival of Lights officially lighted up at its historic midtown location this Saturday.\nSince 1949, community members and Tucson visitors alike have walked through the neighborhood on Front Lowell Road between Country Club Road and Tucson Boulevard during December to check out the unique and bright holiday displays.\nNow in its 70th year, festival organizers hope to gather the community together for another year in support of the Community Food Bank in Tucson.\nWhile there is no entrance fee to attend the annual festival, people who visit Winterhaven are advised to bring a donation of money or food in benefit of the Community Food Bank of Southern Arizona.\nThis year's festival will take place until Dec. 29."}, {"url": "https://www.kgun9.com/holidays/help-fill-the-streetcar-with-toys-for-miracle-on-31st-street", "title": "Help \"Fill the Streetcar\" with toys for Miracle on 31st Street!", "authors": [], "date": "2019-11-15", "keywords": ["streetcar", "street", "help", "toys", "christmas", "children", "charity", "31st", "tucson", "miracle", "celebration"], "summary": "The Regional Transportation Authority, KGUN 9 On Your Side, and Arby's want to thank you for helping to \"Fill the Streetcar\" with toys for the Miracle on 31st Street charity Christmas celebration to benefit children who live in some of Tucson's most disadvantaged neighborhoods.\nRamon's Miracle on 31st Street is a legendary grassroots charity that provides holiday kindness to economically disadvantaged children in Tucson.\n2019 will mark the 49h year, that this open-door Christmas celebration is attended by thousands of children and their families.\nAfter Friday, December 6th, if you would like to make a donation to the Miracle on 31st Street charity Christmas celebration, you can drop off new unwrapped toys at KGUN's studios, or with Ramon Gonzalez at 2019 W Ajo Way Tucson AZ 85713 - or by calling Ramon at (520) 971-8271.\nWe are off to a great start with all of the toys and cash that were donated at Arby's locations throughout Tucson to help the \"Fill the Streetcar\" in downtown Tucson on December 6th."}, {"url": "https://www.kold.com/2019/12/25/tucson-home-destroyed-by-blaze-christmas-morning/", "title": "Tucson home completely destroyed by Christmas morning fire", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-25", "keywords": ["complete", "morning", "loss", "hour", "destroyed", "christmas", "completely", "able", "tucson", "crews"], "summary": "Crews were able to put the fire out in about an hour, but the home was a complete loss."}, {"url": "https://patch.com/arizona/tucson/5-tucson-nonprofits-need-your-giving-tuesday-2019-donations", "title": "5 Tucson Nonprofits That Need Your Giving Tuesday 2019 Donations", "authors": [], "date": "2019-12-02", "keywords": ["thanksgiving", "giving", "right", "help", "nonprofits", "2019", "think", "need", "transform", "donations", "world", "tucson", "tomorrow", "url"], "summary": "TUCSON, AZ — Right on the heels of Thanksgiving, Black Friday and Cyber Monday is Giving Tuesday, tomorrow, Dec. 3.\nGiving Tuesday always falls on the first Tuesday of December since its inception in 2012, and givingtuesday.org describes it as a \"global generosity movement\" to help people and organizations \"transform their communities and the world.\"\nWhile we can help entities across the world by entering a URL and pushing a couple of keyboard buttons, we can also make a difference locally, right here in Tucson.\nHere are 5 Tucson area nonprofits asking the public to think about donating to them on Giving Tuesday 2019:"}, {"url": "https://www.azcentral.com/in-depth/news/local/arizona-environment/2019/12/05/arizona-groundwater-rules-water-tables-declining-parts-phoenix-tucson/3949004002/", "title": "Arizona has tried to safeguard groundwater beneath its big cities. But things are about to change", "authors": ["Rob O'Dell", "Ian James", "The Republic"], "date": "2019-12-05", "keywords": ["safeguard", "phoenix", "areas", "change", "beneath", "state", "groundwater", "big", "levels", "river", "cap", "things", "arizona", "water", "tried", "colorado", "cities"], "summary": "While groundwater is rapidly falling in rural farming communities across Arizona, Phoenix, Tucson and other cities haven’t reached that desperate situation.\nWater levels in some of the wells surrounding these recharge sites have jumped 150 to 200 feet since the early 1980s.\nStarting next year, though, there will be much less of that river water available to prop up aquifers.\nMark Henle/The RepublicThe Colorado River is under increasing pressures due to years of overuse and drought, compounded by the effects of climate change.\nIn 1996, the Central Arizona Project started sending Colorado River water to groundwater replenishment ponds to boost aquifer levels."}, {"url": "https://azbigmedia.com/business/aerospace/u-s-air-force-awards-raytheon-768m-missile-contract/", "title": "U.S. Air Force awards Raytheon $768M missile contract", "authors": ["Az Business Magazine"], "date": "2019-12-31", "keywords": ["contracting", "awards", "raytheon", "engineering", "missile", "force", "awarded", "air", "768m", "contract", "production", "navy", "tucson", "systems"], "summary": "Raytheon Missile Systems Co., Tucson, Arizona, has been awarded a $768,283,907 non-competitive fixed-price incentive (firm) contract for Advanced Medium Range Air-to-Air Missile (AMRAAM) Production Lot 33.\nThis contract provides for the production of the AMRAAM missiles, captive air training missiles, guidance sections, AMRAAM telemetry system, spares and other production engineering support hardware.\nThe Air Force Life Cycle Management Center, Air Dominance Division Contracting Office, Eglin Air Force Base, Florida, is the contracting activity.\nRaytheon Missile Systems in Tucson, Arizona, is awarded a $112,267,649 modification to a previously awarded cost-plus-incentive-fee contract.\nThe Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity."}, {"url": "https://kvoa.com/news/local-news/2019/12/27/ovpd-missing-oklahoma-man-tracked-to-tucson/", "title": "OVPD: Missing Oklahoma man tracked to Tucson", "authors": ["Anthony Victor Reyes"], "date": "2019-12-27", "keywords": ["oklahoma", "ovpd", "tracked", "near", "missing", "oro", "valley", "seen", "tucson", "oracle", "man"], "summary": "TUCSON - Oro Valley Police Department is on the lookout for a missing man from Oklahoma who was last seen Dec. 7.\nAccording to OVPD, 66-year-old Steven Brashear traveled to Tucson from Bartlesville Okla. with another man in a gray Audi Q5 SUV with Oklahoma temporary plates.\nHe is believed to have gone to a restaurant near the Tucson Mall, near Oracle and Wetmore roads.\nMedia Release: OVPD Searching for Missing PersonOro Valley, Arizona (December 27, 2019) – The Oro Valley Police... Posted by Oro Valley Police Department on Friday, December 27, 2019Police tracked Brashear's cell phone, which pinpointed to a location within a three-mile radius of Oracle and Hardy roads.\nBrashear was described as a five-foot, six-inch-tall man who has green eyes and weighs 165 pounds."}, {"url": "https://kvoa.com/news/top-stories/2019/12/04/police-investigate-hit-and-run-in-central-tucson/", "title": "Police investigate hit-and-run in central Tucson", "authors": ["Julia Leon"], "date": "2019-12-04", "keywords": ["transported", "university", "hitandrun", "updates", "central", "tucsonpolice", "vehicle", "umc", "investigate", "timestay", "tucson", "victim", "man"], "summary": "TUCSON – A man was struck by a vehicle Wednesday morning in central Tucson.\nPolice say the victim was transported to University Medical Center (UMC) after a hit-and-run incident on Stone Avenue and Mabel Street.\nThe man suffered non-life threatening injuries.\nNo further details have been released at this time.\nStay with News 4 Tucson for the latest updates."}, {"url": "https://www.kgun9.com/weather/mount-lemmon-ski-valley-opens-saturday", "title": "Mount Lemmon Ski Valley opens Saturday", "authors": [], "date": "2019-12-28", "keywords": ["ski", "conditions", "snowas", "opens", "vehicles", "weather", "valley", "tucson", "mount", "road", "lemmon"], "summary": "TUCSON, Ariz. - Mount Lemmon Ski Valley opened Saturday, weather conditions denied public skiers access to the slopes.\nAccording to the Ski Valley Facebook page, the area received between 20 and 30 inches of snow.\nAs of 11 a.m. Saturday, the road to Mount Lemmon remained closed to the public.\nOnly employees and residents with chains or four-wheel drive vehicles were allowed up the mountain.\nTo check road conditions, call 547-7510."}, {"url": "https://kvoa.com/news/top-stories/2019/12/04/tpd-one-dead-after-hit-and-run-on-tucsons-westside/", "title": "TPD: One dead after hit-and-run on Tucson’s westside", "authors": ["Julia Leon"], "date": "2019-12-04", "keywords": ["suspect", "vehiclewitnesses", "tpd", "hitandrun", "west", "westside", "westsidetucson", "pedestrian", "victim", "dead", "witnesses", "westbound", "tucson", "information", "tucsons"], "summary": "TUCSON – Police are investigating a fatal hit-and-run that happened late Tuesday night on Tucson’s westside.\nTucson Police Department says officers were dispatched to the intersection of West Anklam Road and Centennial Drive after 11 p.m.A pedestrian was pronounced dead at the scene after Tucson Fire Medics attempted to render aid.\nAccording to a news release, detectives learned from witnesses that the pedestrian was southwest of St. Mary’s Hospital when he was struck by a westbound vehicle.\nWitnesses said the suspect did not stop and fled the scene.\nAt this time, there is no suspect vehicle information, police say."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/12/13/things-to-do-friday-dec-13", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk"], "date": "2019-12-13", "keywords": ["live", "music", "free", "church", "15", "weeklys", "dec", "holiday", "dispatch", "tucson", "road", "st", "daily", "range", "13"], "summary": "7 p.m. on Friday, Dec. 13, at St. Francis in the Valley Episcopal Church, 600 S. La Canada Drive.\n7:30 p.m. on Sunday, Dec. 15, at St. Alban’s Episcopal Church, 3738 N. Old Sabino Canyon Road.\n10 a.m. to 6 p.m. Friday, Dec. 13, through Sunday, Dec. 15.\nPreshow & show at 6:20/7 p.m. on Friday, Dec. 13, at 1:20/2 p.m. and 6:20/7 p.m. on Saturday, Dec. 14 and at 1:20/2 p.m. on Sunday, Dec. 15.\nOn Friday, Dec. 13, Udall Park Farmers Market (7202 E. Tanque Verde Road) has live music and vendor specials."}, {"url": "https://www.kgun9.com/weather/winter-weather-advisory-issued-for-tucson-area-thursday", "title": "Winter Weather Advisory issued for Tucson area Thursday", "authors": [], "date": "2019-12-26", "keywords": ["issued", "wont", "area", "snow", "weather", "winter", "river", "valley", "tucson", "advisory", "service", "areas", "11"], "summary": "TUCSON, Ariz. - The National Weather Service issued a Winter Weather Advisory for Tucson and surrounding areas Thursday.\nAccording to the service, rain and possible snow could come from 11 p.m. Thursday through 11 a.m. Saturday.\nSome areas will receive as much as three inches of snow.\nWhile we likely won't see any accumulation in Tucson, KGUN 9 Meteorologist April Madison says Tucsonans may see some flakes falling as flurries are a possibility.\nAffected areas include the Tucson metro area, San Pedro River Valley, eastern Cochise County, Santa Cruz River Valley and upper Gila River Valley."}, {"url": "https://www.kold.com/2019/12/18/pima-county-sheriffs-department-investigating-fatal-domestic-violence-dispute/", "title": "Pima County Sheriff’s Department investigating fatal domestic violence dispute", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-18", "keywords": ["relationship", "department", "investigators", "lopez", "pima", "kurowski", "fatal", "county", "sheriffs", "dispute", "disclose", "domestic", "killed", "violence", "investigating"], "summary": "Investigators did not disclose how Kurowski was killed, where Lopez was found or what the relationship between the two is."}, {"url": "https://www.kold.com/2019/12/22/multi-car-crash-northwest-tucson/", "title": "UPDATE: Multi-car crash northwest of Tucson", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-22", "keywords": ["update", "transported", "hospital", "taken", "northwest", "serious", "person", "crash", "vehicle", "injuries", "say", "tucson", "multicar", "minor", "pulled"], "summary": "At least five people were taken to the hospital, one person was transported with serious injuries and one with minor injuries.\nAuthorities say one person had to be pulled out of a vehicle."}, {"url": "https://kvoa.com/news/local-news/2019/12/30/man-arrested-in-shooting-at-downtown-nightclub/", "title": "Man arrested in shooting in downtown", "authors": ["Anthony Victor Reyes"], "date": "2019-12-30", "keywords": ["shortly", "transported", "downtown", "taken", "shooting", "street", "wound", "arrested", "occurred", "tucson", "victim", "man"], "summary": "TUCSON - A man was taken into custody in connection to a shooting that occurred in downtown Sunday night.\nPolice say the individual was shot after a man later identified as 23-year-old Rey Murillo allegedly discharged a firearm.\nPolice said a physical altercation involving multiple people occurred shortly before the shooting.\nMurillo was arrested for aggravated assault and discharging a firearm in city limits.\nThe shooting victim was transported to the hospital shortly after the officers arrived at the scene."}, {"url": "https://kvoa.com/uncategorized/2019/10/17/noaa-issues-its-winter-forecast-warmer-and-maybe-wetter-for-arizona/", "title": "NOAA issues its Winter forecast: warmer and maybe wetter for Arizona", "authors": ["Matt Brode"], "date": "2019-10-17", "keywords": ["issues", "university", "noaa", "wetter", "married", "wife", "maybe", "winter", "sciences", "arizona", "seal", "proud", "tucson", "forecast", "meteorologist", "matt", "warmer", "maria"], "summary": "Chief Meteorologist Matt Brode has been affiliated with News 4 Tucson since 2006.\nHe holds his AMS seal of approval and is a proud graduate of The University of Arizona with a degree in Atmospheric Sciences.\nHe is happily married to his wife Ana Maria and proud father to David and Alexa."}, {"url": "https://www.kold.com/2019/12/31/list-released-most-popular-baby-names-arizona/", "title": "Most popular baby names in Arizona released for 2019", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-31", "keywords": ["fourth", "olivia", "boys", "according", "site", "released", "baby", "2019", "born", "liam", "girls", "arizona", "popular", "names", "row"], "summary": "Olivia is the top name for girls, and Liam is the top name for boys.\nThis is the fourth year in a row that Liam has been the top name for boys born in Arizona, according to their site."}, {"url": "https://biologicaldiversity.org/w/news/press-releases/hundreds-expected-saturday-tucson-border-wall-protest-rep-grijalva-2019-12-05/", "title": "Hundreds Expected Saturday at Tucson Border Wall Protest With Rep. Grijalva", "authors": [], "date": "2019-12-05", "keywords": ["protest", "expected", "rep", "border", "endangered", "environmental", "wall", "construction", "hundreds", "grijalva", "trumps", "wildlife", "tucson", "national"], "summary": "TUCSON, Ariz.— Arizona leaders and activists will join U.S. Rep. Raúl Grijalva (D.-Ariz.) in Tucson on Saturday to protest President Donald Trump’s border wall.\nBackgroundMore than 100 miles of new border wall are planned or underway across Arizona, paid for with funds Trump diverted from Defense Department budgets.\nWall construction is already occurring through Organ Pipe Cactus National Monument and the San Bernardino National Wildlife Refuge.\nTo rush wall construction, Trump waived dozens of laws that protect public lands, cultural resources, sacred sites and endangered wildlife.\nThe border wall impedes the natural migrations of people and wildlife that are essential to healthy diversity."}, {"url": "https://www.kold.com/2019/12/23/tpd-investigating-fatal-pedestrian-collision/", "title": "UPDATE: Authorities identify victim, suspect in fatal pedestrian crash", "authors": ["Published At Pm"], "date": "2019-12-23", "keywords": ["update", "authorities", "suspect", "murder", "tpd", "drunk", "suffered", "speeding", "pedestrian", "fatal", "identify", "crash", "injuries", "seconddegree", "occurred", "victim", "minor", "facing"], "summary": "Aragon suffered minor injuries and the TPD said she was drunk and speeding when the accident occurred.\nShe is facing charges of second-degree murder, aggravated assault and criminal damage."}, {"url": "https://news.azpm.org/p/news-features/2019/12/10/162744-not-a-smooth-ride-so-far-for-e-scooters-in-tucson/", "title": "Not a smooth ride so far for e-scooters in Tucson", "authors": ["Jake Steinberg"], "date": "2019-12-10", "keywords": ["far", "scooters", "left", "iron", "association", "smooth", "city", "ride", "sidewalk", "seen", "tucson", "horse", "block", "neighborhood", "escooters"], "summary": "LISTENDockless electric scooters from companies Bird and Razor have been on Tucson streets since September.\nFor 30 cents per minute, anyone with a smartphone can activate one, take it for a ride and leave it when they get to their destination.\nHe said he’s seen scooters block the sidewalk and those riding them endanger pedestrians.\nErika Mitnik, president of the Iron Horse Neighborhood Association said the scooters are a hazard for drivers and are often left in yards.\nA letter from the Iron Horse Neighborhood Association to the city called them “corporate litter.”"}, {"url": "https://www.kold.com/2019/12/20/dps-involved-officer-involved-shooting-tempe/", "title": "GRAPHIC CONTENT: Arizona trooper fatally shoots suspect during brutal attack", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-20", "keywords": ["attack", "brutal", "suspect", "loss", "shoots", "knew", "life", "graphic", "immediate", "dps", "observer", "statement", "content", "fatally", "death", "arizona", "trooper", "feel"], "summary": "“As the attack continued, the trooper began to feel a loss of consciousness,” DPS said in a statement.\n“The trooper knew both his life and the life of the citizen observer in his car were in immediate danger of death.”"}, {"url": "https://www.kold.com/2019/12/24/justin-bieber-coming-arizona/", "title": "Justin Bieber coming to Arizona in 2020", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-24", "keywords": ["justin", "state", "twitter", "2020", "according", "video", "glendale", "bieber", "stadium", "farm", "coming", "arizona", "play", "posted"], "summary": "According to a video posted to Twitter, Bieber will play at the State Farm Stadium in Glendale on June 5."}, {"url": "https://www.kold.com/2019/12/08/wyoming-georgia-state-play-nova-home-loans-arizona-bowl/", "title": "Wyoming, Georgia State to play at NOVA Home Loans Arizona Bowl", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-08", "keywords": ["loans", "wyoming", "worked", "state", "zealously", "nova", "bowl", "georgia", "wanted", "twister", "arizona", "tucson", "play"], "summary": "\"The process of obtaining teams for a Bowl game is akin to playing Twister while engaged in speech and debate,” said Ali Farhang, chairman of the NOVA Home Loans Arizona Bowl.\n\"We have worked zealously to get precisely the matchup we wanted.\nWyoming and Georgia State will bring tens of thousands of fans to Tucson, which not only manifests in a significant impact on our economy but maximizes what the NOVA Home Loans Arizona Bowl can do for local charities,.\""}, {"url": "https://kvoa.com/news/local-news/2019/12/03/tucson-arizona-boys-chorus-to-perform-at-national-tree-lighting-at-white-house/", "title": "Tucson Arizona Boys Chorus to perform at National Tree Lighting at White House", "authors": ["Priscilla Casper"], "date": "2019-12-03", "keywords": ["perform", "trip", "white", "holiday", "lighting", "house", "chorus", "tucson", "national", "arizona", "boys", "going", "tree"], "summary": "The Tucson Arizona Boys Chorus is celebrating its 80th anniversary this year with an unforgettable trip this holiday to perform at the National Tree Lighting at the White House.\nTwo dozen boys in the chorus will be going on the trip.\nThis is the third time the chorus has been invited to perform during this annual White House tradition.\nThe group will sing Carol of the Bells and It is the Most Wonderful Time of the Year.\nThe National Christmas Tree Lighting will take place on Thursday night."}, {"url": "https://www.kold.com/2019/12/23/police-investigating-stolen-vehicle-crash/", "title": "Tucson Police investigating crash involving stolen vehicle", "authors": ["Published At Pm"], "date": "2019-12-23", "keywords": ["refused", "stolen", "parkway", "happened", "department", "vehicle", "crash", "involving", "driver", "tucson", "officers", "stop", "kino", "investigating"], "summary": "The Tucson Police Department said it happened on Kino Parkway when the driver refused to stop for officers."}, {"url": "https://tucsonfoodie.com/2019/12/27/best-things-december/", "title": "Here are the best things the Tucson Foodie team tasted in December", "authors": ["Tucson Foodie"], "date": "2019-12-27", "keywords": ["sauce", "favorite", "best", "fresh", "sweet", "scallops", "bite", "things", "rich", "noodles", "foodie", "pizza", "tucson", "en", "team", "tasted"], "summary": "Here are the Tucson Foodie staff picks of the best things we tasted in December.\nMy favorite lunch, perhaps in Tucson, is a side order of their Cochinito en Crema de Chipotle.\nBaba Ghanoush at Med Cuisine – I know, a food court stall as a favorite bite, WHAT?\nIt’s one of my favorite things about visiting the restaurant, and don’t skip out on one of their hefty margaritas either.\nThe deep crust highlighted the scallop’s natural rich umami and sweetness, while the inside was still tender."}, {"url": "https://www.spokesman.com/stories/2019/dec/11/wests-best-gonzaga-has-had-upper-hand-lately-in-ar/", "title": "West’s best? Gonzaga has had upper hand lately in Arizona series but is winless in Tucson", "authors": [], "date": "2019-12-11", "keywords": ["maui", "wests", "gu", "best", "upper", "gonzaga", "series", "win", "shots", "zags", "hand", "winless", "points", "lately", "tucson", "arizona", "scored", "14"], "summary": "Gonzaga and Arizona have battled for Western basketball supremacy all over the West.\n3 Gonzaga trailed by 13 early in the second half before outscoring Arizona 54-24 in the final 17:20.\nArizona forward Lauri Markkanen, who was selected seventh overall in the 2017 NBA draft, had 14 points but made just 4 of 14 shots.\nForward Brandon Ashley scored 14 points, and current Indiana Pacers guard T.J. McConnell had 12 for the third-ranked Wildcats.\nArizona’s Kyle Fogg had 14 points and Nick Johnson 13."}, {"url": "https://patch.com/arizona/tucson/whats-open-closed-tucson-columbus-day-2019", "title": "What's Open/Closed In Tucson On Columbus Day 2019", "authors": [], "date": "2019-10-11", "keywords": ["peoples", "mall", "columbus", "indigenous", "day", "2019", "holiday", "openclosed", "museum", "washington", "reported", "tucson", "whats"], "summary": "TUCSON – The Washington Post reported Thursday that Washington, D.C. Council member David Grosso this week initiated \"emergency legislation\" to rename Columbus Day as Indigenous Peoples' Day.\nLikewise, ABC News reported that more than 100 cities have already renamed the holiday as Indigenous Peoples' Day.\nBut in Arizona, the holiday we still call Columbus Day hits this Monday, Oct. 14, and with it, questions about what we can do and where we can go for entertainment, banking, pet adoptions and more in Tucson that day.\nThough most of the museums and places of business we contacted will be open on Columbus Day, a few won't.\nstores:Safeway – OPENCostco – OPENWalmart – OPENFry's – OPENMalls:Park Place Mall – OPENFoothills Mall – OPENLa Encantada – OPENTucson Mall – OPENPet adoptions:"}, {"url": "https://www.kold.com/2019/12/27/report-tucson-has-some-worst-traffic-country/", "title": "Report: Tucson has some of worst traffic in country", "authors": ["Kold News Staff", "Published April", "At Am", "At Pm"], "date": "2019-12-27", "keywords": ["surprise", "report", "worst", "country", "day", "christmas", "drive", "valentines", "pueblo", "comes", "traffic", "tomtom", "tucson", "old"], "summary": "TomTom said the best day to drive in the Old Pueblo is Christmas Day.\nThe worst day comes as a bit of a surprise -- Valentine’s."}, {"url": "https://www.kold.com/2020/01/01/hundreds-welcome-downtown-tucson/", "title": "Hundreds welcome 2020 in downtown Tucson", "authors": ["Hannah Tiede", "Published At Pm"], "date": "2020-01-01", "keywords": ["took", "themed", "downtown", "welcome", "swing", "2020", "stage", "success", "york", "hundreds", "world", "tucson", "vendors", "skating", "tone"], "summary": "As local bands set the tone on stage, families took advantage of the outdoor skating rink, kids center and food vendors.\nThose 21-years-old and up were able to take a swing at what organizers called “one of the largest pinatas in the world.” At Hotel Congress, a New York themed party was a success."}, {"url": "https://azbigmedia.com/business/business-leaders/newsmakers/making-news-delta-dental-barrett-jackson-sierra-tucson/", "title": "Making news: Delta Dental, Barrett-Jackson, Sierra Tucson", "authors": ["Az Business Magazine"], "date": "2019-12-26", "keywords": ["customer", "making", "dental", "lexus", "sierra", "excellence", "barrettjackson", "toyota", "center", "delta", "tucson", "arizona", "service"], "summary": "Delta Dental of Arizona earns prestigious Center of Excellence DistinctionDelta Dental of Arizona announced its recertification as a Center of Excellence by BenchmarkPortal for the fifth year in a row.\nThe Center of Excellence recognition is one of the most prestigious awards in the customer service and support industry, demonstrating Delta Dental of Arizona’s dedication to providing superior customer care.\nOur calls are efficient and we deliver service with a smile,” said Jeanette Watte, director of customer service at Delta Dental of Arizona.\nDue to Delta Dental of Arizona’s commitment to providing a great customer experience, 99% of members rate the service they receive from their customer service representative as very good or excellent.\n“The recertification of Delta Dental of Arizona is a direct result of its leadership’s commitment to balancing cost-effective service solutions with best-in-class service performance."}, {"url": "https://www.tucsonweekly.com/TheRange/archives/2019/12/14/things-to-do-this-weekend-dec-14-and-15", "title": "The Range: The Tucson Weekly's Daily Dispatch", "authors": ["Tw Fun", "Games Desk", "Propublica", "Justin Elliott", "Kristen Doererfor", "Logan Burtch-Buus"], "date": "2019-12-14", "keywords": ["live", "music", "free", "weeklys", "dec", "holiday", "food", "museum", "dispatch", "tucson", "road", "daily", "range", "14"], "summary": "There are two classes, at 1 p.m. and 2:30 p.m. Saturday, Dec. 14.\n4 p.m. on Saturday, Dec. 14, and 2 p.m. Sunday, Dec. 15.\nSaturday, Dec. 14.\n6 to 10 p.m. Saturday, Dec. 14, to Sunday, Dec. 29.\nThis free screening, presented by the Children’s Museum Tucson, will be held outdoors in the December air."}, {"url": "https://www.kold.com/2019/12/21/fire-closes-east-side-gadabout-salon-location/", "title": "Fire closes east side Gadabout Salon location", "authors": ["Kold News Staff", "Published At Pm"], "date": "2019-12-21", "keywords": ["investigators", "main", "salon", "location", "building", "inferno", "trying", "figure", "source", "gadabout", "attic", "east", "closes", "cause", "came"], "summary": "Investigators are still trying to figure out the cause of the inferno, however, they did find that the source of the fire came from the main part of the building as well as the attic area."}, {"url": "https://www.spokesman.com/stories/2019/dec/14/updates-no-6-gonzaga-faces-no-15-arizona-in-tucson/", "title": "Recap and highlights: Corey Kispert helps No. 6 Gonzaga earn rare road victory at No. 15 Arizona", "authors": [], "date": "2019-12-14", "keywords": ["wildcats", "recap", "points", "rare", "arizona", "kispert", "corey", "lead", "highlights", "scored", "earn", "gonzaga", "road", "zags", "helps", "victory", "rebounds", "run", "bulldogs"], "summary": "7:58 – Arizona 19, Gonzaga 17: A 7-0 run over the last 2-minutes, 33-seconds for the Bulldogs has Gonzaga within two.\n3:34 – Arizona 30, Gonzaga 28: The Wildcats lead by 2 at the under-4 timeout behind 10 points and six rebounds from Zeke Nnaji.\nHalf – Gonzaga 35, Arizona 34: Corey Kispert connects on a 3-pointer with 1:20 left in the half and Gonzaga takes its first lead.\nHalftimeHalf – Gonzaga 35, Arizona 34: Joel Ayayi has eight points, Corey Kispert has seven and balanced Gonzaga leads Arizona by 1 at halftime.\nFinal – Gonzaga 84, Arizona 80: Corey Kispert scored 18 points to lead four Bulldogs in double-figures and No."}, {"url": "https://tucsonfoodie.com/2019/12/30/tucson-restaurants-bars-that-closed-in-2019/", "title": "21 Tucson Restaurants & Bars That Closed in 2019", "authors": ["Jackie Tran"], "date": "2019-12-30", "keywords": ["closed", "months", "bars", "original", "21", "restaurant", "restaurants", "location", "n", "2019", "business", "article", "bar", "tucson"], "summary": "While dozens of new bars and restaurants opened in Tucson during 2019, around 21 restaurants closed.\nRead our April 2019 article Original Prep & Pastry to Move Into Former Casa Valencia on Campbell Avenue.\nRead our August 2019 article CLOSED: Club 21 Mexican Restaurant closed after 73 years.\nRead our June 2019 article CLOSED: Northeast Tucson’s Jackson Bar + Eatery closed after two year run.\nRead our June 2019 article CLOSED: Downtown’s MiAn Sushi & Modern Asian Cuisine closed after two year run."}]