[{"url": "https://oklahoman.com/article/5653176/oklahoma-business-people-for-jan-26-2020", "title": "Oklahoma business people for Jan. 26, 2020", "authors": [], "date": "2020-01-26", "keywords": ["oklahoma", "university", "accounting", "2020", "manager", "business", "named", "law", "tulsa", "joined", "jan", "senior", "26"], "summary": "Glenn Vestrat, CVA, has been named senior manager of business advisory in Tulsa.\nShe holds a Bachelor of Business Administration in accounting from Oklahoma Christian University.\nHe earned a Bachelor of Science in business administration and accounting from Oklahoma Baptist University.\nHe earned a Bachelor of Business Administration from the University of Oklahoma.\nAngie Yocham has been named a business advisory senior accounting specialist in Tulsa."}, {"url": "https://oklahoman.com/article/5659277/laredo-the-third-oilgas-company-seeking-reverse-stock-split-in-2020", "title": "Laredo the third oil/gas company seeking reverse stock split in 2020", "authors": [], "date": "2020-04-05", "keywords": ["stock", "valueit", "reverse", "exchange", "2020", "shares", "number", "week", "york", "split", "laredo", "share", "seeking", "company", "oilgas"], "summary": "The number of Oklahoma-based oil and gas producers that have conducted or plan reverse stock splits to keep their shares active on major exchanges climbed to three the final week of March.\nTulsa-based Laredo Petroleum will ask its shareholders on May 14 to modify its registered certificate of incorporation, allowing it to conduct a reverse split that would reduce the number of shares for the company to boost each remaining share’s value.\nIt did not reveal in a filing how many shares it would combine to create a new single share of its stock, which is currently traded on the New York Stock Exchange under the ticker symbol LPI.\nThe company received a notice from the exchange March 27 that its stock is in danger of being delisted from the platform, giving it six months to get its average monthly share value back to at least $1."}, {"url": "https://patch.com/oklahoma/tulsa/calendar/event/20200101/724908/commitment-day-2020-events", "title": "Commitment Day 2020 Events", "authors": ["Added Robert Mcdaniel"], "date": "2019-12-16", "keywords": ["28", "events", "commitment", "2020", "day", "schedule", "life", "dec", "open", "jan", "family"], "summary": "Commitment Events – December 28 – January 5For 2020, Commitment Day is challenging people in a new way – to commit to taking One Positive Action toward a healthier, happier life.\nIn support of this goal, Life Time locations across the country, including Life Time Raleigh & Life Time Cary, will be open to everyone from December 28 through January 5 with a broad array of healthy and motivating events for all levels and abilities.\nAdditional information and registration is available online at www.CommitmentDay.com.\nCommitment Day 2020 Schedule of Events*Saturday, Dec. 28 Family Day – Blizzard Ball, Tween Takeover, Open Family SwimTuesday, Dec. 31 Kid’s New Year’s EveWednesday, Jan. 1 Commitment Day 5K Fun Run/WalkThursday, Jan. 2 Group TrainingSaturday, Jan. 4 Family Workout EventsSunday, Jan. 5 Indoor Triathlon*For full schedule of events, visit CommitmentDay.com."}, {"url": "http://thefranchiseok.com/report-eddie-sutton-will-be-inducted-into-the-2020-naismith-hall-of-fame/", "title": "REPORT: Eddie Sutton will be inducted into the 2020 Naismith Hall of Fame", "authors": ["Madysson Morris", "Graduated Oklahoma State University", "Have Been Covering College Sports", "The Oklahoma City Thunder For Two Years As A Reporter", "A Videographer For The Franchise.", "Staff Writer", "Brayden Conover", "Ryan Chapman", "John E. Hoover"], "date": "2020-04-03", "keywords": ["eddie", "coach", "oklahoma", "report", "naismith", "inducted", "state", "sutton", "2020", "hall", "fame", "university", "ncaa", "basketball"], "summary": "Legendary Oklahoma State coach Eddie Sutton, who served as the Men’s Basketball head coach from 1990-2006, has been informed that he will be part of the 2020 Naismith Hall of Fame class after being named a finalist for the seventh time.\nCongratulations to Coach Sutton and his family.\nI loved watching Eddie Coach!\nEddie Sutton should have been elected to the Basketball Hall of Fame years earlier -deservingly, I would add- when his body and mind were healthier.\nCongratulations, Coach Sutton!"}, {"url": "https://www.kjrh.com/news/local-news/the-upcoming-festival-asian-world-experience-at-ou-tulsa-will-celebrate-the-lunar-new-year", "title": "The upcoming festival Asian World Experience at OU Tulsa will celebrate the Lunar New Year", "authors": [], "date": "2020-01-19", "keywords": ["celebrate", "upcoming", "lunar", "free", "2020", "booth", "experience", "school", "ou", "tulsa", "festival", "world", "asian", "daily"], "summary": "TULSA, Okla. — Tulsa is celebrating the Lunar New Year with a free festival for the whole family to enjoy next weekend.\nThe Asian World Experience (AWE) will provide children activities and live entertainment, including Asian traditional dances, Jiu-Jitsu, Tai Chi, Kung Fu, sword fighting and a tea ceremony.\nThey will offer a booth with origami-making and raise funds for the upcoming Japanese middle school delegation.\nThe festival falls on the first day of the Lunar New Year, January 25, which observes the beginning of the New Year on the Chinese calendar.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://www.kjrh.com/news/local-news/school-closings-for-january-22-2020", "title": "School Closings for January 22, 2020", "authors": [], "date": "2020-01-22", "keywords": ["public", "22", "closed", "tahlequah", "start", "closings", "2020", "school", "schools", "weather", "list", "rain"], "summary": "There are a few school closings today due to freezing rain and slick roads.\nBut click on our school closings list to confirm that your school is closed and see the list below!\nAugustine Christian Academy - will start at 9:30AMBartlesville Public Schools are on Bus Routes Changes.\nhttp://www.bps-ok.org/home/news/snowrouteson1222020?fbclid=IwAR2oq8XnLIyPAQ0iyFGmszXdIKCOr2B5FRPHdbvzGDBwObfduhlJMxe1BmUBarnsdall to start one hour lateBell School - ClosedBowring School - ClosedBriggs Schools ClosedCarl Albert State College - ClosedCave Public Schools - ClosedChecotah Public Schools - ClosedCopan Public Schools - ClosedCoweta Public Schools - ClosedFort Gibson Public Schools - ClosedGore Public Schools - ClosedGrand View Schools - ClosedGreasy Public Schools - ClosedHaskell Schools - ClosedHilldale Public Schools - ClosedHulbert Public School - ClosedICTC Muskogee - ClosedICTC - Tahlequah - Closed**Keota Public School - Closed for two daysLeach Public School - ClosedMarble City Public Schools - ClosedMaryetta School - Adair Co. - ClosedMuskogee Public Schools - ClosedNSU-Tahlequah - ClosedNSU- Muskogee - ClosedNSU - Broken Arrow - OpenOaks-Mission Schools - ClosedOkay Public Schools - ClosedPeavine Public Schools - ClosedPeggs Public Schools - ClosedPocola Elementary School - ClosedPorter School - ClosedRock Mountain Schools - ClosedSequoyah School Tahlequah - ClosedSequoyah Elementary - ClosedStilwell Public Schools - ClosedTahlequah Public Schools - ClosedTenkiller Public Schools - ClosedVian Public Schools - ClosedWagoner Public Schools - ClosedWebbers Falls - ClosedWoodall Public Schools - ClosedZion Public Schools - Closed*****Keota Public School will be closed for two days according to school Facebook page.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://oklahoman.com/article/5652525/oklahoma-business-briefs-for-jan-17-2020", "title": "Oklahoma business briefs for Jan. 17, 2020", "authors": [], "date": "2020-01-17", "keywords": ["associate", "oklahoma", "director", "customers", "continue", "briefs", "2020", "offerings", "business", "named", "17", "jan", "loves", "wharton", "stores"], "summary": "The announcement follows after Love’s in 2019 opened its 500th store and raised a record $3.75 million for Children’s Miracle Network Hospitals.\nLove’s Travel Stops & Country Stores plans to open up to 40 stores and add about 3,000 parking spots and 2,500 jobs in 2020, officials said.\n“We enter 2020 with lots of momentum that we’ll continue through customer-experience enhancements, product offerings and the best value on the road,” Love’s President Shane Wharton said.\n“We’ve listened to our customers to build a business that caters to what customers need beyond fuel, including factoring, maintenance and fresh food options.\nWe’ll continue listening so we can grow that mindset into the future.”Weingart named associate director of ChoiceMattersRebecca Weingart has been named associate director of ChoiceMatters, an Oklahoma City-based nonprofit that offers parents information, resources and support to help them navigate Oklahoma’s pre-K through 12th grade educational offerings."}, {"url": "https://www.kjrh.com/news/local-news/tulsas-fourth-annual-womens-march", "title": "Tulsa's Fourth Annual Women's March", "authors": [], "date": "2020-01-18", "keywords": ["tells", "fourth", "really", "fighting", "downtown", "tulsas", "better", "curtis", "womens", "ignacio", "tulsa", "believes", "annual"], "summary": "TULSA, Okla. — Many marched the streets of Downtown Tulsa, commemorating the fourth annual Women's March.\nThe march was to commemorate the years of people fighting for women's rights, worker rights, and child care to name a few.\nCurtis tells us she's most passionate about learning more about others and their struggles, so she can better understand people everywhere.\nAshley Ignacio tells us she experienced her first women's march today in downtown Tulsa, but expressed concerns for her tribal members.\n\"We fell like the justice system can do better,\" Ignacio said."}, {"url": "https://racingnews.co/2020/01/17/chili-bowl-nationals-results-january-17-2020/", "title": "Chili Bowl Nationals Results: January 17, 2020", "authors": [], "date": "2020-01-17", "keywords": ["windom", "justin", "2020", "thorson", "nationals", "bowl", "chili", "17", "results", "laps", "chris", "stenhouse", "jr"], "summary": "Full results from night five of the 2020 Chili Bowl NationalsTonight, the 2020 Chili Bowl Nationals resumes in Tulsa, Oklahoma.\nView full 2020 Chili Bowl Nationals results below.\n2020 Chili Bowl Nationals: MenuInfo :: Entries | ScheduleResults :: Jan 13 | Jan 14 | Jan 15 | Jan 16 | Jan 17 | Jan 18Chili BowlMain Event – ReportChris Windom and Tucker Klaasmeyer set the front row for the main event.\nChili Bowl Nationals ResultsDirt MidgetJanuary 17, 2020View full Chili Bowl Nationals results from Tulsa, Oklahoma below.\nBill BalogMoreRyan Newman comments after his race weekend in the Gateway Dirt Nationals; Wants to run Chili Bowl Nationals2019 Chili Bowl Nationals Results2018 Chili Bowl Nationals Results2017 Chili Bowl Nationals ResultsChistopher Bell put his 2017 Chili Bowl winner race car in his living roomLinksChili Bowl Nationals"}, {"url": "https://racingnews.co/2020/01/15/chili-bowl-nationals-results-january-14-2020/", "title": "Chili Bowl Nationals Results: January 14, 2020", "authors": [], "date": "2020-01-15", "keywords": ["tyler", "alex", "larson", "2020", "beason", "leads", "nationals", "bowl", "chili", "results", "laps", "kyle", "14"], "summary": "Full results from night two of the 2020 Chili Bowl NationalsTonight, the 2020 Chili Bowl Nationals resumes in Tulsa, Oklahoma.\nView full 2020 Chili Bowl Nationals results below.\nKyle Larson wins night two of the Chili Bowl Nationals!\nChili Bowl Nationals ResultsDirt MidgetJanuary 14, 2020View full Chili Bowl Nationals results from Tulsa, Oklahoma below.\nDamion GardnerMoreRyan Newman comments after his race weekend in the Gateway Dirt Nationals; Wants to run Chili Bowl Nationals2019 Chili Bowl Nationals Results2018 Chili Bowl Nationals Results2017 Chili Bowl Nationals ResultsChistopher Bell put his 2017 Chili Bowl winner race car in his living roomLinksChili Bowl Nationals"}, {"url": "https://www.kjrh.com/news/local-news/osdh-flu-deaths-increase-by-6-making-the-total-20-in-oklahoma", "title": "OSDH: Flu deaths increase by 6, including first child death in Oklahoma", "authors": [], "date": "2020-01-16", "keywords": ["total", "department", "osdh", "oklahoma", "flu", "including", "state", "number", "child", "health", "deaths", "tulsa", "death", "increase", "sept"], "summary": "According to the Oklahoma State Department of Health's weekly flu activity summary, the number of flu deaths have increased by 6, including the state's first child death, making the total 20 in Oklahoma since Sept. 1.\nOSDH is now reporting there have been six new deaths related to the flu, making the total for Oklahoma 20 cumulative deaths.\nOSDH reports the first child has passed in the state in relation to the flu.\nThe Oklahoma State Department of Health, the Tulsa Health Department and the Oklahoma City-County Health Department say this year's flu virus is particularly unusual' and they expect it to be severe.\nThe number of flu deaths in Tulsa County and in Oklahoma is on the rise, officials say."}, {"url": "https://www.kjrh.com/news/local-news/tfd-investigating-west-tulsa-house-fire", "title": "TFD investigating west Tulsa house fire", "authors": [], "date": "2020-01-16", "keywords": ["breaking", "west", "tfd", "uninjuredthere", "say", "weather", "tulsa", "house", "unconscious", "wakes", "man", "daily", "word", "investigating"], "summary": "TULSA — Breaking overnight, a Tulsa man wakes up only to find his garage is on fire.\nFirefighters tell us the man claims he was assaulted and knocked unconscious an hour before they arrived on scene.\nFirefighters were able to to get the fire put out and say the majority of the house was unaffected except for smoke damage.\nFire crews found the man in his backyard but say he appeared to be uninjured.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://sportsnaut.com/2020/01/smackdown-live-preview-tulsa-january-31-2020-the-road-to-wrestlemania-36-begins/", "title": "Smackdown Live preview (Tulsa), January 31, 2020: The road to Wrestlemania 36 begins", "authors": [], "date": "2020-01-28", "keywords": ["live", "wrestlemania", "36", "2020", "smackdown", "soon", "reigns", "tag", "tulsa", "begins", "31", "preview", "wwe", "feud", "road", "royal", "team"], "summary": "While Kane will be a fun opponent for SmackDown’s resident mad man at Super ShowDown, this isn’t the match that we will see at WrestleMania 36.\nThe Undertaker is the best option for Wyatt’s WrestleMania 36 opponent.\nI don’t see any potential storylines for the leader of The Yes Movement headed into WrestleMania 36.\nThe New Day is coming to an end soonAnother floundering division in the WWE is the SmackDown tag team division.\nAbout Face: Nakamura needs to go back to NXT in the Superstar Shakeup after WrestleMania 36."}, {"url": "https://prospect.org/labor/is-tulsa-a-remote-possibility-for-workers/", "title": "Is Tulsa a Remote Possibility for Workers?", "authors": ["Josh Kramer"], "date": "2020-01-09", "keywords": ["program", "american", "kaiser", "city", "place", "possibility", "tulsa", "oil", "workers", "remote", "cities"], "summary": "Tulsa Remote is similar to Vermont’s Remote Worker Grant Program, but provides more resources for participants.\nUnlike Tulsa Remote, Vermont’s pays remote workers $10,000 over the course of two years, not one, and the grant comes in the form of a tax credit, paid by Vermonters.\nTulsa Remote does not ask applicants about their age, sex, race, or political affiliation, says the program’s executive director, Aaron Bolzle.\nTulsa Remote has already succeeded in changing the image of Tulsa in the popular imagination.\nTulsa Remote is the latest chapter in George Kaiser’s multi-decade project to reshape Tulsa into exactly the place he wants it to be."}, {"url": "https://oklahoman.com/article/5649629/what-to-do-in-oklahoma-on-jan.-1-2020-hear-cody-canada-bj-barham-mike-mcclure-kaitlin-butts-and-more-at-the-hangover-ball-at-cains-ballroom-in-tulsa", "title": "What to do in Oklahoma on Jan. 1, 2020: Hear Cody Canada, BJ Barham, Mike McClure, Kaitlin Butts and more at the Hangover Ball at Cain's Ballroom in Tulsa", "authors": [], "date": "2020-01-01", "keywords": ["hangover", "oklahoma", "canada", "cains", "hear", "kaitlin", "mike", "tulsa", "cody", "braun", "mcclure", "jan", "butts"], "summary": "What to do in Oklahoma on Jan. 1, 2020: Hear Cody Canada, BJ Barham, Mike McClure, Kaitlin Butts and more at the Hangover Ball at Cain's Ballroom in TulsaKaitlin Butts performs during the 2017 Oklahoma Creativity Ambassadors Gala at the National Cowboy & Western Heritage Museum in Oklahoma City, Monday, April 3, 2017.\n[Nate Billings/ The Oklahoman Archives]Happy New Year!\nToday's featured event:TULSA - Spend the first day of 2020 listening to red dirt and Texas country stars Cody Canada, BJ Barham, Mike McClure, Kaitlin Butts, Wade Bowen, Jamie Lin Wilson, Micky Braun, Gary Braun, William Clark Green and Adam Hood play the annual Hangover Ball at Tulsa's historic Cain's Ballroom, 423 N Main.\nThe show starts at 7:30 tonight.\nDoors open at 6:30 p.m.For more information, go to www.cainsballroom.com."}, {"url": "https://www.kjrh.com/news/local-news/osdh-flu-deaths-increase-by-1-making-the-total-21-in-oklahoma", "title": "OSDH: Flu deaths increase by 1, making the total 21 in Oklahoma", "authors": [], "date": "2020-01-23", "keywords": ["total", "department", "osdh", "oklahoma", "making", "flu", "state", "21", "number", "health", "deaths", "tulsa", "increase", "reported", "sept"], "summary": "According to the Oklahoma State Department of Health's weekly flu activity summary, the number of flu deaths have increased by 1, making the total 21 in Oklahoma since Sept. 1.\nOSDH report shows the number of new and previously reported hospitalizations with testing between Sept. 1, 2019 - Jan. 11, 2020 are 876.\nOSDH is now reporting there is one new death related to the flu, making the total for Oklahoma 21 cumulative deaths.\nThe Oklahoma State Department of Health, the Tulsa Health Department and the Oklahoma City-County Health Department say this year's flu virus is particularly unusual and they expect it to be severe.\nThe number of flu deaths in Tulsa County and in Oklahoma is on the rise, officials say."}, {"url": "https://patch.com/oklahoma/tulsa/tulsa-city-hall-facilities-trash-schedule-holidays", "title": "Tulsa City Hall, Facilities, Trash Schedule For The Holidays", "authors": [], "date": "2019-12-20", "keywords": ["closed", "customers", "trash", "2020", "hall", "schedule", "city", "25", "dec", "facilities", "tulsa", "24", "holidays", "open", "jan", "collected"], "summary": "From City of Tulsa:City Hall and other City facilities will be closed Tuesday, Dec. 24, and Wednesday, Dec. 25, for the Christmas holiday, and Wednesday, Jan. 1, 2020, for the New Year's holiday.\nTrash and recycling service will not operate on Dec. 25 – Christmas Day or Jan. 1, 2020 – New Year's Day.\nTrash will be collected as usual on Tuesday, Dec. 24, and Tuesday, Dec. 31.\nMohawk Park and Page Belcher golf courses will be open Dec. 24 and Dec. 31, but closed Dec. 25 and Jan. 1.\nTulsa Transit will provide Saturday level bus service on Dec. 24, and regular bus service on Dec. 31."}, {"url": "https://www.kjrh.com/news/local-news/osdh-flu-deaths-increase-by-1-making-the-new-total-23-in-oklahoma", "title": "OSDH: Flu deaths increase by 1, making the new total 23 in Oklahoma", "authors": [], "date": "2020-02-06", "keywords": ["total", "department", "osdh", "oklahoma", "making", "flu", "state", "number", "health", "deaths", "23", "tulsa", "increase", "reported", "sept"], "summary": "According to the Oklahoma State Department of Health's weekly flu activity summary, the number of flu deaths have increased by 1, making the total 23 in Oklahoma since Sept. 1.\nOSDH report shows the number of new and previously reported hospitalizations with testing between Sept. 1, 2019 - Jan. 25, 2020 are 1225.\nOSDH is now reporting there has been one death related to the flu between Jan. 26 and Feb. 1, making the total for Oklahoma 23 cumulative deaths.\nThe Oklahoma State Department of Health, the Tulsa Health Department and the Oklahoma City-County Health Department say this year's flu virus is particularly unusual' and they expect it to be severe.\nThe number of flu deaths in Tulsa County and in Oklahoma is on the rise, officials say."}, {"url": "https://www.globenewswire.com/news-release/2020/04/14/2015466/0/en/GREYSTONE-LOGISTICS-INC-REPORTS-RESULTS-OF-OPERATIONS-FOR-THE-QUARTER-AND-NINE-MONTHS-ENDED-FEBRUARY-29-2020.html", "title": "GREYSTONE LOGISTICS, INC. REPORTS RESULTS OF OPERATIONS FOR THE QUARTER AND NINE MONTHS ENDED FEBRUARY 29, 2020", "authors": ["Greystone Logistics Inc."], "date": "2020-04-14", "keywords": ["ended", "months", "2020", "operations", "ebitda", "statements", "greystone", "logistics", "sales", "reports", "results", "compared", "period", "income", "29", "quarter"], "summary": "Greystone’s net income was $1,964,942 and $231,430 for the quarters ended February 29, 2020 and February 28, 2019, respectively.\nNet income was $3,056,926 for the nine months ended February 29, 2020 compared to $1,293,283 in the same period last year.\nSales for the nine months ended February 29, 2020 were $57,906,777 compared to $50,163,707 for the prior period for an increase of $7,743,070, or 15%.\nGreystone’s sales to major customers in the nine months ended February 29, 2020 were 87% of sales compared to 85% in the same period last year.\nThe Company had financing lease and bank debt principal reduction for the nine-month period ended February 29, 2020, of $4,038,357."}, {"url": "https://oklahoman.com/article/5659144/coronavirus-in-oklahoma-justin-bieber-postpones-2020-changes-tour-including-tulsa-date", "title": "Coronavirus in Oklahoma: Justin Bieber postpones 2020 'Changes Tour,' including Tulsa date", "authors": [], "date": "2020-04-01", "keywords": ["oklahoma", "including", "justin", "tour", "2020", "changes", "coronavirus", "date", "tulsa", "bieber", "superstar", "statement", "stop", "scheduled", "postpones"], "summary": "Justin Bieber [Photo provided]In the midst of the coronavirus pandemic, pop star Justin Bieber postponed Wednesday his 2020 \"Changes Tour,\" according to Billboard.\nAs previously reported, the Grammy Award-winning global superstar was to play a Tulsa stop July 8 at the BOK Center, 200 S Denver.\nThe tour, promoted by AEG Presents, was scheduled to kick off in Seattle at the CenturyLink Field on May 14.\n\"In light of the current public health crisis, and with the deepest concern for all those being affected, Justin Bieber will be postponing all currently scheduled 2020 dates for The Changes Tour,\" reads an official statement."}, {"url": "https://www.kjrh.com/news/local-news/coronavirus-in-okalhoma-march-6-march-15", "title": "Coronavirus in Oklahoma: March 6 - March 15", "authors": [], "date": "2020-03-23", "keywords": ["officials", "oklahoma", "state", "12", "coronavirus", "health", "say", "tulsa", "covid19", "announced", "15"], "summary": "Stitt and health and state officials announced that Oklahoma has three confirmed cases of coronavirus (COVID-19).\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol.\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol.\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol.\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol."}, {"url": "https://theblackwallsttimes.com/2020/04/06/50-plus-okla-artist-collaborate-on-fire-in-little-africa-to-commemorate-the-1921-tulsa-race-massacre/", "title": "50 plus Okla. artist collaborate on ‘Fire in Little Africa’ to commemorate the 1921 Tulsa Race Massacre", "authors": ["The Black Wall St Times"], "date": "2020-04-06", "keywords": ["little", "hiphop", "oklahoma", "race", "massacre", "okla", "artist", "center", "project", "collaborate", "woody", "tulsa", "artists", "plus", "centennial", "commemorate", "africa", "johnson"], "summary": "View” Johnson, Ph.D., manager of education and diversity outreach for the American Song Archives, which encompasses the Woody Guthrie Center and Bob Dylan Center.\nMore than 50 of the top hip-hop artists from Tulsa, Oklahoma City and Lawton were invited to participate in the creative process.\nThe podcast features hosts Ali Shaw and Doc Free in conversation with Tulsa artists, community leaders and national cultural voices about hip-hop, art and culture.\nAbout The Tulsa Race Massacre Centennial CommissionThe 1921 Tulsa Race Massacre Centennial Commission (“Commission”), an Oklahoma State Commission, formed in 2015 by State Senator Kevin Matthews, seeks to educate all United States citizens about Tulsa’s Historic Greenwood District, the storied “Black Wall Street,” including the massacre and its impact on Oklahoma and the nation.\nJohnson came into this role with the idea of bringing the Oklahoma hip-hop community together in the spirit of Black Wall Street to commemorate the centennial of the 1921 Massacre."}, {"url": "https://www.cnbc.com/2020/03/28/the-us-economy-has-come-to-a-standstill-satellite-imagery-shows.html", "title": "The US economy has come to a standstill, satellite imagery shows", "authors": ["Michael Sheetz"], "date": "2020-03-28", "keywords": ["shows", "cases", "hit", "sources", "imagery", "satellite", "week", "business", "come", "coronavirus", "economy", "standstill", "official", "data", "states"], "summary": "The coronavirus crisis is bringing the United States economy to a screeching halt, with every sector feeling the effects of most of the country's workforce staying home.\nThe U.S. now has more coronavirus cases than any other nation in the world, as Johns Hopkins University data shows 104,837 cases in the States.\nThis week markets did get one hint at what's to come from official data.\nThe U.S. Labor Department on Thursday reported that a staggering 3.28 million Americans filed unemployment claims in the previous week.\nThe drop in U.S. consumer and business activity is apparent in satellite imagery collected by companies like Maxar Technologies, Planet Labs, ICEYE and Orbital Insight."}, {"url": "https://theblackwallsttimes.com/2020/02/14/focus-black-oklahoma-launch-set-for-february-19/", "title": "Focus: Black Oklahoma launch set for February 19 – The Black Wall Street Times", "authors": ["The Black Wall St Times"], "date": "2020-02-14", "keywords": ["public", "oklahoma", "times", "street", "radio", "fellowship", "wall", "tricity", "artist", "collective", "launch", "set", "19", "tulsa", "focus", "black"], "summary": "Published 02/14/2020 | Reading Time 1 min 8 secTULSA, Okla. — Tri-City Collective, Public Radio Tulsa and Tulsa Artist Fellowship will hold a press conference to announce the launch date for Focus: Black Oklahoma, on Wednesday, February 19, 2020, at 10 a.m. in the Tulsa Artist Fellowship –Archer Studios lobby, located at 109 North M.L.K.\nJr Blvd East, Tulsa, OK 74103.\nFocus: Black Oklahoma is a one-hour news and public affairs program on various topics relevant to Oklahomans across the Black diaspora that will air on Public Radio Tulsa monthly beginning in February 2020.\nFocus: Black Oklahoma features a spotlight interview supported by taped stories on current topics and events affecting Black Oklahomans, including news, politics, current affairs, education, family, health, relationships, law, finances, business, arts and culture, spirituality, technology, sports and more.\nThe executive producers of Focus: Black Oklahoma are Quraysh Ali Lansana, Tulsa Artist Fellow/ Tri-City Collective and Scott Gregory, Public Radio Tulsa."}, {"url": "https://townline.org/obituaries-for-thursday-march-19-2020/", "title": "OBITUARIES for Thursday, March 19, 2020", "authors": ["Website Editor"], "date": "2020-03-18", "keywords": ["family", "passed", "son", "2020", "husband", "wife", "school", "loved", "19", "obituaries", "maine", "waterville"], "summary": "SHARON E. DuBOISSIDNEY – Sharon E. DuBois, 80, passed away Tuesday, March 3, 2020, at her home, in Sidney.\nJAMES M. SHEAVASSALBORO – James “Jim” Maynard Shea, 76, passed on Saturday, February 15, 2020, in Zephyrhills, Florida.\nKATHLEEN M. KEEFERSOUTH CHINA – Kathleen M. Keefer, 57, of South China, passed away unexpectedly on Monday, March 2, 2020, at home.\nPATRICIA A. NASIEWINDSOR – Patricia Ann Nasie, 81, passed away at her home on Monday, March 2, 2020, following a brief illness.\nFamily and Friends may visit from 10 – 11 a.m., on March 20, 2020, at Gallant Funeral Home 10 Elm St., Waterville."}, {"url": "https://www.kjrh.com/news/local-news/weather-blog-winter-weather-expected-in-green-country", "title": "Weather Blog: Winter Weather Moving Through Green Country", "authors": [], "date": "2020-02-04", "keywords": ["green", "clintboonekjrh", "clint", "amupdate", "moving", "country", "boone", "242020", "tues", "blog", "winter", "weather", "2020update", "252020"], "summary": "With the winter weather on Wednesday, we have put together some helpful information.\npic.twitter.com/3AN0mEsuk1 — Clint Boone (@clintboonekjrh) February 5, 2020UPDATE WED. 2/5/2020 @ 9 A.M.UPDATE WED. 2/5/2020 @ 8:45 A.M.\npic.twitter.com/PABHTT6LS4 — Clint Boone (@clintboonekjrh) February 5, 2020UPDATE WED. 2/5/2020 @ 7:00 A.M.UPDATE WEDNESDAY 2/5/2020 @ 6:45 A.M.UPDATE WEDNESDAY 2/5/2020 @ 5:50 A.M.Light snow in Cleveland.\n@kjrh2hd pic.twitter.com/P3z08aT2BU — Clint Boone (@clintboonekjrh) February 4, 2020UPDATE TUES. 2/4/2020 @ 12:02 P.M.Coats this afternoon with patchy drizzle and temps in the 30s.\nHOUR BY HOUR TIMELINEFor an hour by hour timeline of the winter weather that's expected to move through Green Country, click here."}, {"url": "https://theblackwallsttimes.com/2020/02/20/friendship-church-presents-its-inaugural-buy-black-expo-on-feb-23/", "title": "Friendship Church presents its inaugural Buy Black Expo on Feb. 23 – The Black Wall Street Times", "authors": ["The Black Wall St Times"], "date": "2020-02-20", "keywords": ["inaugural", "friendship", "community", "times", "street", "feb", "wall", "expo", "church", "products", "event", "entrepreneurs", "presents", "tulsa", "blackowned", "black"], "summary": "Published 02/20/20 | Reading Time 1 min 15 secsTULSA, Okla. — Friendship Church will present its inaugural Buy Black Expo on Sunday, February 23, 2020, from 12 pm to 3 pm at 1709 N Madison Ave Tulsa, Oklahoma 74106.\nAs the community closes out Black History Month, the event seeks to highlight over 30 local black entrepreneurs who are members of their church and community.\nFriendship Church will give these entrepreneurs an opportunity to sell their products and services to the community.\nPastor Jamaal Dyer of Friendship Church said, “I think it’s a really good idea for the church to incorporate this.\nThe Buy Black expo attempts to continue the legacy of Black Wall Street by patronizing Black-owned businesses by circulating dollars within Tulsa’s Black community."}, {"url": "https://theblackwallsttimes.com/2019/12/11/focus-black-oklahoma-set-to-launch-in-feb-2020-on-kwgs-89-5-fm/", "title": "‘Focus: Black Oklahoma’ set to launch in Feb. 2020 on KWGS 89.5 FM", "authors": ["The Black Wall St Times"], "date": "2019-12-11", "keywords": ["public", "oklahoma", "feb", "radio", "fm", "2020", "tricity", "collective", "launch", "set", "tulsa", "focus", "klar", "black", "895", "kwgs", "program"], "summary": "Tri-City Collective, Public Radio Tulsa, Tulsa Artist Fellowship and Tulsa Community Foundation launch event for ‘Focus: Black Oklahoma’ at the Tulsa Press Club in downtown Tulsa, Oklahoma on Tuesday, December 10, 2019.\nFocus: Black Oklahoma is an hour-long news and public affairs program, covering numerous topics relevant to Black Oklahomans.\nHe then added, “Also, the number of folks present [at the launch event] who work at Tulsa Public Schools (TPS) — or closely with — was really good to see.\nThe new radio program will broadcast on Tulsa’s KWGS 89.5 FM monthly from the Public Radio Tulsa studios on the University of Tulsa campus starting in February 2020.\nDonationsThe Tri-City Collective Fund is a component fund of the Tulsa Community Foundation."}, {"url": "https://www.kjrh.com/news/local-news/osdh-flu-deaths-increase-by-3-making-the-new-total-30-in-oklahoma", "title": "OSDH: Flu deaths increase by 3, making the new total 30 in Oklahoma", "authors": [], "date": "2020-02-13", "keywords": ["total", "department", "osdh", "oklahoma", "making", "flu", "feb", "state", "number", "health", "30", "deaths", "tulsa", "increase"], "summary": "According to the Oklahoma State Department of Health's weekly flu activity summary, the number of flu deaths have increased by 3, making the total 30 in Oklahoma since Sept. 1.\nOSDH is now reporting there have been three deaths related to the flu between Feb. 2 and Feb. 8, making the total for Oklahoma 30 cumulative deaths.\nOne of the three deaths is the first in the age group of 5-17 years old, according to OSDH.\nThe Oklahoma State Department of Health, the Tulsa Health Department and the Oklahoma City-County Health Department say this year's flu virus is particularly unusual' and they expect it to be severe.\nThe number of flu deaths in Tulsa County and in Oklahoma is on the rise, officials say."}, {"url": "https://kfor.com/news/february-20th-2020-okc-almanac/", "title": "February 20th, 2020 OKC Almanac", "authors": ["Peyton Yager", "Austin Breasette", "Cnn Wire"], "date": "2020-02-20", "keywords": ["western", "oklahoma", "okc", "totals", "2020", "city", "almanac", "inches", "winter", "tulsa", "20th", "woodward", "storm"], "summary": "February 20th marks the anniversary of the beginning of one of the most significant winter storms in Oklahoma history.\nThe blizzard of 1971 began on the evening of February 20th, over northwest Oklahoma, and would go on to produce a state-record storm total snowfall of 36 inches in Buffalo.\nOther storm totals for this extraordinary event, which left drifts up to 20 feet high, include 25 inches at Gage, 18 inches in Enid, 17 inches in Woodward, and 10 inches in Ponca City.\nThe rest of Oklahoma faired much better, with only 4.9 inches in Oklahoma City, 2.7 inches in Tulsa, and 1 inch in McAlester.\nBoise City picked up only a little over 3 inches, and Kenton only 2 inches."}, {"url": "https://www.kjrh.com/traffic/winter-weather-highway-conditions-feb-6th-2020", "title": "WINTER WEATHER: Highway Conditions Feb 6th 2020", "authors": [], "date": "2020-02-06", "keywords": ["highway", "feb", "oklahoma", "treat", "6th", "2020", "conditions", "slow", "slick", "weather", "winter", "ice", "daily", "crews"], "summary": "WINTER WEATHER: Highway Conditions 2-6-2020 as of 5 a.m.Due to the freezing temperatures in central and eastern Oklahoma, the Oklahoma Department of Transportation crews are reporting black ice conditions across the state this morning.\nCrews continue to treat highways and interstates with salt and sand.\nIn the Oklahoma City and Tulsa metros, crews continue to treat isolated slick spots as many developed overnight.\nFor an interactive look at current highway conditions, including views from snow plow cameras, visit www.okroads.org [lnks.gd].\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://oklahoman.com/article/5648921/pitbull-to-play-oklahoma-show-in-2020", "title": "Pitbull to play Oklahoma show in 2020", "authors": [], "date": "2019-12-03", "keywords": ["box", "available", "oklahoma", "hit", "pitbull", "2020", "business", "singles", "tickets", "television", "titled", "office", "play"], "summary": "Tickets will not be available for purchase at BOK Center Box Office on the first day of ticket sales.\nRemaining available tickets will be available for purchase at BOK Center Box Office on the next business day that the box office is open, according to a news release.\nPitbull’s album \"Global Warming: Meltdown\" features the massive hit singles “Feel This Moment” with Christina Aguilera, “Don’t Stop The Party,” “Back In Time” from the action-comedy \"Men in Black 3,\" along with his second No.\nHe is also a burgeoning business entrepreneur with his own line of premium vodkas (Voli), a partnership with Sheets, the dissolvable energy strip, as well as premier fragrances for men and women titled Pitbull.\nPitbull extends his musical legacy in 2019 with a Latin opus titled \"Libertad 548.\""}, {"url": "https://patch.com/oklahoma/tulsa/calendar/event/20200222/743858/5th-annual-tulsa-mardi-gras-masquerade", "title": "5th Annual Tulsa Mardi Gras Masquerade", "authors": ["Added Robert Mcdaniel"], "date": "2020-01-14", "keywords": ["5th", "proper", "immersive", "goal", "event", "masquerade", "wild", "tulsa", "mardi", "okeq", "gras", "annual"], "summary": "Isn't time Tulsa had a proper Mardi Gras celebration?\nOklahomans for Equality, LockHeart Productions, and the Blue Dome District are hosting the 5th annual Tulsa Mardi Gras Masquerade on Saturday Feb 22nd at 7:00pm.\nEnjoy a traditional Mardi Gras immersive environment with live Cajun and music atEnso Bar, or get a little crazy and go to a Mardi Gras gone wild celebration in The Unicorn Club.\nWhen you step through our doors you are walking into a proper Mardi Gras celebration.\nOur long-term goal is to build Mardi Gras up to a level of notoriety that rivals other downtown holidays and festivals in downtown Tulsa."}, {"url": "https://oklahoman.com/article/5654891/def-leppard-to-bring-2020-tour-with-zz-top-to-oklahoma", "title": "Def Leppard to bring 2020 tour with ZZ Top to Oklahoma", "authors": [], "date": "2020-02-13", "keywords": ["arena", "little", "oklahoma", "def", "rock", "music", "tour", "bring", "2020", "center", "zz", "presale", "leppard", "albums", "band"], "summary": "As they did with the original release of their records, Def Leppard dominated the worldwide charts again.\n5 in the U.K. Def Leppard had the No.\n“We’re excited about hitting the road with Def Leppard this fall; we’ve been fans of theirs since forever,” says Gibbons in a statement.\n1 on Billboard’s Top Rock Albums and Top Independent Albums charts.\nNow celebrating its 50th anniversary, ZZ Top has maintained the most consistently stable lineup in the history of rock music: Billy Gibbons (guitar), Dusty Hill (bass) and Frank Beard (drums)."}, {"url": "https://www.kjrh.com/news/local-news/osdh-flu-deaths-increase-by-2-making-the-new-total-45-in-oklahoma", "title": "OSDH: Flu deaths increase by 2, making the new total 45 in Oklahoma", "authors": [], "date": "2020-02-27", "keywords": ["total", "department", "osdh", "oklahoma", "making", "flu", "45", "feb", "state", "number", "health", "deaths", "tulsa", "increase"], "summary": "According to the Oklahoma State Department of Health's weekly flu activity summary, the number of flu deaths have increased by 2, making the total 45 in Oklahoma since Sept. 1.\nOSDH is now reporting deaths related to the flu have increased by 2 between Feb. 16 and Feb. 22, making the total for Oklahoma 45 cumulative deaths.\nTen of the total flu deaths are out of Tulsa County.\nThe Oklahoma State Department of Health, the Tulsa Health Department and the Oklahoma City-County Health Department say this year's flu virus is particularly unusual and they expect it to be severe.\nThe number of flu deaths in Tulsa County and in Oklahoma is on the rise, officials say."}, {"url": "https://fox8.com/news/baby-born-on-2-20-2020-at-2020-its-pretty-cool/", "title": "Baby born on 2/20/2020 at 20:20: ‘It’s pretty cool’", "authors": ["Kara Sutyak", "Nexstar Media Wire"], "date": "2020-02-24", "keywords": ["birth", "wjw", "pretty", "2020", "jamie", "center", "2202020", "baby", "think", "cool", "born", "hillcrest", "centercourtesy", "wilson", "medical"], "summary": "Please enable Javascript to watch this videoTULSA, Okla. (WJW) -- A sweet bundle of joy has an unforgettable birthday.\nHillcrest Medical Center in Tulsa, Oklahoma, says Peyton Elizabeth Logan was born 2/20/2020.\nAnd, if that isn't cool enough the newborn's birth time was 20:20 military time!\nWhen asked about the unique birth date, Jamie told the hospital, “We think it’s pretty cool.\nWe’re super excited!”Courtesy: Hillcrest Medical CenterCourtesy: Hillcrest Medical CenterCourtesy: Hillcrest Medical Center"}, {"url": "https://oklahoman.com/article/5640681/brantley-gilbert-bringing-2020-firet-up-tour-to-oklahoma", "title": "Brantley Gilbert bringing 2020 'Fire’t Up Tour' to Oklahoma", "authors": [], "date": "2019-09-07", "keywords": ["tyler", "rice", "available", "oklahoma", "tour", "2020", "country", "centerfri", "ford", "tickets", "hits", "bringing", "office", "gilbert", "firet", "brantley", "centersat"], "summary": "Tickets go on sale at 10 a.m. next Friday and will be available online at www.bokcenter.com.\nTickets will not be available for purchase at BOK Center Box Office on the first day of ticket sales.\nRemaining available tickets will be available for purchase at BOK Center Box Office on the next business day that the box office is open, according to a news release.\nShortly after the album’s October release, Gilbert will set sail for his Second Annual Kick It in the Ship cruise.\nThe Ford CenterFri 2/21/2020 North Little Rock, Ark."}, {"url": "https://www.nytimes.com/2020/02/05/us/tulsa-race-massacre-mass-grave.html", "title": "Nearly 100 Years After Tulsa Massacre, City Plans to Search Cemetery for Victims", "authors": ["Mihir Zaveri"], "date": "2020-02-05", "keywords": ["cemetery", "step", "massacre", "white", "city", "obtain", "remains", "plans", "tulsa", "victims", "search", "possible", "100", "plan", "rarely", "nearly"], "summary": "Archaeologists plan to excavate part of a cemetery in Tulsa, Okla., to see if it holds the remains of black residents slaughtered by white mobs during a massacre in 1921.\nThe archaeologists plan to dig up a small section of the Oaklawn Cemetery, east of downtown, where they found evidence last year of a possible mass grave site.\nAnd do they seem to be consistent with race massacre victims?’” Dr. Kary Stackelbeck, the state archaeologist of Oklahoma, said at the meeting.\nPrevious investigations have identified possible locations for the mass graves and compiled historical evidence of the massacre, which for decades was rarely mentioned in textbooks or publicly acknowledged by white city officials.\nThe excavation, which is slated for April, raises the tantalizing possibility that, after nearly a century of shame and inattention, the bodies of at least some of the victims could finally be found."}, {"url": "https://oklahoman.com/article/5642149/grace-potter-to-play-okc-and-tulsa-dates-on-2020-tour", "title": "Grace Potter to play OKC and Tulsa dates on 2020 tour", "authors": [], "date": "2019-09-24", "keywords": ["feb", "okc", "tour", "2020", "tickets", "stop", "potter", "major", "grace", "tulsa", "information", "dates", "play"], "summary": "Grace Potter to play OKC and Tulsa dates on 2020 tour shares emailGrace Potter [Photo by Pamela Neal] Grace Potter has announced a major 2020 North American headlining tour in support of her forthcoming album \"Daylight,\" due out Oct. 25 via Fantasy Records.\nThe tour kicks off Jan. 8 in Charleston, South Carolina and will hit theaters in major cities nationwide.\nThe tour will include a Tulsa stop Feb. 12 at historic Cain's Ballroom, 423 N Main.\nFor Tulsa tickets and information, go to www.cainsballroom.com.\nThe trek also will make an Oklahoma City stop Feb. 13 The Jones Assembly, 901 W Sheridan Ave. For OKC tickets and info, go to www.thejonesassembly.com."}, {"url": "https://www.kjrh.com/news/local-news/firefighters-investigating-house-fire-in-midtown-tulsa", "title": "Firefighters Investigating House Fire In Midtown Tulsa", "authors": [], "date": "2020-02-10", "keywords": ["scene", "officials", "treated", "midtown", "investigating", "twitterlike", "touch", "dog", "weather", "tulsa", "house", "survivedthe", "daily", "firefighters"], "summary": "TULSA, Okla. — Firefighters are investigating a house fire in midtown Tulsa, according to the Tulsa Fire Department.\nCrews responded to the scene near South Sheridan Road and East 8th Street.\nFive people were home at the time of the fire, but no one was harmed, officials said.\nThey also say one dog had smoke inhalation, but was treated with oxygen at the scene and is expected to be fine.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://www.kjrh.com/news/local-news/coronavirus-in-oklahoma-march-16-march-23", "title": "Coronavirus in Oklahoma: March 16 - March 23", "authors": [], "date": "2020-03-28", "keywords": ["officials", "department", "oklahoma", "16", "state", "coronavirus", "health", "say", "23", "tulsa", "covid19", "announced"], "summary": "The U.S. Department of Education approved waivers to suspend assessments and Oklahoma School Report Cards for the 2019-20 school year, according to the Oklahoma State Department of Education.\nThe Oklahoma State Department of Health announced that they have entered into a \"new public-private partnership with Diagnostic Labs of Oklahoma\" to help increase the state's capacity for getting results for coronavirus (COVID-19) tests.\nAccording to the Oklahoma State Department of Health's website, there are currently 44 people who have tested positive for coronavirus in Oklahoma.\nAccording to the Oklahoma State Department of Health's website, the first child has tested positive for coronavirus in Oklahoma.\nMarch 16, 202011:01 a.m.March 16, 2020The Oklahoma Department of Emergency Management’s online form for businesses suffering losses due to the effects of COVID-19 is now active at damage.ok.gov [damage.ok.gov]."}, {"url": "https://www.kjrh.com/news/local-news/coronavirus-in-okalhoma-march-6-march-15", "title": "Coronavirus in Oklahoma: March 6 - March 15", "authors": [], "date": "2020-03-23", "keywords": ["officials", "oklahoma", "state", "12", "coronavirus", "health", "say", "tulsa", "covid19", "announced", "15"], "summary": "Stitt and health and state officials announced that Oklahoma has three confirmed cases of coronavirus (COVID-19).\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol.\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol.\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol.\nGovernor Kevin Stitt, Commissioner of Health Gary Cox and Oklahoma state officials will be providing an update on coronavirus (COVID-19) today at 1 p.m. Officials say the press conference will take place in Oklahoma City at the Oklahoma State Capitol."}, {"url": "https://www.kjrh.com/news/local-news/coronavirus-closings-in-oklahoma-march-12-march-17", "title": "Coronavirus Closings in Oklahoma: March 12 - March 17", "authors": [], "date": "2020-03-23", "keywords": ["public", "oklahoma", "16", "12", "events", "closings", "2020", "center", "city", "coronavirus", "health", "17", "tulsa", "covid19"], "summary": "March 17, 20204:02 p.m.Oklahoma Caring Vans Cancels Upcoming ClinicsIn light of Oklahoma’s state of emergency, the Oklahoma Caring Van program is canceling upcoming clinics in the Oklahoma City and Tulsa metro, through Friday, March 27.\nSee all meetings, details and cancellations at Stillwater.org/agenda.Cancelled City events between now and April 5:This is not a complete list.\nFor Tulsa Public Schools employees:By Friday, March 20, employees will receive any necessary updates about their schedules through Friday, April 3.\nThe Oklahoma Aquarium Closes Until Further NoticeThe Oklahoma Aquarium is closed to the public effective March 16, 2020, as a precautionary measure for our guests and staff.\nMarch 12, 20206:09 p.m.Muskogee Public Schools Closed FridayMuskogee Public Schools closed Friday, March, 13, 2020 due to Coronavirus (COVID-19)March 12, 20205:55 p.m."}, {"url": "https://oklahoman.com/article/5658336/okc-civic-life-for-monday-march-23-2020", "title": "OKC Civic Life for Monday, March 23, 2020", "authors": [], "date": "2020-03-23", "keywords": ["department", "n95", "okc", "used", "2020", "life", "walker", "weekend", "masks", "yearfacts", "23", "working", "civic", "medical", "firefighters"], "summary": "Emergency Management was working \"diligently\" on the fire department's behalf to secure more masks — but the department was preparing in case it runs short.\n\"We are developing protocols to safely reuse N95 masks if needed,\" Walker said.\n\"What we are lacking are surgical masks that can be used for symptomatic patients.\nOf note: The Fire Department is the front-line responder to medical emergencies.\nFirefighters are expected to answer 60,000 medical calls this year."}, {"url": "https://www.kjrh.com/news/local-news/coronavirus-in-oklahoma-march-24-march-30", "title": "Coronavirus in Oklahoma: March 24 - March 30", "authors": [], "date": "2020-04-06", "keywords": ["officials", "oklahoma", "state", "coronavirus", "30", "health", "say", "tulsa", "24", "covid19", "park", "announced"], "summary": "Officials say signs and barriers will be placed around structures at Haikey Creek Park, LaFortune Park, Chandler Park, O’Brien Park, Triangle Park, and Mack Taylor Park.\nOfficials say signs and barriers will be placed around structures at Haikey Creek Park, LaFortune Park, Chandler Park, O’Brien Park, Triangle Park, and Mack Taylor Park.\nOklahoma State Rep. Jason Lowe has tested positive for coronavirus (COVID-19) earlier this week, according to a press release.\nThe Oklahoma State Department of Health announced the third coronavirus death in the state today.\nThe Oklahoma State Department of Health announced the third coronavirus death in the state today."}, {"url": "https://www.grandlakenews.com/news/20200326/oklahoma-covid-19-update-3262020", "title": "Oklahoma COVID-19 Update: 3/26/2020", "authors": ["Chloe Goff", "Cgoff Grovesun.Com"], "date": "2020-03-26", "keywords": ["update", "oklahoma", "state", "zoneso", "counties", "male", "female", "3262020", "county", "confirmed", "covid19", "cases"], "summary": "OKLAHOMA CITY - According to the Oklahoma State Department of Health has released the latest numbers for the Coronavirus (COVID-19) within the state.\nThese are the number of confirmed cases from COVID-19 test kits.\nPawnee County - male in his 50s.\nCleveland County - female in her 60s, female in her 90s, male in his 60s.\nOklahoma County, male in his 50s, male in his 70s."}, {"url": "https://www.grandlakenews.com/news/20200330/oklahoma-covid-19-update-3302020", "title": "Oklahoma COVID-19 Update: 3/30/2020", "authors": ["Chloe Goff", "Cgoff Grovesun.Com"], "date": "2020-03-30", "keywords": ["update", "oklahoma", "group", "counties", "male", "female", "age", "65", "county", "5064", "covid19", "3302020", "cases"], "summary": "OKLAHOMA CITY - According to the Oklahoma State Department of Health has released the latest numbers for the Coronavirus (COVID-19) within the state.\nDeaths:Tulsa County - a male in the 50-64 age group, a female in the 65+ age group, a male in the 65+ age group.\nCleveland County - a male in the 50-64 age group, three females in the 65+ age group, two males in the 65+ age group.\nOklahoma County - two males in the 50-64 age group, a female in the 65+ age group, a male in the 65+ age group.\n◦ People age 65 or older or those with a compromised immune system must shelter at home."}, {"url": "https://www.grandlakenews.com/news/20200321/oklahoma-covid-19-update-3212020", "title": "Oklahoma COVID-19 Update: 3/21/2020", "authors": ["Chloe Goff", "Cgoff Grovesun.Com"], "date": "2020-03-21", "keywords": ["update", "oklahoma", "state", "zoneso", "counties", "county", "confirmed", "washington", "3212020", "covid19", "tests", "cases"], "summary": "OKLAHOMA CITY - According to the Oklahoma State Department of Health has released the latest numbers for the Coronavirus (COVID-19) within the state.\nThese are the number of confirmed cases from COVID-19 test kits.\nAs of Saturday, March 21, the state has 53 confirmed cases in 14 counties.\nOklahoma County leads with 20 cases, while Cleveland County has 12, Tulsa County has five cases, Kay County has three cases, Canadian, Garvin and Pawnee Counties have two cases each, Custer, Grady, Jackson, Logan, McClain, Payne and Washington Counties each have one case.\nSo far the state has had 560 negative tests, 144 tests are still pending, there have been ten hospitalizations and only one death."}, {"url": "https://www.kjrh.com/news/local-news/tulsa-church-mourns-first-coronavirus-related-death", "title": "Tulsa Church Mourns First Coronavirus-Related Death", "authors": [], "date": "2020-03-19", "keywords": ["pastor", "passed", "martin", "mourns", "church", "coronavirusrelated", "sodexo", "health", "drys", "tulsa", "death", "oru", "dry", "family"], "summary": "TULSA, Okla. — The first person to die from coronavirus in Oklahoma passed away in Tulsa on Wednesday night.\nTulsa Health officials confirm this was the city's first community spread case.\nThe church had already been live streaming services, but as a precaution the church and Dry's family are all in quarantine, Pastor Martin says.\nTulsa Health officials said Dry was confirmed with coronavirus just one day before he passed.\nHe didn't even go into ER until Sunday because he was having trouble breathing,\" Pastor Martin said."}, {"url": "https://theblackwallsttimes.com/2020/03/18/covid-19-in-oklahoma-jails-and-prisons/", "title": "COVID-19 in Oklahoma Jails and Prisons", "authors": ["The Black Wall St Times"], "date": "2020-03-18", "keywords": ["incarcerated", "oklahoma", "justice", "spread", "norman", "release", "city", "local", "prisons", "covid19", "jails"], "summary": "OKLAHOMA CITY – We call on the Governor of Oklahoma, as well as the Mayors of Oklahoma City and Tulsa, to immediately protect the lives of ALL the people in their communities.\nWe are calling for decisive action to prevent further spread of COVID-19 in all communities, especially the most vulnerable among us.\nThe safest and most effective way to ensure that jails do not become a vector for the spread of COVID-19 is to reduce the number of people incarcerated.\nJails should consider pretrial release, release for those whose release was granted but pending payment of bail, and anyone who would otherwise be released but for technical parole, probation, or warrant violations.\nAdditionally, jails should consider release with no bail for those held on nonviolent and municipal warrants in local jails, including those with immigration detainers."}, {"url": "https://oklahoman.com/article/5657720/some-choose-to-close-dining-rooms-to-focus-on-delivery-pick-up-service", "title": "Mayor closes OKC bars, limits restaurants to delivery, carry-out amid coronavirus concerns", "authors": [], "date": "2020-03-16", "keywords": ["delivery", "coronavirus", "possible", "closes", "hospitality", "bars", "know", "takeout", "mayor", "okc", "restaurants", "team", "limits", "operate", "taking", "help", "staff", "concerns", "industry", "carryout"], "summary": "84 Hospitality made the move to stop dining room service at its locations.\nBeginning Tuesday, March 17th, all of our 84 Hospitality Group restaurants will operate as take-out, delivery, and curbside pickup only.\nThis includes: Empire Slice House OKC and Tulsa, Gorō Ramen, Gun Izakaya, Revolución, and Burger Punk.\nAs with all of our industry friends from around the country, we are taking every possible sanitary precaution to keep our team and our customers safe.\nThough the road ahead is uncertain, be assured we will do everything we can to weather the storm in a solution-oriented fashion."}, {"url": "https://www.kjrh.com/news/local-news/live-blog-whos-hiring-in-green-country", "title": "Live Blog: Who's Hiring in Green Country?", "authors": [], "date": "2020-03-23", "keywords": ["green", "live", "services", "security", "oklahoma", "dollar", "country", "whos", "health", "blog", "work", "hiring", "general", "company", "clients"], "summary": "Below are official press releases regarding hiring updates for Green Country businesses:April 2, 2020Schwans Home ServiceWe are currently hiring for Route Sales Representatives and Warehouse positions in the Tulsa area.\nThese organizations need security services assistance from our first responder security officers.\nFor public safety reasons the nation needs the support of the security services industry.\n“The Dollar General family continues to do its part in helping our customers and neighbors during these unprecedented times.\nCandidates can learn more about a variety of opportunities across the Dollar General network and apply for available openings here [u7061146.ct.sendgrid.net] ."}, {"url": "https://sanditepride.com/local-news/200320/covid", "title": "Sand Springs to vote on order closing all restaurants, bars, massage parlors, gyms, etc. — Sandite Pride News", "authors": ["Scott Emigh"], "date": "2020-03-20", "keywords": ["parlors", "springs", "public", "sand", "state", "vote", "order", "massage", "pride", "emergency", "restaurants", "city", "andwhereas", "local", "gyms", "continuing", "threat", "sandite"], "summary": "Correction: We inaccurately reported that this measure had already been ordered by the Mayor due to a misunderstanding of the City’s press release.\nThe City of Sand Springs will vote on an order to close numerous local business due to the COVID-19 pandemic, including: bars, restaurants, gyms, entertainment venues, tattoo and massage parlors, and private clubs.\nPursuant to directives from state and federal health authorities, all gatherings of more than ten persons are strongly discouraged.\nSECTION SIX: All persons are encouraged to take all precautions available to assist in alleviating the spread of the virus.\nSECTION EIGHT: This state of emergency shall continue until 12:01 AM May 11, 2020, or terminated earlier by further proclamation."}, {"url": "https://townline.org/obituaries-for-thursday-march-19-2020/", "title": "OBITUARIES for Thursday, March 19, 2020", "authors": ["Website Editor"], "date": "2020-03-18", "keywords": ["family", "passed", "son", "2020", "husband", "wife", "school", "loved", "19", "obituaries", "maine", "waterville"], "summary": "SHARON E. DuBOISSIDNEY – Sharon E. DuBois, 80, passed away Tuesday, March 3, 2020, at her home, in Sidney.\nJAMES M. SHEAVASSALBORO – James “Jim” Maynard Shea, 76, passed on Saturday, February 15, 2020, in Zephyrhills, Florida.\nKATHLEEN M. KEEFERSOUTH CHINA – Kathleen M. Keefer, 57, of South China, passed away unexpectedly on Monday, March 2, 2020, at home.\nPATRICIA A. NASIEWINDSOR – Patricia Ann Nasie, 81, passed away at her home on Monday, March 2, 2020, following a brief illness.\nFamily and Friends may visit from 10 – 11 a.m., on March 20, 2020, at Gallant Funeral Home 10 Elm St., Waterville."}, {"url": "https://www.thetelegraph.com/news/article/Number-of-coronavirus-cases-in-Oklahoma-rises-by-15145942.php", "title": "Oklahoma Legislature closes, coronavirus increases in state", "authors": ["Ken Miller", "Associated Press", "The Telegraph", "Sanford J. Schmidt", "Jill Moon"], "date": "2020-03-20", "keywords": ["oklahoma", "virus", "ap", "state", "coronavirus", "health", "mike", "tulsa", "increases", "closes", "work", "legislature"], "summary": "A key item unresolved by the Legislature is the state budget, which is constutionally required to be balanced.\nThe state Board of Equalization in February projected $8.2 billion in available funding, a 1% decline from last year.\nFive additional coronavirus cases also were confirmed in Oklahoma, the state Department of Health reported, rising from 44 to 49.\nOklahoma health officials have warned that the state was experiencing a shortage of testing kits and that the number of cases in Oklahoma was likely much higher.\n___The Associated Press receives support for health and science coverage from the Howard Hughes Medical Institute’s Department of Science Education."}, {"url": "https://www.kjrh.com/news/local-news/cancellations-due-to-covid-19-concerns", "title": "Cancellations, Postponed Events Due to COVID-19 Concerns", "authors": [], "date": "2020-03-13", "keywords": ["cancellations", "events", "postponed", "pmmarch", "2020", "center", "health", "tulsa", "concerns", "students", "covid19", "information", "campus"], "summary": "What events and schools have been canceled or postponed in Green Country due to coronavirus concerns?\nThe following are official news releases regarding updates to events and school schedules, including changes due to COVID-19 pandemic.\nApril 6, 20205:29 p.m.Due to the ongoing situation with COVID-19, the following shows have been postponed or cancelled.\nOn Monday, March 30th 2020, Tulsa Ballet announced the cancelation of all public events, as well as the rescheduling the last two programs of its 2019|2020 season.\nFor questions regarding events and facilities usage call 918.684.6305 Love-Hatbox Sports Complex: CLOSED for events April 17 – May 8, 2020."}, {"url": "https://www.themarshallproject.org/2020/03/21/coronavirus-transforming-jails-across-the-country", "title": "Coronavirus Transforming Jails Across the Country", "authors": ["Salwan Georges The Washington Post", "Via Getty Images", "Mike Simons Tulsa World"], "date": "2020-03-21", "keywords": ["public", "transforming", "population", "country", "coronavirus", "released", "sheriff", "county", "sheriffs", "office", "jail", "defenders", "jails"], "summary": "Across the country, the coronavirus outbreak is transforming criminal justice in the most transient and turbulent part of the system: local jails.\nRun mostly by county sheriffs, jails hold an ever-changing assortment of people—those who are awaiting trial and cannot afford to pay bail; those convicted of low-level offenses; overflows from crowded prisons.\nQuarantines are also underway in Silicon Valley, where a public defender who visited a Santa Clara County jail tested positive for coronavirus.\n“It’s amazing,” said Sarah Wood, a lawyer and policy director at the Harris County Public Defender’s Office.\nThe state prison system has already stopped taking in new prisoners, so now those with recent criminal convictions must wait at county jails."}, {"url": "https://www.runnersworld.com/races-places/a31945705/race-calendar-fall-winter-2020/", "title": "2020 Fall and Winter Running Races", "authors": ["Hailey Middlebrook", "Digital Editor", "Hailey First Got Hooked On Running News As An Intern With Running Times", "Now She Reports On Elite Runners", "Cyclists", "Feel-Good Stories", "Training Pieces For Runner'S World", "Bicycling Magazines."], "date": "2020-03-30", "keywords": ["spring", "marathon", "marathonoctober", "race", "2020", "25", "13", "winter", "races", "world", "running", "half", "runners", "fall"], "summary": "While the spring race season was largely cancelled this year due to the coronavirus pandemic, the good news is that the latter half of 2020 will be jam-packed with running events.\nA whopping five World Marathon Majors are slated for this fall—Boston, Berlin, London, Chicago, and New York City—along with many other annual races and postponed spring events.\nIf your spring marathon was postponed until fall, you don’t have to keep doing long runs if you don’t want to, Dr. Justin Ross, a clinical psychologist, told Runner’s World .\nHere, we’ve gathered a few key events to add to your 2020 fall and winter race calendars.\nWe will continue to update this story as postponed races announce new fall dates."}, {"url": "https://www.kjrh.com/news/local-news/green-country-grab-and-go-meals", "title": "Green Country \"Grab-and-Go\" Meals", "authors": [], "date": "2020-03-23", "keywords": ["green", "public", "available", "breakfast", "grabandgo", "free", "country", "meal", "lunch", "school", "schools", "meals"], "summary": "These \"Grab-and-Go\" meals, both breakfast and lunch meals, will be available starting March 23.\nFor more information on Broken Arrow Public Schools Free Grab-and-Go meals, click here.\nSAPULPA PUBLIC SCHOOLSSapulpa Public Schools is offering free meals to children during the mandatory closure of schools.\nStrong Schools - Strong Community - Zebra StrongFor more information on Claremore Public Schools Drive-Thru \"Grab-and-Go\" meals, click here.\nFor more information on Bixby Public Schools Grab-and-Go meals, click here."}, {"url": "https://www.kjrh.com/news/local-news/coronavirus-in-oklahoma-covid-19-cases-locations-across-the-state", "title": "Coronavirus in Oklahoma: COVID-19 cases, locations across the state", "authors": [], "date": "2020-03-11", "keywords": ["officials", "department", "oklahoma", "state", "coronavirus", "65", "county", "say", "deaths", "older", "covid19", "locations", "cases"], "summary": "The Oklahoma State Department of Health says that there are now 2,263 confirmed cases of coronavirus in the state.\nThe Oklahoma State Department of Health says there are now 2,184 confirmed coronavirus cases in the state.\nThe Oklahoma State Department of Health says there are now 2,069 confirmed cases of coronavirus in the state.\nThe Oklahoma State Department of Health says that there are now 1,794 confirmed cases of coronavirus in the state.\nThe Oklahoma State Department of Health says that there are now a total of 1,684 confirmed cases of coronavirus in the State."}, {"url": "https://www.kjrh.com/news/local-news/first-case-of-coronavirus-confirmed-in-tulsa-county", "title": "First Case of Coronavirus Confirmed in Tulsa County", "authors": [], "date": "2020-03-06", "keywords": ["officials", "department", "oklahoma", "public", "state", "travelers", "coronavirus", "health", "county", "confirmed", "say", "tulsa", "case"], "summary": "TULSA, Okla. — The first case of coronavirus has been confirmed in Oklahoma, according to Oklahoma's Governor Kevin Stitt, and state and local health leaders.\nDuring a press conference on Friday, March 6, officials announced the first confirmed case was in Tulsa County.\nRelated Story: Governor, State and Local Public Health Officials to Provide 'Important' Coronavirus Update at 4 p.m.\nUntil now, five cases have tested negative, officials say, with four people under investigation for coronavirus with pending tests.\nTulsa Health Department has established a call center that Tulsans can call at 918-582-9355."}, {"url": "https://www.kjrh.com/news/local-news/kiss-bringing-end-of-the-road-tour-to-tulsas-bok-center-in-march-2020", "title": "KISS bringing \"END OF THE ROAD TOUR\" to Tulsa's BOK Center in March 2020", "authors": [], "date": "2019-11-14", "keywords": ["twitterlike", "tour", "2020", "tulsas", "center", "event", "end", "say", "weather", "bringing", "tulsa", "bok", "tourofficials", "road", "daily", "kiss"], "summary": "TULSA — The Rock n Roll legends KISS announced today they will be coming to Tulsa's BOK Center on their final tour, the \"END OF THE ROAD TOUR.\"\nOfficials say the event will take place on Thursday, March 12, 2020.\nTickets go on sale, official say, on Friday, November 22 at 10 a.m.Officials also say that KISS Meet & Greet Experiences will be available Tuesday, November 19 at 10 a.m. through 10 p.m. here.\nKISS Army fan club presales will begin on Wednesday, November 20 at 10 a.m. until Thursday, November 21 at 10 p.m.For more information on the event and ticket sales, click here.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://oklahoman.com/article/5657708/coronavirus-in-oklahoma-stitt-declares-state-of-emergency", "title": "Coronavirus in Oklahoma: Stitt declares state of emergency", "authors": [], "date": "2020-03-15", "keywords": ["oklahoma", "stitt", "state", "order", "emergency", "coronavirus", "signed", "testing", "case", "declares", "executive"], "summary": "Kevin Stitt on Sunday declared a state of emergency across Oklahoma in response to the coronavirus.\nCiting an eighth case of coronavirus discovered in Oklahoma, Stitt signed an executive order declaring a state of emergency in all 77 counties.\nStitt did not give any details on the location of the latest case of coronavirus in Oklahoma, but said the testing was done through a private testing lab.\n\"While impact in Oklahoma has continued to be relatively minimal to date, it is increasingly important for Oklahoma to be ready for this threat,\" Stitt wrote in the order.\nHe also cited a national executive order President Donald Trump signed on Saturday."}, {"url": "https://thefalconswire.usatoday.com/gallery/atlanta-falcons-nfl-draft-javon-kinlaw-cj-henderson/", "title": "4 options for the Falcons in each round of the 2020 draft", "authors": ["Matt Urben", "April"], "date": "2020-04-14", "keywords": ["linebacker", "round", "2020", "usa", "today", "defensive", "2019", "credit", "options", "draft", "stadium", "falcons", "mandatory", "moreround", "nov"], "summary": "The biggest event of the NFL’s offseason has always been the draft, with the annual three-day event helping fans get through the five football-less months following the season.\nThe Atlanta Falcons have six picks, including two fourth-rounders, but that can obviously change on draft day.\nEven though Atlanta doesn’t currently have a fifth or sixth-round pick, here are four options for the team in each round.\nMandatory Credit: Kim Klement-USA TODAY Sports moreRound 1: CB C.J.\nMandatory Credit: Tommy Gilligan-USA TODAY Sports more"}, {"url": "https://www.kjrh.com/news/local-news/guide-to-all-things-oktoberfest-tulsa-2019", "title": "Guide to all things Oktoberfest Tulsa 2019", "authors": [], "date": "2019-10-16", "keywords": ["guide", "west", "rock", "free", "street", "day", "oktoberfest", "polka", "2019", "tulsa", "river", "lufthansa", "things"], "summary": "TULSA — The Linde Oktoberfest Tulsa 2019 will be open to the public starting Thursday, Oct. 17.\nLinde Oktoberfest Tulsa was named \"Best 10 Most Authentic Oktoberfests\" in the United States by USA Today and was recognized as a Top 5 Oktoberfest in the nation.\nBelow is all the information you need to know about the Linde Oktoberfest Tulsa 2019:SCHEDULEWednesday 10/16Gemütlichkeit Corporate Night– The signature fundraiser for Tulsa Oktoberfest, this pre-festival evening is supported by more than 400 Tulsa area businesses and is often referred to as simply “Corporate Night.” Gemütlichkeit is by reservation only.\nEuro Disco – 11:30 p.m. til 1:00 a.m.Der Lufthansa Technik BierGartenLinde Oktoberfest Tulsa tent transforms into a European Disco.\nEuro Disco – 11:30 p.m. til 1:00 a.m.Der Lufthansa Technik BierGartenLinde Oktoberfest Tulsa tent transforms into a European Disco."}, {"url": "https://oklahoman.com/article/5637364/chance-the-rapper-bringing-the-big-day-tour-to-oklahoma", "title": "Chance The Rapper bringing 'The Big Day' tour to Oklahoma", "authors": [], "date": "2019-07-29", "keywords": ["chance", "oklahoma", "tour", "day", "oct", "center", "big", "stop", "tulsa", "bringing", "bok", "rapper"], "summary": "Chance The Rapper bringing 'The Big Day' tour to OklahomaChance The Rapper is planning a Tulsa tour stop Oct. 26 at the BOK Center.\n[Poster image provided]TULSA – Chance The Rapper today announced his highly-anticipated return to the road with \"The Big Day,\" touching down in cities across North America this fall.\nThe tour reveal follows the long-awaited release of his debut studio album, \"The Big Day,\" out last Friday.\nThe tour will include a Tulsa stop at Oct. 26 at the BOK Center, 200 S Denver.\nTulsa tickets are priced at $59.50 to $129.50."}, {"url": "https://nypost.com/2019/10/08/this-oklahoma-city-is-paying-people-10k-to-move-there/", "title": "This Oklahoma city is paying people $10K to move there", "authors": ["October"], "date": "2019-10-08", "keywords": ["participants", "curbed", "oklahoma", "interesting", "city", "yanov", "paying", "tulsa", "10k", "workers", "remote", "work", "program"], "summary": "Earlier this year, the city best known for birthing ’90s boy band Hanson announced the Tulsa Remote program.\nTulsa Remote attracted 10,000 applicants and selected 100 participants for the first year of the program.\nHawkins “had been living in an Airstream trailer with her husband, Zach, and their dog, Kyla, when other office-free colleagues told her about Tulsa Remote.\nIt helps that Tulsa, a former oil hub that is Oklahoma’s second-largest city, isn’t the backwards town that so-called “coastal elites” might perceive it to be.\nApplications for 2020, the second year of the Tulsa Remote program, will be available in the fall of 2019."}, {"url": "https://kfor.com/news/october-storms-bring-hail-tornado-warnings/", "title": "October storms bring hail, tornado warnings", "authors": ["K. Butcher"], "date": "2019-10-21", "keywords": ["tornado", "oklahoma", "asher", "bring", "storms", "rolled", "oct", "hail", "city", "20severe", "weather", "warnings"], "summary": "ASHER, Okla. (KFOR) – Fall weather in Oklahoma took a turn Sunday night as severe storms rolled across the state.\nAt around 9:30 p.m., a wide line of storms formed from Tulsa to east Oklahoma City down to Wichita Falls, Texas.\nHail was the main threat, but the National Weather Service also issued several tornado warnings.\nTerri Foster hail southeast of CushingLaramie Batey hail in Sasakwa, OKDan Williams hail in Elmore City, OKLanea Billings hail near Drumright, OKTerri Foster hail southeast of CushingBilly Simon hail north of Little City, OKJessica Mascho-Bender hail in Chandler, OKDamage was left behind in Asher, however, it is unknown if a tornado touched down.\nSevere storms rolled through Asher, Oklahoma on Sunday, Oct. 20."}, {"url": "https://www.dailymail.co.uk/news/article-8222965/Major-U-S-airlines-plan-apply-government-loans-addition-grants-sources.html", "title": "Airlines plan to apply for government loans in addition to $25 billion coronavirus payroll bailout", "authors": [], "date": "2020-04-15", "keywords": ["loans", "cent", "billion", "25", "treasury", "apply", "coronavirus", "payroll", "loan", "million", "plan", "grants", "bailout", "addition", "receive", "airlines"], "summary": "Numerous major U.S. airlines are preparing to apply this week for a $25 billion U.S. government loan program after winning billions in federal payroll grants, people familiar with the matter said.\nThe U.S. Treasury told airlines to apply by Friday if they want priority consideration, according to documents posted on its website.\nAmerican Airlines Group Inc confirmed on Tuesday it plans to apply for a $4.75 billion loan ahead of the Friday deadline set by Treasury for priority consideration.\nAlaska Airlines Inc said it would apply for $1.1 billion in federal loans.\nAmerican Airlines said it would receive $5.8 billion in grants, of which it would need to repay $1.7 billion."}, {"url": "https://www.nytimes.com/2019/12/17/us/tulsa-graves-black-wall-street-massacre.html", "title": "Tulsa Sites May Hold Mass Graves From ‘Black Wall Street’ Massacre", "authors": ["Nicholas Bogel-Burroughs"], "date": "2019-12-17", "keywords": ["street", "mass", "massacre", "wall", "hold", "white", "graves", "destroyed", "city", "1921", "tulsa", "black", "man", "sites"], "summary": "Scientists said on Monday that two patches of land in Tulsa, Okla., could be the sites of mass graves holding victims of a bloody 1921 clash in which white mobs attacked black residents and destroyed a prosperous business district known as Black Wall Street.\nThe evidence of possible mass graves, gathered by two archaeologists from the University of Oklahoma, is the latest discovery to spur more active interest in a brutal chapter that the city tried for decades largely to forget.\nThe massacre in Tulsa was one of the deadliest eruptions of race-motivated violence in the nation’s history.\nAs many as 300 people were killed, and a whole section of the city destroyed, including more than 1,200 homes.\nIt began on May 31, 1921, after a black man was arrested and accused of sexually assaulting a white woman."}, {"url": "https://www.kjrh.com/news/local-news/city-of-tulsa-road-closures-in-downtown-tulsa-for-2019-native-american-day-parade", "title": "City of Tulsa: Road closures in downtown Tulsa for 2019 Native American Day Parade", "authors": [], "date": "2019-10-14", "keywords": ["american", "officials", "downtown", "closures", "day", "city", "2019", "guests", "facebook", "say", "tulsa", "parade", "native", "road", "daily"], "summary": "TULSA — According to officials with the City of Tulsa, there will be road closures in downtown Tulsa today due to the 2019 Native American Day parade.\nOfficials say the celebration is from 9 a.m. to 5 p.m. on Monday, October 14 at the Guthrie Green.\nDownload our free app for Apple and Android and Kindle devices.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts.\nFollow us on TwitterLike us on Facebook"}, {"url": "https://www.cnn.com/2019/10/29/business/10k-for-tulsa-trnd/index.html", "title": "This foundation will pay you $10,000 to move to Tulsa", "authors": ["Lauren M. Johnson"], "date": "2019-10-29", "keywords": ["program", "foundation", "money", "pay", "10000", "cnn", "bolzle", "tulsa", "yearthe", "remote", "work", "told"], "summary": "(CNN) If you work remotely and want to make an extra $10,000, relocating to Tulsa might be your next move.\nTulsa Remote , a program funded by the George Kaiser Family Foundation, is offering 250 people the opportunity to make $10,000 by simply moving to Oklahoma, the organizers announced Tuesday.\nThe money comes in the form of a grant and is distributed to the recipient over the course of a year.\nThe program was launched in 2018, and more than 10,000 applications came in from more than 150 countries, Tulsa Remote Executive Director Aaron Bolzle told CNN.\n\"We wanted to remove the barrier to come from other cities -- and the money got people's attention,\" Bolzle told CNN."}, {"url": "https://theoklahoma100.com/business/business-news/2020/02/05/winco-foods-tulsa/15406", "title": "WinCo Foods to open first Tulsa store this month", "authors": [], "date": "2020-02-05", "keywords": ["month", "oklahoma", "foods", "store", "winco", "utah", "tulsa", "washington", "open", "retail", "locations"], "summary": "Tulsa residents will soon have a new option for buying groceries.\nWinCo Foods will open its first Tulsa store on Thursday, Feb. 6, at 71st and Memorial on the southeast side of the city.\nThe grocery store will be open 24/7 and retail food items in both regular and bulk quantities.\nWinCo Foods has announced that it will bring between 180 and 200 full- and part-time jobs to the community.\nWinCo Foods, an Idaho-based supermarket chain, operates retail locations in Arizona, California, Idaho, Montana, Nevada, Oklahoma, Oregon, Texas, Utah and Washington, including three locations in the Oklahoma City metro area."}, {"url": "https://somd.com/news/headlines/2020/23526.php", "title": "Local Navy Contract Awards", "authors": ["Virtually Everything", "Southern Maryland Online"], "date": "2020-04-15", "keywords": ["services", "virginia", "awards", "oklahoma", "aircraft", "funds", "local", "procurement", "llc", "navy", "contract", "fiscal", "work"], "summary": "WASHINGTON$6,106,000,000(April 15, 2020)—The U.S. Department of Defense recently announced the following contract awards that pertain to local Navy activities., is awarded amodification (P00006) to a previously-awarded firm-fixed-price contract N00019-18-C-1061 to procure eight General Electric F414-400 spare engines, 11 afterburner modules and 12 low pressure turbine modules for the Navy F/A-18 Super Hornet fighter aircraft.\nFiscal 2020 aircraft procurement (Navy) funds in the amount $51,520,476 will be obligated at time of award, none of which will expire at the end of the current fiscal year.\nFiscal 2020 aircraft procurement (Navy) funds of $9,696,091 will be obligated at time of award, none of which will expire at the end of the current fiscal year.\nThis modification changes the contract type of the Stand-off Land Attack Missile — Expanded Response (SLAM-ER) Phase I obsolescence redesign from a cost-plus-incentive-fee type contract to a firm-fixed-price type contract.\nFiscal 2020 weapons procurement (Navy) funds in the amount of $15,151,392; fiscal 2019 weapons procurement (Navy) funds in the amount of $11,363,544; and fiscal 2019 research, development, test and evaluation (Navy) funds in the amount of $3,787,848 will be obligated at time of award, none of which will expire at the end of the fiscal year."}, {"url": "https://www.kjrh.com/news/local-news/2019-dia-de-los-muertos-art-festival", "title": "2019 Día de los Muertos Art Festival", "authors": [], "date": "2019-10-25", "keywords": ["green", "living", "muertos", "art", "900", "día", "2019", "500", "festival", "tulsa", "arts", "vendors", "los", "guthrie"], "summary": "Living Arts of Tulsa, in partnership with Guthrie Green and Casa de la Cultura is hosting Tulsa's annual Día de los Muertos Arts Festival on November 1st, 2019, 5:00 - 11:00 PM.\nThe festival will celebrate Día de Los Muertos traditions with a display of altars to honor those who have passed.\nThe cornerstone of the Día de Los Muertos Arts Festival are the altarpieces, decorated for the spirits of those who have passed from this earth.\nFeatured Events at Guthrie Green - 5:00 P.M. - 9:00 P.M.Guthrie Green will host all merchant vendors and food trucks from 5:00 - 9:00 PM.\nLiving Arts of Tulsa, is located at 307 E Brady St., Tulsa, OK 74120Stay in touch with us anytime, anywhere."}, {"url": "https://kfor.com/news/suspect-crashes-into-and-kills-innocent-driver-while-fleeing-police-authorities-say/", "title": "Suspect crashes into and kills innocent driver while fleeing police, authorities say", "authors": ["Hicham Raache"], "date": "2019-10-19", "keywords": ["truck", "suspect", "struck", "crashes", "tragic", "theyre", "say", "sheriffs", "tulsa", "driver", "innocent", "kills", "suspects", "streets", "authorities", "involved", "fleeing"], "summary": "TULSA, Okla. (FOX23) – A police chase in east Tulsa ended with the death of a person who was not involved in the pursuit.\nTulsa police were searching for a possible shooting suspect Friday night when they came upon a stolen truck linked to the investigation.\nPolice attempted to stop the pickup , but the driver fled, ran a red light and crashed into an innocent motorist near 11th and South 129th streets, according to the Tulsa County Sheriff’s Office.\n“They were not involved in this pursuit at all,” said Casey Roebuck with the Sheriff’s Office.\n“What is most tragic about this is that our suspects are at the hospital, they’re expected to recover, but the bystander they struck died here at the scene.”Click here for the full story."}, {"url": "https://oklahoman.com/article/5642949/oklahoma-business-briefs-for-oct-3-2019", "title": "Oklahoma business briefs for Oct. 3, 2019", "authors": [], "date": "2019-10-03", "keywords": ["oklahoma", "companies", "exhibitors", "briefs", "resources", "expo", "business", "oct", "gas", "2019", "event", "oil", "industry", "energy"], "summary": "Oklahoma Oil & Gas Expo scheduledThe Oklahoma Oil & Gas Expo is set for 9 a.m. to 3 p.m. Oct. 10 at the Bennett Event Center at the OKC Fairgrounds.\nNow in its 23rd year, the event is expected to feature more than 270 exhibitors and 3,500 attendees.\nThe Oklahoma Oil & Gas Expo brings together companies, technology and people who will shape the future of the oil and natural gas industry.\nExhibitors include small, local businesses to large, international service companies and cover all facets of the industry.\nThe event is presented by Sustaining Oklahoma’s Energy Resources (SOER), a program under the Oklahoma Energy Resources Board."}, {"url": "https://theoklahoma100.com/lifestyle/holidays/2020/03/03/celebrating-the-irish-spirit-in-okc-and-tulsa/15572", "title": "Celebrating the Irish spirit in OKC and Tulsa", "authors": [], "date": "2020-03-03", "keywords": ["spirit", "green", "oklahoma", "music", "okc", "day", "ireland", "celebrating", "tulsa", "irish", "parade", "world", "patricks", "unforgettable", "st"], "summary": "St. Patrick’s Day is a celebration not just in Ireland but across the world.\nThe first St. Patrick’s Day parade was held in Boston in 1737, long before Ireland had its first one.\nFestivities include:TulsaRunnersWorld St. Patrick’s Day Run benefiting the Special Olympics.\nOKCGo Green: St. Patty’s Day, where Scottish music is played to go with green beer.\nOKC Energy FC O’City Parade, joining communities together for an unforgettable green experience."}, {"url": "https://theblackwallsttimes.com/2019/12/15/1921-graves-public-oversight-committee-to-meet-on-dec-16/", "title": "1921 Graves Public Oversight Committee to Meet on Dec. 16", "authors": ["The Black Wall St Times"], "date": "2019-12-15", "keywords": ["public", "oklahoma", "oversight", "committee", "16", "oaklawn", "race", "1921", "investigation", "massacre", "graves", "dec", "tulsa", "meet"], "summary": "Eddie Lockard, one of the many victims during the 1921 Tulsa Race Massacre, was buried at Oaklawn Cemetery in downtown Tulsa, Oklahoma.\nOaklawn is one of the sites where mass graves are believed to be.\nPublished 12/15/2019 | Reading Time 1 min 0 secBy BWSTimes StaffThe Public Oversight Committee for the 1921 Tulsa Race Massacre Graves Investigation will meet on Monday, Dec. 16, 5:30 p.m. at Carver Middle School, 624 E. Oklahoma Pl., to receive results from the geophysical and scanning of Oaklawn Cemetery and Newblock Park for the potential of graves from the 1921 Tulsa Race Massacre.\nThree goals were established around the 1921 graves reexamination, including public oversight, historical context and the physical evidence investigation.\nFor more information on the investigation process, visit: www.cityoftulsa.org/1921gravesAll Public Oversight meetings are streamed live on the City of Tulsa Facebook account."}, {"url": "https://patch.com/oklahoma/tulsa/calendar/event/20191108/654134/tulsa-ballet-peter-and-the-wolf", "title": "Tulsa Ballet | Peter and the Wolf", "authors": ["Added Robert Mcdaniel"], "date": "2019-09-27", "keywords": ["2020", "wolf", "1000", "tickets", "2019", "1145", "ballet", "peter", "tulsa", "plus", "amfri", "family"], "summary": "Go into the woods and experience the return of this fantastic family production with performances in both Tulsa and Broken Arrow.\nTulsa Ballet's Hardesty Family Foundation Children's Series presents Ma Cong's Peter & the Wolf, a show perfect for ballet fans of all ages.\nWhen a dangerous wolf causes problems for the village, it's up to Peter and his animal friends to save the town.\nPerformances in Tulsa and Broken Arrow:Tulsa (Studio K - 1212 E 45th Place)Fri. September 27, 2019 10:00 amSat.\nSeptember 28, 2019 2:00 pmFri. April 3, 2020 10:00 amFri. April 3, 2020 11:45 amBroken Arrow (Zarrow Syudio - 1901 W New Orleans St)Fri. November 8, 2019 10:00 amFri. November 8, 2019 11:45 amFri. January 17, 2020 10:00 amFri. January 17, 2020 11:45 amSat."}, {"url": "https://theblackwallsttimes.com/2019/11/19/tulsa-mom-mourns-the-loss-of-her-firstborn-due-to-gun-violence/", "title": "Tulsa mom mourns the loss of her firstborn due to gun violence", "authors": ["The Black Wall St Times"], "date": "2019-11-19", "keywords": ["loss", "mourns", "high", "hall", "school", "funeral", "mom", "senior", "cost", "mother", "tulsa", "firstborn", "gun", "violence", "son", "michelle"], "summary": "Photos of Montaevion Hall, a Central High School senior who tragically lost his life to gun violence in Tulsa, Okla, on November 16, 16 days after Oklahoma became an open carry state.\nHe revealed to his mother the horrible news that her firstborn son, Montaevion Hall, had been murdered.\nMontaevion, who everyone called Tae, was an 18-year-old senior high school student at Central and was excited to graduate in the spring and had plans of attending college.\n“My son was an athlete at Central High School, who has touched the lives of an entire school.\nAccording to Parting, a funeral comparison website, the average funeral cost in the US is between $7,000 and $10,000."}, {"url": "https://theblackwallsttimes.com/2019/11/11/ruby-sickle-cell-awareness-gala-presented-by-oklahomas-supporters-of-families-with-sickle-cell-disease/", "title": "Ruby Sickle Cell Awareness Gala Presented by Oklahoma’s Supporters of Families with Sickle Cell Disease", "authors": ["The Black Wall St Times"], "date": "2019-11-11", "keywords": ["awareness", "chance", "presented", "gala", "sct", "child", "cell", "oklahomas", "sickle", "supporters", "families", "trait", "black", "disease", "ruby", "warrior"], "summary": "Published 11/11/2019 | Reading Time 1 min 53 secTULSA, Okla. — On Saturday, November 23, 2019, at the 36th Street North Event Center at 1125 E. 36th Street North, Tulsa, OK, 74106, the Supporters of Families with Sickle Cell Disease will host their 15th Sickle Cell Awareness Gala.\nTickets are $32 and will go to Supporters of Families with Sickle Cell Disease.\nThis year the Supporters of Families with Sickle Cell Disease will honor One Gas (Black Leadership at One Gas), Nehemiah Frank (The Black Wall Street Times), Essence Williams (a Youth Sickle Cell Warrior), Amari Benson (Sickle Cell Warrior), Kejuan Morris (Sickle Cell Warrior), Jimmy Young (Sickle Cell Volunteer) and Jimmy Campton (a Fallen Sickle Cell Warrior.\nSupporters of Families with Sickle Cell Disease (SFSCD) is a comprehensive community-based organization that services individuals and families living with sickle cell and thalassemia disease and trait in Oklahoma.\nSFSCD is the center of contact and community service provision for the estimated 40,000 Oklahomans with sickle cell trait and approximate 1,700 Oklahoma families living with sickle cell and thalassemia disease in Oklahoma."}, {"url": "https://www.kjrh.com/news/local-news/post-malone-making-oklahoma-tour-stop-in-november", "title": "Post Malone making Oklahoma tour stop in November", "authors": [], "date": "2019-07-23", "keywords": ["malone", "oklahoma", "making", "yaweh", "upcoming", "tyla", "tour", "twitterlike", "tourstay", "city", "announced", "post", "weather", "stop", "daily"], "summary": "OKLAHOMA CITY — Singer and rapper Post Malone has announced an Oklahoma City stop on his upcoming \"Runaway\" tour.\nIt was announced Tuesday that he will perform at Chesapeake Energy Arena on Nov. 4Tickets go on sale July 26 at 10 a.m. at LiveNation.com.\nSwae Lee and Tyla Yaweh will appear as special guests during the tour.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts.\nFollow us on TwitterLike us on Facebook"}, {"url": "https://www.kjrh.com/news/local-news/veterans-day-2019-guide-to-all-events", "title": "Veterans Day 2019: Guide to All Events", "authors": [], "date": "2019-11-07", "keywords": ["works", "guide", "downtown", "events", "day", "veterans", "n", "2019", "parade11", "park", "daily", "informationnovember", "11"], "summary": "Monday, Nov. 11 is Veterans Day!\nBelow, 2 Works for You compiled a list of Veterans Day events happening around Green Country:November 9, 2019MuskogeeMuskogee Area Veterans Parade10:30 a.m. | Downtown MuskogeeClick here for more information.\nBartlesvilleVeterans Day Parade11 a.m. | Downtown BartlesvilleClick here for more information.\nNovember 10, 2019Broken ArrowVeterans Day Concert2 – 4 p.m. | Kirkland Theater, 808 East College St, Broken ArrowOwassoVeterans Appreciation Ceremony2 p.m. | Veterans Memorial Park, 10320 E 116th Street N, OwassoClick here for more information.\nNovember 11, 2019Tulsa AreaBreakfast at VFW #5777 – 8 a.m. | 1109 E. 6th St.Tulsa Veterans Day Parade11 a.m. | Downtown TulsaClick here for more info."}, {"url": "https://patch.com/oklahoma/tulsa/city-tulsa-surplus-property-auction-nov-9th", "title": "City Of Tulsa Surplus Property Auction: Nov. 9th", "authors": [], "date": "2019-11-04", "keywords": ["auction", "city", "surplus", "9th", "equipment", "merchandise", "tulsa", "bidders", "items", "nov", "property"], "summary": "From City of Tulsa:Six-hundred old parking meters, almost 150 vehicles – the most ever at a City of Tulsa auction, plus concessions and catering equipment from the BOK Center and Cox Business Center will be among the many items up for bids at the next City of Tulsa Surplus Property Auction.\nThe auction will be held Saturday, Nov. 9, at the City of Tulsa surplus property facility, 108 N. Trenton Ave., beginning at 9:30 a.m.\nPotential bidders may preview auction merchandise on Friday, Nov. 8, from 9 a.m. to 3 p.m.\nThe City surplus property facility also will open at 7:30 a.m. on Saturday, Nov. 9, for viewing merchandise before the sale begins.\nNo one under age 16 may be admitted to the City surplus property facility."}, {"url": "https://www.kjrh.com/news/local-news/2019-dia-de-los-muertos-art-festival", "title": "2019 Día de los Muertos Art Festival", "authors": [], "date": "2019-10-25", "keywords": ["green", "living", "muertos", "art", "900", "día", "2019", "500", "festival", "tulsa", "arts", "vendors", "los", "guthrie"], "summary": "Living Arts of Tulsa, in partnership with Guthrie Green and Casa de la Cultura is hosting Tulsa's annual Día de los Muertos Arts Festival on November 1st, 2019, 5:00 - 11:00 PM.\nThe festival will celebrate Día de Los Muertos traditions with a display of altars to honor those who have passed.\nThe cornerstone of the Día de Los Muertos Arts Festival are the altarpieces, decorated for the spirits of those who have passed from this earth.\nFeatured Events at Guthrie Green - 5:00 P.M. - 9:00 P.M.Guthrie Green will host all merchant vendors and food trucks from 5:00 - 9:00 PM.\nLiving Arts of Tulsa, is located at 307 E Brady St., Tulsa, OK 74120Stay in touch with us anytime, anywhere."}, {"url": "https://www.kjrh.com/news/local-news/city-of-tulsa-basic-streets-and-infrastructure-program-vote-on-november-12", "title": "City of Tulsa basic streets and infrastructure program: Vote on November 12", "authors": [], "date": "2019-11-12", "keywords": ["basic", "street", "12", "vote", "improve", "worked", "city", "infrastructure", "tulsa", "streets", "daily", "program"], "summary": "According to the improve our Tulsa website, after following two years of planning and eight public meetings across the city, three ballot proposals will head to Tulsa residents for a November 12 vote to fund Improve Our Tulsa, the city’s basic streets and infrastructure program.\nI am grateful for all our fellow Tulsans who made their voices heard every step of the way.\nThey told us they want better streets, so this program is overwhelmingly focused on street improvements.\nThis is a very basic, but very important, infrastructure program that will help us build the Tulsa we want without raising our taxes.”Mayor G.T.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://oklahoman.com/article/5637364/chance-the-rapper-bringing-the-big-day-tour-to-oklahoma", "title": "Chance The Rapper bringing 'The Big Day' tour to Oklahoma", "authors": [], "date": "2019-07-29", "keywords": ["chance", "oklahoma", "tour", "day", "oct", "center", "big", "stop", "tulsa", "bringing", "bok", "rapper"], "summary": "Chance The Rapper bringing 'The Big Day' tour to OklahomaChance The Rapper is planning a Tulsa tour stop Oct. 26 at the BOK Center.\n[Poster image provided]TULSA – Chance The Rapper today announced his highly-anticipated return to the road with \"The Big Day,\" touching down in cities across North America this fall.\nThe tour reveal follows the long-awaited release of his debut studio album, \"The Big Day,\" out last Friday.\nThe tour will include a Tulsa stop at Oct. 26 at the BOK Center, 200 S Denver.\nTulsa tickets are priced at $59.50 to $129.50."}, {"url": "https://www.kjrh.com/lifestyle/happy-birthday-oklahoma", "title": "Happy Birthday Oklahoma", "authors": [], "date": "2019-11-11", "keywords": ["oklahoma", "birthday", "twitterlike", "tobey11", "state", "happy", "touch", "theatre", "severe", "weather", "select", "daily"], "summary": "We're celebrating the great state of Oklahoma!\nJoin us at the Riverwalk in Jenks, Oklahoma on November 16th 10 AM - 2 PM.\nPerformance schedule:10-10:30 a.m. – Author Louis Bodnar10:30-11 a.m. – Jacob Tobey11 a.m.-noon – Charis MusicNoon-1 p.m. – Marquette1-2 p.m. – Theatre ArtsStay in touch with us anytime, anywhere.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts.\nFollow us on TwitterLike us on Facebook"}, {"url": "https://www.dallasnews.com/sports/cowboys/2020/04/15/film-room-3-late-round-targets-for-the-cowboys-in-the-2020-nfl-draft-including-a-backup-qb-to-develop/", "title": "Film room: 3 late-round sleepers for the Cowboys in the 2020 NFL draft, including a backup QB to develop", "authors": ["John Owning", "Hayat Norimine", "Tom Steele", "Loyd Brumfield", "Kevin Krause", "Catherine Marfin", "John Hancock"], "date": "2020-04-15", "keywords": ["morgan", "dallas", "robinson", "film", "qb", "nfl", "lateround", "teams", "player", "develop", "cowboys", "size", "draft", "including", "tight", "jennings", "does", "sleepers", "room"], "summary": "Although the Dallas Cowboys have a robust history of finding diamonds in the rough in undrafted free agency, they’ve been a bit hit-or-miss when it comes to finding talent late in the draft.\nCurrently trending as a fifth-rounder, the Cowboys have shown interest in the small-school quarterback during the pre-draft process.\nListed at 6-4, 229 pounds with 9 3/4-inch hands, Morgan possesses coveted NFL size that translates to the field.\nMorgan does have a nasty tendency to drift back when holding the ball, which makes him very susceptible to edge pressure, but he shows promising pocket mobility to avoid interior pressure.\nUnfortunately, Robinson does appear to be tight in the hips, which is why he struggled with the agility drills at the combine."}, {"url": "https://oklahoman.com/article/5646316/oklahoma-business-briefs-for-nov-7-2019", "title": "Oklahoma business briefs for Nov. 7, 2019", "authors": [], "date": "2019-11-07", "keywords": ["ql", "oklahoma", "draw", "fund", "briefs", "business", "devon", "partners", "gas", "2019", "compression", "cotton", "gathering", "nov", "capital"], "summary": "Devon deal funds assetsDevon and QL Capital Partners have created a new partnership to fund natural gas gathering and compression assets owned by Devon in the its Delaware Basin “Cotton Draw” area, the companies announced.\nDevon will contribute its existing gas gathering and compression system there to Cotton Draw Midstream LLC, which Devon will operate as part of a management services agreement.\nAdditionally, it is dedicating 24,000 upstream acres to support the system's future growth.\nPer agreement terms, QL Capital Partners will provide $100 million initially to Devon and also pledges to fund the majority of incremental capital that will be needed to build out Cotton Draw Midstream’s assets the next several years."}, {"url": "https://oklahoman.com/article/5646362/what-to-do-in-oklahoma-on-nov.-7-2019-hear-rascal-flatts-at-tulsas-river-spirit-casino", "title": "What to do in Oklahoma on Nov. 7, 2019: Hear Rascal Flatts at Tulsa's River Spirit Casino", "authors": [], "date": "2019-11-07", "keywords": ["rascal", "tulsas", "hear", "river", "reviews", "newsoks", "spirit", "mcdonnellbrandy", "music", "nov", "read", "notched", "entertainment", "casino", "oklahoma", "flatts", "2019", "blog", "movies", "writes"], "summary": "Brandy McDonnellBrandy McDonnell, also known by her initials BAM, writes stories and reviews on movies, music, the arts and other aspects of entertainment.\nShe is NewsOK’s top blogger: Her 4-year-old entertainment news blog, BAM’s Blog, has notched more than 1... Read more ›"}, {"url": "https://www.kjrh.com/news/local-news/all-you-need-to-know-nov-12-elections-and-sample-ballots", "title": "All You Need To Know: Nov. 12 Election Results", "authors": [], "date": "2019-11-04", "keywords": ["works", "election", "information", "twitterlike", "12", "know", "vote", "sample", "need", "weather", "results", "view", "nov", "daily"], "summary": "Today, November 12, Green Country will be going to the polls to vote on several propositions.\nTo view November 12, 2019 Election Results, click here.\nBelow, 2 Works for You has compiled a list of sample ballots and important information you need to know:Click here to view all sample ballots.\nClick here to view Tulsa County Election Board \"All the Information You Need\".\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}, {"url": "https://lbmjournal.com/cameron-ashley-opens-topeka-distribution-center/", "title": "Cameron Ashley opens Topeka distribution center", "authors": [], "date": "2020-04-15", "keywords": ["distribution", "ashley", "customers", "manager", "kansas", "center", "city", "opens", "topeka", "glover", "cameron"], "summary": "Greenville, S.C. — Cameron Ashley Building Products, Inc. has opened its new Topeka, Kansas distribution center.\nTheir current distribution center in Kansas City, Kansas, has moved and reopened in Topeka as of April 15.\nDanny joined the company in December 2017, rising the ranks from distribution manager to district manager.\n“Cameron Ashley has continued to invest in their employees and company growth,” said Glover.\nIn December 2019, Cameron Ashley announced a new distribution center in Tulsa, Oklahoma."}, {"url": "https://www.kjrh.com/news/local-news/tpd-one-person-shot-in-northwest-tulsa-shooting", "title": "UPDATE: One person shot in Northwest Tulsa shooting", "authors": [], "date": "2019-12-29", "keywords": ["scene", "update", "suspect", "shooting", "shot", "northwest", "apartment", "person", "say", "tulsa", "saythe", "officers", "victim", "man"], "summary": "TULSA — Tulsa police arrested and booked a juvenile in connection to the Northwest Tulsa shooting Sunday morning.\nThe victim left the apartment in an attempt to get away from the suspect, but the suspect followed him outside and shot the victim.\nOfficers say the suspect left the scene, but after his mother and officers contacted him, he returned to the scene and surrendered himself.\nOfficers arrived at 746 North Osage Drive and learned a victim was shot in the torso, police say.\nWhile police were investigating the scene, a man crossed the yellow tape with his hands up, officers say."}, {"url": "https://www.dailyleader.com/2020/04/14/arthur-fredrick-oestmann/", "title": "Arthur Fredrick Oestmann - Daily Leader", "authors": [], "date": "2020-04-14", "keywords": ["art", "leader", "church", "husband", "arthur", "wife", "texas", "midland", "working", "work", "fredrick", "daily", "family", "oestmann"], "summary": "That night, Arthur Fredrick Oestmann was born to Arthur Diedrich Oestmann and Ida Wolff Oestmann.\nHe claimed he had the current record as the longest continually practicing geophysicist in Midland, working the Permian Basin from Midland since 1958.\nHe will be greatly missed by his family, his Church family and his many friends and associates.\nDonations may be sent in memory of Art Oestmann to Texas Children’s Offce of Philanthropy, Ste.\nPlease notate “In memory of Art Oestmann” in the memo line."}, {"url": "https://www.wbur.org/hereandnow/2019/12/24/tulsa-mass-graves-discovery", "title": "What Potential Mass Graves Discovery Means For Tulsa, Oklahoma", "authors": [], "date": "2019-12-24", "keywords": ["potential", "oklahoma", "means", "discovery", "suspected", "mass", "race", "massacre", "tulsas", "graves", "tulsa", "victims", "young", "speaks"], "summary": "In Tulsa, Oklahoma, scientists recently announced evidence that two sites in the city could be mass graves.\nThe community has long suspected there were mass graves of victims of the 1921 brutal race massacre in Tulsa's African American Greenwood section.\nHere & Now's Robin Young speaks with Phil Armstrong, project director at the Tulsa Race Massacre Centennial Commission."}, {"url": "https://journalrecord.com/2019/12/31/tulsa-okc-among-best-places-to-start-a-business/", "title": "Tulsa, OKC among best places to start a business", "authors": ["Janice Francis-Smith"], "date": "2019-12-31", "keywords": ["start", "best", "okc", "access", "login", "web", "business", "password", "site", "witt", "tulsa", "credentials", "email", "places", "subscriber", "user"], "summary": "Email Address: Password:Enter your user name and password in the fields above to gain access to the subscriber content on this site.\nYour subscription includes one set of login credentials for your exclusive use.\nTo inquire about group subscriptions for your organization please email Shaun Witt for special pricing.\nIf you feel your login credentials are being used by a second party, contact customer service at 877-615-9536 for assistance in changing your password.\nFor instructions on how to get premium web access, click here."}, {"url": "https://www.nytimes.com/2019/12/19/us/grandma-for-christmas.html", "title": "A Lonely Plea: ‘Anybody Need a Grandma for Christmas?’", "authors": ["Maria Cramer"], "date": "2019-12-19", "keywords": ["email", "department", "plea", "number", "christmas", "city", "coming", "anybody", "elder", "need", "families", "likely", "reported", "grandma", "lonely", "abuse"], "summary": "“At some point, the loneliness is coming at you like a train coming down the tracks.”For those with families, there can be other dangers.\nOlder adults are more likely to experience abuse around the holidays from someone they trust, according to the New York City Department for the Aging.\n“So far this year, there have been 1,623 cases reported to our elder abuse programs, displaying a pattern that must be changed,” said Lorraine Cortés-Vázquez, the department’s commissioner in an email.\n“I really thought the feeling would go away, but my heart is so broken,” she said in an email.\n“I couldn’t understand why people I don’t know were being so rude and hateful to me,” she said."}, {"url": "https://theblackwallsttimes.com/2019/12/06/black-entrepreneur-hosts-book-pop-up-shop-at-mother-road-market-in-tulsa-okla/", "title": "Black entrepreneur hosts book pop-up shop at Mother Road Market in Tulsa, Okla.", "authors": ["The Black Wall St Times"], "date": "2019-12-06", "keywords": ["entrepreneur", "books", "street", "shop", "book", "okla", "market", "wall", "mother", "tulsa", "hosts", "popup", "black", "road", "asamoacaesar", "color", "fulton"], "summary": "However, the legend of Black Wall Street is as real today as it was in its golden yesteryears.\nIn spite of those adverse challenges, seedlings of Black entrepreneurship continue to sprout within proximity to the geographical borders of America’s famed Black Wall Street.\nAsamoa-Caesar’s popup shop, and soon to be opening Fulton Street books, will boast books that inspire all children to fall in love with the everlasting gift of reading.\nWhile the finishing touches on her highly anticipated bookstore get complete, Asamoa-Caesar and her staff are hosting a pop-up shop at the Mother Road Market.\n“We are here today at Mother Road Market from 10 am to 10 pm for Fulton Street Books and Coffee Pop-up."}, {"url": "https://www.kjrh.com/news/local-news/holiday-travel-tips-from-tulsa-international-airport", "title": "Holiday Travel Tips From Tulsa International Airport", "authors": [], "date": "2019-12-16", "keywords": ["international", "carryon", "security", "travelers", "airport", "airlines", "located", "holiday", "checkin", "travel", "tulsa", "parking", "tips", "passengers"], "summary": "TULSA, OK – December 16, 2019 – Travelers are expected to begin their holiday journey this week, and officials at Tulsa International Airport are gearing up for the traditional Holiday rush.\nTravelers should also confirm their airline’s check-in procedure prior to coming to the airport.\nTravelers have several options for parking at the airportGarage/Covered Parking: The closest airport parking option at $12/day.\nEconomy Parking: Located behind the Clarion Inn, shuttles provide car side to curbside service at $8/day.\nTravelers should confirm their airline’s check-in procedure prior to coming to the airport."}, {"url": "https://theblackwallsttimes.com/2019/12/11/focus-black-oklahoma-set-to-launch-in-feb-2020-on-kwgs-89-5-fm/", "title": "‘Focus: Black Oklahoma’ set to launch in Feb. 2020 on KWGS 89.5 FM", "authors": ["The Black Wall St Times"], "date": "2019-12-11", "keywords": ["public", "oklahoma", "feb", "radio", "fm", "2020", "tricity", "collective", "launch", "set", "tulsa", "focus", "klar", "black", "895", "kwgs", "program"], "summary": "Tri-City Collective, Public Radio Tulsa, Tulsa Artist Fellowship and Tulsa Community Foundation launch event for ‘Focus: Black Oklahoma’ at the Tulsa Press Club in downtown Tulsa, Oklahoma on Tuesday, December 10, 2019.\nFocus: Black Oklahoma is an hour-long news and public affairs program, covering numerous topics relevant to Black Oklahomans.\nHe then added, “Also, the number of folks present [at the launch event] who work at Tulsa Public Schools (TPS) — or closely with — was really good to see.\nThe new radio program will broadcast on Tulsa’s KWGS 89.5 FM monthly from the Public Radio Tulsa studios on the University of Tulsa campus starting in February 2020.\nDonationsThe Tri-City Collective Fund is a component fund of the Tulsa Community Foundation."}, {"url": "https://www.kjrh.com/news/local-news/celebration-of-life-announced-for-allan-trimble", "title": "Celebration of Life announced for Allan Trimble", "authors": [], "date": "2019-12-02", "keywords": ["mabee", "foundation", "celebration", "support", "life", "legacy", "strong", "facebook", "jenks", "trimble", "announced", "family", "allan"], "summary": "JENKS — The Trimble Strong Foundation Facebook page announced Monday the date and time of Allan Trimble's celebration of life.\nTrimble's celebration of life will take place on Wednesday, December 4, 2019 at ORU's Mabee Center.\nThe posts says, \"In lieu of flowers, those who wish to honor coach's legacy or show support to his girls may donate to any of the following:-Allan Trimble Family Support Fund: A Care Account has been established for the Trimble Family at Arvest Bank.\n-Trimble Strong Foundation: ‪www.trimblestrong.org/donations‬-Golden Years: The Life and Legacy of Coach Allan Trimble, Join the community and show support by helping publish a coffee table book on the Legacy of Coach Trimble and Jenks Football.\nSelect from these options: Breaking News, Severe Weather, School Closings, Daily Headlines and Daily Forecasts."}]