[{"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-april-15-2020", "title": "Headlines for Wednesday, April 15, 2020", "authors": [], "date": "2020-04-15", "keywords": ["kan", "ap", "state", "2020", "kansas", "governor", "city", "court", "coronavirus", "headlines", "stayathome", "kelly", "15"], "summary": "Kansas Governor Extends Stay-at-Home Directive Until May 3TOPEKA, Kan. (AP) — Gov.\nKansas Governor Extends Stay-at-Home Order for Two WeeksTOPEKA, Kan. (KNS) — Kansas Governor Laura Kelly wants her statewide stay-at-home order to last another two weeks.\nGovernor Kelly has a regularly scheduled briefing on COVID-19 developments scheduled for 2 pm.\nThe Kansas City Star reports that Wilson considered an attack on the University of Kansas Hospital in Kansas City, Kansas, before settling on a plan to attack Belton Regional Medical Center.\nThe Kansas State Association of Fire Chiefs and Kansas State Firefighters Association demanded help Monday in a joint letter."}, {"url": "https://www.kshb.com/news/coronavirus/covid-19-outbreak-leaves-grim-unemployment-picture-in-kansas", "title": "COVID-19 outbreak leaves grim unemployment picture in Kansas", "authors": [], "date": "2020-04-08", "keywords": ["department", "unemployment", "week", "kansas", "received", "covid19", "picture", "grim", "claims", "past", "county", "leaves", "outbreak", "weeks", "residents"], "summary": "— Kansas spent nearly $15 million last week on unemployment, but that barely scratches the surface of the need amid the COVID-19 outbreak.\nLast week, Kansas provided benefits to 37,150 workers, a need more than four times greater than usual and growing.\nKansas adds fewer than 5,900 new unemployment claims in a typical three-week period from January to March during the past two years.\nMeanwhile, Kansas has gone from spending $3.5 million per week on unemployment claims on average to more than $14.8 million last week alone.\nThe Kansas City area has been particularly hard hit with unemployment claims, according to the Kansas Department of Labor."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-january-31-2020", "title": "Headlines for Friday, January 31, 2020", "authors": [], "date": "2020-01-31", "keywords": ["kan", "related", "ap", "2020", "kansas", "super", "city", "court", "bowl", "county", "headlines", "31", "woman"], "summary": "Kansas City, Kansas Company Pleads Guilty to Violating Clean Air ActTOPEKA, KAN. (KPR) – A company based in Kansas City, Kansas, has pleaded guilty to violating a federal clean air law.\n====================Kansas AG Sues over Counterfeit Chiefs, Super Bowl GearTOPEKA, Kan. (AP) — The top prosecutor in Kansas is suing over counterfeit Kansas City Chiefs and Super Bowl merchandise.\n====================Man Convicted in Triple Killing in Kansas City, KansasKANSAS CITY, Kan. (AP) — A 29-year-old man has been convicted in a triple homicide in a Kansas City, Kansas, duplex.\nThe Chiefs will appear in their first Super Bowl in 50 years when they play the San Francisco 49ers Sunday.\nWhat is traditionally the largest TV audience of the year will watch as Kansas City fans break into the “war chant\" and mimic tomahawk chop."}, {"url": "https://www.ksn.com/news/local/2-minor-injuries-reported-following-southeast-wichita-house-fire/", "title": "3 minor injuries following southeast Wichita house fire", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-01-24", "keywords": ["department", "s", "ksn", "southeast", "injuries", "tanks", "house", "wichita", "garage", "1900", "block", "following", "minor", "michelle"], "summary": "The Wichita Fire Department battled a house fire Friday, Jan. 24, 2020 in the 1900 block of S. Michelle.\n(KSN Photo)WICHITA, Kan. (KSNW) – The Wichita Fire Department said there were three minor injuries following a house fire Friday afternoon in southeast Wichita.\nThe fire started around 1 p.m. at a home located in the 1900 block South Michelle.\nChad Cox, Wichita Fire Department.\nThe Wichita Fire Department battled a house fire Friday, Jan. 24, 2020 in the 1900 block of S. Michelle."}, {"url": "https://www.ksn.com/top-stories/family-friends-hold-vigil-for-man-killed-in-double-homicide/", "title": "Family, friends hold vigil for man killed in double homicide", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-01-04", "keywords": ["vigil", "killed", "friends", "remember", "hold", "double", "support", "night", "homicide", "loved", "kirksey", "hotel", "wichita", "man", "held", "family"], "summary": "WICHITA, Kan. (KSNW) – The family of George Kirksey is in mourning after their loved one was killed in a shooting at a downtown Wichita hotel.\nFamily and friends held a vigil Friday night to remember him.\n“Always and forever.”A brother, son and father of three, the family said he was loved by all.\nFriends and family held a candlelight vigil Friday night to remember him.\n“To have that support, see that support it does make it easier it does help,” said Brianna."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-january-30-2020", "title": "Headlines for Thursday, January 30, 2020", "authors": [], "date": "2020-01-30", "keywords": ["kan", "public", "ap", "state", "2020", "kansas", "super", "city", "court", "abortion", "30", "headlines", "medicaid"], "summary": "====================Series of Small Earthquakes Rattles Central KansasMARION, Kan. (AP) — A series of four small earthquakes has rattled central Kansas this week.\n====================Man Fatally Shot in Pizza Hut in Kansas City, KansasKANSAS CITY, Kan. (AP) — Authorities say a man has been fatally shot at a Pizza Hut in Kansas City, Kansas.\n====================Body Found in Burning Car in WichitaWICHITA, Kan. (AP) — Authorities are investigating after a body was found in a burning car in Wichita.\nState Medicaid Director Todd Richardson cites improved public awareness about the severity of the opioid crisis.\nWhat is traditionally the largest TV audience of the year will watch as Kansas City fans break into the “war chant\" and mimic tomahawk chop."}, {"url": "https://www.ksn.com/news/crime/2-arrested-following-chase-in-sedgwick-county/", "title": "2 arrested following chase in Sedgwick County", "authors": ["Ksn News", "The Associated Press"], "date": "2020-01-06", "keywords": ["away", "kept", "jahnkeshe", "sedgwick", "arrested", "county", "watchful", "following", "suspects", "woman", "things", "wichita", "man", "chase"], "summary": "WICHITA, Kan. (KSNW) – A man and woman were arrested following a chase Monday in Sedgwick County.\nThe Sedgwick County Sheriff’s Office said they chased a pair of burglary suspects, and it ended near 34th and Ridge Road.\nLiz Jahnke’s watchful neighbor called police after seeing the suspects go into her home and then leave.\nThe suspects kept trying to drive away.\nNo one was injured, and an 18-year-old man and a 28-year-old woman are in custody."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-january-1-2020", "title": "Headlines for Wednesday, January 1, 2020", "authors": [], "date": "2020-01-01", "keywords": ["kan", "ap", "2020", "kansas", "city", "charged", "headlines", "say", "county", "death", "wichita", "reports"], "summary": "The Kansas City Star reports that 38-year-old Mollie Fitzgerald was arrested Tuesday by police in Olathe, Kansas.\nA relative says Patricia Fitzgerald was in the process of moving back to the Kansas City area after living in the Houston area for several decades.\n====================Missing 15-Year-Old Girl Rescued During Kansas Traffic StopGARDEN CITY, Kan. (AP) — Authorities have rescued a missing 15-year-old girl during a traffic stop in western Kansas.\n====================AG: Treatment, Funding Key to Kansas Criminal Justice ReformTOPEKA, Kan. (AP) — Kansas' top law enforcement official advocates higher spending on for the mentally ill and treating substance abuse.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-january-9-2020", "title": "Headlines for Thursday, January 9, 2020", "authors": [], "date": "2020-01-09", "keywords": ["kan", "murder", "ap", "shooting", "2020", "kansas", "governor", "city", "county", "headlines", "wichita", "guilty"], "summary": "The two men are accused of going to a crowded Kansas City, Kansas, bar in early October and opening fire.\nWyandotte County District Attorney Mark Dupree announced the upgraded charges Wednesday against Ismael Caballero in their deaths in Kansas City, Kansas.\nThe Kansas City Star reports that the Shawnee Mission School District in Johnson County, Kansas, agreed to settle in September, but the amount wasn't disclosed until it was approved this week.\n====================Wichita to Resume Chalking Tires After Temporary SuspensionWICHITA, Kan. (AP) — Wichita is reinstating the legally contested practice of marking tires with chalk to enforce parking rules.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://www.ksn.com/news/good-news/wichita-welcomes-two-new-years-babies-to-2020/", "title": "Wichita welcomes two New Year’s babies", "authors": ["Andrea Herrera", "Ksn News", "Emily Allen"], "date": "2020-01-02", "keywords": ["took", "blair", "hospital", "elisa", "morning", "hanning", "baby", "born", "wichita", "babies", "welcomes", "rhys"], "summary": "WICHITA, Kan. (KSNW) – Two Wichita couples are celebrating the start of the year with new babies.\nBaby Elisa was born at 5:25 Wednesday morning at Wesley Hospital.\nBut baby Elisa was not the only New Year’s baby in Wichita.\nHis name is Rhys Hanning.\nBoth Elisa and Rhys are the first of thousands of babies to be born in Wichita in 2020."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-january-13-2020", "title": "Headlines for Monday, January 13, 2020", "authors": [], "date": "2020-01-13", "keywords": ["kan", "ap", "state", "2020", "kansas", "senate", "city", "governor", "tafanelli", "headlines", "woman", "wichita", "13"], "summary": "====================Wichita Man Arrested in Alleged Abuse of 2-Month-Old TwinsWICHITA, Kan. (AP) — Wichita police say a 22-year-old man is in jail on suspicion of abusing his 2-month-old twins.\n====================Kansas Woman Pleads Guilty to Role in Son's DeathLEAVENWORTH, Kan. (AP) — A Kansas woman has pleaded guilty to involuntary manslaughter in connection with the 2018 death of her baby.\n====================Report: Kansas Farmers Plant Same Amount of Wheat AcreageWICHITA, Kan. (AP) — Kansas farmers seeded an estimated 6.9 million acres into winter wheat.\nKansas City now returns to the AFC championship game for the second consecutive season.\nKansas City lost lost 35-32 at Tennessee in Week 10."}, {"url": "https://www.ksn.com/news/local/protesters-fill-downtown-wichita-after-iraq-airstrike/", "title": "Protesters fill downtown Wichita after Iraq airstrike", "authors": ["Alexis Padilla", "Jasmine Haynes", "Angelica Castelo"], "date": "2020-01-05", "keywords": ["protest", "downtown", "war", "iraq", "airstrike", "zuercher", "wichita", "young", "protesters", "worried", "members", "family", "peace"], "summary": "WICHITA, Kan. (KSNW) – Chants could be heard throughout downtown Wichita Saturday afternoon.\n“We want peace in the Middle East!”More than 100 protesters gathered at Douglas and Broadway with signs in hand and megaphones ready to go.\nThey decided to host the event after the Iraq airstrike on Friday.\n“All of us here have family members in the military.\nWe do not want our family members returning."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-january-15-2020", "title": "Headlines for Wednesday, January 15, 2020", "authors": [], "date": "2020-01-15", "keywords": ["kan", "department", "hospital", "ap", "state", "2020", "kansas", "city", "headlines", "say", "wichita", "office", "15"], "summary": "(You can hear Governor Kelly's complete 2020 State of the State address and the Republican response by clicking here.)\nThe longtime Kansas City company was purchased by Switzerland-based Lindt & Sprungli in 2014.\nWichita office Charley Davidson said he expects Rader will be charged with first-degree murder in Maela's death.\n====================New Plates in Kansas Will Emphasize Renewable EnergyTOPEKA, Kan. (AP) — Kansas will begin issuing new personalized license plates Wednesday that emphasize the state's growth in using renewable energy.\nKansas Department of Revenue Secretary Mark Burghart says Kansas has become a leader in alternative energy."}, {"url": "https://www.ksn.com/news/police-arrest-wichita-man-on-suspicion-of-child-abuse/", "title": "Man arrested after police find infant injured, drugs in home", "authors": ["Ksn News", "The Associated Press"], "date": "2020-01-12", "keywords": ["rader", "suspicion", "west", "suffered", "investigation", "child", "arrested", "injured", "drugs", "infant", "wichita", "inside", "ksn", "man", "tell"], "summary": "WICHITA, Kan. (KSNW) – The Wichita Police Department arrested 25-year-old Brietan Rader, of Wichita, on suspicion of child abuse, child endangerment, and several other drug-related charges.\nAuthorities responded to the 3600 block of West 13th Street North on Friday around 8:30 p.m.Police tell KSN News a 9-month-old girl suffered critical injuries.\nPolice tell KSN News that an investigation was initiated because of an incident that happened inside the apartment complex, eventually leading to the arrest Rader.\nDuring the investigation, officers discovered a marijuana grow operation inside the apartment.\nPolice say Rader is not the father of the injured girl."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-january-2-2020", "title": "Headlines for Thursday, January 2, 2020", "authors": [], "date": "2020-01-02", "keywords": ["kan", "officer", "ap", "state", "near", "2020", "kansas", "plane", "city", "headlines", "wichita", "reports"], "summary": "====================Kansas Taxes Nearly $39 Million More Than Anticipated in DecemberTOPEKA, Kan. (AP) — Kansas is reporting that it collected nearly $39 million more in taxes than expected in December.\nThe Kansas City Star reports that 38-year-old Mollie Fitzgerald was arrested Tuesday by police in Olathe, Kansas.\nA relative says Patricia Fitzgerald was in the process of moving back to the Kansas City area after living in the Houston area for several decades.\n====================AG: Treatment Funding Key to Kansas Criminal Justice ReformTOPEKA, Kan. (AP) — Kansas' top law enforcement official advocates higher spending on for the mentally ill and treating substance abuse.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-january-17-2020", "title": "Headlines for Friday, January 17, 2020", "authors": [], "date": "2020-01-17", "keywords": ["kan", "ap", "state", "2020", "kansas", "governor", "city", "headlines", "17", "say", "wichita", "kelly", "man"], "summary": "====================Advocates' Hopes High as Kansas Heads for Medical Pot DebateTOPEKA, Kan. (AP) — Kansas lawmakers expect this year to have their most serious debate so far on medical marijuana.\nA Kansas State University spokeswoman said Layne Mays was enrolled there through the fall 2019 semester but was not enrolled for the upcoming spring semester.\nJohnson is charged in the death of Shavar Walker, of Kansas City, who was shot outside a Leavenworth apartment complex.\n====================Wichita Man Charged in Death of Man Whose Body Is MissingWICHITA, Kan. (AP) — A Wichita man has been charged with second-degree murder in the death of a man whose body is still missing.\n====================Hit-and-Run Driver Critically Injures Pedestrian in KansasKANSAS CITY, Kan. (AP) — Authorities say a hit-and-run driver has critically injured a pedestrian in Kansas City, Kansas."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-january-23-2020", "title": "Headlines for Thursday, January 23, 2020", "authors": [], "date": "2020-01-23", "keywords": ["kan", "ap", "state", "2020", "kansas", "court", "abortion", "charged", "headlines", "23", "supreme", "man", "states"], "summary": "====================Kansas Supreme Court Dismisses Lawsuit over Court FundingTOPEKA, Kan. (AP) — Kansas' top court has dismissed a lawsuit over funding for the state's court system filed by six trial-court judges against the Republican-controlled Legislature.\nThe Supreme Court added that it must make a good-faith effort not to encroach on the Legislature's power over budget matters.\n====================67-Year-Old and 14-Year-Old Killed in Northeast Kansas CrashOTTAWA, Kan. (AP) — Authorities say two people have been killed in a northeast Kansas crash.\n====================Wichita Man Charged in Death of 2-Month-Old SonWICHITA, Kan. (AP) — A Wichita man is charged with first-degree murder in the death of his 2-month-old son.\n====================Missouri Man Charged with Killing Man as He Walked His DogKANSAS CITY, Mo."}, {"url": "https://www.ksn.com/news/local/kansas-grand-jury-returns-indictments-in-project-guardian-gun-cases/", "title": "Kansas Grand jury returns indictments in ‘Project Guardian’ gun cases", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-01-28", "keywords": ["indictments", "project", "possession", "grand", "fine", "drug", "federal", "gun", "count", "attorney", "occurred", "prison", "guardian", "cases", "kan", "returns", "jury", "kansas", "unlawful"], "summary": "WICHITA, Kan. (KSNW) – A grand jury in Wichita returned two indictments Tuesday charging federal gun crimes under the Justice Department’s new initiative called Project Guardian, U.S. Attorney Stephen McAllister said.\n“We are working closely with our law enforcement partners to investigate and prosecute gun crimes as part of Project Guardian,” U.S. Attorney Stephen McAllister said.\nIf convicted, he could face a penalty of not less than 10 years in federal prison and a fine up to $10 million.\nIf convicted, he could face a penalty of not less than 10 years in federal prison and a fine up to $10 million.\nIf convicted, she could face up to 10 years in federal prison and a fine up to $250,000."}, {"url": "https://www.ksn.com/news/local/crews-battle-house-fire-near-harry-and-topeka/", "title": "Family displaced after a house fire in south Wichita", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-01-07", "keywords": ["department", "family", "1600", "wont", "watch", "south", "topeka", "house", "wichita", "able", "crews", "displaced", "wichitafiredept", "winterhouse"], "summary": "WICHITA, Kan. (KSNW) – The Wichita Fire Department put out a house fire in the 1600 block south of Topeka.\nAccording to the Wichita Fire Department, crews were able to see flames coming from the home when they arrived.\n“The damage is fairly significant, and some people are going to be displaced.\nHouse fire in the 1600 blk of S Topeka Ave. Fire was visible on arrival.\n#icttraffic #ictfire pic.twitter.com/rSzDxk00Uc — WichitaFireDept (@WichitaFireDept) January 7, 2020LATEST STORIES:"}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-january-3-2020", "title": "Headlines for Friday, January 3, 2020", "authors": [], "date": "2020-01-03", "keywords": ["kan", "officials", "ap", "state", "2020", "kansas", "million", "city", "charged", "headlines", "water", "man"], "summary": "(–earlier reporting–)Chemical Spill in River Shuts Down Humboldt Water PlantHUMBOLDT, Kan. (AP) — A southeast Kansas town is operating without its water plant after a chemical spill in a nearby river.\nOfficials said the water in the city's water tower is safe but there is a limited supply.\n====================Kansas Taxes Nearly $39 Million More than Anticipated in DecemberTOPEKA, Kan. (AP) — Kansas is reporting that it collected nearly $39 million more in taxes than expected in December.\n====================Paroled Kansas Killer Charged in Another HomicideWICHITA, Kan. (AP) — A convicted Kansas killer has been charged with another homicide just months after he was released on parole.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-saturday-march-21-2020", "title": "Headlines for Saturday, March 21, 2020", "authors": [], "date": "2020-03-21", "keywords": ["kan", "officials", "state", "2020", "21", "kansas", "city", "health", "coronavirus", "close", "county", "headlines", "covid19"], "summary": "On the other side of the state, Jackson County officials said a woman in her 80s had died.\nQuoting Labor Secretary Delía García, who spoke Friday, the Kansas City Star reports that more than 11,300 claims were filed this week.\nThe Kansas City Star reported the policy applies to restaurants with liquor licenses, bars, clubs, farm wineries, micro-breweries, micro-distilleries and liquor stores.\nThe Kansas City Star reported the policy applies to restaurants with liquor licenses, bars, clubs, farm wineries, micro-breweries, micro-distilleries and liquor stores.\nCounty health officials announced last week a woman associated with the college tested positive for the COVID-19 virus."}, {"url": "https://www.dcourier.com/news/2020/apr/15/obituary-gerald-paul-couch/", "title": "Obituary: Gerald Paul Couch", "authors": [], "date": "2020-04-15", "keywords": ["gerald", "kansas", "life", "weekly", "paul", "jerry", "air", "wichita", "judy", "couch", "theresa", "strategic", "obituary"], "summary": "On Friday, April 10, 2020, Gerald Paul Couch passed away at the age of 77 after a battle with pulmonary fibrosis.\nJerry was born on July 9, 1942, to Paul and Theresa Couch.\nJerry was then transferred to Plattsburg Strategic Air Command in New York.\nIt was here he met the love of his life, Judy Mageean.\nJerry was preceded in death by his father, Paul; mother, Theresa and sister, Betty."}, {"url": "https://www.argusmedia.com/en/news/2094957-us-fe-scrap-imports-rise-metallics-fall-in-february", "title": "Argus Media", "authors": [], "date": "2020-04-08", "keywords": ["prior", "publisher", "marketsnotice", "single", "argus", "site", "whatsoever", "written", "purpose", "prices", "media", "reproduce"], "summary": "illuminating the markets®Notice: By accessing this site you agree that you will not copy or reproduce any part of its contents (including, but not limited to, single prices, graphs or news content) in any form or for any purpose whatsoever without the prior written consent of the publisher."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-february-24-2020", "title": "Headlines for Monday, February 24, 2020", "authors": [], "date": "2020-02-24", "keywords": ["kan", "ap", "state", "2020", "kansas", "city", "county", "headlines", "24", "wichita", "death", "man", "missouri"], "summary": "Ex-Kansas Governor Colyer Endorses Rep. Marshall in U.S. Senate RaceTOPEKA, Kan. (AP) — Former Kansas GOP Gov.\n====================Kansas Lawmakers Consider Changing Rules to Public Offender RegistryTOPEKA, Kan. (AP) — Kansas lawmakers are considering making changes to the criminal public offender registry system and cut back on penalties.\n====================Kansas Lawmakers Reject Lower Penalties on Pot PossessionTOPEKA, Kan. (AP) — Kansas legislators aren't ready to declare that marijuana possession never should be a felony.\nThe Kansas attorney general's office said Monday that Lamonte McIntyre of Kansas City, Kansas, also received a certificate of innocence as part of a resolution of a mistaken-conviction lawsuit filed last year.\nThe Kansas City Star says the incident happened Friday morning in downtown Kansas City."}, {"url": "https://www.ksn.com/news/local/numerous-crashes-reported-around-wichita-area-due-to-winter-weather/", "title": "Numerous crashes reported around Wichita area due to winter weather", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-02-20", "keywords": ["willis", "west", "crashes", "street", "area", "salt", "saltsand", "mixture", "weather", "winter", "20", "wichita", "reported", "road", "numerous"], "summary": "WICHITA, Kan. (KSNW) – Numerous crashes were reported around the Wichita area early Thursday morning due to the winter weather that moved through the area overnight.\nOne crash involving multiple cars happened on westbound Kellogg at West Street around 7 a.m.\nTraffic is being diverted off of WB Kellogg following a multi-car crash near the West Street exit.\npic.twitter.com/sa236fD88J — Carly Willis (@CarlyWillisKSN) February 20, 2020A little after midnight last night we began applying heavy salt/sand mixture.\nWeather is improving and crews will continue responding with salt sand mixture."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-february-19-2020", "title": "Headlines for Wednesday, February 19, 2020", "authors": [], "date": "2020-02-19", "keywords": ["kan", "hit", "ap", "near", "2020", "kansas", "city", "guard", "school", "headlines", "19", "children", "killed"], "summary": "In his letter, Murguia, who is based in Kansas City, Kansas, said it has become clear that he could no longer serve effectively on the federal court.\n====================Crossing Guard Killed Protecting Children Lauded as HeroKANSAS CITY, Kan. (AP) — The son of a school crossing guard who was struck and killed in Kansas City, Kansas, described his father as “selfless.\"\nThe driver of a black sedan that hit the guard was taken to a hospital, but no children were hurt.\n====================Deadly Topeka Hit-and-Run Victim Identified as 41-Year-OldTOPEKA, Kan. (AP) — The victim of a deadly hit-and-run in Topeka has been identified as a 41-year-old man.\nThe Kansas City Star reports that it's not unusual for governments to file claims for damages and costs after traffic crashes."}, {"url": "https://www.ksn.com/news/local/injury-accident-in-west-wichita-sends-two-to-hospital/", "title": "Crash in west Wichita sends two to hospital", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-02-21", "keywords": ["supposed", "west", "shop", "governor", "struggling", "crash", "wondering", "statewide", "stayathome", "wichita", "small", "kelly", "sends", "hospital"], "summary": "WICHITA, Kan. (KSNW) - Governor Laura Kelly has pushed back the statewide stay-at-home order to May 3.\nIt was supposed to end Sunday.\nGovernor Kelly said she made the move because Kansas has not hit it's projected peak of the coronavirus.\nThe announcement has already struggling small business owners wondering if they can hang on just a little longer.\nBarber Marvin Oakley Jr. was anxiously counting down the days until he could reopen his barber shop to service his clients and restore his livelihood."}, {"url": "https://www.aerotechnews.com/blog/2020/04/08/news-briefs-april-8-2020/", "title": "News Briefs – April 8, 2020", "authors": [], "date": "2020-04-08", "keywords": ["spirit", "continue", "briefs", "2020", "taliban", "military", "afghan", "health", "statement", "employees", "killed", "company"], "summary": "The Taliban’s statement issued April 5 warned of more violence if the U.S. and the Afghan government continue alleged violations of the deal.\nIn December, the Estonian defense ministry said the United States has allocated $175 million in military aid to the Baltic countries of Estonia, Latvia and Lithuania for 2020.\nThe temporary layoffs apply to Spirit employees associated with the company’s Boeing commercial program.\nIt includes Spirit employees in San Antonio and in Tulsa and McAlester locations in Oklahoma.\nOther workers at Spirit will continue as they have been, including those associated with military and non-Boeing work."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-february-25-2020", "title": "Headlines for Tuesday, February 25, 2020", "authors": [], "date": "2020-02-25", "keywords": ["kan", "ap", "2020", "kansas", "25", "city", "person", "county", "headlines", "say", "death", "authorities", "man"], "summary": "The Kansas attorney general's office said Monday that Lamonte McIntyre of Kansas City, Kansas, also received a certificate of innocence as part of a resolution of a mistaken-conviction lawsuit filed last year.\n====================Kansas Lawmakers Reject Lower Penalties on Pot PossessionTOPEKA, Kan. (AP) — Kansas legislators aren't ready to declare that marijuana possession never should be a felony.\n====================Wichita Police Arrest 18-Year-Old Accused of Killing His 21-Year-Old BrotherWICHITA, Kan. (AP) — Authorities have arrested an 18-year-old in the deadly shooting of his brother in Wichita.\n====================Fired School Worker in Kansas City Blames Bosses for Faked DataKANSAS CITY, Mo.\nFormer Central Middle School secretary LaQuyn Collier told The Kansas City Star that she gave administrators “exactly what they said they needed.\""}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-february-28-2020", "title": "Headlines for Friday, February 28, 2020", "authors": [], "date": "2020-02-28", "keywords": ["kan", "officer", "28", "ap", "state", "2020", "kansas", "court", "city", "headlines", "died", "man", "missouri"], "summary": "====================Police Investigate Deadly Shooting in Central TopekaTOPEKA, Kan. (AP) — Topeka police say a 19-year-old man died in a shooting in central Topeka.\n(AP) — A Kansas man is charged with second-degree murder in a shooting death during the weekend in Sedalia.\nDaniel Fernandez, of Kansas City, Kansas, is accused of killing Robert Fox Jr. on Saturday.\nSedalia police say detectives established Fox owed money to someone in Kansas City, Kansas, stemming from illegal activity.\n====================Lawsuit Filed in Kansas City Against Boy Scouts of America Moves to Federal LevelKANSAS CITY, Mo."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-saturday-february-22-2020", "title": "Headlines for Saturday, February 22, 2020", "authors": [], "date": "2020-02-22", "keywords": ["kan", "22", "election", "ap", "2020", "kansas", "business", "city", "county", "headlines", "case", "man", "parents"], "summary": "Kansas Business Groups Mobilize to Stop Local Plastics BansTOPEKA, Kan. (AP) — Kansas business groups have mobilized to snuff out a budding movement among a few cities to ban single-use plastic bags and straws.\n===============4th Congressional Candidate Announces Bid for Kansas 3rd DistrictLEAWOOD, Kan. (AP) — A former engineering firm executive is running for the Kansas congressional seat in the Kansas City area.\nBeehler is a former vice president of Kansas City engineering firm Burns & McDonnell and is the fourth Republican in the race.\nIt offered no explanation, but the announcement came one day after The Kansas City Star reported about the case.\nFred Sherman was appointed deputy election security commissioner for 2020 and will become Johnson County election commissioner by January 4, 2021."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-february-21-2020", "title": "Headlines for Friday, February 21, 2020", "authors": [], "date": "2020-02-21", "keywords": ["kan", "ap", "state", "2020", "21", "kansas", "city", "star", "county", "headlines", "asbestos", "reports", "authorities"], "summary": "Beehler is a former vice president of Kansas City engineering firm Burns & McDonnell and is the fourth Republican in the race.\n====================Kansas Business Groups Mobilize to Stop Local Plastics BansTOPEKA, Kan. (AP) — Kansas business groups have mobilized to snuff out a budding movement among a few cities to ban single-use plastic bags and straws.\nIt offered no explanation, but the announcement came one day after The Kansas City Star reported about the case.\nThe Kansas City Star reports that Jordan Denny, of Olathe, was sentenced Thursday for drug charges.\n(The Kansas City Star) — An African American medical technician at a Kansas City hospital alleges in a lawsuit that a white employee called him “boy\" and referred to a black co-worker as “Aunt Jemima.\""}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-february-14-2020", "title": "Headlines for Friday, February 14, 2020", "authors": [], "date": "2020-02-14", "keywords": ["kan", "lawsuit", "ap", "state", "2020", "kansas", "court", "city", "mo", "headlines", "filed", "missouri", "14"], "summary": "-Related-McClatchy Has 30 Papers in 14 States, Operations ContinueUNDATED (AP) - McClatchy, which has filed for bankruptcy protection, operates 30 newspapers in 14 states.\n====================Democrats Sue over Kansas Delay in Start of 'Vote Anywhere'TOPEKA, Kan. (AP) — Kansas and national Democratic Party groups have sued the Republican official who oversees the state's elections.\n====================Gun Maker Files for Bankruptcy Following Kansas City LawsuitKANSAS CITY, Mo.\nIt alleges the gun trafficking created a public nuisance in Kansas City, which has one of America's highest homicide rates.\n====================Judge: Kansas City Officer Justified in Death of Unarmed ManKANSAS CITY, Mo."}, {"url": "https://weather.com/safety/winter/news/2020-02-27-kansas-snow-stripe-seen-from-airplane-satellites", "title": "Narrow Kansas Snow Stripe Could Be Seen From Planes and Satellites", "authors": [], "date": "2020-02-27", "keywords": ["narrow", "satellites", "pencilthin", "satellite", "kansas", "snow", "stripe", "snowband", "weather", "seen", "planes", "band"], "summary": "<img class=\"styles__noscript__2rw2y\" src=\"https://s.w-x.co/util/image/w/ks-snow-swath-close-26feb20.jpg?v=at&w=485&h=273\" srcset=\"https://s.w-x.co/util/image/w/ks-snow-swath-close-26feb20.jpg?v=at&w=485&h=273 400w, https://s.w-x.co/util/image/w/ks-snow-swath-close-26feb20.jpg?v=ap&w=980&h=551 800w\" > Kansas snow stripe up close High-resolution visible satellite image of the narrow Kansas snow stripe on Feb. 26, 2020.\n(NASA Worldview)At a Glance A narrow band of heavy snow blanketed parts of Kansas on Tuesday.\n<img class=\"styles__noscript__2rw2y\" src=\"https://s.w-x.co/util/image/w/ks-snow-stripe-radar-25feb20.gif?v=at&w=485&h=273\" srcset=\"https://s.w-x.co/util/image/w/ks-snow-stripe-radar-25feb20.gif?v=at&w=485&h=273 400w, https://s.w-x.co/util/image/w/ks-snow-stripe-radar-25feb20.gif?v=ap&w=980&h=551 800w\" > Kansas snow stripe radar history Radar loop from Feb. 24 - 25, 2020, showing the development of the narrow band of heavy snow over parts of Kansas.\nSatellite images showed the pencil-thin snow stripe virtually bisecting a part of the Sunflower State.\n<img class=\"styles__noscript__2rw2y\" src=\"https://s.w-x.co/util/image/w/ks-snow-stripe-26feb20-nasa.gif?v=at&w=485&h=273\" srcset=\"https://s.w-x.co/util/image/w/ks-snow-stripe-26feb20-nasa.gif?v=at&w=485&h=273 400w, https://s.w-x.co/util/image/w/ks-snow-stripe-26feb20-nasa.gif?v=ap&w=980&h=551 800w\" > The Kansas snow stripe shrinks This GOES-East visible satellite loop shows the stripe of Kansas snow cover, denoted by black arrows, gradually shrunk on Feb. 26, 2020, as temperatures warmed above freezing."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-saturday-february-8-2020", "title": "Headlines for Saturday, February 8, 2020", "authors": [], "date": "2020-02-08", "keywords": ["kan", "ap", "2020", "kansas", "hilyard", "training", "meter", "sexual", "county", "headlines", "wichita", "parking"], "summary": "Kansas Anti-abortion Amendment FailsTOPEKA, Kan. (AP) — Republican lawmakers in Kansas have failed to get a proposed anti-abortion amendment to the state constitution on the ballot.\n===============WSU Tech Offers Free Scholarships to Laid-off Spirit WorkersWICHITA, Kan. (AP) — WSU Tech in Wichita is offering free scholarships to laid-off Spirit AeroSystems employees.\n===============KC Chiefs Fan: Took 'NFL Hit' in Parking Meter CollisionKANSAS CITY, Mo.\nEven Mahomes checked in on Twitter, asking “Yo is the dude who hit the parking meter okay.\"\n===============5 Guards Injured at Hutchinson Correctional FacilityHUTCHINSON, Kan. (AP) — State prison officials say five correctional officers were injured during a disturbance at the Hutchinson Correctional Facility this week."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-sunday-february-9-2020", "title": "Headlines for Sunday, February 9, 2020", "authors": [], "date": "2020-02-09", "keywords": ["kan", "2020", "kansas", "turnpike", "city", "fires", "dugo", "headlines", "plastic", "wichita", "reports", "mph"], "summary": "Wichita Considers Banning, Taxing Plastic BagsWICHITA, Kan. (AP) — The city of Wichita is considering banning plastic bags or implementing a city-wide tax to curb their use.\nThe Wichita Eagle reports that the City Council voted for a new task force to consider reducing or eliminating single-use plastic bags.\nEither option would make Wichita the first city in Kansas to pass a plastic bag ordinance.\n===============Hutchinson Man Killed in Kansas Turnpike CrashBELLE PLAINE, Kan. (AP) — Authorities say a Hutchinson man was killed in a crash on the Kansas Turnpike in south-central Kansas.\nThe Kansas Turnpike Authority says the crash happened Friday afternoon, when the southbound car 58-year-old Gilberto Benitez-Garcia was driving went off the road near Belle Plaine."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-february-6-2020", "title": "Headlines for Thursday, February 6, 2020", "authors": [], "date": "2020-02-06", "keywords": ["kan", "ap", "2020", "kansas", "city", "abortion", "headlines", "parade", "house", "wichita", "car", "man"], "summary": "Earlier reporting...Vote to Put Abortion Measure on Kansas Ballot Seen as CloseTOPEKA, Kan. (AP) — Kansas legislators are expecting a close vote on a measure aimed at preserving their power to regulate abortion.\n====================Body Found in Cowley County Likely that of Wichita Murder VictimWICHITA, Kan. (AP) - Wichita police say they believe a body found in Cowley County is that of a 50-year-old homicide victim from Hutchinson.\n(AP) — A Kansas man charged with the Nebraska collision deaths of four Iowa motorcyclists has taken a plea deal.\nProsecutors on Thursday charged 42-year-old Addae Doyle, of Kansas City, Kansas, with resisting arrest, possession of a controlled substance and misdemeanor driving while intoxicated.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-february-12-2020", "title": "Headlines for Wednesday, February 12, 2020", "authors": [], "date": "2020-02-12", "keywords": ["kan", "lawsuit", "ap", "12", "state", "2020", "kansas", "city", "headlines", "say", "wichita", "reports", "man"], "summary": "The AP reports that former staffers, including two doctors, accuse Rea of conducting medical experimentation on fragile and dependent residents - without their consent.\n====================Wichita Police Investigate Four Overdoses Last WeekendWICHITA, Kan. (AP) — Wichita police are investigating whether four overdose cases last weekend involve Oxycodone embedded with fentanyl.\n====================Kansas City Man Convicted in Shooting that Killed MissionaryKANSAS CITY, Mo.\n(AP) — A Kansas City man has been convicted of killing a Christian missionary from China and wounding two others while high on PCP.\n====================Judge Throws Out Lawsuit over Arrest at Kansas City LibraryKANSAS CITY, Mo."}, {"url": "https://www.cjonline.com/sports/20200220/kansas-wrestling-coaches-association-rankings-feb-20-2020-update", "title": "Kansas Wrestling Coaches Association rankings, Feb. 20, 2020 update", "authors": ["Brent Maycock"], "date": "2020-02-20", "keywords": ["wrestling", "update", "feb", "2020", "kansas", "association", "coaches", "20", "rankings"], "summary": ""}, {"url": "https://www.hutchnews.com/ZZ/obituaries/20200213/betty-barker", "title": "Betty Barker", "authors": [], "date": "2020-02-13", "keywords": ["leatherman", "morton", "betty", "2020", "church", "wichitabetty", "christ", "born", "barker", "pratt"], "summary": "WICHITA - Betty Lorraine (Leatherman) Barker, 90, was born August 9, 1929 in St. John, the third of seven daughters born to Chester and Pansy (Gariss) Leatherman, and died Tuesday, February 11, 2020 at her home in Wichita.\nBetty BarkerWICHITA - Betty Lorraine (Leatherman) Barker, 90, was born August 9, 1929 in St. John, the third of seven daughters born to Chester and Pansy (Gariss) Leatherman, and died Tuesday, February 11, 2020 at her home in Wichita.\nOn May 2, 1954, Betty married Morton Barker in Pratt.\nBetty was a faithful member of the Pratt Church of Christ.\nSurvivors include: her husband of 65 years, Morton Barker; sister, Connie (Dr. Larry) Ball of St. John; children, Sue (Dr. Randy) Beech of Andover, Frank (Robin) Barker of Decatur, Alabama, Leisa (Chris) Kinnin of Shawnee and Jim (Amy) Barker of Greenwood, Arkansas; seven grandchildren; six great grandchildren with another on the way; as well as numerous dearly loved nieces, nephews and friends."}, {"url": "https://www.ksn.com/news/local/multiple-wrecks-reported-due-to-winter-weather/", "title": "Multiple wrecks reported due to winter weather", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-02-12", "keywords": ["clean", "multiple", "seneca", "12", "wrecks", "kansas", "crash", "macarthur", "county", "weather", "winter", "wichita", "reported", "ksn"], "summary": "SALINA, Kan. (KSNW) – Multiple wrecks are being reported around the area and on I-135 north of Wichita due to winter weather.\nIn McPherson County around 7:30 a.m., Kansas Highway Patrol Trooper Ben Gardner said McPherson County deputies worked a rollover crash at mile marker 68 southbound.\nTroopers also responded to a crash on the northbound side at mile marker 65 involving a pickup and semi.\nHere in Wichita around 8 a.m., two crashes were reported at the intersection of Seneca and MacArthur.\npic.twitter.com/ejvR0036Pi — Carly Willis (@CarlyWillisKSN) February 12, 2020Here is the other non-injury accident at Seneca and MacArthur."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-february-11-2020", "title": "Headlines for Tuesday, February 11, 2020", "authors": [], "date": "2020-02-11", "keywords": ["kan", "ap", "state", "2020", "kansas", "city", "headlines", "plastic", "say", "wichita", "federal", "man", "11"], "summary": "====================Wichita Police Investigate Four Overdoses Last WeekendWICHITA, Kan. (AP) — Wichita police are investigating whether four overdose cases last weekend involve Oxycodone that may have contained fentanyl.\n====================Judge Dismisses Lawsuit over Arrest at Kansas City LibraryKANSAS CITY, Mo.\n====================About 300 Animals Removed from Kansas City HomeKANSAS CITY, Mo.\n(AP) — Kansas City officials are removing about 300 small animals from a Kansas City duplex.\n====================Wichita Woman Charged with Federal Sex TraffickingWICHITA, Kan. (AP) — A Wichita woman has been charged with sex trafficking in federal court."}, {"url": "https://www.ksn.com/entertainment/kiss-brings-the-end-of-the-road-tour-to-wichita-february-19/", "title": "KISS brings The End of the Road Tour to Wichita Feb. 19", "authors": ["Kelli Kennedy", "Associated Press", "Andrew Dalton", "Jake Coyle"], "date": "2019-11-14", "keywords": ["brings", "available", "feb", "rock", "tour", "local", "end", "19", "worldwidelatest", "wwwintrustbankarenacomkisskiss", "wichita", "wwwkissonlinecom", "road", "nov", "kiss"], "summary": "WICHITA, Kan. (KSNW) – Rock n roll legends KISS announced the last legs of their final tour, the END OF THE ROAD TOUR.\nThe rock group will be in Wichita on Feb. 19, 2020.\nTickets go on sale Friday, Nov. 22 at 10 a.m. Tickets start at $39.50.\nMore information is available at www.intrustbankarena.com/kissKISS Meet & Greet Experiences will be available Tuesday, November 19 at 10 a.m. local time through 10pm local time at kissonline.com.\nKISS Army fan club presales will begin Wednesday, Nov. 20 at 10 a.m. local time until Thursday, November 21 at 10 p.m. local time."}, {"url": "https://www.ksn.com/news/local/friends-remember-homicide-victim-found-under-wichita-bridge/", "title": "Friends remember homicide victim found under Wichita bridge", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-02-15", "keywords": ["volunteer", "morning", "remember", "friends", "staff", "social", "bernard", "breakthrough", "homicide", "say", "bridge", "wichita", "woodard", "victim", "came"], "summary": "WICHITA, Kan. (KSNW) – Friends of 59-year-old Bernard Woodward, who was found dead under a Wichita bridge, are describing the lasting impact he had on them.\n“I would say good morning Bernard he would say good morning ma’am,” said RoxAnne Romey, a staff member at Breakthrough Episcopal Social Services.\nAll who came in contact with Woodard say he was a light and joy to work with.\nWhen police identified the man found beaten to death under the Douglas Street Bridge as Woodard, it confirmed their worst fears.\n“I hope that they catch the person that’s responsible for this in a timely fashion,” said RoxAnne Romey, Breakthrough staff member."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-february-10-2020", "title": "Headlines for Monday, February 10, 2020", "authors": [], "date": "2020-02-10", "keywords": ["kan", "sentenced", "ap", "state", "2020", "kansas", "city", "headlines", "say", "house", "wichita", "federal"], "summary": "Neither side expected Friday's vote in the Kansas House to be the last word on whether the abortion measure ultimately is put to a vote in a statewide election.\n====================Police: High-Speed Crash in Kansas City Kills WomanKANSAS CITY, Mo.\n(AP) — Police in Kansas City say a woman has died in a fiery crash on state Highway 169.\nFrom there, one of the victims was transported to the University of Kansas Hospital in Kansas City, Kansas.\n====================Wichita Woman Charged with Federal Sex TraffickingWICHITA, Kan. (AP) — A Wichita woman has been charged with sex trafficking in federal court."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-march-31-2020", "title": "Headlines for Tuesday, March 31, 2020", "authors": [], "date": "2020-03-31", "keywords": ["kan", "ap", "state", "pandemic", "2020", "kansas", "governor", "city", "coronavirus", "headlines", "31", "wichita", "missouri"], "summary": "Also Monday, the Kansas City Star reports a nursing home in eastern Kansas has 18 confirmed cases among staff and residents.\nThe Life Care Center in Burlington is part of a chain that includes a home in Kansas City, Kansas, where the state's first COVID-19 death was reported.\n==========Kansas Businessman Enters GOP Senate PrimaryKANSAS CITY, Kan. (AP) — Kansas businessman Bob Hamilton is running as a Republican for the soon-to-be open U.S. Senate in Kansas.\nElections for Missouri governor, lieutenant governor, secretary of state, treasurer and attorney general are scheduled for November 3.\n==========K-State Brings Back Ex-Player Southwell as Assistant CoachMANHATTAN, Kan. (AP) — Kansas State brought back former player Shane Southwell as an assistant basketball coach."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-march-17-2020", "title": "Headlines for Tuesday, March 17, 2020", "authors": [], "date": "2020-03-17", "keywords": ["kan", "officials", "ap", "state", "2020", "kansas", "city", "coronavirus", "county", "headlines", "17", "online", "cases"], "summary": "=======================UPDATE: Kansas Has 18 Cases; Casinos Close; 3 Universities OnlineTOPEKA, Kan. (AP) — Kansas is now reporting 18 confirmed cases of the coronavirus.\n(–earlier reporting–)COVID-19 Case Total Continues to Climb StatewideKansas is now reporting 17 confirmed cases of the coronavirus.\nOthers said such decisions are best made by mayors, county officials or school boards who are more closely in touch with their communities.\nOnly those with official state business will be allowed inside (lawmakers, staff, state officials and members of the news media).\nValeo is among several city, state and private organizations that make up Topeka's Homeless Task Force."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-march-20-2020", "title": "Headlines for Friday, March 20, 2020", "authors": [], "date": "2020-03-20", "keywords": ["kan", "ap", "state", "week", "2020", "kansas", "city", "coronavirus", "health", "county", "headlines", "20", "covid19"], "summary": "UPDATE: Kansas COVID-19 Cases Increase to 44TOPEKA, Kan. (KPR) - Kansas health officials say the number of confirmed COVID-19 cases has risen to 44.\n====================Kansas Lawmakers Approve Transportation Plan Seen as Economic StimulusTOPEKA, Kan. (AP) — Kansas legislators have approved a new, 10-year transportation program.\nThe Kansas City Star reported the policy applies to restaurants with liquor licenses, bars, clubs, farm wineries, micro-breweries, micro-distilleries and liquor stores.\n=====================Johnson County Community College Hires New PresidentOVERLAND PARK, Kan. (AP) — Johnson County Community College has hired a new president.\nElsewhere, the Douglas County Health Officer announced that public gatherings of more than 10 people will be prohibited in the county until April 1."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-march-18-2020", "title": "Headlines for Wednesday, March 18, 2020", "authors": [], "date": "2020-03-18", "keywords": ["kan", "cases", "ap", "state", "2020", "kansas", "city", "coronavirus", "health", "headlines", "18", "workers", "states"], "summary": "__________Kansas Governor Bans Home and Business Evictions Until May 1TOPEKA, Kan. (AP) — Kansas Gov.\nJeff Morris, a spokesman for Hollywood Casino in Kansas City, Kansas, said, \"We are not aware of any confirmed cases of COVID-19 among our team members.\"\nThe Kansas City Star reports that the party still plans to hold its primary on May 2.\nValeo is among several city, state and private organizations that make up Topeka's Homeless Task Force.\n1 in Final AP Poll; Gonzaga, Dayton NextLAWRENCE, Kan. (AP) — Kansas has finished the season No."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-march-25-2020", "title": "Headlines for Wednesday, March 25, 2020", "authors": [], "date": "2020-03-25", "keywords": ["kan", "ap", "state", "stay", "2020", "kansas", "25", "city", "coronavirus", "county", "headlines", "residents", "orders"], "summary": "The Unified Government of Wyandotte County and Kansas City, Kansas, announced Tuesday night that the latest victim is a man in his 70s who tested positive for COVID-19 last week.\nTwo other deaths had been reported previously in the Kansas City area.\nThe Kansas City Star reports that FBI spokeswoman Bridget Patton said the person who was shot died at a hospital.\n==========Bill Braum, Ice Cream and Burger Chain Founder, Dead at 92OKLAHOMA CITY (AP / KPR) — The Braum's Ice Cream company says its founder, Bill Braum, has died.\n==========K-State's 2nd-Leading Scorer Cartier Diarra Leaves SchoolMANHATTAN, Kan. (AP) — Kansas State University guard Cariter Diarra is leaving the basketball program with the intention of turning professional."}, {"url": "https://www2.ljworld.com/news/state-region/2020/mar/19/kansas-k-12-tests-cancelled-wichita-officials-quarantined/", "title": "Kansas Republicans continue effort to curb Democratic governor’s power amid pandemic", "authors": [], "date": "2020-03-19", "keywords": ["amid", "republicans", "coronavirus", "days", "leaders", "coverage", "curb", "pandemic", "continue", "power", "kelly", "effort", "state", "kansas", "emergency", "resolution", "legislative", "governors", "democratic"], "summary": "Kelly declared a state of emergency last week, and without the resolution, it would have expired March 27.\nBut the resolution also requires legislative leaders to review all of Kelly’s executive orders and allows them to overturn many of them within days.\nDemocrats said requiring legislative leaders’ oversight is workable, though they were frustrated that conservatives moved to curb Kelly’s power.\nAt least 34 people have tested positive for the coronavirus in Kansas, according to the state health department.\nMore coverage: Coronavirus (COVID-19) As the pandemic continues, the Journal-World will be making coverage of COVID-19 available outside of the paywall on LJWorld.com."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-march-30-2020", "title": "Headlines for Monday, March 30, 2020", "authors": [], "date": "2020-03-30", "keywords": ["kan", "ap", "state", "pandemic", "order", "2020", "kansas", "coronavirus", "30", "county", "headlines", "stayathome", "cases"], "summary": "Earlier reporting...Kansas Stay-at-Home Rule Allows Religious Worship, Gun SalesTOPEKA, Kan. (AP) — All 2.9 million Kansas residents are under a stay-at-home order imposed by Democratic Governor Laura Kelly.\nIt took effect early today (MON) as the numbers of confirmed coronavirus cases and COVID-19-related deaths surged past 300 this past weekend.\nCampaign events are now on hold because of the coronavirus pandemic.\nThe number of coronavirus cases confirmed in Missouri rose by 65 on Sunday to 903, but the 8% jump was smaller than the average 45% daily increase during the previous week.\nInstead, most of the country is on lock-down amid the coronavirus pandemic."}, {"url": "https://www.theguardian.com/sport/2020/mar/27/katie-swan-tennis-aside-coronavirus-kansas", "title": "Katie Swan puts tennis aside to help coronavirus relief effort in Kansas", "authors": ["Kevin Mitchell"], "date": "2020-03-27", "keywords": ["live", "coronavirus", "kids", "know", "going", "house", "player", "aside", "effort", "swan", "relief", "help", "packages", "helping", "kansas", "tennis", "katie", "wimbledon", "puts"], "summary": "For the past fortnight, they have been sorting tinned food and other necessities in their garage, ready for distribution.\nShe has been going to the supermarket pretty much every day for the past two weeks, buying loads of groceries.\nSome of them have loads of kids, [including] a family of 15 who live in one house.\n“I go to the club to practise a couple of hours a day, then come home to do my fitness.\nIf everyone does their best to stay hygienic, follow the guidelines, then hopefully Wimbledon has a chance of going ahead."}, {"url": "https://www2.ljworld.com/news/state-government/2020/mar/17/kansas-now-reporting-at-least-17-cases-of-covid-19/", "title": "Kansas reporting at least 18 cases of COVID-19 in state", "authors": [], "date": "2020-03-17", "keywords": ["officials", "university", "state", "reporting", "kansas", "city", "health", "county", "wichita", "covid19", "18", "announced", "cases"], "summary": "Health officials reported the first cases in Douglas County, home to the University of Kansas; Miami County, south of the Kansas City metropolitan area; and Ford County, in southwest Kansas.\nKansas health officials said 16 of the cases involve Kansas residents.\nThe state’s casinos are in Kansas City, Pittsburg, Dodge City and Mulvane.\nThat comes after Kansas State University and Wichita State University both made a similar announcement Monday.\nKansas State said it is cancelling graduation ceremonies at its Manhattan and Polytechnic campuses, while Wichita State said its spring graduation was postponed."}, {"url": "https://www.hutchnews.com/ZZ/obituaries/20200328/dorothy-jane-hill-yoder", "title": "Dorothy Jane Hill-Yoder", "authors": [], "date": "2020-03-28", "keywords": ["hillyoder", "janie", "hill", "hutchinson", "dorothy", "school", "jane", "wichita", "moats", "ks", "haven"], "summary": "HAVEN - Dorothy Jane Hill-Yoder, 83, died March 27, 2020 at her home in Wichita, KS.\nShe was born September 5, 1936 in Hutchinson, KS., the daughter of Russell and Dorothy (Finfrock) Haines.\nDorothy Jane Hill-YoderHAVEN - Dorothy Jane Hill-Yoder, 83, died March 27, 2020 at her home in Wichita, KS.\nShe was born September 5, 1936 in Hutchinson, KS., the daughter of Russell and Dorothy (Finfrock) Haines.\nDue to concerns with the coronavirus, a private family burial will be Wednesday at Laurel Cemetery in Haven, KS."}, {"url": "https://www.ksn.com/news/local/offender-death-reported-at-wichita-work-release-facility/", "title": "Offender death reported at Wichita Work Release Facility", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-03-26", "keywords": ["department", "kansas", "release", "facility", "death", "wichita", "reported", "possession", "kdoc", "work", "offender"], "summary": "WICHITA, Kan. (KSNW) – The Kansas Department of Corrections said a Wichita Work Release Facility offender Chares Rist died Wednesday, March 25, 2020.\nRist, 54, was pronounced dead by the on-call doctor at Susan B. Allen Memorial Hospital at approximately 11:33 a.m.\nThe official cause of death is pending an autopsy but is not believed to be COVID-19 related.\nPer protocol when an offender dies in the custody of the Kansas Department of Corrections (KDOC) the death is under investigation by the KDOC and the Kansas Bureau of Investigation.\nThe Wichita Work Release Facility, a satellite unit of the Winfield Correctional Facility, is an all-male, minimum-custody state prison with a population of 250."}, {"url": "https://www.kshb.com/news/coronavirus/live-blog-kc-metro-covid-19-updates-for-march-19", "title": "March 19 blog: Sedgwick County reports 1st COVID-19 cases", "authors": [], "date": "2020-03-19", "keywords": ["elementary", "kansas", "sedgwick", "city", "school", "1st", "county", "blog", "19", "blue", "reports", "covid19", "positive", "missouri", "cases"], "summary": "9:46 p.m. | Sedgwick County announced its first positive COVID-19 case Thursday evening, according to NBC affiliate KSN.\nAs of 3/19/20Confirmed #COVID19 cases in #KansasCity @KCMO residents:6 people-(3 males, 3 females)Age range: 30s to 60sAll recovering at home.\n1:55 p.m. | The Kansas City, Missouri, City Hall will be closed Friday “for a major deep cleaning” in response to the coronavirus pandemic.\n11:37 a.m. | Wyandotte County has now confirmed eight positive cases of COVID-19, an increase from the seven cases it reported on Wednesday.\nMike Parson tweeted an update Thursday morning with an update on COVID-19 cases announced Wednesday night."}, {"url": "https://www.ksnt.com/capitol-bureau/kansas-lawmakers-vote-to-extend-unemployment-benefits-while-coronavirus-spreads/", "title": "Kansas lawmakers vote to extend unemployment benefits while coronavirus spreads", "authors": ["Alec Gartner", "Lindley Lund"], "date": "2020-03-18", "keywords": ["saidthe", "closing", "insurance", "extend", "unemployment", "vote", "ohaebosim", "kansas", "spreads", "benefits", "coronavirus", "representative", "lawmakers", "wichita", "bill", "hoheisel"], "summary": "TOPEKA, Kan. (KSNT) – House members unanimously passed a bill Tuesday that extends the amount of time Kansans can be on unemployment.\nThe bill would increase the length of time you can collect unemployment insurance from the current 16 weeks to 26 weeks.\n“It’s more imperative now that we do this, that we provide certainty to the families of Kansas,” sponsor of the bill, Wichita Representative Nick Hoheisel, said.\n“There is a ripple effect here, if you have one industry closing, other industries are closing as well,” Wichita Representative KC Ohaebosim said.\nIn Kansas, the average weekly benefit of unemployment insurance is $398, but that can vary from person to person."}, {"url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/wesley-medical-center-adds-new-restrictions-for-visitors/", "title": "Wesley Medical Center adds new restrictions for visitors", "authors": ["Alexis Padilla", "Jhovani Carrillo", "Angelica Castelo"], "date": "2020-03-22", "keywords": ["surgery", "patients", "wesley", "center", "visitors", "voloch", "allow", "adds", "visitor", "wichita", "wesly", "restrictions", "exceptions", "medical"], "summary": "WICHITA, Kan. (KSNW) – On Saturday, Wesly Medical Center announced they will no longer allow visitors on their ICU or Acute care buildings, this will be in effect Monday, March 23, 2020.\n“We will still have some exceptions to that– for pediatrics, for the NICU, for laboring mom we’ll allow one visitor and for anyone having surgery, obviously, our surgery patients need to have a ride home, so they will still be allowed to have a visitor,” said Bill Voloch CEO for Wesley Medical Center.\nVoloch said other exceptions include patients who are close to the end-of-life.\nHe is urging people to self-quarantine if people’s symptoms aren’t too severe.\nHe added that people should continue to social distance themselves."}, {"url": "https://www.columbian.com/news/2020/apr/13/abortion-clinics-pandemic-boosts-demand-heightens-stress/", "title": "Abortion clinics: Pandemic boosts demand, heightens stress", "authors": ["David Crary", "Ap National Writer"], "date": "2020-04-13", "keywords": ["stress", "demand", "pandemic", "clinics", "women", "abortion", "weve", "abortions", "heightens", "texas", "wichita", "clinic", "boosts", "ban", "states"], "summary": "NEW YORK — The coronavirus outbreak has fueled attempts to ban abortions in some states, but providers where the procedure remains available report increased demand, often from women distraught over economic stress and health concerns linked to the pandemic.\n“The calls we’ve been getting are frantic,” said Julie Burkhart, who manages clinics in Wichita, Kansas, and Oklahoma City.\nDr. Allison Cowett of Family Planning Associates in Chicago said one recent patient was a teen who drove from Texas with her mother.\nIn Atlanta, Dr. Marissa Lapedis said her clinic accommodated a woman who received her initial abortion consultation in Texas but flew to Georgia when the Texas ban postponed a second visit to receive the abortion pill.\nAn influx of women from Texas contributed to the upsurge of abortions at Burkhart’s clinic in Wichita."}, {"url": "https://www2.ljworld.com/news/ku/2020/mar/17/ku-moves-classes-online-for-entire-spring-semester-commencement-status-still-undecided/", "title": "KU moves classes online for entire spring semester; commencement status still undecided", "authors": [], "date": "2020-03-17", "keywords": ["bichelmeyer", "ku", "undecided", "commencement", "semester", "moves", "students", "housing", "entire", "university", "girod", "facilities", "gatherings", "classes", "campus", "online", "spring", "kansas", "status"], "summary": "Girod and Bichelmeyer said KU had not yet decided the status of its May commencement ceremonies.\n“It’s worth waiting a bit longer and monitoring developments before we make a decision on this tradition.”On Monday, Haskell University, Kansas State University and Wichita State University were among Kansas colleges that moved all courses online and canceled spring graduation ceremonies.\nAlso in KU’s announcement was a mandate to significantly reduce the number of students in university housing.\n“This is a very hard decision, but one that is necessary to protect the health of students,” Girod and Bichelmeyer said.\nIt is important to note that KU students currently cannot return to university facilities to get their belongings."}, {"url": "https://townline.org/obituaries-for-thursday-april-9-2020/", "title": "OBITUARIES for Thursday, April 9, 2020", "authors": ["Website Editor"], "date": "2020-04-08", "keywords": ["winslow", "away", "passed", "2020", "husband", "enjoyed", "wife", "school", "massachusetts", "obituaries", "maine", "waterville"], "summary": "GERALD E. CARVERWINSLOW – Gerald E. Carver, 82, passed away unexpectedly at his home, in Winslow, on Wednesday, March 18, 2020.\nGLORIA POULIOTTEWATERVILLE – Gloria Pouliotte, 95, a long-time resident of Waterville, passed away on Wednesday March 18, 2020 in Tallahassee, Florida.\nPRISCILLA L. FENNELLALBION – Priscilla Lillian (Perry) Fennell, 93, passed away Monday, March 23, 2020, at her home, in Albion.\nSISTER MARY PETER BACHANDWATERVILLE – Sister Mary Peter Bachand o.s.u., 94, of Waterville, passed away peacefully on Wednesday March 24, 2020, at Northern Light Inland Hospital.\nJOYCE BUSHEYOAKLAND – Joyce Bushey, 84, of Oakland, passed away on Wednesday, April 1, 2020, at Woodlands Memory Care, of Lewiston."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-march-2-2020", "title": "Headlines for Monday, March 2, 2020", "authors": [], "date": "2020-03-02", "keywords": ["kan", "happened", "ap", "state", "2020", "kansas", "city", "crash", "headlines", "say", "died", "man"], "summary": "(AP) — A Kansas City, Kansas, man has been arrested in connection with a deadly shooting in a popular Kansas City entertainment district that killed one person and injured four others.\nPolice said a gunman fired shots from a white sport utility vehicle traveling in the Westport district in midtown Kansas City, Missouri.\n(AP) — Kansas City police say a man who died during a police chase last week was a murder suspect.\nPolice said Monday that Wilkins was a suspect in the Feb. 23 death of Antonio Smith in Kansas City.\n1 in Top 25; Baylor Down 2 Spots to 4thUNDATED (AP) — Kansas is the unanimous No."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-sunday-march-15-2020", "title": "Headlines for Sunday, March 15, 2020", "authors": [], "date": "2020-03-15", "keywords": ["public", "kan", "hospital", "ap", "state", "2020", "kansas", "city", "health", "county", "headlines", "schools", "15"], "summary": "_____Kansas Health Officials: 8th Case of COVID-19 ConfirmedOTTAWA, Kan. (AP) — Kansas health officials have confirmed the state's eighth case of COVID-19.\nThe Kansas State High School Activities Association canceled the 2020 state basketball tournaments, marking the first time since 1907 that a state champion won't be crowned.\nThe University of Kansas, Kansas State University, Emporia State and Wichita State have decided to hold all classes in cyberspace once students return from spring break.\n====================Pedestrian Dies After Being Struck by Train in Kansas City, KansasKANSAS CITY, Kan. (AP) — A pedestrian died after being struck by a train while trying to cross train tracks in Kansas City, Kansas.\nPolice in Kansas City, Kansas, say the crash happened shortly after midnight Sunday in southwestern Kansas City."}, {"url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/sedgwick-county-events-that-have-been-canceled/", "title": "Events that have been canceled or postponed", "authors": ["Alexis Padilla", "Jhovani Carrillo", "Angelica Castelo"], "date": "2020-03-13", "keywords": ["spring", "public", "community", "events", "postponed", "closings", "sedgwick", "county", "break", "canceled"], "summary": "The K-State Research and Extension – Sedgwick County has postponed/canceled several events that are listed here.\nWichita Symphony – Postpones March 14 & 15 concerts following Sedgwick County Ban over COVID-19 concernsIntrust Bank Arena – All March events are already suspended/postponed.\nOther events are postponed or suspended.\nEvents scheduled as part of Spring Break Carnival are canceled.\nAll garden club meetings, spring break activities, tours and story time are canceled."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-march-16-2020", "title": "Headlines for Monday, March 16, 2020", "authors": [], "date": "2020-03-16", "keywords": ["kan", "public", "16", "state", "ap", "2020", "kansas", "city", "health", "coronavirus", "county", "headlines", "hospital"], "summary": "Earlier reporting...Kansas Health Officials: 8th Case of COVID-19 ConfirmedOTTAWA, Kan. (AP) — Kansas health officials have confirmed the state's eighth case of COVID-19.\nThe University of Kansas, Kansas State University, Emporia State and Wichita State have decided to hold all classes in cyberspace once students return from spring break.\n====================Pedestrian Dies After Being Struck by Train in Kansas City, KansasKANSAS CITY, Kan. (AP) — A pedestrian died after being struck by a train while trying to cross train tracks in Kansas City, Kansas.\nPolice in Kansas City, Kansas, say the crash happened shortly after midnight Sunday in southwestern Kansas City.\n(AP) — Kansas City police say the December death of a 2-year-old girl has been ruled a homicide."}, {"url": "https://www.ksn.com/news/power-outage-reported-in-ne-wichita/", "title": "Power outage reported in NE Wichita", "authors": ["Jasmine Haynes", "Alexis Padilla", "Nexstar Media Wire"], "date": "2020-03-06", "keywords": ["supposed", "shop", "governor", "power", "struggling", "wondering", "statewide", "kelly", "stayathome", "outage", "wichita", "reported", "small", "ne"], "summary": "WICHITA, Kan. (KSNW) - Governor Laura Kelly has pushed back the statewide stay-at-home order to May 3.\nIt was supposed to end Sunday.\nGovernor Kelly said she made the move because Kansas has not hit it's projected peak of the coronavirus.\nThe announcement has already struggling small business owners wondering if they can hang on just a little longer.\nBarber Marvin Oakley Jr. was anxiously counting down the days until he could reopen his barber shop to service his clients and restore his livelihood."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-march-5-2020", "title": "Headlines for Thursday, March 5, 2020", "authors": [], "date": "2020-03-05", "keywords": ["kan", "sentenced", "ap", "state", "2020", "kansas", "court", "city", "school", "headlines", "say", "man"], "summary": "Kelly Issues Disaster Declaration over Fire RiskTOPEKA, Kan. (AP) — Kansas Gov.\nAfter Lamonte McIntyre's conviction for a double murder was vacated in 2017, he sued the Unified Government of Wyandotte County / Kansas City, Kansas, and police officers involved in the investigation.\nMcIntyre and his mother allege Kansas City, Kansas, police conducted a sloppy investigation and he was framed because his mother refused one officer's sexual demands.\nThe Kansas City Star reports English was a school system security guard before joining the Kansas City, Kansas, School District's independent police unit in 2015.\n2 seed in the NAIA national tournament scheduled for Friday and Saturday in Park City, Kansas."}, {"url": "https://toofab.com/2020/03/17/american-idol-recap-5th-judge-hollywood-week-genre-challenge-fan-favorite-sent-home/", "title": "American Idol 5th Judge: Huge Fan-Favorite Gets Boot After First Round in Hollywood", "authors": ["Toofab Staff"], "date": "2020-03-17", "keywords": ["right", "judge", "idol", "hollywood", "incredible", "voice", "gets", "5th", "round", "note", "ca", "song", "hes", "american", "really", "boot", "fanfavorite", "huge", "result", "performance"], "summary": "It's an all new Hollywood Week on \"American Idol\" with rounds the contestants have never seen before in two decades of this show.\nResult: InLauren Spencer-SmithPop (16, Vancouver Island, Canada) This viral video star has an incredible voice and proved absolutely effortless on one of Kelly Clarkson's most iconic anthems.\nHe's one who needs nerves training more than vocal training as he's really got a rich, genuine sound.\nThe right song on the right singer can create a magical moment, and this was Amber's moment to shine and she was so very bright.\nIt was an incredible performance."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-march-4-2020", "title": "Headlines for Wednesday, March 4, 2020", "authors": [], "date": "2020-03-04", "keywords": ["kan", "sentenced", "ap", "shooting", "2020", "kansas", "city", "headlines", "wichita", "prison", "federal", "man"], "summary": "McIntyre and his mother allege Kansas City, Kansas, police conducted a sloppy investigation and he was framed because his mother refused one officer's sexual demands.\n====================KCK Police: 2 Killed in Fatal ShootingAuthorities are investigating after two people were killed in a Kansas City, Kansas, shooting.\n====================Topeka Police: 18-Year-Old Arrested in Deadly ShootingTOPEKA, Kan. (AP) — Authorities have arrested an 18-year-old in a deadly Topeka shooting.\n(AP) — A Kansas City, Kansas, man has been arrested in connection with a deadly shooting in a popular Kansas City entertainment district that killed one person and injured four others.\nPolice said a gunman fired shots from a white sport utility vehicle traveling in the Westport district in midtown Kansas City, Missouri."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-march-13-2020", "title": "Headlines for Friday, March 13, 2020", "authors": [], "date": "2020-03-13", "keywords": ["officials", "ap", "state", "2020", "kansas", "city", "coronavirus", "county", "headlines", "death", "man", "hospital", "13"], "summary": "The Kansas State High School Activities Association announced that the 2020 state basketball tournaments have been canceled without make-up, marking the first time since 1907 that a state champion won't be crowned.\nAlong with all the other major breaking news stories on Thursday, the Big 12 Basketball Tournament in Kansas City was canceled.\nKansas City Mayor Quinton Lucas made the announcement Thursday, shortly after organizers cancelled a St. Patrick's Day parade.\nThe University of Kansas, Kansas State University, Emporia State and Wichita State have decided to hold all classes in cyberspace once students return from spring break.\nKansas officials, and officials at other state capitols, are urging the public to stay away while they work."}, {"url": "https://www.usatoday.com/story/entertainment/celebrities/2020/03/17/coronavirus-cancellations-entertainment-rolling-stones-black-widow-snl-james-bond/5070289002/", "title": "CMA Fest, 'Ghostbusters: Afterlife,' Burning Man join coronavirus postponements", "authors": ["Usa Today Staff", "Published P.M. Et March"], "date": "2020-03-17", "keywords": ["shows", "postponed", "tour", "coronavirus", "join", "dates", "film", "ghostbusters", "music", "burning", "date", "cma", "festival", "afterlife", "postponements", "man", "fest", "scheduled", "announced"], "summary": "On Tuesday, CMA Fest announced it would cancel this year's music festival in downtown Nashville.\nSony Pictures' entire summer-movie slate is the latest to join a slew of music, film and TV postponements, and major international events that have also had to adjust their schedules to the pandemic.\nGovernors Ball Music FestivalOn March 26, the Governors Ball Music Festival announced it was canceling.\nCannes Film FestivalCannes Film Festival will not take place this May in the South of France, festival organizers announced Thursday on Twitter.\nSomething in the WaterPharrell Williams' Virginia music festival was pushed back until April 2021 \"after much consideration.\""}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-march-3-2020", "title": "Headlines for Tuesday, March 3, 2020", "authors": [], "date": "2020-03-03", "keywords": ["kan", "ap", "shooting", "state", "2020", "kansas", "city", "headlines", "say", "death", "prison", "man"], "summary": "KCK Police: 2 Killed in Fatal ShootingKANSAS CITY, Kan. (AP) — Authorities are investigating after two people were killed in a Kansas City, Kansas, shooting.\n====================2 More Kansas State Football Players Arrested, Both on Pot ChargesMANHATTAN, Kan. (AP) — Two Kansas State football players are facing marijuana possession charges.\n(AP) — A Kansas City, Kansas, man has been arrested in connection with a deadly shooting in a popular Kansas City entertainment district that killed one person and injured four others.\nPolice said a gunman fired shots from a white sport utility vehicle traveling in the Westport district in midtown Kansas City, Missouri.\n(AP) — Kansas City police say a man who died during a police chase last week was a murder suspect."}, {"url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/coronavirus-in-kansas-wichita-takes-steps-to-reduce-community-impact/", "title": "Coronavirus in Kansas: Wichita takes steps to reduce community impact", "authors": ["Alexis Padilla", "Jhovani Carrillo", "Angelica Castelo"], "date": "2020-03-13", "keywords": ["impact", "taking", "community", "information", "events", "postponed", "help", "kansas", "city", "coronavirus", "health", "wichita", "reduce", "steps", "takes"], "summary": "WICHITA, Kan. (KSNW) – The City of Wichita is taking preemptive measures to help ensure the health and wellbeing of Wichita residents, visitors, and employees during the coronavirus.\nThe City of Wichita is committed to taking the necessary, appropriate actions to keep our community and employees safe.\nAfter much deliberation, the city is taking steps recommended by the CDC and the Sedgwick County Health Department to help reduce the impact of Coronavirus in our community.\nPlease consult the CDC website for up-to-date information before making decisions about attending city programs and classes and other community activities.\nBelow are links to resources for information related to COVID-19 and steps from the CDC to help prevent illness."}, {"url": "https://www2.ljworld.com/news/state-region/2020/mar/13/after-kansas-1st-coronavirus-death-more-cancellations/", "title": "Owner of facility tied to Kansas death runs Washington nursing home; first case identified outside KC metro", "authors": [], "date": "2020-03-13", "keywords": ["nursing", "officials", "metro", "state", "symptoms", "kansas", "city", "health", "owner", "kc", "county", "runs", "outside", "washington", "tied", "wichita", "weeks", "identified"], "summary": "Life Care Center of Kansas City referred all calls to another phone number whose voicemail box was full.\nThe Church of the Resurrection in the Kansas City suburb of Leawood, Kansas, is among the churches canceling services.\nThe Kansas City Star reported that Leawood closed its City Hall on Friday after a possible coronavirus exposure.\nUniversities and colleges, including the University of Kansas and Kansas State, are moving their classes online.\nThe Kansas State High School Activities Association has canceled the 2020 state basketball tournaments."}, {"url": "https://www.ksn.com/news/local/state-and-county-to-host-a-real-id-event-in-wichita/", "title": "State and county to host REAL ID event in Wichita", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-03-05", "keywords": ["sign", "license", "state", "id", "kansas", "sedgwick", "proof", "event", "county", "identification", "real", "wichita", "residents", "host"], "summary": "Sample of REAL ID Compliant Kansas State Drivers License.\n(Courtesy | ksreveune.orgWICHITA, Kan. (KSNW) – The Kansas Department of Revenue has partnered with Sedgwick County Government to help county employees and residents get their REAL ID.\nBeginning October 1, 2020, anyone 18 years and older will need a REAL ID-compliant identification, which could be either the license or identification card with the REAL ID inscription, passport, or military identification card.\nThe event in Sedgwick County will be held March 10 and 11 at the Sedgwick County Extension Center, 7001 W. 21st Street.\nIt will be for people who only wish to obtain their REAL ID."}, {"url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/second-person-tested-for-coronavirus-in-kansas/", "title": "Second person tested for Coronavirus in Kansas", "authors": ["Alexis Padilla", "Jhovani Carrillo", "Angelica Castelo"], "date": "2020-03-01", "keywords": ["department", "symptoms", "second", "negative", "kansas", "person", "coronavirus", "health", "covid19", "tested", "kdhe", "puis"], "summary": "WICHITA, Kan. (KSNW) – The Kansas Department of Health and Environment (KDHE) says they tested a second person for the novel coronavirus in Kansas on Friday.\n“A new person under investigation (PUI) was identified Friday.\nHowever, the person has since tested negative for COVID-19.\nSince the virus began, Kansas has had two PUIs, both of whom tested negative for COVID-19,” said Kristi Zears, Director of Communications for the Kansas Department of Health and Environment.\nAccording to KDHE, people who have been diagnosed with the COVID-19 are reporting symptoms like; coughing, fever, and difficulty breathing."}, {"url": "https://www.ksn.com/news/local/crews-rush-to-house-fire-in-south-wichita/", "title": "Morning house fire claims life of Wichita man", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-03-08", "keywords": ["scene", "wichitathe", "morning", "person", "life", "south", "claims", "died", "house", "wichita", "unknown", "visible", "victim", "man"], "summary": "WICHITA, Kan. (KSNW) – A man has died following an early morning house fire in south Wichita.\nThe call for a house fire in the 2100 block of South Saint Francis near Clark came into Sedgwick County dispatch at around 8:55 a.m. Sunday morning.\nWichita fire crews on scene say smoke and flames were visible upon arrival.\nThey did not appear to suffer from any burns but they were rendered medical aid on the scene.\nThat person died at the scene for unknown reasons."}, {"url": "https://www.kfdi.com/2020/03/30/list-of-cancellations-due-to-coronavirus/", "title": "Nothing found for 2020 03 30 List Of Cancellations Due To Coronavirus", "authors": [], "date": "2020-03-30", "keywords": ["younothing", "using", "cancellations", "wrong", "2020", "provided", "site", "coronavirus", "30", "03", "went", "maybe", "location", "search", "list", "snap"], "summary": "Something went wrong here.\nMaybe we can still help you.\nNothing could be found at this location.\nYou can search our site using the form provided below"}, {"url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/conversation-with-wichita-mayor-brandon-whipple-on-covid-19/", "title": "Conversation with Wichita Mayor Brandon Whipple on COVID-19", "authors": ["Craig Andres", "Alexis Padilla", "Jhovani Carrillo", "Angelica Castelo"], "date": "2020-03-15", "keywords": ["quier", "zero", "women", "ton", "covid19", "didnt", "visitors", "uncertainty", "mayor", "brandon", "whipple", "conversation", "wichita", "world", "weeks"], "summary": "WICHITA, Kan. (KSNW) - Tabitha Quier is one of the many women getting ready to add to the world, during a time when the coronavirus is taking many things away.\n\"I'm a first time mom, so there's so much uncertainty anyway,\" she said.\nQuier is due in just a couple weeks, her biggest concern is the limited support.\n\"I didn't plan on having a ton of visitors right at first.\nAfter the baby was born, but I really didn't want zero,\" said Quier."}, {"url": "https://www.ksn.com/news/local/crews-investigating-house-fire-in-far-east-wichita/", "title": "Crews investigating house fire in far east Wichita", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2020-03-01", "keywords": ["scene", "far", "started", "supervisor", "ridder", "house", "wichita", "garage", "wichitafireorg", "east", "crews", "investigating"], "summary": "WICHITA, Kan. (KSNW) – City fire crews battled a fire in a large house in far east Wichita early Sunday morning.\nSedgwick County dispatchers said the first call came at 7:18 a.m. Sunday in the area of 159th Street and East Central.\nA Wichita Fire supervisor on scene told KSN the fire started in the attached garage and was contained because of a fast response.\nWichita Fire crews at the scene of a fire in an attached garage in the area of 159th St. and East Central.\nhttps://t.co/yHZvIeA3gw pic.twitter.com/dnISdmuBzk — WichitaFire.org (@wichitafireorg) March 1, 2020LATEST STORIES:"}, {"url": "https://www2.ljworld.com/news/general-news/2020/mar/12/as-other-tournaments-cancel-state-basketball-tourney-to-continue-and-will-allow-fans/", "title": "As other tournaments cancel, Kansas high school basketball tourney continues, will allow fans", "authors": [], "date": "2020-03-12", "keywords": ["tournaments", "fans", "state", "teams", "tourney", "high", "kansas", "school", "allow", "basketball", "tournament", "statement", "wichita", "cancel", "spectators", "play", "team", "continues"], "summary": "photo by: Carter GaskinsUpdated story • Kansas high school basketball tournament canceled after completing quarterfinal roundHigh school state basketball tournaments are taking place and will allow spectators despite the growing concern over the new coronavirus, organizers of the tournament announced Thursday.\nThree Lawrence teams are scheduled to play in the state tournaments Thursday.\nThe Free State boys team plays at 4:45 p.m. in Wichita, while the Lawrence High boys team plays at 8:15 p.m. in Wichita.\n“We will continue to monitor new information from our public health organizations as it becomes available and make any changes to the state basketball tournaments if needed,” the Kansas State High School Activities Association said in a statement on its website.\nKSHSAA’s decision to continue the event and allow fans runs counter to many regional and national organizations, including the Big 12 Conference, which has canceled its basketball tournaments, and the NCAA, which has decided to play its tournaments without spectators."}, {"url": "https://www.niskanencenter.org/report-from-suburban-kansas/", "title": "Report from Suburban Kansas", "authors": ["Laura K. Field", "April", "March", "Rachel Bitecofer"], "date": "2020-03-12", "keywords": ["suburbs", "2018", "isnt", "report", "kansas", "americas", "wichita", "feel", "suburban", "dc", "trump"], "summary": "I also moved to Wichita, Kansas.\nA majority of Americans live in suburban communities, as do most people in Kansas.\nAmerica’s suburban women—with their college degrees and full time jobs—matter more, electorally speaking, than Brooks’ flyover guy.\nSo perhaps the most surprising thing to me about life in suburban Kansas was the near total absence of MAGA culture.\nContrary to what people often assume inside the Beltway, life in America’s suburban universe doesn’t revolve around personal experience of economic anxiety."}, {"url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/clint-black-postponed-at-kansas-star-arena/", "title": "Clint Black concert postponed at Kansas Star Arena", "authors": ["Alexis Padilla", "Jhovani Carrillo", "Angelica Castelo"], "date": "2020-03-13", "keywords": ["clint", "arena", "tenn", "taken", "postponed", "concert", "kansas", "star", "visit", "black", "casino", "tonights"], "summary": "Clint Black performs “Killin’ Time” during the 50th annual CMA Awards at the Bridgestone Arena on Wednesday, Nov. 2, 2016, in Nashville, Tenn. (Photo by Charles Sykes/Invision/AP)WICHITA, Kan. (KSNW) – The Kansas Star Casino says tonight’s show for Clint Black at the Kansas Star Arena has been postponed.\nNew scheduled date will be September 5, 2020.\nRefunds will be made available to guests that aren’t able to attend the rescheduled dates at the original point of purchaseFor more information on steps being taken at Kansas Star Casino regarding COVID-19 please visit: https://www.Kansasstarcasino.com/news/coronavirus"}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-october-2-2019", "title": "Headlines for Wednesday, October 2, 2019", "authors": [], "date": "2019-10-02", "keywords": ["kan", "ap", "kansas", "city", "2019", "charged", "headlines", "tax", "wichita", "reports", "water", "man"], "summary": "====================Kansas Tax Collections $43 Million More than Expected in SeptemberTOPEKA, Kan. (AP) — Kansas is reporting that it collected $43 million more in taxes than anticipated in September.\nThe pursuit started Monday after a Kansas Highway Patrol trooper attempted to stop a car with a registration issue near a Kansas City, Kansas, shopping area.\nThe woman was last seen late Friday walking northbound on Interstate 35 near Seventh Street Trafficway in Kansas City, Kansas.\n====================Police: Wichita Man Drowned While Trying to Save DogWICHITA, Kan. (AP) — Sedgwick County authorities say a 59-year-old Wichita man drowned while trying to save his dog.\nThe Kansas City Star reports when the flight was announced in 2018, it was the Kansas City airport's first transatlantic route."}, {"url": "https://kslsports.com/432011/local-college-basketball-players-in-transfer-portal/", "title": "Local College Basketball Players In Transfer Portal", "authors": ["Kyle Ireland", "Ksl Sports"], "date": "2020-04-07", "keywords": ["portal", "assists", "state", "rebounds", "according", "college", "guard", "local", "games", "basketball", "utah", "players", "points", "season", "transfer", "averaged"], "summary": "SALT LAKE CITY, Utah – A number of players from local college basketball teams in the state of Utah announced they were exploring the option of leaving for a new school this offseason.\nFrom BYU to Utah to Utah State and more, here are the local college basketball players in the NCAA transfer portal.\nHe joined the BYU basketball program for the 2019-20 season after playing at Utah State Eastern.\nPrior to joining the Utah State program, the big man played for the College of Southern Idaho.\nDuring his time with Utah State, Porter averaged 4.3 points, 1.9 rebounds and 2.3 assists per game."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-october-14-2019", "title": "Headlines for Monday, October 14, 2019", "authors": [], "date": "2019-10-14", "keywords": ["kan", "shooting", "ap", "patrol", "kansas", "city", "2019", "headlines", "say", "car", "reports", "man", "14"], "summary": "====================Struggling Kansas City T-Bones Locked Out of StadiumKANSAS CITY, Kan. (AP) — The Kansas City T-Bones are officially locked out of their stadium in Kansas City, Kansas.\nThe Kansas City Star reports team owners have said they are working to sell the team but no deal has been reached.\n====================Kansas City Woman Shot to Death; Suspect ArrestedKANSAS CITY, Mo.\nTim Hernandez said the woman was shot Monday morning in eastern Kansas City and died by the time officers arrived.\nThe Kansas City Star reports that the suspect crashed an SUV Friday in downtown Kansas City."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-october-18-2019", "title": "Headlines for Friday, October 18, 2019", "authors": [], "date": "2019-10-18", "keywords": ["kan", "ap", "state", "kansas", "court", "city", "sexual", "2019", "county", "headlines", "wichita", "campaign", "18"], "summary": "====================Kansas City T-Bones Get New Owner, Will Stay in KansasKANSAS CITY, Kan. (AP) — The Kansas City T-Bones have a prospective new owner and a plan to stay in Kansas City, Kansas.\nThe Unified Government of Wyandotte County/ Kansas City, Kansas, on Thursday approved an agreement to use $1 million in tax revenues to help the team stay in the area.\n====================Manhattan to Allow Women to Go Topless, with RestrictionsMANHATTAN, Kan. (AP) — Women are now legally allowed to go topless in Manhattan, with some restrictions.\nTexas was picked fourth in the poll released Thursday, followed by West Virginia, Oklahoma State, Iowa State, Oklahoma, Kansas State and TCU.\nTexas Tech and Kansas State were the Big 12 co-champions last year."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-october-25-2019", "title": "Headlines for Friday, October 25, 2019", "authors": [], "date": "2019-10-25", "keywords": ["kan", "sentenced", "ap", "kansas", "25", "city", "court", "2019", "county", "headlines", "wichita", "reports", "man"], "summary": "====================Wichita Man Sentenced to 3 Life Terms for Child Sex CrimesWICHITA, Kan. (AP) — A Wichita man has been sentenced to three life terms for 25 felony sex crimes with six children.\nThe Kansas City Star reports that members of the Kansas City Tax Increment Financing Commission Board voted 8-3 Thursday against a 23-year TIF agreement.\nThey say Kansas City needs a top-of-the-line hotel to compete with other major American cities for top conventions and events.\n(AP) — Two Kansas City, Kansas, men have been sentenced to lengthy prison terms for kidnapping and robbing three women.\nThe men and a third man stole a Jaguar in Kansas City, Kansas, and drove into Kansas City, Missouri."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-october-4-2019", "title": "Headlines for Friday, October 4, 2019", "authors": [], "date": "2019-10-04", "keywords": ["kan", "murder", "ap", "kansas", "city", "2019", "headlines", "death", "wichita", "reports", "water", "man"], "summary": "====================Lawrence Police: Kansas Man Cited Devil During Alleged AssaultLAWRENCE, Kan. (AP) — A Kansas man has been arrested for allegedly assaulting a woman after telling her that the devil wanted her dead.\n(AP) — Kansas City police say an officer shot a man after he tried to hit them with his vehicle.\nThe Kansas City Star reports this is the second concert on the six-stop tour postponed because of rain.\nThe Kansas City Star reports a six-member public defender commission will select a new director.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://www.kcur.org/news/2020-04-10/live-coverage-coronavirus-in-the-kansas-city-area", "title": "Live Coverage: Coronavirus In The Kansas City Area", "authors": [], "date": "2020-04-10", "keywords": ["live", "department", "public", "state", "area", "kansas", "city", "coronavirus", "health", "county", "covid19", "missouri", "coverage"], "summary": "County workers will run the mobile unit in the parking lot next to Kansas City, Kansas City Hall at 619 Anne Avenue.\nThe joint KC Chamber, Civic Council of Greater Kansas City and the Kansas City Area Development Council survey includes responses from about 340 businesses.\nKansas City, Kansas officials hope that limiting interactions in this way will prevent the further spread of the virus.\nLocal health centers and the money they’re getting include:Turner House Clinic in Kansas City, Kansas – $64,427Health Partnership Clinic, Olathe, Kansas – $72,310Kansas City Care Clinic, Kansas City, Missouri – $70,040Samuel U. Rodgers Health Center, Kansas City, Missouri – $82,066Swope Health Services, Kansas City, Missouri – $114,755Northwest Health Services, St. Joseph, Missouri – $82,182.\nThe fund will be managed by the Greater Kansas City Community Foundation, United Way of Greater Kansas City, LISC Greater Kansas City and the Mid-America Regional Council."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-october-3-2019", "title": "Headlines for Thursday, October 3, 2019", "authors": [], "date": "2019-10-03", "keywords": ["kan", "ap", "kansas", "city", "2019", "attorney", "county", "headlines", "wichita", "reports", "water", "man"], "summary": "===================Police Say Kansas Man Cited Devil During Alleged AssaultLAWRENCE, Kan. (AP) — A Kansas man has been arrested for allegedly assaulting a woman after telling her that the devil wanted her dead.\nBrungardt said the findings have been shared with the Kansas Bureau of Investigation and the Kansas Attorney General’s office.\nThe Kansas City Star reports that 53-year-old Katherine Konon, of Shawnee, was arrested last week on the felony charge.\nThe consortium will involve up to 16 universities and include a link with the University of Kansas Medical Center in Kansas City, Kansas.\n====================Police: Wichita Man Drowned While Trying to Save DogWICHITA, Kan. (AP) — Sedgwick County authorities say a 59-year-old Wichita man drowned while trying to save his dog."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-october-23-2019", "title": "Headlines for Wednesday, October 23, 2019", "authors": [], "date": "2019-10-23", "keywords": ["kan", "ap", "state", "kansas", "city", "remains", "2019", "headlines", "say", "23", "reports", "wichita", "reported"], "summary": "====================Squirrel Blamed for Power Outage in TopekaTOPEKA, Kan. (AP) — A wayward squirrel is being blamed for a power outage in Topeka.\nHis employment with the Kansas City, Kansas, Police Department subsequently ended.\n====================Kansas City Area Woman Accused of Slashing 18 Police Car Tires After Her ArrestRAYTOWN, Mo.\n(AP) — A Kansas City, Missouri, woman is accused of slashing the tires on eight police vehicles one day after her arrest.\nThe Kansas City Star reports that 46-year-old Eunice A. Fisher is charged with first-degree property damage."}, {"url": "https://www.ksn.com/news/local/attorney-general-william-barr-will-be-in-wichita-wednesday/", "title": "Attorney General William Barr will be in Wichita Wednesday", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2019-10-01", "keywords": ["barr", "tomorrows", "university", "william", "state", "rkansas", "senator", "attorney", "travel", "wichita", "general", "law", "roundtable"], "summary": "WICHITA, Kan. (KSNW) – Attorney General William P. Barr will travel to Wichita, Kansas, on Wednesday, October 2, 2019, to participate in a roundtable event with Senator Jerry Moran, R-Kansas, and state and local law enforcement.\nThe meeting will take place at 2:30 p.m. at the Wichita State University Law Enforcement Center.\nKSN News will be at tomorrow’s event.\nLATEST STORIES:"}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-october-10-2019", "title": "Headlines for Thursday, October 10, 2019", "authors": [], "date": "2019-10-10", "keywords": ["kan", "ap", "shooting", "kansas", "city", "2019", "county", "headlines", "wichita", "federal", "man", "missouri"], "summary": "====================Kansas City Man Convicted of Rape, Filming Crime on Victim's CellphoneKANSAS CITY, Mo.\n(AP) — A Kansas City man has been found guilty of raping a 16-year-old girl while recording the crime on her cellphone.\nThe Kansas City Star reports that Adrienne Foster announced her campaign this week for the GOP nomination in the 3rd Congressional District.\nPolice continued searching Thursday for 29-year-old Hugo Villanueva-Morales, more than four days after gunfire erupted early Sunday at the Tequila KC bar in Kansas City, Kansas.\nHe and 23-year-old Javier Alatorre are charged with four counts of first-degree murder in Sunday's shooting at the Tequila KC bar in Kansas City, Kansas."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-october-29-2019", "title": "Headlines for Tuesday, October 29, 2019", "authors": [], "date": "2019-10-29", "keywords": ["kan", "ap", "state", "kansas", "city", "2019", "county", "headlines", "say", "kobach", "reports", "missouri", "29"], "summary": "The Clay County, Missouri, Sheriff's Department says that deputies later heard a single gunshot while attempting to stop a sport utility vehicle in Kearney.\nThe government says investigators found the methamphetamine when serving a search warrant at a house in Kansas City, Kansas, where one of the defendants lives.\nBut with rain and snow forecast for northeast Kansas and northwest Missouri, organizers announced Tuesday that the concert will be moved inside to the Sprint Center in downtown Kansas City, Missouri.\n====================Kansas City Police Settle Suit over Flash-Bang Grenade RaidKANSAS CITY, Mo.\n====================Oklahoma Fan Dies After Heart Attack at Kansas State GameMANHATTAN, Kan. (AP) — An Oklahoma football fan died after suffering an apparent heart attack at Saturday's game against Kansas State."}, {"url": "https://www.kmbc.com/article/dr-lee-norman-emerges-as-leader-amid-coronavirus-outbreak-in-kansas-kansas-department-of-health-environment-covid-19/32106027", "title": "Dr. Lee Norman emerges as leader amid coronavirus outbreak in Kansas", "authors": ["The Associated Press", "Https", "Www.Facebook.Com"], "date": "2020-04-10", "keywords": ["amid", "state", "pandemic", "norman", "kansas", "leader", "dr", "coronavirus", "lee", "health", "outbreak", "emerges", "kelly", "national", "hes", "inmates", "medical"], "summary": "SHE’S ACSING THOSE G-O-P LEADERS OF JEOPARDIZING THE HEALTH ANDSE KANS - ADDG THAT THIS IS *NOT A NOR POLITICAL DISAGREEMENT.\nSTAY WITH FOR THE LATEST INFORMAdvertisement Dr. Lee Norman emerges as leader amid coronavirus outbreak in Kansas Share Shares Copy Link CopyAbout 20 minutes into a recent press conference, Lee Norman, the man spearheading Kansas’s response to the novel coronavirus, coughed.People noticed.“Is he coughing into his hand?” one person asked on a Facebook livestream.\nHope you are ok,” wrote another.Three weeks ago, Norman was a well-regarded but little-known secretary of the Kansas Department of Health and Environment.\nBut I’ve been thinking and doing this kind of work for a long time.”As chief medical officer of the University of Kansas Health System, Norman learned first hand about the havoc a pandemic can wreak.\nTrewyn, the liaison to the National Bio-Agro Defense Facility at Kansas State University, has known Norman the better part of a decade."}, {"url": "https://www.ksn.com/news/crime/two-people-sent-to-hospital-following-south-wichita-shooting-incident/", "title": "Man arrested, woman still in critical condition following downtown Wichita shooting", "authors": ["Krystle Sherrell", "Ksn News", "The Associated Press"], "date": "2019-10-13", "keywords": ["downtown", "condition", "shooting", "critical", "solomon", "shot", "mental", "homeless", "health", "arrested", "working", "woman", "wichita", "suffered", "man", "following"], "summary": "WICHITA, Kan. (KSNW) – Wichita police said a 50-year-old man and 33-year-old woman were sent to the hospital after a shooting in downtown.\nThe woman suffered critical injuries and underwent surgery after being shot one time in the back.\n“Through the investigation, Solomon was experiencing a mental health crisis induced by narcotics.”Police said methamphetamine may have had a part to play in Solomon’s mental crisis.\nLocal non-profit organizations said they are already working to help bring awareness to mental health within the homeless population.\n“Unfortunately, you do deal with a large percentage of homeless who are dealing with a mental illness,” said Seth Nesmith with the Mental Health Association of South Central Kansas (MHA)."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-october-15-2019", "title": "Headlines for Tuesday, October 15, 2019", "authors": [], "date": "2019-10-15", "keywords": ["district", "kan", "ap", "shooting", "kansas", "court", "city", "2019", "headlines", "say", "reports", "man", "15"], "summary": "Police Captain Tim Hernandez said the woman was shot Monday morning in eastern Kansas City and died by the time officers arrived.\nThe Kansas City Star reports that Leighlan Fleming was found fatally shot Saturday afternoon in the driveway of a home.\nFleming is among 25 teenagers who have been killed by gunfire this year in the Kansas City area.\n====================Struggling Kansas City T-Bones Locked Out of StadiumKANSAS CITY, Kan. (AP) — The Kansas City T-Bones are officially locked out of their stadium in Kansas City, Kansas.\n(AP) — A Kansas man is suing after he was injured while driving a go-kart in the Missouri tourist town of Branson."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-october-31-2019-0", "title": "Headlines for Thursday, October 31, 2019", "authors": [], "date": "2019-10-31", "keywords": ["kan", "sentenced", "ap", "state", "kansas", "city", "2019", "county", "headlines", "31", "woman", "prison", "federal"], "summary": "The Kansas City Star reports that more than 170 morning rush hour accidents were reported Thursday in the metro area.\nKansas City, Missouri, police alone responded to 116 accident calls from 5 a.m. to 9 a.m., including 77 involving injuries.\nTemperatures fell to 22 degrees in Kansas City, and roads were icy and slick.\n====================USDA Picks Missouri Office Building as Its Kansas City SiteKANSAS CITY, Mo.\n====================Kansas City Royals Hire Mike Matheny as ManagerKANSAS CITY, Mo."}, {"url": "https://www.mlive.com/sports/2020/04/looking-to-add-some-personality-to-your-zoom-meetings-you-will-need-these-michigan-based-sports-backgrounds.html", "title": "Add personality to your next video call with a custom Zoom background featuring these Detroit sports moments", "authors": ["Mike Mulholland", "Mmulholl Mlive.Com"], "date": "2020-04-09", "keywords": ["detroit", "mlivecommike", "personality", "state", "lansing", "video", "game", "2017", "add", "won", "mulholland", "mike", "moments", "custom", "michigan", "featuring", "zoom", "background"], "summary": "Well, look no further, as we have compiled more than 40 Detroit professional teams and Michigan and Michigan State sports photos.\n(Mike Mulholland | MLive.com)Mike MulhollandThe sun sets over Comerica Park as the Detroit Tigers host the Texas Rangers in Detroit, on Sunday, May 21, 2017.\n(Mike Mulholland | MLive.com)Mike Mulholland'Al the Octopus' has been installed on the roof at the west entrance of Joe Louis Arena in Detroit.\n(Mike Mulholland | MLive.com)Mike MulhollandThe Detroit Lions take the field before their NFL game against the Carolina Panthers at Ford Field in Detroit on Sunday, November 18, 2018.\n(Mike Mulholland | MLive.com)Mike Mulholland"}, {"url": "https://www.kfdi.com/2019/10/03/slower-economic-growth-projected-for-wichita-and-kansas-in-2020/", "title": "Slower economic growth projected for Wichita and Kansas in 2020", "authors": ["Posted", "George Lawson"], "date": "2019-10-03", "keywords": ["economic", "national", "state", "projected", "area", "slower", "kansas", "2020", "hill", "rate", "wichita", "trade", "forecast", "growth"], "summary": "The Wichita area is looking at job growth of about half a percent for 2020, according to the economic forecast from Wichita State University.\nHill is projecting growth of around 1,600 new jobs for the Wichita area, which covers Sedgwick, Butler, Harvey, Kingman and Sumner counties.\nFor the state of Kansas, the forecast calls for around 8,926 new jobs and a growth rate of 0.6 percent.\nThe Wichita area had 1.2 percent growth in 2018 and growth of 1.3 percent is expected for 2019.\nHe said the 0.5 percent growth projected for Wichita is a natural rate of growth with high school graduates entering the labor market."}, {"url": "https://www.manufacturing.net/labor/news/21109654/boeing-supplier-spirit-cutting-2800-jobs-at-kansas-plant", "title": "Boeing Supplier Spirit Cutting 2,800 Jobs at Kansas Plant", "authors": [], "date": "2020-01-10", "keywords": ["spirit", "boeing", "aerospace", "737", "kansas", "2800", "jobs", "company", "cutting", "wichita", "production", "max", "layoffs", "supplier", "plant"], "summary": "In this Oct. 3, 2019 file photo, completed Boeing 737 MAX fuselages, made at Spirit Aerosystems in Wichita, KS, sit covered in tarps near the factory.\nMore than 40 aerospace companies, most of them in and around Wichita, provide parts and services for the production of the 737 Max.\nSpirit produced about 70% of the 737 Max, including the fuselage.\nThe company suspended production of fuselages and other parts for the Max on Jan. 1, after Boeing ordered Spirit to suspend shipments.\nIt already had lost more than 20% of its value since Boeing grounded the 737 Max in March."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-november-5-2019", "title": "Headlines for Tuesday, November 5, 2019", "authors": [], "date": "2019-11-05", "keywords": ["kan", "officer", "ap", "kansas", "court", "city", "2019", "headlines", "say", "woman", "wichita", "man"], "summary": "======================Kansas City to Vote on Removing King's Name from Historic BoulevardKANSAS CITY, Mo.\nIn this case, the Kansas court said police relied on nothing other than Glover's suspended license, they said.\nOlathe police told the Kansas City Star that a video shared on social media was related to the robberies.\n======================Kansas City Man Charged in Deadly Drunken Driving CrashKANSAS CITY, Mo.\n\"Mark is an innovative leader and a talented executive who is widely respected in our industry and in the Kansas City community."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-november-22-2019", "title": "Headlines for Friday, November 22, 2019", "authors": [], "date": "2019-11-22", "keywords": ["kan", "22", "ap", "state", "kansas", "city", "2019", "county", "headlines", "say", "wichita", "reports", "missouri"], "summary": "The methamphetamine was distributed from Kansas City to the St. Joseph and the Atchison areas.\n\"He is 100% focused on being President Trump's secretary of state,\" State Department spokeswoman Morgan Ortagus said.\n====================City Manager of Kansas City Leaving Post in DecemberKANSAS CITY, Mo.\n(AP) — The city manager of Kansas City, Missouri, will leave his job earlier than originally expected, vacating the position effective December 2.\n====================14-Year-Old Tiger Dies at Wichita ZooWICHITA, Kan. (AP) — A tiger that had been in declining health has died at a Wichita zoo."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-november-28-2019", "title": "Headlines for Thursday, November 28, 2019", "authors": [], "date": "2019-11-28", "keywords": ["kan", "28", "ap", "judge", "kansas", "court", "2019", "county", "headlines", "say", "death", "bison", "man"], "summary": "The Topeka Capital-Journal reports that the states highest court rejected on Wednesday a legal interpretation by the lower Kansas Court of Appeals that had granted Daquantrius Johnson a new trial on firearms charges.\n====================Patrol Says Man Walking Along Turnpike Killed by TruckEMPORIA, Kan. (AP) — Authorities say a man walking along the Kansas Turnpike has been fatally struck by a truck.\n====================Bison Herds a Bright Spot for Kansas AgricultureHUTCHINSON, Kan. (AP) _ One of the promising industries for agriculture harkens back to the days when bison roamed the Kansas prairie.\nSophomore Devon Dotson and senior Udoka Azubuike combined for 60 points, the most by a KU duo in 28 years.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-sunday-november-24-2019", "title": "Headlines for Sunday, November 24, 2019", "authors": [], "date": "2019-11-24", "keywords": ["tornado", "kan", "ap", "kansas", "2019", "headlines", "say", "education", "24", "wichita", "woman", "reports", "general"], "summary": "Wichita Police Investigate Fatal StabbingWICHITA, Kan. (AP) — Police in Wichita say a 28-year-old woman has been stabbed to death.\nThe Wichita Eagle reports that the woman, whose name has not yet been released, died Saturday morning at a Wichita hospital.\n===============Kansas Woman Charged With Murder in Boyfriend's DeathWICHITA, Kan. (AP) — A woman accused of fatally shooting her boyfriend has been charged with intentional second-degree murder.\n(AP) — Kansas universities are reducing general education requirements to ensure more students can graduate on time and create more room for classes in their majors.\nWichita State’s general education cuts were largely spurred by a Kansas Board of Regents mandate to reduce students’ credit hours."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-november-29-2019", "title": "Headlines for Friday, November 29, 2019", "authors": [], "date": "2019-11-29", "keywords": ["kan", "ap", "shot", "shooting", "patrol", "kansas", "2019", "headlines", "say", "wichita", "man", "missouri", "29"], "summary": "====================4 Children Killed in Thanksgiving Day Crash in KansasBELLEVILLE, Kan. (AP) — Authorities say four children have been killed in a Thanksgiving Day crash.\n====================Police Pursuit in Kansas Ends in Fatal Shooting in MissouriPITTSBURG, Kan. (AP) — Authorities in Kansas and Missouri are investigating an officer-involved fatal shooting after a police pursuit in both states.\nPolice say a man driving the car shot a woman later identified as Toner and then shot himself.\n===================Bison Herds a Bright Spot for Kansas AgricultureHUTCHINSON, Kan. (AP) _ One of the promising industries for agriculture harkens back to the days when bison roamed the Kansas prairie.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-sunday-november-10-2019", "title": "Headlines for Sunday, November 10, 2019", "authors": [], "date": "2019-11-10", "keywords": ["kan", "ap", "buses", "kansas", "crash", "2019", "holtzman", "headlines", "say", "car", "wichita", "driver"], "summary": "================Second Driver Charged in Fatal December Crash near WichitaWICHITA, Kan. (AP) — A second driver has been charged in a crash near Wichita that killed a 24-year-old Kansas man last year.\n================Driver Dies when Car Hits Wichita Utility PoleWICHITA, Kan. (AP) — Police in Wichita say a 59-year-old driver has died after his car slammed into a city utility pole.\nInvestigators say the crash happened late Friday night when the eastbound car left the road and hit the pole.\n================Wichita to Operate the First Electric Buses in KansasWICHITA, Kan. (AP) — The state's first electric buses are coming to Wichita.\nHe has also bought seven smaller electric buses to replace aging buses that look like old trolleys using another grant."}, {"url": "https://kslsports.com/432011/local-college-basketball-players-in-transfer-portal/", "title": "Local College Basketball Players In Transfer Portal", "authors": ["Kyle Ireland", "Ksl Sports"], "date": "2020-04-07", "keywords": ["portal", "assists", "state", "rebounds", "according", "college", "guard", "local", "games", "basketball", "utah", "players", "points", "season", "transfer", "averaged"], "summary": "SALT LAKE CITY, Utah – A number of players from local college basketball teams in the state of Utah announced they were exploring the option of leaving for a new school this offseason.\nFrom BYU to Utah to Utah State and more, here are the local college basketball players in the NCAA transfer portal.\nHe joined the BYU basketball program for the 2019-20 season after playing at Utah State Eastern.\nPrior to joining the Utah State program, the big man played for the College of Southern Idaho.\nDuring his time with Utah State, Porter averaged 4.3 points, 1.9 rebounds and 2.3 assists per game."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-november-20-2019", "title": "Headlines for Wednesday, November 20, 2019", "authors": [], "date": "2019-11-20", "keywords": ["kan", "sentenced", "ap", "state", "kansas", "city", "2019", "headlines", "20", "reports", "wichita", "man", "guilty"], "summary": "====================Kansas City School District Falsified Attendance Data; Owes State MoneyKANSAS CITY, Mo.\nThe Kansas City Star reports Brett Hoedl, chairman of the Equality Kansas Metro Kansas City chapter, and others asked for Brownlee’s resignation.\nBrett Hoedl, chairman of the Equality Kansas Metro Kansas City chapter, said in a Facebook post that Councilwoman Karin Brownlee complained to his employer, Black & Veatch, about his advocacy for the ordinance.\nThe methamphetamine was distributed from Kansas City to the St. Joseph and the Atchison, Kansas, areas.\n====================Kansas City to Disband Mounted Patrol UnitKANSAS CITY, Mo."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-november-12-2019", "title": "Headlines for Tuesday, November 12, 2019", "authors": [], "date": "2019-11-12", "keywords": ["kan", "dole", "ap", "12", "state", "kansas", "city", "2019", "headlines", "died", "reports", "wichita", "service"], "summary": "====================Cerner Corporation Cuts 130 Jobs, Including 60 in Kansas CityNORTH KANSAS CITY, Mo.\nCerner says it remains committed to creating jobs in Kansas City and has hired several thousand workers this year.\n======================2 People Dead After Shooting in Southeast TopekaTOPEKA, Kan. (AP) — Police say a shooting in southeast Topeka left two people dead.\nThe Kansas City Star obtained the records after a state agency revoked the law enforcement license for former Kansas City, Kansas, police officer Robert Ward.\n====================Missouri Congressman Criticizes Kansas City Church Action During King Street CampaignKANSAS CITY, Mo."}, {"url": "https://www.kcur.org/news/2020-04-10/live-coverage-coronavirus-in-the-kansas-city-area", "title": "Live Coverage: Coronavirus In The Kansas City Area", "authors": [], "date": "2020-04-10", "keywords": ["live", "department", "public", "state", "area", "kansas", "city", "coronavirus", "health", "county", "covid19", "missouri", "coverage"], "summary": "County workers will run the mobile unit in the parking lot next to Kansas City, Kansas City Hall at 619 Anne Avenue.\nThe joint KC Chamber, Civic Council of Greater Kansas City and the Kansas City Area Development Council survey includes responses from about 340 businesses.\nKansas City, Kansas officials hope that limiting interactions in this way will prevent the further spread of the virus.\nLocal health centers and the money they’re getting include:Turner House Clinic in Kansas City, Kansas – $64,427Health Partnership Clinic, Olathe, Kansas – $72,310Kansas City Care Clinic, Kansas City, Missouri – $70,040Samuel U. Rodgers Health Center, Kansas City, Missouri – $82,066Swope Health Services, Kansas City, Missouri – $114,755Northwest Health Services, St. Joseph, Missouri – $82,182.\nThe fund will be managed by the Greater Kansas City Community Foundation, United Way of Greater Kansas City, LISC Greater Kansas City and the Mid-America Regional Council."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-november-18-2019", "title": "Headlines for Monday, November 18, 2019", "authors": [], "date": "2019-11-18", "keywords": ["kan", "ap", "kansas", "city", "2019", "headlines", "say", "died", "car", "wichita", "18", "officers", "man"], "summary": "Residents evacuated the city 50 miles northwest of Kansas City, or sheltered in place for hours.\nPolice say officers were called to the area around 2:30 am Saturday for a report of a carjacking.\nA recycler in Kansas City has helped the agency dispose of roughly 12,000 gallons of fuel, pesticides and herbicides.\n====================Police Investigate Fatal Shooting in Kansas City, MissouriKANSAS CITY, Mo.\nThe Kansas City Star reports it’s one example of the lingering damage from floodwaters that rose across Kansas earlier this year."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-november-11-2019", "title": "Headlines for Monday, November 11, 2019", "authors": [], "date": "2019-11-11", "keywords": ["kan", "ap", "shooting", "kansas", "city", "2019", "county", "headlines", "say", "driver", "reports", "man", "11"], "summary": "=====================Kansas Had 10-Year High for Deer-Related Crashes in 2018TOPEKA, Kan. (AP) — The state transportation agency says Kansas hit a 10-year high for deer-related crashes last year.\nThe Kansas City Star obtained the records after a state agency revoked the law enforcement license for former Kansas City, Kansas, police officer Robert Ward.\nCleaver, the first black mayor of Kansas City, said even the Ku Klux Klan didn't enter churches at rallies during the civil rights movement.\n=====================Four Injured in Shooting at Adult Club in Kansas City, MissouriKANSAS CITY, Mo.\nKANSAS CITY, Mo."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-november-25-2019", "title": "Headlines for Monday, November 25, 2019", "authors": [], "date": "2019-11-25", "keywords": ["kan", "ap", "shooting", "state", "kansas", "25", "city", "2019", "headlines", "say", "wichita", "reports", "man"], "summary": "(AP) — Kansas universities are reducing general education requirements to ensure more students can graduate on time and create more room for classes in their majors.\nWichita State University became the latest school to slash the numbers of general ed classes their undergraduates are required to take.\nRealty, a landlord with a major presence in both Kansas City and St. Louis.\nKansas City Police spokesman Tim Hernandez told the Kansas City Star that the car had been sitting near the restaurant’s drive-thru for some time before the shooting.\n====================Police Investigate Fatal Shooting Outside Wichita HotelWICHITA, Kan. (AP) — Wichita police are investigating a fatal shooting that happened in a hotel parking lot."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-november-1-2019", "title": "Headlines for Friday, November 1, 2019", "authors": [], "date": "2019-11-01", "keywords": ["kan", "ap", "university", "state", "kansas", "city", "2019", "county", "headlines", "wichita", "reports", "heroin"], "summary": "They are seeking the 3rd District seat in the Kansas City area held by freshman Rep. Sharice Davids.\n====================USDA Picks Missouri Office Building as Its Kansas City SiteKANSAS CITY, Mo.\nKansas City, Missouri, police alone responded to 116 accident calls from 5 a.m. to 9 a.m., including 77 involving injuries.\n====================Wichita State University Names Jay Golden as Next PresidentWICHITA, Kan. (AP) — A vice chancellor at East Carolina University experienced in building research campuses will become the new president of Wichita State University.\nThe Kansas City Star reports that the Tequila KC Bar in Kansas City, Kansas, reopened late last month."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-november-26-2019", "title": "Headlines for Tuesday, November 26, 2019", "authors": [], "date": "2019-11-26", "keywords": ["kan", "ap", "shooting", "kansas", "city", "2019", "headlines", "say", "death", "wichita", "reports", "26", "man"], "summary": "Republicans Turn on Novice Congressman Whom They Helped Win Kansas SeatTOPEKA, Kan. (AP) — Republicans are going after one of their own in Kansas.\n====================Police Shoot, Wound 16-Year-Old in Kansas City SuburbOLATHE, Kan. (AP) — Authorities say police shot and wounded a 16-year-old while investigating a robbery in suburban Kansas City.\nThe lawsuit was filed by Linus Baker, who is the grandfather of a student at Crossroads Academy in Kansas City.\nSt. Louis, Kansas City and Springfield all have seen spikes in gun crimes and homicides in recent years.\n(AP) — A Kansas man has been charged with sexually assaulting a student at a Missouri school where he taught and coached."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-november-6-2019", "title": "Headlines for Wednesday, November 6, 2019", "authors": [], "date": "2019-11-06", "keywords": ["kan", "ap", "state", "kansas", "city", "2019", "county", "headlines", "say", "wichita", "king", "man"], "summary": "Whipple was elected to the House in 2012 and is a lecturer at Wichita State University.\n(– related –)Kansas City Voters Approve Measure to Remove Martin Luther King Jr.'s Name from Historic StreetKANSAS CITY, Mo.\nThe Kansas City Star reports Kansas Reps. Roger Marshall, Steve Watkins and Ron Estes issued a joint response supporting the Trump administration's decision after receiving Davids's letter.\nOlathe police told the Kansas City Star that a video shared on social media was related to the robberies.\n\"Mark is an innovative leader and a talented executive who is widely respected in our industry and in the Kansas City community."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-saturday-november-23-2019", "title": "Headlines for Saturday, November 23, 2019", "authors": [], "date": "2019-11-23", "keywords": ["kan", "ap", "operating", "kansas", "pompeo", "2019", "store", "county", "headlines", "23", "wichita", "reports", "girl"], "summary": "Icy Kansas Roads Cause Fatal WrecksWICHITA, Kan. (AP) — Icy and snow-covered roads are causing accidents across much of Kansas, including two fatal wrecks.\n===============Girls Accused of Attacking Store Worker in WichitaWICHITA, Kan. (AP) — Four girls are accused of attacking a Kansas store worker who confronted them about shoplifting, an attack that left the woman unconscious.\n================Report Shows Improvement in Kansas Athletics’ FinancesLAWRENCE, Kan. (AP) — The athletic department at the University of Kansas is reporting a profit after two straight years of financial losses.\n===============Woman Charged with Child Sex Crimes Enters Plea DealLAWRENCE, Kan. (AP) — A Lawrence woman charged with sex crimes involving two young teenagers pleaded to lesser charges and was given two years of probation.\n===============Tiger Dies at Wichita ZooWICHITA, Kan. (AP) — A tiger that had been in declining health has died at a Wichita zoo."}, {"url": "https://www.ksn.com/news/local/union-pacific-bringing-steam-locomotive-to-kansas-to-celebrate-150th-anniversary/", "title": "Union Pacific steam locomotive traveling across Kansas to celebrate 150th anniversary", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2019-11-20", "keywords": ["ave", "n", "traveling", "locomotive", "depart", "steam", "arrivaldepart", "crossing", "pacific", "arrival", "ct", "union", "st", "celebrate", "800", "kansas", "anniversary", "150th", "stops"], "summary": "4014 is touring the Union Pacific system throughout 2019 to commemorate the transcontinental railroad’s 150th anniversary.\nArrivalDepart 12:15 p.m. CT12:35 p.m. CT Salina400 N. 13th St Arrival 2:15 p.m. CT November 21 Salina400 N. 13th St Depart 8:00 a.m. CT EllsworthLincoln Ave.\nCrossing ArrivalDepart Noon CT12:15 p.m. CT HaysE. 9th St. & Milner St.\nArrival 2:15 p.m. MT November 23 Sharon SpringsN. Front St. & N. Boeke St.\nDepart 8:00 a.m. MTLATEST STORIES:"}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-saturday-november-30-2019", "title": "Headlines for Saturday, November 30, 2019", "authors": [], "date": "2019-11-30", "keywords": ["kan", "ap", "shooting", "shot", "kansas", "vehicle", "2019", "30", "headlines", "river", "wichita", "bison", "missouri"], "summary": "Flooding ravaged much of the Missouri and Mississippi River basins earlier this year, reaching record levels in many places.\nEight months later, parts of the Missouri River are above flood stage at a time of the year when river levels traditionally run low.\n====================4 Children Killed in Kansas Thanksgiving Day CrashBELLEVILLE, Kan. (AP) — Authorities say four children have been killed in a Thanksgiving Day crash.\n====================Bison Called Bright Spot for Kansas AgricultureHUTCHINSON, Kan. (AP) — One of the promising industries for agriculture harkens back to the days when bison roamed the Kansas prairie.\nThe Hutchinson News reports that when Moundridge rancher Dick Gehring started his bison ranch more than 30 years ago, he did it for the money."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-november-14-2019", "title": "Headlines for Thursday, November 14, 2019", "authors": [], "date": "2019-11-14", "keywords": ["kan", "sentenced", "ap", "state", "kansas", "city", "school", "2019", "headlines", "say", "death", "man", "14"], "summary": "Wyandotte County District Attorney’s Office spokesman Jonathan Carter told The Kansas City Star on Wednesday that the Rev.\nHe was accused of inappropriately touching a 10-year-old girl in 2015 at a Kansas City, Kansas, church gymnasium and again at a graduation party in Bonner Springs.\nThe Kansas City Star reports Hallgrimson’s attorney, Robin Fowler, said he will plead not guilty and go to trial.\n====================Cerner Corporation Cuts 130 Jobs, Including 60 in Kansas CityNORTH KANSAS CITY, Mo.\n(AP) — Kansas City Mayor Quinton Lucas is asking people interested in honoring the Rev."}, {"url": "https://www.ksn.com/news/crime/sedgwick-county-sheriffs-office-investigating-homicide-northeast-of-wichita/", "title": "Third arrest made in connection to homicide northeast of Wichita", "authors": ["Ksn News", "The Associated Press"], "date": "2019-12-03", "keywords": ["suspicion", "robbery", "sedgwick", "homicide", "connection", "county", "aggravated", "woman", "wichita", "sheriffs", "northeast", "office", "kidnapping", "man", "arrest"], "summary": "WICHITA, Kan. (KSNW) – Authorities arrested a third person in connection to the homicide, kidnapping, and robbery of 30-year-old Christian Hernandez.\nHernandez was found by a woman driving in the area of 45th Street North and Greenwich Wednesday, Nov. 27 around 7:30 a.m.\nOn Monday, the sheriff’s office said 33-year-old Thomas R. Armstrong and 30-year-old Efrain D. Arroyo II were both booked on suspicion of aggravated kidnapping, aggravated robbery, and first-degree murder.\nA woman, 28-year-old Whitney Duke, was arrested on suspicion of aggravated kidnapping and robbery.\nThe case will be presented to the Sedgwick County District Attorney’s Office."}, {"url": "https://www.mlive.com/sports/2020/04/looking-to-add-some-personality-to-your-zoom-meetings-you-will-need-these-michigan-based-sports-backgrounds.html", "title": "Add personality to your next video call with a custom Zoom background featuring these Detroit sports moments", "authors": ["Mike Mulholland", "Mmulholl Mlive.Com"], "date": "2020-04-09", "keywords": ["detroit", "mlivecommike", "personality", "state", "lansing", "video", "game", "2017", "add", "won", "mulholland", "mike", "moments", "custom", "michigan", "featuring", "zoom", "background"], "summary": "Well, look no further, as we have compiled more than 40 Detroit professional teams and Michigan and Michigan State sports photos.\n(Mike Mulholland | MLive.com)Mike MulhollandThe sun sets over Comerica Park as the Detroit Tigers host the Texas Rangers in Detroit, on Sunday, May 21, 2017.\n(Mike Mulholland | MLive.com)Mike Mulholland'Al the Octopus' has been installed on the roof at the west entrance of Joe Louis Arena in Detroit.\n(Mike Mulholland | MLive.com)Mike MulhollandThe Detroit Lions take the field before their NFL game against the Carolina Panthers at Ford Field in Detroit on Sunday, November 18, 2018.\n(Mike Mulholland | MLive.com)Mike Mulholland"}, {"url": "https://www.aopa.org/news-and-media/all-news/2020/march/18/textron-furloughs-workers", "title": "Textron furloughs workers", "authors": ["David Tulis"], "date": "2020-03-18", "keywords": ["aviation", "meetings", "social", "textron", "statement", "furloughs", "production", "employees", "wichita", "workers", "company"], "summary": "Textron Aviation announced four-week furloughs “for most of our U.S. based employees” beginning March 23 in response to the coronavirus pandemic.\nThe company added that it was “adjusting production to align with anticipated market demand.” With world financial markets cratering amid the unfolding pandemic, “adjusting production” could mean cuts to Cessna or Beechcraft production lines, or both.\nThe Wichita, Kansas-based aviation manufacturer is one of the largest employers in the city and state, The Wichita Eagle reported.\nThe furloughs follow hundreds of Textron layoffs in December 2019 that mostly affected engineers and other professionals.\nThe emailed statement said Textron was following Centers for Disease Control and Prevention guidelines to limit social interaction and large group meetings, increasing daily cleaning of its facilities, restricting travel, and canceling “participation in several global meetings and events.”"}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-december-2-2019", "title": "Headlines for Monday, December 2, 2019", "authors": [], "date": "2019-12-02", "keywords": ["kan", "ap", "kansas", "city", "2019", "county", "headlines", "say", "died", "wichita", "reports", "man"], "summary": "====================Woman Arrested in Death of Her Husband in SalinaSALINA, Kan. (AP) — Authorities have arrested a woman in the killing of her husband in Salina.\n\\=====================Fetus Found in Wichita Died of Stillbirth/MiscarriageWICHITA, Kan. (AP) — Wichita police say a human fetus found near a river in Wichita in November died from stillbirth or miscarriage.\nThe vandalism was discovered earlier this month at a statue honoring abolitionist John Brown in Kansas City, Kansas.\n====================Three Weekend Homicides Reported in Kansas City, MissouriKANSAS CITY, Mo.\n(AP) - The Kansas City Chiefs defense came alive yesterday as the Chiefs defeated the Oakland Raiders by a score of 40-9 at Arrowhead Stadium in Kansas City."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-december-31-2019", "title": "Headlines for Tuesday, December 31, 2019", "authors": [], "date": "2019-12-31", "keywords": ["kan", "officer", "ap", "state", "kansas", "city", "2019", "headlines", "31", "wichita", "woman", "reports", "hospital"], "summary": "====================Missing 15-Year-Old Girl Rescued During Kansas Traffic StopGARDEN CITY, Kan. (AP) — Authorities have rescued a missing 15-year-old girl during a traffic stop in western Kansas.\n(– earlier reporting –)1 Woman, 2 Juveniles Die in Kansas City, Kansas, House FireKANSAS CITY, Kan. (AP) — Police say the deaths of three people in a house fire in Kansas City, Kansas, are being investigated as homicides.\n====================2 Dead in Plane Crash near Suburban Kansas City AirportOLATHE, Kan. (AP) — The Kansas Highway Patrol says two people have died in a small plane crash near a suburban Kansas City airport.\n21 Navy capitalized on a fourth-down gamble in the final minute to beat Kansas State 20-17 in the Liberty Bowl.\nKansas State has bounced back from a 5-7 season to go 8-4 in its first year under coach Chris Klieman."}, {"url": "https://www.zmescience.com/science/coronavirus-updates-news-us-kansas/", "title": "Coronavirus in Kansas — live updates, cases, and news", "authors": [], "date": "2020-04-09", "keywords": ["slowing", "live", "community", "symptoms", "states", "updates", "kansas", "spread", "number", "coronavirus", "rise", "covid19", "disease", "cases"], "summary": "It is very likely that the true number of COVID-19 cases is higher as many cases are asymptomatic.\nWatch for symptomsReported illnesses have ranged from mild symptoms to severe illness and death for confirmed coronavirus disease 2019 (COVID-19) cases.\nThe number of cases of COVID-19 being reported in the United States is rising due to increased laboratory testing and reporting across the country.\nThe growing number of cases in part reflects the rapid spread of COVID-19 as many U.S. states and territories experience community spread.\nThe focus is on protecting the health care system with expected rise in cases by slowing the spread within the community and focused on protecting the vulnerable members of the community."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-december-10-2019", "title": "Headlines for Tuesday, December 10, 2019", "authors": [], "date": "2019-12-10", "keywords": ["kan", "ap", "state", "kansas", "court", "city", "2019", "county", "headlines", "wichita", "reports", "office"], "summary": "Only Kansas Democrat in Congress Supports Impeaching TrumpTOPEKA, Kan. (AP) — The only Kansas Democrat in Congress supports impeaching President Donald Trump.\n====================Man Killed in Shooting Outside Wichita MotelWICHITA, Kan. (AP) — Wichita police say a man died when someone walked up to the vehicle he was in, fired once and ran away.\n====================Lawrence District Considers Suing E-Cigarette Maker JuulLAWRENCE, Kan. (AP) — Another Kansas school district is considering suing a leading e-cigarette maker.\n====================8 Macaroni Penguins Hatch at Kansas City ZooKANSAS CITY, Mo.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://www.ksn.com/community/local-events/december-1-2019/", "title": "December 1, 2019", "authors": [], "date": "2019-11-15", "keywords": ["link", "lights", "christmas", "n", "2019", "dec", "holiday", "click", "santa", "st", "tree"], "summary": "WICHITA AREA2019 Mayor’s Christmas Tree Lighting and Lights on the River Wichita Boathouse, 515 S Wichita St.\n2019 The Arc’s Lights Douglas Ave at St Paul St (between Meridian and West St), through Dec. 28.\nCentering on the town’s annual Christmas Yard Display Contest, a “Christmas Phantom” threatens to throw the contest into turmoil.\nOld Fashioned Christmas at Prairie Pines Christmas Tree Farm 4055 N. Tyler Rd.\nBuy and cut down your own Christmas tree with your family or choose a pre-cut tree."}, {"url": "https://www.cnbc.com/2019/12/27/explosion-at-kansas-aircraft-plant-injures-11-people.html", "title": "Explosion at Kansas aircraft plant injures 11 people", "authors": [], "date": "2019-12-27", "keywords": ["explosion", "aircraft", "injures", "wegner", "kansas", "sedgwick", "gas", "nitrogen", "county", "liquid", "wichita", "potentially", "plant", "11"], "summary": "Damage from explosion at a Beechcraft plant in east Wichita, Kansas.\nA liquid nitrogen explosion at a Textron Aviation plant near Wichita, Kansas, injured 11 people on Friday, potentially setting back the introduction of a new aircraft under development, county and company officials said.\nEmergency medical services took 11 people to the hospital, one of them suffering potentially serious injuries, Dr. John Gallagher, director of Sedgwick County EMS, told a news conference.\nInjuries were limited because a skeleton crew was on duty during the holidays, said Deputy Chief Daniel Wegner of the Sedgwick County Fire Department.\nThe explosion in a 3-inch liquid nitrogen gas line also damaged a storage tank, causing nitrogen gas to vent out of the building, Wegner said."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-december-9-2019", "title": "Headlines for Monday, December 9, 2019", "authors": [], "date": "2019-12-09", "keywords": ["kan", "ap", "state", "kansas", "city", "2019", "county", "headlines", "say", "sheriffs", "office", "man"], "summary": "====================Kansas Sheriff's Deputy Accused of Stalking Co-WorkerWICHITA, Kan. (AP) — A Sedgwick County Sheriff's Office jail deputy has been arrested after being accused of stalking a co-worker.\nThe sheriff's office says in a news release that Shawn McGonnigil was arrested Friday and has been placed on administrative leave.\nThe sheriff's office says its Professional Standards Unit is also investigating the allegations against McGonnigil.\n====================Lawrence School District Considers Suing E-Cigarette Maker JuulLAWRENCE, Kan. (AP) — Another Kansas school district is considering suing a leading e-cigarette maker.\n(AP) — Police in Kansas City, Missouri, no longer will give suspects a written warning of their right to remain silent."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-december-27-2019", "title": "Headlines for Friday, December 27, 2019", "authors": [], "date": "2019-12-27", "keywords": ["kan", "ap", "kansas", "city", "2019", "county", "headlines", "topeka", "woman", "wichita", "reports", "man", "27"], "summary": "Authorities say Ballard repeatedly hurt her and drove her to Cherokee County, Kansas, in the state’s southeastern corner.\nMcIntyre was 17 in 1994 when he was arrested in Kansas City for the double homicide.\nThe Kansas City Star reports that Olathe, Kansas, police on Thursday identified the victim as 68-year-old Patricia Fitzgerald of Montgomery, Texas.\nThe Lawrence, Kansas, man was 38 when he was reported missing on June 11, 2015.\n====================2 16-Year-Olds Injured in Wichita ShootingWICHITA, Kan. (AP) — Two 16-year-olds are hospitalized but expected to survive after a shooting in Wichita."}, {"url": "https://www.ksn.com/community/local-events/december-31-2019/", "title": "December 31, 2019", "authors": [], "date": "2019-11-21", "keywords": ["link", "music", "lights", "day", "n", "snow", "christmas", "2019", "holiday", "click", "31", "100"], "summary": "WICHITA AREAHolly Jolly Jurassic Holiday 2019 Field Station: Dinosaurs, 2999 N. Rock Road, Derby.\nWichita’s premier light display with more than 2 million lights, live music, carolers.\nA holiday music journey Exploration Place Dome Theater, 300 N. McLean Blvd.\nClick link for details.\nWichita Snow Day Mid-America All-Indian Center, 650 N. Seneca."}, {"url": "https://more.thomasmore.edu/?p=8549", "title": "Faculty Notes", "authors": [], "date": "2020-03-31", "keywords": ["notes", "department", "presented", "thomas", "phd", "based", "2019", "citizenship", "faculty", "arts", "teaching", "online"], "summary": "The chapter is based on a professional development workshop the three presented at the 2019 Academy of Management Conference.\nCOLLEGE OF ARTS & SCIENCESDwyerCaitlin Dwyer, M.T.S., Department of Theology, presented a talk on the theology of femininity at the mother-daughter community event Beautifully You!\nElizabeth Neal, Art Department, presented artwork in November 2019 at the 1305 Gallery on Main Street in Cincinnati.\nTheir presentation, “Stimulating Critical Thinking: Interdisciplinary Perspectives on Democratic Citizenship,” was based upon their team-teaching experience during the 2019 spring semester.\nINSTITUTE FOR ETHICAL LEADERSHIP & INTERDISCIPLINARY STUDIESSchumacherAnthony Schumacher, Ph.D., completed the Online Learning Consortium’s online teaching certificate and was interviewed for their September newsletter."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-december-3-2019", "title": "Headlines for Tuesday, December 3, 2019", "authors": [], "date": "2019-12-03", "keywords": ["kan", "ap", "shot", "kansas", "city", "2019", "headlines", "say", "topeka", "wichita", "reports", "man"], "summary": "====================Police Are Searching for Evidence in 20-Year-Old Cold CaseKANSAS CITY, Kan. (AP) — Authorities have used ground-penetrating radar to search for evidence in a 20-year-old missing person case.\nKansas City, Kansas, police said in a news release that officers searched Monday on an empty lot and found an anomaly in an area that once contained a home where Star Boomer stayed off and on with her boyfriend.\nThe Kansas City Star reports that two Kansas City, Kansas, men were charged in her disappearance in October 1999.\n====================Woman Arrested in Death of Her Husband in SalinaSALINA, Kan. (AP) — Authorities have arrested a woman in the killing of her husband in Salina.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://www.kcur.org/news/2020-04-10/live-coverage-coronavirus-in-the-kansas-city-area", "title": "Live Coverage: Coronavirus In The Kansas City Area", "authors": [], "date": "2020-04-10", "keywords": ["live", "department", "public", "state", "area", "kansas", "city", "coronavirus", "health", "county", "covid19", "missouri", "coverage"], "summary": "County workers will run the mobile unit in the parking lot next to Kansas City, Kansas City Hall at 619 Anne Avenue.\nThe joint KC Chamber, Civic Council of Greater Kansas City and the Kansas City Area Development Council survey includes responses from about 340 businesses.\nKansas City, Kansas officials hope that limiting interactions in this way will prevent the further spread of the virus.\nLocal health centers and the money they’re getting include:Turner House Clinic in Kansas City, Kansas – $64,427Health Partnership Clinic, Olathe, Kansas – $72,310Kansas City Care Clinic, Kansas City, Missouri – $70,040Samuel U. Rodgers Health Center, Kansas City, Missouri – $82,066Swope Health Services, Kansas City, Missouri – $114,755Northwest Health Services, St. Joseph, Missouri – $82,182.\nThe fund will be managed by the Greater Kansas City Community Foundation, United Way of Greater Kansas City, LISC Greater Kansas City and the Mid-America Regional Council."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-friday-december-6-2019", "title": "Headlines for Friday, December 6, 2019", "authors": [], "date": "2019-12-06", "keywords": ["kan", "stolen", "ap", "university", "kansas", "city", "released", "2019", "county", "headlines", "say", "authorities"], "summary": "====================Deaths of 2 Men from Junction City Considered Murder-SuicideJUNCTION CITY, Kan. (AP) -- Authorities say the deaths of two men from Junction City are being investigated as a murder-suicide.\nGeary County authorities say the bodies of 27-year-old Zachary Lima and 24-year-old Christopher Young were found late Thursday near Milford Lake Dam in Junction City.\n====================Man Dies in Central Kansas Duplex FireMARION, Kan. (AP) — Authorities are investigating a deadly fire at a duplex in central Kansas.\n====================Driver Crashes into Wichita Home While Fleeing from PoliceWICHITA, Kan. (AP) — A driver has crashed into a Wichita home while fleeing from police.\n====================Kansas City Looks for New Homes for Some City InmatesKANSAS CITY, Mo."}, {"url": "https://www.ksn.com/community/local-events/december-3-2019/", "title": "December 3, 2019", "authors": [], "date": "2019-11-15", "keywords": ["link", "park", "lights", "christmas", "2019", "dec", "holiday", "click", "st", "hours", "tree"], "summary": "WICHITA AREA2019 The Arc’s Lights Douglas Ave at St Paul St (between Meridian and West St), through Dec. 28.\nOld Fashioned Christmas at Prairie Pines Christmas Tree Farm 4055 N. Tyler Rd.\nBuy and cut down your own Christmas tree with your family or choose a pre-cut tree.\nClick link for ticket information.\nWINFIELD – Isle of Lights Island Park, 200 N. Main St. Open nightly 6:00 – 10:00. until Dec. 30."}, {"url": "https://www.courthousenews.com/woman-who-accused-astronaut-ex-wife-is-herself-accused/", "title": "Woman Who Accused Astronaut Ex-Wife Is Herself Accused", "authors": ["Cameron Langford"], "date": "2020-04-07", "keywords": ["worden", "international", "nasa", "mcclain", "astronaut", "station", "exwife", "wordens", "woman", "accused", "account", "filed", "space", "told"], "summary": "HOUSTON (CN) — A woman who accused her ex-wife, a NASA astronaut, of accessing her bank account without permission from the International Space Station was charged with fabricating the allegations in a federal indictment unsealed Monday.\nThe International Space Station in 2009, as seen from the Space Shuttle Discovery during separation.\nWorden filed for divorce that year, and McClain went to court to try to get custody of Worden’s son.\nShe finished her training in July 2015 and deployed to the International Space Station in December 2018.\nDays before McClain was scheduled to do the first all-female space walk with fellow astronaut Christina Koch in March 2019, Worden filed her complaint with the FTC."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-thursday-december-12-2019", "title": "Headlines for Thursday, December 12, 2019", "authors": [], "date": "2019-12-12", "keywords": ["kan", "body", "ap", "12", "state", "kansas", "million", "city", "school", "2019", "board", "headlines", "man"], "summary": "Kansas City, Kansas, Police Say Burned Body Found in BarrelKANSAS CITY, Kan. (AP) — Kansas City, Kansas, police say a badly burned body was found inside a barrel near a cemetery.\n====================New Kansas City Airport Will Include 2 All-Gender BathroomsKANSAS CITY, Mo.\n(AP) — Kansas City's new airport will include two all-gender bathrooms, as well as other bathrooms designed to be inclusive and convenient.\n====================Construction on American Royal Complex in KCK to Start Next YearKANSAS CITY, Kan. (AP) — The American Royal plans to begin construction on its new complex in Kansas City, Kansas, next year.\nKansas City, Kansas, police spokesman Jonathon Westbrook said Thursday that law enforcement arrested 29-year-old Hugo Villanueva-Morales."}, {"url": "https://kslsports.com/432011/local-college-basketball-players-in-transfer-portal/", "title": "Local College Basketball Players In Transfer Portal", "authors": ["Kyle Ireland", "Ksl Sports"], "date": "2020-04-07", "keywords": ["portal", "assists", "state", "rebounds", "according", "college", "guard", "local", "games", "basketball", "utah", "players", "points", "season", "transfer", "averaged"], "summary": "SALT LAKE CITY, Utah – A number of players from local college basketball teams in the state of Utah announced they were exploring the option of leaving for a new school this offseason.\nFrom BYU to Utah to Utah State and more, here are the local college basketball players in the NCAA transfer portal.\nHe joined the BYU basketball program for the 2019-20 season after playing at Utah State Eastern.\nPrior to joining the Utah State program, the big man played for the College of Southern Idaho.\nDuring his time with Utah State, Porter averaged 4.3 points, 1.9 rebounds and 2.3 assists per game."}, {"url": "https://www.ksn.com/news/crime/wpd-continue-search-for-hit-and-run-vehicle-and-driver/", "title": "Police search for hit-and-run vehicle and driver", "authors": ["Ksn News", "The Associated Press"], "date": "2019-12-06", "keywords": ["wpd", "requesting", "struck", "hitandrun", "vehicle", "regarding", "driver", "search", "wichita", "information", "interest", "truck"], "summary": "WICHITA, Kan. (KSNW) – Police are still requesting help from the public to locate a vehicle of interest involved in a hit-and-run in Wichita.\nOne person was in critical but stable condition after being struck by a hit-and-run driver on Thursday.\nThe WPD is requesting information regarding the pictured vehicle of interest regarding a hit and run accident on Thursday.\nThe WPD is requesting information regarding the pictured vehicle of interest regarding a hit and run accident on Thursday.\nIf you have any information that could help police find the driver, call Crime Stoppers at (316) 267-2111."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-december-24-2019", "title": "Headlines for Tuesday, December 24, 2019", "authors": [], "date": "2019-12-24", "keywords": ["kan", "ap", "state", "kansas", "city", "rural", "2019", "headlines", "24", "wichita", "federal", "road", "man"], "summary": "But the Kansas Supreme Court that Marla Luckert leads faces a Republican-controlled Legislature that's been sharply critical of the court.\nThe hospital also addressed another inspection issue by telling federal officials that treatment plans will be individualized for each patient.\nThe Kansas State Highway Patrol said 24-year-old Robert Jackson was being pursed by law enforcement around 11:30 p.m. Monday when the road went from pavement to gravel.\nPolice said 24-year-old Zachary Morrisey, of Kansas City, was sitting in a vehicle when someone walked up to it and began shooting.\n====================KPR's daily headlines are generally posted by 10 am weekdays and updated throughout the day."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-tuesday-december-17-2019", "title": "Headlines for Tuesday, December 17, 2019", "authors": [], "date": "2019-12-17", "keywords": ["kan", "ap", "state", "kansas", "court", "city", "2019", "county", "headlines", "17", "man", "missouri", "states"], "summary": "All of the victims were students of either Kansas State University or the University of Kansas.\nThe Missouri State Highway Patrol said it had responded to 525 calls from stranded motorists and to 559 traffic crashes.\n-related-Wichita Man Dies in Weather-Related AccidentSEDGWICK COUNTY, Kan. (Salina Post) — One person died in an accident Sunday night in Sedgwick County.\n====================Kansas Man Whose Granddaughter Died Bonds Out of JailTOPEKA, Kan. (AP) — A Kansas man whose 4-year-old granddaughter from Nebraska died is out of jail after a judge reduced his bond.\nCol. Bill Hannan, commander of the Kansas City District, announced Monday emergency operations were ending and the district was returning to normal operations."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-saturday-december-21-2019", "title": "Headlines for Saturday, December 21, 2019", "authors": [], "date": "2019-12-21", "keywords": ["kan", "sentenced", "ap", "state", "21", "kansas", "court", "city", "life", "sex", "2019", "headlines", "man"], "summary": "================Kansas Man Sentenced for Molesting Girls over 4 YearsWICHITA, Kan. (AP) — A 51-year-old Maize man has sentenced to life in prison without parole for 25 years for molesting two girls over four years.\n================Man Pleads Guilty in Topeka Motel Strangulation DeathTOPEKA, Kan. (AP) — A 29-year-old man has admitted strangling an Osawatomie woman at a Topeka hotel.\n================Police: Man Injured in Wichita Hit-and-run DiesWICHITA, Kan. (AP) — Wichita police say a man who was injured in a hit-and-run earlier this month has died.\n================Feds: Kansas Mental Hospital at Risk of Losing Medicare FundingOSAWATOMIE, Kan. (AP) — One of Kansas' two state mental hospitals is again at risk of losing Medicare funds.\n================Topeka Man Admits Killing Girlfriend on Cruise ShipKANSAS CITY, Kan. (AP) — A 55-year-old Kansas man has admitted that he killed his girlfriend during a fight aboard a cruise ship off the coast of Florida last year."}, {"url": "https://www.businessinsider.com/esper-pompeo-west-point-class-1986-role-in-trump-administration-2020-4", "title": "How the 'West Point mafia' wields power in and around the Trump White House", "authors": ["Danny Sjursen"], "date": "2020-04-14", "keywords": ["army", "mafia", "point", "secretary", "esper", "west", "defense", "state", "white", "wields", "power", "pompeo", "86", "house", "class", "trump"], "summary": "Every West Point class votes on an official motto.\nThe West Point mafiaTrump presents the Commander-in-Chief's Trophy to the US Military Academy football team in the Rose Garden at the White House, May 1, 2018.\nREUTERS/Leah MillisThe core group of '86 grads cheekily refer to themselves as \"the West Point mafia.\"\nThen there's the retired colonel who, like me, taught on the West Point history faculty.\nIronically, this will inevitably include the blood of future West Point graduates, doomed to serve in their hopeless crusades."}, {"url": "https://www.ksn.com/news/local/fire-crews-battle-west-wichita-house-fire/", "title": "Improper ash disposal cause of fire at west Wichita home", "authors": ["Jasmine Haynes", "Alexis Padilla", "Angelica Castelo"], "date": "2019-12-10", "keywords": ["scene", "structure", "west", "socora", "disposal", "homethe", "wichita", "ash", "wichitafireorg", "inside", "improper", "caused", "cause", "socorathe"], "summary": "WICHITA, Kan. (KSNW) – Improper ash disposal from a fireplace caused a fire in a west Wichita home.\nThe fire broke out around 12:30 p.m. Tuesday near Maple and Socora.\nThe Wichita Fire Department arrived to find fire coming from the roof of the home.\nThe fire caused $170,000 in damage to the contents and structure of the home.\npic.twitter.com/7RwXNT4T6Y — WichitaFire.org (@wichitafireorg) December 10, 2019LATEST STORIES:"}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-monday-december-30-2019", "title": "Headlines for Monday, December 30, 2019", "authors": [], "date": "2019-12-30", "keywords": ["kan", "ap", "state", "kansas", "city", "2019", "30", "mcdonalds", "headlines", "say", "died", "reports", "hospital"], "summary": "====================2 Adults, 1 Juvenile Killed in Kansas City, Kansas, House FireKANSAS CITY, Kan. (AP) — Police say the deaths of three people in a house fire in Kansas City, Kansas, are being investigated as homicides.\nJunction City McDonald's owner Dana Cook said in a written statement that the store has video showing it wasn’t their employee.\n====================As Crimes Continue, DOJ Will Add More Police in Kansas City AreaKANSAS CITY, Mo.\nKansas City, Missouri, is on its way to report about 150 homicides and officials are projecting another 500 nonfatal shootings by year's end.\nThe Kansas City Star reports that the commission released an order Friday requiring Sanders to reimburse his campaign committee $2,500."}, {"url": "https://kansaspublicradio.org/kpr-news/headlines-wednesday-december-25-2019", "title": "Headlines for Wednesday, December 25, 2019", "authors": [], "date": "2019-12-25", "keywords": ["kan", "department", "ap", "state", "kansas", "25", "city", "enrollment", "2019", "headlines", "wichita", "road", "man"], "summary": "The state Department for Children and Families says its annual drive raised more than $4,000 in money and gift cards while also providing wish lists.\nDennis is state government's leading expert on public school funding and has worked as an administrator at the State Department of Education for 52 years.\nThe Kansas City Star reports that police were dispatched to a southern Kansas City neighborhood about 11:30 p.m. Tuesday.\nThe Star said data it has maintained shows that the shooting was the 149th homicide in Kansas City this year.\nPolice said 24-year-old Zachary Morrisey, of Kansas City, was sitting in a vehicle when someone walked up to it and began shooting."}, {"url": "https://www.ksn.com/home-for-the-holidays/christmas-across-kansas-2019/", "title": "Christmas Across Kansas 2019", "authors": [], "date": "2019-11-15", "keywords": ["spirit", "events", "kansas", "day", "christmas", "enjoy", "snow", "2019", "holiday", "click", "wichita", "yearhappy"], "summary": "WICHITA, Kan. (KSNW) – Communities across Kansas are getting into the holiday spirit.\nClick a date to see the events happening in the Wichita area and elsewhere in Kansas.\nIf you want to send us an event to add to the calendar, click on Connect3Now.\nDecember 30, Monday One of your remaining chances to enjoy some holiday shows, lights and music in 2019December 31, Tuesday Snow Day!\nPlus, enjoy the final day of some holiday favorites and have fun ringing in the New YearHappy New Year!"}]