[{"url": "https://www.hcpress.com/obituaries/watauga-avery-obituaries-april-7-2020.html", "title": "Watauga, Avery Obituaries – April 7, 2020", "authors": [], "date": "2020-04-07", "keywords": ["family", "avery", "boone", "2020", "watauga", "survived", "passed", "funeral", "wife", "nc", "obituaries", "husband", "miller"], "summary": "Ralph Anthony Nilles1928 – 2020Ralph A. Nilles, 91, passed away Sunday, March 29, 2020 at Horizons Memory Care in Boone, NC.\nBorn January 4, 1947 in Watauga County, he was a son of the late Thomas Jefferson and Mae Church Wall.\nPO Box 1586, Boone, NC 28607.\nPlease mail to Treasurer, Snow Lodge 363, PO Box 2672, Boone, NC 28607.\nHazel Triplett TateJune 23, 1914 – April 01, 2020Hazel Triplett Tate, age 105, of Boone, passed away Wednesday evening, April 1, 2020, at Glenbridge Health and Rehabilitation in Boone."}, {"url": "https://myfox8.com/news/man-shot-to-death-in-winston-salems-first-homicide-of-2020/", "title": "Man shot to death in Winston-Salem's first homicide of 2020", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-20", "keywords": ["man", "moran", "2020", "yearat", "shot", "watch", "winstonsalem", "homicide", "say", "shooting", "willard", "responded", "ems", "winstonsalems", "death", "citys"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A man was shot and killed in what Winston-Salem police say is the city's first homicide of the year.\nAt about 4:53 p.m. Saturday, officers responded to a report of unknown trouble and an EMS call on the 2400 block of Willard Road.\nAt the scene, EMS and police found 22-year-old Antonio Moran, of Winston-Salem, unresponsive in the road on Willard Road.\nDetectives with the Criminal Investigations Division responded and determined Moran was shot.\nWinston-Salem police say this is the city's first shooting of 2020."}, {"url": "https://myfox8.com/news/person-sent-to-hospital-after-being-shot-while-driving-in-winston-salem-police-say/", "title": "Person sent to hospital after being shot while driving in Winston-Salem, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-11", "keywords": ["gilmer", "block", "hospital", "told", "shot", "person", "officers", "winstonsalem", "driving", "say", "department", "sent", "victim"], "summary": "WINSTON-SALEM, N.C. — A male victim was sent to the hospital after he was shot while driving in Winston-Salem Friday, according to a Winston-Salem Police Department news release.\nAt 10:30 p.m., officers were told that a victim had arrived at a local hospital with a non-life threatening gunshot wound to the shoulder.\nTyshawn Everette, of Winston-Salem, said he was driving in the 2800 block of Gilmer Avenue when another vehicle drove up next to him and started shooting.\nEarlier in the night, around 8:52 p.m., officers responded to the 2800 block of Gilmer Avenue after they were told about guns being fired in the area.\nAnyone with any information regarding this incident or similar crimes is asked to call the Winston-Salem Police Department at (336) 773-7700."}, {"url": "https://myfox8.com/news/1-person-shot-near-hanes-mall-in-winston-salem/", "title": "1 person shot on sidewalk outside Hanes Mall in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-25", "keywords": ["suspected", "shooter", "taken", "shot", "outside", "person", "videowinstonsalem", "watch", "store", "winstonsalem", "mall", "hanes", "sidewalk", "victim"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- One person was shot outside of Hanes Mall in Winston-Salem on Friday night, Winston-Salem police confirm.\nThe victim, identified only as a male, was shot on the sidewalk outside the entrance to Forever 21 as he exited the store around 8:30 p.m., according to police.\nWinston-Salem police said the suspected shooter is in police custody and is being questioned.\nThe victim was taken to the hospital with non-life-threatening injuries.\nPolice said they believe the shooter and victim knew each other and it was not a random shooting."}, {"url": "https://myfox8.com/news/2-men-shot-taken-to-hospital-after-argument-in-winston-salem-police-say/", "title": "2 men shot, taken to hospital after argument in Winston-Salem, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-18", "keywords": ["rodriguez", "hospital", "taken", "shot", "men", "villegas", "villareal", "watch", "woundsthe", "winstonsalem", "videowinstonsalem", "say", "department", "argument", "wake"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Two men were shot in Winston-Salem Saturday and taken to the hospital, according to a Winston-Salem Police Department news release.\nJorge Villareal Rodriguez, 19, of Winston-Salem, and Oscar Villegas, 22, of Winston-Salem were found when police responded to the “Lubuchanas” Bar at 2915 Starlight Drive after they heard gunfire.\nOfficers arrived around 12:22 a.m. and found Rodriguez and Villegas lying in the parking lot with apparent gunshot wounds.\nRodriguez and Villegas were taken to Wake Forest Baptist Medical Center.\nThe Winston-Salem Police Department requests that anyone with information regarding this incident contact CrimeStoppers at (336) 727-2800."}, {"url": "https://theundefeated.com/features/samuel-puryear-howards-new-golf-coach-knows-how-to-win/", "title": "Samuel Puryear, Howard’s new golf coach, knows how to win", "authors": ["Nathaniel Easington"], "date": "2020-04-15", "keywords": ["youre", "things", "university", "knows", "hbcu", "think", "samuel", "howards", "win", "puryear", "coach", "golf", "lot", "howard", "thats", "looking"], "summary": "Samuel Puryear Jr., Howard University’s new men’s and women’s golf coach, is returning to his HBCU roots.\nSo, you’re looking at a lot of video, which you do anyway, but now that’s your only way to do it.\nSo now you’re looking at a golf resume.\nYou’re looking at junior tournaments and you’re looking at golf video.\nI think you’re looking at students from coast to coast, honestly."}, {"url": "https://myfox8.com/news/police-investigating-reported-shooting-in-winston-salem/", "title": "Police investigating reported shooting in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-19", "keywords": ["unclear", "sprague", "suspects", "videowinstonsalem", "street", "road", "watch", "winstonsalem", "timeno", "shooting", "willard", "investigating", "reported", "victim"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Police say Willard Road between Sprague Street and Interstate 40 will be closed for several hours while officers investigate a reported shooting.\nOfficers responded to Willard Road at Green Oaks at 4:53 p.m. over a report of a shooting.\nThere is one victim, police say.\nTheir condition is unclear at this time.\nNo suspects are in custody."}, {"url": "https://myfox8.com/news/homicide-investigation-underway-after-person-found-dead-in-winston-salem-home/", "title": "Homicide investigation underway after person found dead in Winston-Salem home", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-31", "keywords": ["336", "trouble", "dead", "investigation", "believe", "unknown", "suspects", "person", "woundthe", "underway", "winstonsalem", "homicide", "responded"], "summary": "WINSTON-SALEM, N.C. — Winston-Salem police have launched a homicide investigation after a person was found dead in a home.\nAt about 3:15 a.m. Friday, police responded to an unknown trouble call that suggested a person was found dead in a home at 2917 Frank Street.\nOfficers immediately responded to the scene and found the person dead inside.\nThe person has injuries that investigators believe may be a gunshot wound.\nAnyone with information is asked to contact Winston-Salem police at (336) 773-7700 or CrimeStoppers at (336) 727-2800."}, {"url": "https://myfox8.com/news/winston-salem-homeowners-exchange-gunfire-with-break-in-suspect-police-say/", "title": "Winston-Salem homeowners exchange gunfire with break-in suspect, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-13", "keywords": ["exchange", "sagewood", "gunfire", "homeowners", "breakin", "told", "winstonsalem", "say", "responded", "suspect", "lane"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Winston-Salem homeowners exchanged gunfire with a suspect who broke into their home Monday, according to a Winston-Salem Police Department news release.\nOfficers responded to Sagewood Lane around 12:35 a.m. when they were told about guns being fired in the area.\nAfter hearing about the break-in, the homeowners reportedly went home and saw the suspect in their house.\nAt that point, gunfire was exchanged between the suspect and the homeowners, the release says.\nSurveillance picture from Sagewood Lane home invasionSurveillance picture from Sagewood Lane home invasionWinston-Salem homeowners exchange gunfire with break-in suspect, police sayWinston-Salem homeowners exchange gunfire with break-in suspect, police sayPolice say a nearby home was hit during the gunfire, and no one was injured."}, {"url": "https://myfox8.com/news/juvenile-shot-in-winston-salem-police-say/", "title": "Juvenile shot in Winston-Salem, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-28", "keywords": ["grant", "investigation", "shot", "information", "winstonsalem", "say", "area", "juvenile", "department", "street", "avenue", "victim"], "summary": "WINSTON-SALEM, N.C. — A juvenile victim was shot in Winston-Salem Tuesday, according to a Winston-Salem Police Department news release.\nOfficers responded to the 1700 block of Grant Avenue around 5 p.m. when they were told about a shooting.\nThe victim was reportedly walking with friends in the Thurmond Street area near 20th Street when several shots were heard.\nShe realized that she had been shot and ran to the area of Grant Avenue where police were called.\nThis investigation is in its early stages and the Winston-Salem Police Department requests that anyone with information regarding this incident contact CrimeStoppers at (336) 727-280036.09986 -80.244216"}, {"url": "https://myfox8.com/news/person-taken-to-hospital-after-vehicle-rolls-over-during-crash-in-winston-salem-police-say/amp/", "title": "Person taken to hospital after vehicle rolls over during crash in Winston-Salem, police say", "authors": ["Digital Desk"], "date": "2020-01-08", "keywords": ["crash", "main", "hospital", "taken", "work", "vehicle", "person", "rolls", "winstonsalem", "say", "lanes", "southbound", "wake", "52", "yetthe"], "summary": "WINSTON-SALEM, N.C. -- A person was taken to Wake Forest Baptist Medical Center after a crash in Winston-Salem, according to a Winston-Salem Police Department news release.\nOfficers are investigating the crash that happened in the southbound lanes of U.S. 52 at South Main Street.\nThe vehicle reportedly rolled over during the crash.\nPolice say the extent of the person's injuries has not been determined yet.\nThe southbound lanes of U.S. 52 at Main Street have been temporarily closed while first responders work to clear the road and investigate the cause of the accident."}, {"url": "https://myfox8.com/news/blocked-voter-id-law-sparks-protest-in-winston-salem/", "title": "Blocked voter ID law sparks protest in Winston-Salem", "authors": ["Daniel Pierce", "Cnn Wire", "Digital Desk"], "date": "2020-01-03", "keywords": ["sparks", "protest", "voting", "id", "law", "state", "blocked", "decision", "north", "carolina", "vote", "winstonsalem", "voter", "recent"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Thursday afternoon North Carolina Attorney General Josh Stein announced that he will fight the recent decision to block the state’s voter ID law.\nAmong their arguments, they claim that even though the state will give out free voter IDs, the limited times and locations directly impact minorities.\nThe preliminary injunction means North Carolina can’t require voter ID at the polls in upcoming elections without further notice from the court.\nHe voted for the Voter ID Law in 2018 and said he feels that vote is now being overlooked.\nThe attorney general’s office was not able to give a timetable for when a decision will be made on the blocked voter ID law."}, {"url": "https://myfox8.com/news/woman-found-shot-to-death-in-vacant-lot-in-winston-salem-identified-2/", "title": "Man charged with murder after woman found shot to death in vacant lot in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-08", "keywords": ["county", "man", "forsyth", "336", "shot", "richardson", "arrested", "watch", "officers", "winstonsalem", "woman", "vacant", "lot", "death", "murder", "stover", "charged"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A man was arrested Tuesday, months after a woman was killed in Winston-Salem, according to police.\nAt 9:29 a.m. on May 9, officers came to the 400 block of Liberia Street and found a woman lying in a vacant lot unresponsive.\nWinston-Salem police believe Richardson was shot to death.\nHe is being held in the Forsyth County Law Enforcement Detention Center under no bond allowed.\nAnyone with information is asked to contact the Winston-Salem Police Department at (336) 773-7700 or CrimeStoppers at (336) 727-2800."}, {"url": "https://myfox8.com/news/city-of-winston-salem-stresses-importance-of-the-census/", "title": "City of Winston-Salem stresses importance of the Census", "authors": ["Olivia Steen", "Cnn Wire", "Digital Desk"], "date": "2020-01-17", "keywords": ["thatll", "saidthe", "gets", "money", "importance", "lunch", "education", "winstonsalem", "stresses", "city", "mcneal", "census", "adams"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- The City of Winston-Salem is promoting awareness and education as the 2020 US Census gets closer.\n“The count determines so much,\" said Ed McNeal, city marketing director.\nThe Census affects how much money the state gets for road projects, higher education and emergency services.\nAdams, city council member.\n“Our yard waste trucks that have to go down just about every street in the city that'll be out in the city as well,\" McNeal said."}, {"url": "https://myfox8.com/news/2-sent-to-hospital-including-1-with-serious-injuries-after-rescued-from-wreck-in-winston-salem/", "title": "2 sent to hospital, including 1 with serious injuries, after rescued from wreck in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-03", "keywords": ["rescued", "wreck", "injuries", "trapped", "station", "hospital", "taken", "videowinstonsalem", "including", "vehicle", "video", "watch", "serious", "winstonsalem", "vehiclethey", "sent"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Two people were sent to the hospital after a crash trapped them inside a vehicle in Winston-Salem, according to the fire department.\nAt about 1:21 a.m. Friday, the Winston-Salem Fire Department shared video of the scene showing crews on scene.\nOfficials say a vehicle crashed on Bethania Station Road.\nCrews had to pull two people from the vehicle.\nThey were both taken to a hospital, one of them with serious injuries."}, {"url": "https://myfox8.com/news/2019-marks-violent-year-for-winston-salem-juveniles/", "title": "2019 marks violent year for Winston-Salem juveniles", "authors": ["Daniel Pierce", "Cnn Wire", "Digital Desk"], "date": "2020-01-09", "keywords": ["seized", "marks", "teens", "reach", "winstonsalem", "tollie", "violent", "2019", "juveniles", "young", "saw", "increase"], "summary": "During a public safety news conference, Winston-Salem police announced they saw an increase in almost every violent crime category.\nCompared to 2018, the 2019 year saw a 19.2 percent increase in homicides, a 12.6 percent increase in rape and a 17.1 percent increase in aggravated assaults.\nThe most concerning part of 2019 was the number of teenagers involved in violent crimes.\nLast year alone, 169 juveniles between the ages of 7 and 17 were arrested for violent crimes.\nWhen it comes to victims of violent crimes, more than 508 juveniles were involved, six of whom were killed."}, {"url": "https://myfox8.com/news/2-similar-armed-robberies-at-winston-salem-michaels-subway/", "title": "2 'similar' armed robberies at Winston-Salem Michaels, Subway", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-31", "keywords": ["minutes", "michaels", "think", "took", "boulevard", "went", "robberies", "vehicle", "waistband", "thingwinstonsalem", "winstonsalem", "armed", "subway", "similar"], "summary": "WINSTON-SALEM, N.C. — Winston-Salem police are looking for someone they think may have committed two armed robberies within 20 minutes of each other on Thursday night.\nThe first happened at the Michaels store on Hanes Mall Boulevard around 6:40 p.m.\nTwenty minutes later, at the Subway on Northpoint Boulevard, a suspect with the same description did the same thing.\nWinston-Salem police called the incident “similar” to the armed robbery at the Michaels.\nNobody was hurt in either armed robbery."}, {"url": "https://myfox8.com/news/company-plans-to-continue-downtown-winston-salems-revitalization-with-one-stop-destination/", "title": "Company plans to continue downtown Winston-Salem’s revitalization with 'one-stop destination'", "authors": ["Michael Hennessey", "Digital Desk", "Cnn Wire"], "date": "2020-01-09", "keywords": ["downtown", "salem", "building", "continue", "street", "correll", "destination", "winstonsalem", "onestop", "liberty", "plans", "food", "area", "company", "winstonsalems", "revitalization"], "summary": "It’s a historic building and the company that just bought it is trying to make history of their own.\nMayfair Street Partners recently wrapped up the renovations of the Pepper Building in the heart of downtown, transforming it into the Hotel Indigo.\nOn the North Liberty Street level, they’ll put in a brewery, self-serve beer taps and six food stalls, which will range from pizza to Chinese and Mexican cuisine.\nThe crowning jewel is a rooftop bar, complete with one of the better views of downtown one could ask for.\n\"Right in the bullseye of the revitalization of downtown Winston-Salem,” Correll said."}, {"url": "https://myfox8.com/news/man-sentenced-to-at-least-32-years-in-prison-for-killing-man-in-winston-salem/", "title": "Man sentenced to at least 32 years in prison for killing man in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-16", "keywords": ["man", "2018", "months", "sentenced", "mccullin", "winstonsalem", "32", "killing", "apartment", "youngers", "guilty", "prison", "younger", "murder"], "summary": "WINSTON-SALEM, N.C. — A man has been sentenced to prison after pleading guilty to a 2018 murder in Winston-Salem, according to a news release from Forsyth County district attorney’s office.\nMichael Lamont Younger, 49, pleaded guilty to second-degree murder on Thursday.\nOfficers came to 114 Weatherwood Court, Apartment E, at 8:56 p.m. on Jan. 15, 2018, for a welfare check.\nAn autopsy determined McCullin died from strangulation and Younger’s blood was found McCullin’s body.\nYounger was sentenced to a minimum of 386 months and a maximum of 472 months in prison."}, {"url": "https://myfox8.com/news/winston-salem-woman-plans-to-start-ministry-after-winning-1000-a-day-for-life-lottery-prize/", "title": "Winston-Salem woman plans to start ministry after winning $1,000 a day for life lottery prize", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-14", "keywords": ["yadkinville", "start", "winning", "money", "lucky", "won", "day", "ticket", "winstonsalem", "woman", "nc", "prize", "plans", "ministry", "lottery", "life", "zepponi"], "summary": "RALEIGH, N.C. — A Winston-Salem woman won a life-changing amount of money with a Lucky for Life ticket, according to the N.C. Education Lottery.\nOn Thursday, 47-year-old Damian Zepponi, of Winston-Salem.\nZepponi says she wants to save and invest the money and live off the investments, and some of the prize money will go towards starting a ministry to help others.\nBIG WINNER ALERT: One lucky #NCLottery player matched all five white balls and the Lucky Ball, winning $1,000 A Day For Life in last night's #LuckyForLife drawing.\nThe winning ticket was sold at the @FoodLion on Yadkinville Rd."}, {"url": "https://wtkr.com/2020/01/24/six-deaths-from-flu-reported-in-north-carolina-last-week/", "title": "Six deaths from flu reported in North Carolina last week", "authors": [], "date": "2020-01-24", "keywords": ["carolina", "flu", "north", "health", "died", "deaths", "week", "death", "complications", "woman", "winstonsalem", "reported", "toll"], "summary": "North Carolina health officials say six people died from complications of the flu last week, helping to raise the death toll for the 2019-20 season to 41.\nThe Winston-Salem Journal reports the death toll includes two deaths from previous weeks.\nNorth Carolina woman who nearly died from flu complications urges others to get their flu shotThe N.C. Department of Health and Human Services cautions the weekly report count does not represent all flu-associated deaths in the state because many go undiagnosed or unreported."}, {"url": "https://myfox8.com/weather/flurries-spotted-in-charlotte-as-low-pressure-system-spreads-precipitation-in-carolinas/", "title": "Snowflakes spotted across NC, including in the Piedmont Triad", "authors": ["Van Denton", "Kate Garner", "Allison Smith", "Associated Press", "Digital Desk"], "date": "2020-01-31", "keywords": ["triad", "snow", "including", "videoplease", "12", "watch", "temperatures", "nc", "javascript", "spotted", "piedmont", "enable", "snowflakes", "areas", "period"], "summary": "Please enable Javascript to watch this videoWe've seen snow reports across parts of South Carolina and North Carolina, including here in the Piedmont Triad.\nIf you've been hoping to see some snow, your wish may come true today!\nFoothill counties stand the best chance to also see some snow and snow/rain mix with 1/2\" to locally 1\" possible in these areas.\nAgain, in the Piedmont, ours will be mainly cold rain, mixed at times with snow and possibly a brief period of all snow.\n❄️ pic.twitter.com/VpgO00LOr5 — Charlotte Motor Speedway (@CLTMotorSpdwy) January 31, 2020Please enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this videoPlease enable Javascript to watch this video35.227087 -80.843127"}, {"url": "https://myfox8.com/news/motorcyclist-taken-to-the-hospital-after-crash-in-forsyth-county/", "title": "Motorcyclist taken to the hospital after crash in Forsyth County", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-01-07", "keywords": ["county", "crash", "motorcyclist", "parkway", "hospital", "taken", "north", "car", "troopers", "university", "forsyth", "left"], "summary": "Please enable Javascript to watch this videoFORSYTH COUNTY, N.C. -- A motorcyclist was taken to the hospital after a crash in Forsyth County on Monday night, according to troopers on the scene.\nThe crash happened in the 6600 block of University Parkway, just north of the Winston-Salem city limits, around 6:20 p.m.A car was headed north on University Parkway and signaled for a left turn onto Cross Baptist Church Road when a motorcyclist tried to pass on the left side.\nThe car hit the motorcycle and the motorcyclist was taken to Wake Forest Baptist Medical Center.\nThere is no word on their condition.\nNo charges have been filed and troopers are still investigating."}, {"url": "https://myfox8.com/news/former-winston-salem-police-officer-accused-of-sexually-assaulting-woman-during-police-call/", "title": "Former Winston-Salem police officer accused of sexually assaulting woman during police call", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-03-23", "keywords": ["accused", "sexual", "criminal", "assaulting", "service", "officer", "winstonsalem", "woman", "department", "responded", "university", "white", "mr", "sexually"], "summary": "WINSTON-SALEM, N.C. — A former Winston-Salem police officer has been charged with sexual battery, according to a news release.\nApproximately four minutes after Officer White cleared from the scene of the call for service, the Winston-Salem Police Department was notified of an allegation by an adult female who encountered Officer White during the earlier call for service.\nThe adult female alleged that she was sexually assaulted by Officer White during the call for police service at the hotel.\nOfficer White was placed on administrative leave and the criminal investigation has been on-going and active since Feb. 20.\nIn consultation with the Forsyth County District Attorney’s Office, our Detectives have criminally charged Mr. White with Sexual Battery."}, {"url": "https://www.wwaytv3.com/2020/03/24/north-carolina-police-officer-charged-with-sexual-battery/", "title": "North Carolina police officer charged with sexual battery", "authors": [], "date": "2020-03-24", "keywords": ["sexual", "unclear", "carolina", "officer", "north", "winstonsalem", "woman", "touching", "thompson", "white", "statement", "charged", "battery"], "summary": "WINSTON-SALEM, NC (AP) — A North Carolina police department says an officer has been charged with inappropriately touching a woman while responding to a 911 call.\nWinston-Salem Police Chief Catrina Thompson said in a statement that 37-year-old officer Harry Lee White III was charged with sexual battery and resigned from his post Monday.\n- Advertisement -The statement said White was accused of grabbing the woman at a hotel where he was dispatched early in the morning Feb. 20.\nThe former officer was booked into jail and is set to appear in court in May.\nIt’s unclear whether he has an attorney who can comment on his behalf."}, {"url": "https://www.lawofficer.com/north-carolina-officer-arrested-for-sexual-battery-separated-from-department/", "title": "North Carolina officer arrested for sexual battery, ‘separated’ from department", "authors": ["Law Officer Is The Only Major Law Enforcement Publication", "Website Owned", "Operated Law Enforcement. This Unique Facet Makes Law Officer Much More Than Just A Publishing Company But Is A True Advocate For The Profession."], "date": "2020-03-23", "keywords": ["sexual", "fox", "separated", "carolina", "investigation", "officer", "north", "arrested", "winstonsalem", "according", "responded", "white", "department", "released", "battery"], "summary": "WINSTON-SALEM, N.C. — A Winston-Salem police officer has been charged with sexual battery and separated from the department, according to details released by his agency.\nApproximately four minutes after White cleared the call, the Winston-Salem Police Department was notified of an allegation by an adult female who encountered the officer at the hotel.\nDetectives from the Special Victim’s Unit of the department were summoned and began the investigation regarding criminal allegations against White.\nSubsequent to the criminal investigation, White was placed on administrative leave.\nHowever, following his arrest he is no longer employed with the department, according to the chief."}, {"url": "https://www.nytimes.com/2020/03/20/us/politics/coronavirus-richard-burr-insider-trading.html", "title": "Stock Sales by Senator Richard Burr Ignite Political Uproar", "authors": ["Eric Lipton", "Nicholas Fandos", "Sharon Lafraniere", "Julian E. Barnes"], "date": "2020-03-20", "keywords": ["ignite", "sales", "united", "prepare", "richard", "sell", "political", "burr", "uproar", "virus", "according", "senator", "stock", "mr", "senators"], "summary": "Mr. Burr trades relatively often on his holdings, filing 17 different “periodic transaction reports” last year, which are required when lawmakers buy or sell a stock.\nBut most of these other transactions involved just a couple of purchases or sales, instead of a comprehensive and sudden sale of most of his holdings.\nBut Mr. Burr was clearly worried about the threat presented by the coronavirus.\nSessions organized by the health committee that Mr. Burr attended were not classified and largely rehashed publicly available information about the virus, according to Senate aides involved.\nThe four other senators each also made significant stock sales between late January and late February at a time when senators were regularly briefed on the virus’s spread."}, {"url": "https://www.robesonian.com/opinion/letters/133531/vital-everyone-fills-out-census-form", "title": "Vital everyone fills out Census form", "authors": [], "date": "2020-04-08", "keywords": ["county", "form", "roughly", "federal", "state", "means", "person", "fills", "complete", "responded", "robeson", "vital", "census"], "summary": "To the editorWhile we attempt to flatten the curve through social distancing, one thing we can all do is complete the 2020 Census.\nAs of April 5 everyone with a home mailing address should have received an invitation to complete the 2020 Census.\nIf you have misplaced it or put it off, you can complete the form online at the Census.gov.\nDespite the obvious importance, Robeson County has only a 33% self-response rate as of April 5.\nIf you have not yet responded to the Census, take five minutes to help yourself and your community in this time of uncertainty."}, {"url": "https://www.robesonian.com/opinion/133002/free-money-not-the-correct-economic-fix", "title": "Free-money not the correct economic fix", "authors": [], "date": "2020-03-20", "keywords": ["folks", "proper", "jobs", "fix", "paying", "correct", "money", "economic", "socalled", "free", "work", "obama", "freemoney"], "summary": "To the Editor,As a free market economist, I am against the “free money” so-called stimulus package being supported by the majority of the GOP Senate.\nEvery time the government has passed out free cash, it is paying folks not to work.\nOne economic principle is anything you subsidize, you get more of.\nA wasted trillion dollars and less than 1% economic growth throughout the eight Obama years.\nThe very worst thing you could do is to wait on free money from the government."}, {"url": "https://www.wistv.com/2020/03/24/latest-north-carolina-news-sports-business-entertainment-am-edt/", "title": "Latest North Carolina news, sports, business and entertainment at 9:20 p.m. EDT", "authors": ["Published Am At Am", "Published April", "At Am"], "date": "2020-03-24", "keywords": ["unclear", "sexual", "business", "carolina", "statement", "officer", "north", "latest", "winstonsalem", "entertainment", "woman", "920", "touching", "thompson", "white", "edt", "charged"], "summary": "WINSTON-SALEM, N.C. (AP) — A North Carolina police department says an officer has been charged with inappropriately touching a woman while responding to a 911 call.\nWinston-Salem Police Chief Catrina Thompson said in a statement that 37-year-old officer Harry Lee White III was charged with sexual battery and resigned from his post Monday.\nThe statement said White was accused of grabbing the woman at a hotel where he was dispatched early in the morning Feb. 20.\nThe former officer was booked into jail and is set to appear in court in May.\nIt's unclear whether he has an attorney who can comment on his behalf."}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/news/2020/02/21/viewers-capture-thursday-s-snowfall-across-the-state", "title": "Viewers Capture Thursday's Snowfall Across the State", "authors": ["Published Pm Et Feb."], "date": "2020-02-21", "keywords": ["reep", "viewers", "snowfall", "thursdays", "laughter", "joins", "episode", "state", "need", "talk", "right", "capture", "medicine", "jon", "podcast"], "summary": "NEW PODCAST EPISODE Is laughter the medicine we need right now?\nJon Reep joins us to talk comedy in the time of coronavirus."}, {"url": "https://www.wnct.com/local-news/sanders-to-host-rally-in-winston-salem/", "title": "Sanders to host rally in Winston-Salem", "authors": ["Kayla Schmidt", "Fantasia Harvey", "Dalisa Robles"], "date": "2020-02-22", "keywords": ["event", "carolina", "state", "democratic", "rally", "north", "presidential", "sanders", "early", "winstonsalem", "host", "bernie"], "summary": "Democratic presidential candidate Sen. Bernie Sanders I-Vt., smiles during his campaign event in Carson City, Nev., Sunday, Feb. 16, 2020.\n(AP Photo/Rich Pedroncelli)WINSTON-SALEM, N.C. (WNCT) – Senator Bernie Sanders is scheduled to visit North Carolina less than two weeks before Super Tuesday.\nThe democratic presidential candidate will host a rally and march to early vote in Winston-Salem Thursday, February 27th according to a press release.\nThe trip announcement follows news that fifteen progressive leaders from across the state of North Carolina are backing the senator’s presidential campaign.\nFollowing the rally, volunteers and supporters will cast ballots for Bernie Sanders at the one-stop early voting site at Winston-Salem State University."}, {"url": "https://myfox8.com/news/big-changes-coming-to-downtown-winston-salem-streets/", "title": "Big changes coming to downtown Winston-Salem streets", "authors": ["Michelle Wolf", "Cnn Wire", "Digital Desk"], "date": "2020-02-28", "keywords": ["downtown", "streets", "changes", "stewart", "traffic", "coming", "oneway", "ive", "winstonsalem", "city", "project", "driving", "leaders", "big"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Big changes are coming to the way you get around Winston-Salem.\nIt's part of a plan by city leaders to create more two-way streets and make driving downtown easier.\nIt's one-way streets like First, Second, Liberty and Main that occasionally confuse even the people who've lived in Winston-Salem their whole lives.\nLiberty and Main will follow next year in what city leaders say is a $6.4 million combined project.\nBlake owns Fair Witness downtown and think the one-way streets are doing more harm than good."}, {"url": "https://myfox8.com/news/facebook-removing-news-page-that-shares-fake-stories-about-nc-winston-salem-police/", "title": "Facebook removing ‘news’ page that shares fake stories about NC, Winston-Salem police", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-19", "keywords": ["post", "carolina", "removing", "page", "officer", "north", "fake", "posts", "winstonsalem", "nc", "department", "say", "facebook", "shares"], "summary": "Winston-Salem police say “North Carolina Breaking News” is sharing untrue stories about their department, according to a news release.\nAfter discovering the false posts, police say they reached out to administrators of the “North Carolina Breaking News” Facebook page.\nOfficers cited two specific posts on the “North Carolina Breaking News” Facebook page.\nA second post on the fake news Facebook page claims that a Winston-Salem police officer sat with a dog after it was hit by a vehicle.\nThe story was based on a viral Facebook post from the Osceola County Sheriff’s Office in Florida."}, {"url": "https://myfox8.com/your-local-election-hq/michael-bloomberg-to-speak-in-winston-salem-on-2020-presidential-campaign-trail/", "title": "Michael Bloomberg to speak in Winston-Salem, Greensboro on 2020 presidential campaign trail", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-13", "keywords": ["michael", "trail", "campaign", "event", "2020", "words", "carolina", "voting", "bloomberg", "presidential", "north", "watch", "winstonsalem", "greensboro", "raleigh", "speak"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Michael Bloomberg, Democratic presidential candidate, is set to speak in the Triad on Thursday.\nFirst, Bloomberg will speak at a Winston-Salem campaign event scheduled for 7:30 a.m. at Footnote Coffee & Cocktails.\nSecond, at about 9:30 a.m., Bloomberg will speak in Greensboro at Cadillac Service Garage.\nHis North Carolina visits will finish with a trip to Raleigh for a 12:30 p.m. speaking event at Raleigh Union Station.\nBloomberg's visit comes the same day that early voting begins in North Carolina."}, {"url": "https://myfox8.com/news/busy-winston-salem-road-closed-for-emergency-water-main-repairs/", "title": "Busy Winston-Salem road closed for emergency water main repairs", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-14", "keywords": ["main", "water", "roadsthere", "road", "closed", "robinhood", "winstonsalem", "repairs", "utilities", "word", "busy", "stratford", "emergency"], "summary": "WINSTON-SALEM, N.C. — A busy Winston-Salem road has closed for emergency water main repairs, according to a news release from the city’s utilities department.\nNorth Stratford Road is closed between Robinhood and Reynolda roads.\nThere is no word on how long the repairs will take or when the road will reopen."}, {"url": "https://myfox8.com/news/adult-taken-to-hospital-after-overnight-shootings-in-winston-salem/", "title": "Adult taken to hospital after overnight shootings in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-17", "keywords": ["hospital", "taken", "suspects", "adult", "shootings", "overnight", "winstonsalem", "officers", "woodvale", "say", "gunshot", "wound", "witnessesat", "witnesses", "victim"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Gunshots were fired into two Winston-Salem homes overnight, according to Winston-Salem police.\nAt about 11:30 p.m. Sunday night, officers responded to a report of a gunshot at Woodvale Drive and Konnoak Drive.\nPolice say no one appeared to have been hit, and there were no suspects or witnesses.\nAt the scene, police found an adult suffering from a non-life-threatening gunshot wound to the leg.\nOfficers have no suspects or witnesses, and police believe the victim was not the target."}, {"url": "https://www.wxii12.com/article/piedmont-triad-north-carolina-snow-winter-wxii-weather/30997744", "title": "Triad's chilly temperatures could lead to more slick roads", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-02-22", "keywords": ["triads", "wind", "warm", "snow", "chilly", "temperatures", "slick", "day", "rainfall", "roads", "morning", "pretty", "sunshine", "rain", "tomorrow", "lead"], "summary": "Piedmont Triad's chilly temperatures could lead to more slick roads, black ice overnight Share Shares Copy Link CopyHide Transcript Show TranscriptLET’S TALK ABOUT THE WEATHER.\nSCHOOLS HAD BEEN CLOSED FOR THREE DAYS AND SNOW PLOW DRIVERS BRAVED THE COLD TO CLEAR THE MAIN ROADS TO DOZENS OF VILLAGES.\nTHE KIDS GOT A SNOW DAY.\nTOMORROW MORNING, WATCH OUT.\n22 DEGREES EARLY TOMORROW MORNING."}, {"url": "https://myfox8.com/news/man-taken-to-hospital-after-being-shot-in-winston-salem-police-say/", "title": "Man taken to hospital after being shot in Winston-Salem, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-16", "keywords": ["man", "wayne", "hospital", "taken", "shot", "told", "winstonsalem", "say", "shooting", "stable", "wound", "department", "critical", "wake"], "summary": "WINSTON-SALEM, N.C. — A man is in the hospital in critical but stable condition following a shooting in Winston-Salem Saturday, according to a Winston-Salem Police Department news release.\nAround 6:23 p.m., officers were sent to 2300 Bethabara Road when they were told about a shooting.\nWhen police arrived, they found Wayne Roosevelt Mack, 41, suffering from a gunshot wound to the abdomen.\nMack was taken to Wake Forest Baptist Medical Center by EMS and is currently listed in critical but stable condition.\nThe Winston-Salem Police Department requests that anyone with information regarding this incident contact CrimeStoppers at (336) 727-2800."}, {"url": "https://myfox8.com/weather/snowfall-is-still-a-possibility-late-thursday-early-friday-chief-meteorologist-van-denton-says/", "title": "‘Snowfall is still a possibility’ late Thursday, early Friday", "authors": ["Digital Desk", "Allison Smith", "Associated Press"], "date": "2020-02-18", "keywords": ["upper", "snowfall", "snow", "low", "model", "shows", "early", "late", "light", "byrd", "likely", "possibility", "piedmont", "raleigh"], "summary": "Thursday and Thursday night, Byrd says chilly air will settle into the Tar Heel State, setting the scene for some possible rain/snow mixture or light snow.\nDenton says the Short Range Ensemble Forecast model shows the possibility of the Triad getting more than 7 inches.\nThe new GFS model shows the same with lighter amounts in the Piedmont and more in southeastern North Carolina.\n\"At this point, it is way too early to determine if we're going to have accumulations here in the Piedmont,\" Byrd says.\nBeginning Friday, expect sunshine and warmer temperatures reaching into the low 40s Friday and low 50s Saturday, Byrd said."}, {"url": "https://myfox8.com/news/person-killed-in-house-fire-on-inwood-drive-in-winston-salem/", "title": "Person killed in house fire on Inwood Drive in Winston-Salem identified", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-10", "keywords": ["house", "inwood", "winstonsalemat", "drive", "person", "died", "snyder", "smoke", "winstonsalem", "watch", "killed", "according", "firefighters", "wsfd", "identified"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — One person is dead after a house fire on Inwood Drive in Winston-Salem.\nAt about 3:54 p.m. Sunday, crews responded to a fire at 4535 Inwood Drive.\nSnyder died on scene.\nSnyder is believed to have died from smoke inhalation, according to a news release from the Winston-Salem Fire Department.\nThe cause of the fire was a candle too close to combustibles in the living room, according to the WSFD."}, {"url": "https://myfox8.com/community-foundation/hustle-winston-salem-helps-entrepreneurs-find-the-tools-for-success/", "title": "HUSTLE Winston-Salem helps entrepreneurs find the tools for success", "authors": ["Katie Nordeen"], "date": "2020-02-26", "keywords": ["hustle", "yacinthe", "business", "marketing", "things", "serves", "speech", "success", "try", "winstonsalem", "tools", "helps", "entrepreneurs"], "summary": "The entrepreneurs all participate in \"Marketing Out of the Box\" sessions hosted by HUSTLE Winston-Salem, a nonprofit that serves women, people of color and other business owners who don’t fit the typical mold.\n“It is our goal to make sure that they have a voice in our community and accelerate them in entrepreneurship,” said Magalie Yacinthe, interim director of HUSTLE Winston-Salem.\nHUSTLE is run by entrepreneurs for entrepreneurs and serves about 100 of them each year.\n“We try to provide tools and resources to entrepreneurs specifically as it relates to marketing or ways to improve their business,” said Yacinthe.\nShe admits it’s not easy growing a business, but with a little guidance and support like what she finds with HUSTLE Winston-Salem, it is possible."}, {"url": "https://www.wwaytv3.com/2020/02/18/truck-carrying-41-cattle-overturns-killing-some-of-the-cows/", "title": "Truck carrying 41 cattle overturns, killing some of the cows", "authors": [], "date": "2020-02-18", "keywords": ["crash", "highway", "truck", "41", "cows", "wrightsville", "overturns", "winstonsalem", "journal", "killing", "carrying", "worked", "veered", "cattle", "driver"], "summary": "WINSTON-SALEM, NC (Winston-Salem Journal) — A truck that was carrying 41 cattle has crashed on a North Carolina highway, and at least some of the animals on board have died.\nThe Winston-Salem Journal reports that the crash occurred about 3:20 a.m. Tuesday on Interstate 40.\n- Advertisement -State police said that the driver of the truck veered off the highway, and his rig overturned.\nOfficials from the Winston-Salem Fire Department said that some of the cattle were killed.\nRelated Article: One hospitalized after morning crash in Wrightsville BeachThe crash remains under investigation."}, {"url": "https://myfox8.com/news/winston-salem-police-called-10-hours-after-shooting-victim-taken-to-hospital-with-gunshot-wound/", "title": "Winston-Salem police called 10 hours after shooting; victim taken to hospital with gunshot wound", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-21", "keywords": ["called", "hospital", "taken", "person", "hours", "officers", "winstonsalem", "place", "gunshot", "wound", "shooting", "victim"], "summary": "WINSTON-SALEM, N.C. — A person was taken to the hospital after a shooting in Winston-Salem.\nAt the scene, officers spoke with a person suffering from a gunshot wound to the upper arm.\nThe victim couldn’t provide a suspect description or the place where the shooting happened.\nPolice then discovered the shooting happened 10 hours before officers were called in.\nThe victim was taken to a hospital by EMS with non-life-threatening injuries."}, {"url": "https://myfox8.com/your-local-election-hq/bernie-sanders-to-campaign-in-winston-salem-next-week/", "title": "Bernie Sanders to campaign in Winston-Salem next week", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-22", "keywords": ["campaign", "tickets", "rally", "sanders", "open", "winstonsalem", "week", "vote", "bernie", "weeka", "universitythe", "timothy"], "summary": "Bernie Sanders (Photo by TIMOTHY A. CLARY/AFP via Getty Images)WINSTON-SALEM, N.C. — Sen. Bernie Sanders will campaign in Winston-Salem next week.\nA rally and march to early vote will be held Thursday at the C.E.\nGaines Center at Winston-Salem State University.\nThis event is free and open to the public.\nTickets are not required, but an RSVP is encouraged."}, {"url": "https://www.wxii12.com/article/early-voting-for-north-carolina-primary-ends-feb-29/31083520", "title": "Early voting for North Carolina primary ends Feb. 29", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-02-24", "keywords": ["youre", "voting", "sites", "carolina", "primary", "early", "ends", "north", "feb", "29", "vote", "day", "wxii", "video", "register"], "summary": "This is the last of early voting ahead of North Carolina's primary on March 3.\nClick the video player above to see WXII 12 News election coverage In-person early voting ends on Saturday.\nPeople can register and vote in one stop at early voting sites in their county.\nThis is the last of early voting ahead of North Carolina's primary on March 3.\nPeople can register and vote in one stop at early voting sites in their county."}, {"url": "https://www.wxii12.com/article/maroon-5-to-perform-two-shows-in-north-carolina-in-2020/30122057", "title": "Maroon 5 to perform two shows in North Carolina in 2020", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2019-12-04", "keywords": ["stops", "trainor", "2020", "tour", "carolina", "shows", "texas", "north", "sept", "maroon", "released", "upcoming", "perform", "bands"], "summary": "Leon Bridges’ new collaborative EP with Khruangbin, \"Texas Sun,\" will be released Feb. 7.Meghan Trainor will appear on all show dates.For more information, click here.\nMaroon 5 has announced dates for the band's upcoming 2020 U.S. tour, and it includes two stops in North Carolina.\nThe band’s multicountry tour will come to Raleigh on Sept. 12 and Charlotte on Sept. 14.\nAdvertisementTickets for both show are set to go on sale to the general public at noon Friday, Dec. 13.\nMost recently, Maroon 5 released its latest single \"Memories\" to critical acclaim."}, {"url": "https://myfox8.com/news/crews-face-fire-at-kfc-in-winston-salem/", "title": "Crews face fire at KFC in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-14", "keywords": ["system", "roof", "videowinstonsalem", "unrelatedthe", "watch", "winstonsalem", "crews", "kfc", "responded", "smoke", "reports", "face"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Firefighters rushed to a KFC in Winston-Salem as smoke poured from the restaurant's roof overnight, according to the Winston-Salem Fire Department.\nAt about 11:59 p.m. late Thursday night, crews responded to the KFC at 1203 Silas Creek Parkway.\nEngine 6 arrived at the scene minutes later at 12:04 a.m. and saw the smoke coming from the roof.\nThe fire department reports the fire was accidental, ignited by an HVAC system on the roof.\nThe KFC now faces about $200,000 in damages."}, {"url": "https://myfox8.com/news/van-hits-building-during-2-vehicle-wreck-in-winston-salem/", "title": "Van hits building during 2-vehicle wreck in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-19", "keywords": ["wreck", "building", "videowinstonsalem", "video", "hits", "2vehicle", "watch", "winstonsalem", "warns", "corner", "white", "wsfd", "van", "vehicles"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A crash involving two vehicles ended with a van crashing into a Winston-Salem convenience store, according to the Winston-Salem Fire Department.\nAt about 6:35 p.m, WSFD tweeted a video showing the white van with its hazard lights still flashing at the corner of the Titanic Food Mart on the corner of Cameron Avenue and East 14th Street.\nTwo people were injured.\nThe fire department warns the public to avoid the area if possible."}, {"url": "https://www.myarklamiss.com/news/national-news/north-carolina-painter-shot-after-being-sent-to-wrong-apartment/", "title": "North Carolina: Painter shot after being sent to wrong apartment", "authors": ["David Eggert", "Associated Press", "Seth Borenstein", "The Associated Press"], "date": "2020-02-05", "keywords": ["point", "castillo", "carolina", "sims", "shot", "north", "wrong", "wood", "unit", "apartment", "high", "winstonsalem", "door", "sent", "painter", "tried"], "summary": "High Point, NC (NBC)(02/05/20)— A painter was shot last week after he was mistakenly sent to the wrong apartment in North Carolina and tried to enter it.\nByron Castillo, age 48, of Winston-Salem, continues to improve at a hospital, High Point police said Tuesday.\nCastillo was hired by Chatham Wood Apartments in High Point, in Guilford County between Greensboro and Winston-Salem, to complete repairs to an apartment, according to police.\nA man inside the unit, Gregory Sims, age 28, thought Castillo was trying to break into his apartment.\nFearing for his safety, Sims opened the door and shot, striking Castillo once in the chest, according to police."}, {"url": "https://myfox8.com/news/no-charges-filed-after-truck-slides-down-ditch-kills-winston-salem-man-police-say/", "title": "No charges filed after truck slides down ditch, kills Winston-Salem man, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-12", "keywords": ["man", "slides", "filed", "ditch", "truck", "kills", "pinned", "winstonsalem", "say", "charges", "charged", "department", "slid", "driver"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A driver won't be charged after his truck slid down a ditch and killed a Winston-Salem man, according to police.\nA 2000 Ford truck slid down a ditch and pinned a man underneath the truck bed, according to a Winston-Salem Police Department news release.\nDaniel Ray Boles, 54, of Winston-Salem, died on the scene, and the driver of the truck was not injured.\nThe truck was backing up to a ditch that was being worked on, and Boles was behind the truck guiding it when it began to slide down the ditch.\nAnyone with information is asked to contact the Winston-Salem Police Department at (336) 773-7700 or Crime Stoppers at (336) 727-2800."}, {"url": "https://myfox8.com/news/woman-charged-after-fatal-crash-in-winston-salem/", "title": "Woman charged after fatal crash in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-26", "keywords": ["fatal", "crash", "virginia", "feb", "vehiclethe", "winstonsalem", "woman", "jeep", "ghosthorse", "intersection", "charged"], "summary": "WINSTON-SALEM, N.C. — A Winston-Salem woman has been charged after a fatal crash earlier this month, according to a news release from Winston-Salem police.\nSyndey Ray Ghosthorse, 19, is charged with misdemeanor death by motor vehicle.\nThe crash happened on Feb. 11 around 2 p.m. at the intersection of Hawthorne Road and Lockland Avenue.\nA passenger in the Jeep, 85-year-old Frankie Bartlett, of Bassett, Virginia, was taken to the hospital and died from her injuries on Feb. 16.\nGhosthorse was charged on Wednesday"}, {"url": "https://myfox8.com/news/shalom-project-providing-affordable-housing-in-winston-salem/", "title": "Shalom Project providing affordable housing in Winston-Salem", "authors": ["Natalie Wilson", "Cnn Wire", "Digital Desk"], "date": "2020-02-13", "keywords": ["affordable", "step", "saidthat", "speaks", "providing", "winstonsalem", "project", "help", "resources", "housing", "unemployed", "shalom"], "summary": "Demolition is almost finished to make room for 72 affordable housing units.\nThe Shalom Project gained ownership of the property in May and believes providing affordable housing is one step toward putting a dent in the crisis.\n“We have approximately 16,000 units short of affordable housing in this community alone,” Executive Director Eileen Ayuso said.\nThat often causes people to have to rely on other resources such as clothing closets, food pantries and medical clinics – resources the Shalom Project does provide.\nAs for the Budget Inn, the Shalom Project owns the property, but will not manage the housing units."}, {"url": "https://myfox8.com/your-local-election-hq/hear-bernie-sanders-full-speech-from-his-winston-salem-rally/", "title": "Watch Bernie Sanders’ full rally in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-02-27", "keywords": ["running", "video", "rally", "sanders", "watch", "winstonsalem", "thing", "theres", "bernie", "weve", "workplaces", "crisis", "obama", "worship", "spirit"], "summary": "(CNN) -- Former President Barack Obama endorsed Joe Biden on Tuesday, in a video message in which he explains why he believes his former running mate is the candidate needed at this moment of crisis in America.\n\"If there's one thing we've learned as a country from moments of great crisis, it's that the spirit of looking out for one another can't be restricted to our homes, or our workplaces, or our neighborhoods, or our houses of worship.\nIt also has to be reflected in our national government,\" Obama says in the over 11-minute endorsement video."}, {"url": "https://www.wxii12.com/article/north-carolina-flu-season-2019-2020-child-death-five/30913714", "title": "North Carolina flu death: First child under 5", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-02-13", "keywords": ["carolina", "blood", "child", "flu", "north", "died", "age", "season", "according", "total", "death", "type"], "summary": "First child under 5 dies from flu in North CarolinaThe first child under the age of 5 has died during this year's flu season, according to the North Carolina Department of Health and Human Services.Nine people, including the child, died between Feb. 2 and 8, bringing the total number of people who have died from the flu this season to 75.\nBlood donations are badly needed, especially for people with type O blood.Doctors and nurses say it's not too late to get the flu vaccine.\nThe first child under the age of 5 has died during this year's flu season, according to the North Carolina Department of Health and Human Services.\nNine people, including the child, died between Feb. 2 and 8, bringing the total number of people who have died from the flu this season to 75.\nThe flu is creating a blood shortage, according to the Red Cross."}, {"url": "https://spectrumlocalnews.com/nc/charlotte/sports/2020/02/28/no--7-duke-s-visit-to-virginia-highlights-acc-s-week-ahead", "title": "No. 7 Duke’s Visit to Virginia Highlights ACC’s Week Ahead", "authors": ["Published Pm Et Feb."], "date": "2020-02-28", "keywords": ["duke", "visit", "ahead", "won", "carolina", "north", "road", "accs", "week", "dukes", "season", "night", "forest", "wake", "virginia", "highlights"], "summary": "Duke won both meetings last season and has won its last three visits to John Paul Jones Arena.\nFor North Carolina, escaping the league basement would be nice, too.\nWake Forest (12-15, 5-12) and Pittsburgh (15-15, 6-12) are both one game ahead in the loss column.\nThe league’s three home teams — Wake Forest, Georgia Tech and North Carolina — all won on Tuesday night.\n19 Florida State and the Hokies, the Tar Heels (16-12, 7-10) are in a three-way tie for ninth with Wake Forest and Notre Dame."}, {"url": "https://myfox8.com/news/winston-salem-woman-runs-her-business-from-hotel-room-after-home-floods/", "title": "Winston-Salem woman runs her business from hotel room after home floods", "authors": ["Michelle Wolf", "Cnn Wire", "Digital Desk"], "date": "2020-02-13", "keywords": ["hotel", "hall", "business", "flooded", "took", "floods", "weeks", "runs", "winstonsalem", "woman", "working", "pay", "lot", "room", "stay", "minute"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Flooding troubles are not over for a Winston-Salem woman.\nOn top of that, she runs an arts and crafts business and a lot of her supplies got ruined in the flooding.\nI’ve got three in all but two of them flooded,” Hall said.\nShe's now working out of her hotel room using her income to pay for her stay and the repairs to her house.\nShe said she's working on some last minute Valentine's Day crafts to help pay for her stay."}, {"url": "https://www.wfmynews2.com/article/news/health/coronavirus/coronavirus-real-time-updates-blog-nc/83-6f488f69-b12a-4d21-b73d-2570f7ceb9d0", "title": "Blog: Trump signs $2.2 trillion stimulus bill", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Megan Allman", "Chris Venzon", "Wfmy", "Brian Bennett", "Lea Wilson", "Published", "Am Edt March"], "date": "2020-03-25", "keywords": ["county", "carolina", "state", "blog", "north", "health", "22", "stayathome", "bill", "city", "trump", "trillion", "stimulus", "coronavirus", "open", "order", "signs"], "summary": "North Carolina officials say staying homes can save lives, to stand six feet away from others, wash your hands, cough into your elbows.\nNorth Carolina Governor Roy Cooper is holding a press conference at 4 p.m. We will stream it LIVE in this story.\nWEDNESDAY, MARCH 25:10:45 p.m. - Winston-Salem Police said they will enforce the stay-at-home order even if it means issuing citations.\nRELATED: High Point University student tests positive for COVID-199:00 p.m. - President Trump has approved a major disaster declaration for North Carolina.\nGovernor Cooper said a number of patients in North Carolina are in hospitals, and some are in critical condition."}, {"url": "https://www.wraltechwire.com/2020/03/20/march-17-coronavirus-update-impact-on-nc-tech-events/", "title": "March 20 coronavirus update: Here’s the latest on tech events across NC", "authors": [], "date": "2020-03-20", "keywords": ["canceled", "business", "event", "email", "20", "2020", "postponed", "scheduled", "events", "announced", "latest", "nc", "coronavirus", "originally", "update", "heres", "tech"], "summary": "The Automotive Intelligence Summit in Raleigh, originally scheduled for April 14-16, has been moved to August 17-19.\nThe event, originally scheduled for April 2 on UNC Chapel Hill’s campus, planned to feature TEDx-style presentations from students.\nTech Talent South Charlotte’s Speed Dating With Recruiters event scheduled for April 2 has been postponed, according to the event webpage.\nThis includes CFWIT’s Get It Together Workshop, originally scheduled for March 24 from 5:30-7 p.m. at tekMountain.\n— Launch Chapel Hill (@launchCH) March 11, 2020Electrification 2020, originally planned for April 6-9 at the Charlotte Convention Center, will be rescheduled for early-2021."}, {"url": "https://www.northcarolinahealthnews.org/2020/03/23/drive-thru-test-sites-come-and-go/", "title": "COVID-19 drive-thru test sites come and go in NC", "authors": ["Liora Engel-Smith", "Glenn Field", "Candice Manning", "Rose Hoban", "North Carolina Health News"], "date": "2020-03-23", "keywords": ["testing", "site", "sites", "clinics", "drivethru", "state", "health", "week", "nc", "test", "come", "unc", "patients", "covid19"], "summary": "Drive-thru sites allow people whose doctor deemed the test necessary to get evaluated and swabbed for COVID-19 in their vehicles.\nAt least two sites — Cone Health and Pardee UNC Health drive-thru at a local community college — have experienced supply shortages that quickly led to their closure.\nFor more information: UNC drive-thru clinic : UNC Health can only test UNC patients who have a doctor’s prescription.\nFor more information, contact UNC’s COVID-19 helpline, 888-850-2684.: UNC Health can only test UNC patients who have a doctor’s prescription.\nThe drive-thru site was initially opened daily since last Sunday but has changed its hours, according to spokeswoman Erica Allison, who said the drive-thru site is using different kits than the UNC Health testing sites."}, {"url": "https://www.wfmynews2.com/article/news/local/coronavirus-live-updates-nc-blog-wfmy/83-6c1f8cf6-8c47-4bf0-b863-819dd6b9d49e", "title": "BLOG | Guilford County issues tighter restrictions, limits groups", "authors": ["Author", "Wfmy News Digital Team", "Published", "Am Edt March", "Updated"], "date": "2020-03-23", "keywords": ["county", "carolina", "issues", "guilford", "state", "blog", "north", "groups", "health", "center", "closed", "coronavirus", "restrictions", "school", "limits", "tighter", "schools"], "summary": "RELATED: Coronavirus in North Carolina: County-by-county breakdown of positive cases7:45 a.m. - Join our digital newscast AFTER GMS!\nRELATED: List of businesses to close by 5pm Wednesday7:25 p.m. - Guilford County Schools gives an update on a plan moving forward following Gov.\n4:37 p.m. - Randolph County Health makes the following changes based on recommendations.\n4:00 p.m. - In accordance with the Governor’s announcement, Winston-Salem/Forsyth County Schools will remain closed for in-person instruction through May 15, 2020.\n8:00 a.m. - Today is the first day of online learning for Guilford County Schools."}, {"url": "https://www.elkintribune.com/news/29313/winston-salem-banking-group-agrees-to-purchase-control-of-tennessee-based-community-bank", "title": "Winston-Salem banking group agrees to purchase control of Tennessee-based community bank", "authors": [], "date": "2020-03-31", "keywords": ["proposed", "business", "purchase", "banking", "agrees", "transaction", "brighton", "winstonsalem", "community", "platform", "capital", "group", "bank", "control", "tennesseebased", "carolinas", "brown"], "summary": "WINSTON-SALEM, NC – The Winston-Salem-based organizers of the formerly proposed Community Bank of the Carolinas signed on March 27 a Stock Purchase Agreement to purchase a controlling interest in Brighton Bancorp, the Bank Holding Company of Brighton Bank located in Brighton, Tennessee.\n“Taking this path certainly provides us the potential of creating a better community bank in the long run.”Brighton Bank, founded in 1910, has three locations.\nBrighton Bank President and CEO John Phillips will remain with the combined bank and become market president of Tipton County.\nFollowing regulatory approval, the Jonestown Road LPO/DPO will operate as a DBA – Doing Business As the Community Bank of the Carolinas.\nOrganizers of proposed Community Bank of the Carolinas sign Definitive Agreement to buy Brighton Bancorp"}, {"url": "https://apnews.com/9f45358a342a2f2f2806fcbe4c2f8846", "title": "North Carolina’s largest county issues stay-at-home order", "authors": ["Gary D. Robertson"], "date": "2020-03-24", "keywords": ["county", "carolinas", "shelterinplace", "carolina", "issues", "state", "cooper", "cases", "north", "health", "stayathome", "statewide", "order", "largest"], "summary": "The North Carolina capital, like many cities across the country, is virtually shut down in the face of the COVID-19 pandemic.\nThe North Carolina capital, like many cities across the country, is virtually shut down in the face of the COVID-19 pandemic.\nMecklenburg County Health Director Gibbie Harris said the county had more than 140 positive cases as of Tuesday afternoon.\nMore than 15 states have some kind of “stay-at-home” or “shelter-in-place” order.\nThe North Carolina Healthcare Association, representing the state’s hospitals, also penned a letter Monday asking Cooper to issue a statewide shelter-in-place order."}, {"url": "https://www.wfmynews2.com/article/news/health/coronavirus/5-north-carolina-ymca-sites-become-emergency-child-care-facilities/83-3987afa0-f727-473b-8f3b-754427058d32", "title": "Several North Carolina YMCA sites to become emergency child care facilities", "authors": ["Author", "Lea Wilson", "Published", "Pm Edt March", "Updated"], "date": "2020-03-22", "keywords": ["family", "facilities", "sites", "children", "carolina", "child", "need", "north", "serve", "workers", "day", "nc", "students", "staff", "ymca", "care", "emergency"], "summary": "GREENSBORO, N.C. — The YMCA of Northwest North Carolina will transition several of its branches into emergency child care sites, the company said on its website Sunday.\nThe sites will serve first-responders, health care workers, grocery store workers, pharmacy, and others.\nThe weekly rate is $100 per week for these sites, as well as William G. White, Jr. No registration fee will be charged.\nAll areas will be cleaned several times a day, including every time children enter and leave a space.\nHandwashing of all staff and children will take place many times throughout the day."}, {"url": "https://thegrio.com/2020/03/17/north-carolina-woman-recants-story-black-teens-jail/", "title": "North Carolina woman recants story that put 4 Black teens in jail for years", "authors": [], "date": "2020-03-17", "keywords": ["sorry", "jail", "wrongful", "man", "recants", "local", "carolina", "black", "teens", "north", "men", "woman", "commission", "jones", "murder"], "summary": "A North Carolina woman has recanted her original testimony that implicated five Black teens in the 2002 murder of local man Nathaniel Jones.\nAccording to the Winston-Salem Journal, last week, Jessicah Black, 33, wept on the stand as she was questioned by the state’s Innocence Inquiry Commission.\nBlack was visibly distraught throughout her hearing with the commission in the state capital of Raleigh and expressed remorse for her part in getting the teens thrown behind bars.\nBlack claims she was coerced by detectives to implicate the teens in Jones’ murder and only complied after they convinced her that she might be charged if she didn’t say exactly what they wanted.\nAnd a fifth man, Dorrell Brayboy was released but tragically stabbed to death outside a local grocery store in 2019."}, {"url": "https://www.hcpress.com/obituaries/watauga-avery-obituaries-april-7-2020.html", "title": "Watauga, Avery Obituaries – April 7, 2020", "authors": [], "date": "2020-04-07", "keywords": ["family", "avery", "boone", "2020", "watauga", "survived", "passed", "funeral", "wife", "nc", "obituaries", "husband", "miller"], "summary": "Ralph Anthony Nilles1928 – 2020Ralph A. Nilles, 91, passed away Sunday, March 29, 2020 at Horizons Memory Care in Boone, NC.\nBorn January 4, 1947 in Watauga County, he was a son of the late Thomas Jefferson and Mae Church Wall.\nPO Box 1586, Boone, NC 28607.\nPlease mail to Treasurer, Snow Lodge 363, PO Box 2672, Boone, NC 28607.\nHazel Triplett TateJune 23, 1914 – April 01, 2020Hazel Triplett Tate, age 105, of Boone, passed away Wednesday evening, April 1, 2020, at Glenbridge Health and Rehabilitation in Boone."}, {"url": "https://www.northcarolinahealthnews.org/2020/03/26/covid-19-icu-beds/", "title": "Will NC have enough ICU beds for COVID-19?", "authors": ["Rose Hoban", "Matt Case", "Jean Aycock", "Tom Linden", "Leon Franzen", "North Carolina Health News"], "date": "2020-03-26", "keywords": ["carolina", "icu", "state", "north", "health", "rural", "beds", "nc", "hospitals", "patients", "care", "covid19"], "summary": "By Rose HobanYesterday, state health officials announced the first deaths of North Carolina patients who had acquired the novel coronavirus, known as COVID-19.\nScaling back for the surgeWhen inquiring about the number of ICU beds North Carolina has, the answer often comes back that there is no one number.\nWhen first queried, Doug Allred, the communications director at the Cone Health, said there were 100 ICU beds across that system.\nA few minutes later, he emailed with an update that Cone could “flex” to 125 ICU beds.\nHolmes’ center published a report Wednesday looking at the number of rural ICU beds versus urban ICU beds which noted that while rural ICU beds have, on average, fewer patients in them, there are fewer of those beds overall."}, {"url": "https://arkansasrazorbacks.com/razorback-licensees-see-bigger-picture/", "title": "Razorback Licensees See Bigger Picture", "authors": ["Jeri Thorpe"], "date": "2020-04-13", "keywords": ["production", "bigger", "help", "razorback", "medical", "licensees", "apparel", "area", "wingert", "picture", "brands", "masks", "face", "company"], "summary": "Razorback Licensees See Bigger PictureFAYETTEVILLE — The University of Arkansas partners with many great licensees.\nFree JUNK Brands Face Masks for Medical Staff in Response to COVID-19MARCH 25, 2020JUNK Brands wants to give back to all those medical personnel serving on the frontlines of the COVID-19 pandemic.\nSo, starting this week we’ll be giving out free face masks to medical staff in the Northwest Arkansas area made from our Borean Technical Fabric!\nMedical staff and centers can request their no cost face masks by clicking here.\n“And I actually saw a company out of California that was using t-shirt jersey material and cutting masks,” Wingert said."}, {"url": "https://www.wxii12.com/article/list-triad-restaurants-serve-food-coronavirus-outbreak/31741028", "title": "LIST: Triad restaurants offer take-out, pick-up, delivery services amid coronavirus outbreak", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-04-01", "keywords": ["restaurants", "delivery", "offer", "triad", "curbside", "takeout", "restaurant", "options", "mexican", "offering", "list", "coronavirus", "grill", "pizza", "outbreak", "optionsthe", "pickup", "services"], "summary": "ArchdaleCarolina Diner is offering take-out and delivery options.Mary B's Southern Kitchen is offering take-out and delivery options.Asheboro America's Roadhouse Express is offering take-out options.Coach's is offering take-out, curbside and delivery options.CJ's Olde Towne Restaurant is offering take-out, curbside and delivery options.\nHigh Point Bagel is offering take-out, curbside and delivery options, as well as free delivery.J Butler's Bar and Grille is offering take-out, curbside and delivery options.Kickback Jack's is offering curbside and take-out options.La Hacienda is offering take-out and delivery options.Lubranos Italian Restaurant is offering take-out and delivery options.Mi Taqueria is offering take-out, curbside and delivery options.\nLu's Chinese Restaurant is offering take-out and delivery options.O'Brien's Deli is offering take-out, curbside and delivery options.Omega House Family Restaurant is offering take-out and curbside options.Pancho Villa's Mexican & Seafood is offering take-out and delivery options.Paul's Fine Italian Dining is offering take-out, curbside and delivery options.PB's Takeout is offering take-out options.P.F.\nYadkin Plaza Restaurant is offering take-out options.Yadkin Valley Seafood is offering take-out options.Restaurants with locations in multiple communities:Applebee's is offering take-out, curbside and delivery options.Cracker Barrel is offering take-out and curbside options.Duck Donuts is offering take-out and delivery options.Dunkin' Donuts is offering take-out options.East Coast Wings and Grill is offering take-out and delivery options.Five Guys is offering take-out and delivery options.Golden Corral is offering take-out, curbside and delivery options.Jersey Mike's Subs is offering take-out, curbside and delivery options.Jim’s Grill is offering take-out and curbside options.K&W Cafeteria is offering take-out options.Krispy Kreme is offering take-out and delivery options.Long Horn Steakhouse is offering take-out and curbside options.Little Richard's BBQ is offering take-out, curbside and delivery options.\nSubway is offering take-out options and curbside options.Tropical Smoothie Cafe is offering take-out, curbside and delivery options.Zaxby's is offering take-out, curbside and drive-thru options.Zoe's Kitchen is offering take-out and delivery options."}, {"url": "https://www.nytimes.com/2020/03/20/us/politics/coronavirus-richard-burr-insider-trading.html", "title": "Stock Sales by Senator Richard Burr Ignite Political Uproar", "authors": ["Eric Lipton", "Nicholas Fandos", "Sharon Lafraniere", "Julian E. Barnes"], "date": "2020-03-20", "keywords": ["ignite", "sales", "united", "prepare", "richard", "sell", "political", "burr", "uproar", "virus", "according", "senator", "stock", "mr", "senators"], "summary": "Mr. Burr trades relatively often on his holdings, filing 17 different “periodic transaction reports” last year, which are required when lawmakers buy or sell a stock.\nBut most of these other transactions involved just a couple of purchases or sales, instead of a comprehensive and sudden sale of most of his holdings.\nBut Mr. Burr was clearly worried about the threat presented by the coronavirus.\nSessions organized by the health committee that Mr. Burr attended were not classified and largely rehashed publicly available information about the virus, according to Senate aides involved.\nThe four other senators each also made significant stock sales between late January and late February at a time when senators were regularly briefed on the virus’s spread."}, {"url": "https://triad-city-beat.com/breaking-local-sheriffs-offices-to-halt-all-eviction-orders-until-april-17/", "title": "BREAKING: Local sheriffs’ offices to halt all eviction orders until April 17", "authors": [], "date": "2020-03-19", "keywords": ["county", "local", "orders", "halt", "breaking", "state", "office", "offices", "eviction", "actions", "sheriffs", "order", "authority", "17", "writs"], "summary": "Sheriffs’ offices for both Guilford and Forsyth Counties have stated that they will suspend all foreclosure and eviction orders until April 17.\nReached via a phone call on Thursday, Jim Secor, the attorney for the Guilford County Sheriff’s Office, said that their county will halt all orders until April 17.\nSecor also stated that after April 17, unless the courts order a further extension for the orders, that the sheriff’s office will have to begin executing the writs of possession again.\n“But for now, everyone is going to get a breather until the 17th.”Christina Howell, a spokesperson for the Forsyth County Sheriff’s Office, stated that their office too, will halt all writs of possession.\nDan Rose, a member of Housing Justice Now in Winston-Salem, expressed his relief at the declarations by the sheriffs’ offices."}, {"url": "https://www.wxii12.com/article/coronavirus-north-carolina-stay-home-order-what-you-can-do/31960215", "title": "Coronavirus: What North Carolina CAN do under stay at home order", "authors": [], "date": "2020-03-27", "keywords": ["carolina", "state", "need", "north", "health", "lives", "coronavirus", "virus", "order", "stay", "care", "covid19"], "summary": "Coronavirus outbreak puts North Carolina under 'stay at home' order.\nTODAY HAVE SIGNED A STAY-AT-HOME ORDER FOR THE ENTIRE STATE OF, NORTH CAROLINA.\nNORTH CAROLINA IS NOW CONSIDERED BY THE CDC TO HAVE WIDESPREAD TRANSMISSION.\nWE ARE AGGRESSIVELY WORKING TO LEARN AS MUCH AS POSSIBLE ABOUT THE VIRUS ACROSS THE COUNTRY AND HERE IN, NORTH CAROLINA.\nAND HARM BOTH THE NORTH CAROLINA MEDICAL SOCIETY THE NORTH CAROLINA HEALTHCARE ASSOCIATION, WHICH REPRESENTS DOCTORS AND HOSPITALS ACROSS THE STATE HAVE WARNED ABOUT POTENTIAL SHORTAGES OF SUPPLIES AND EQUIPMENT AND HOSPITAL BEDS."}, {"url": "https://www.wxii12.com/article/health-officials-report-first-covid-19-death-in-forsyth-county/31990353", "title": "Coronavirus: First deaths in Forsyth, Guilford counties", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-04-01", "keywords": ["county", "underlying", "guilford", "state", "counties", "died", "health", "deaths", "coronavirus", "virus", "department", "forsyth", "covid19"], "summary": "A PERSON FROM FORSYTH COUNTY HAS DIED RELATED TO THE VIRUS.\nTHE HEALTH DEPARTMENT SAYS THE PATIENT WAS IN THEIR EARLY 90'S AND HAD SEVERAL UNDERLYING MEDICAL CONDITIONS.\nTHIS IS THE FIRST DEAdvertisement Forsyth, Guilford counties report first COVID-19 deaths Share Shares Copy Link CopyThe North Carolina Department of Health and Human Services is reporting the first coronavirus-related deaths in Forsyth and Guilford counties.Guilford County health officials reported the individual died Tuesday.\n“We extend our deepest condolences to the family and their loved ones,” said Guilford County Interim Health Director Dr. Iulia Vann.\nThe Public Health Department is taking necessary, carefully considered steps to slow down the spread of the disease and to protect those at greatest risk."}, {"url": "https://hypepotamus.com/news/monday-fund-day-who-raised-what-in-the-startup-south-march-16-20-2020/", "title": "Monday Fund-Day: Who Raised What In The Startup South March 16-20, 2020", "authors": ["Mike Jordan"], "date": "2020-03-23", "keywords": ["raised", "stock", "2020", "stack", "startup", "funding", "north", "1620", "platform", "south", "software", "series", "fundday", "tech"], "summary": "Tech startups are continuing to find investment capital, even with the stock market being a little zanier than usual.\nRead below to find out which North Carolina startup got a little extra funding and which Atlanta company just closed a massive Series B round.\nKeep coming back to Hypepotamus to stay up to date on which tech companies in the South raised capital!\nThe cryptocurrency startup was launched in 2018 by Intercontinental Exchange, which owns the New York Stock Exchange and nearly two dozen additional global exchanges.\nClick here to sign up for the Hypepotamus newsletter, and you’ll get two weekly emails covering the tech startup community in the Southeast, with all the latest jobs, news, events and announcements."}, {"url": "https://www.citizen-times.com/story/news/local/2020/03/18/asheville-coronavirus-liquor-sales-booming-store-hours/2868035001/", "title": "Coronavirus: Asheville Liquor sales booming, but stores will curtail hours", "authors": ["John Boyle", "Published P.M. Et March"], "date": "2020-03-18", "keywords": ["stores", "sales", "combs", "abc", "store", "hours", "liquor", "curtail", "asheville", "coronavirus", "booming", "watson", "employees", "close", "brockwell"], "summary": "CLOSEKelly Brockwell, left, store manager of the Arden ABC store, rings up customer Ronnie Waldrup on Wednesday, March 18.\nThe store, like others in the nine-store Asheville ABC system, has been seeing near-record sales in the wake of the coronavirus pandemic.\nShorter store hours comingThe Asheville stores are curtailing hours, though, starting Friday, March 20.\nThe Arden ABC store, like the other eight in the Asheville ABC system, has employees wiping down credit card machines after every transaction.\nIn Asheville, staff will still come in at 10 a.m., but they'll spend the first hour intensely cleaning the stores, Combs said."}, {"url": "https://www.northcarolinahealthnews.org/2020/03/21/nc-faith-leaders-forge-ahead-as-covid-19-closes-traditional-services/", "title": "As COVID-19 closes services, faith leaders get creative", "authors": ["Thomas Goldsmith", "North Carolina Health News"], "date": "2020-03-21", "keywords": ["faith", "closes", "carolina", "creative", "north", "churches", "community", "leaders", "church", "love", "diocese", "worship", "covid19", "services"], "summary": "But the lowering threat of COVID-19 in North Carolina has mostly shut the doors of churches, synagogues and mosques to gatherings of any size.\nIn this time of trial, North Carolina faith leaders are having to improvise to a rare degree.\nRobert Kochersberger, an English professor emeritus at North Carolina State University, noted in an email to this writer that his wife, the Rev.\nI guess desperate times call for desperate measures.”The address the couple heard was delivered by a familiar North Carolina voice, that of the Most Rev.\nCurry began his career as a minister in Winston-Salem, from 1978 through 1982, and returned as bishop of the Episcopal Diocese of North Carolina in 2000."}, {"url": "https://www.wxii12.com/article/blue-cross-blue-shield-north-carolina-new-ceo/31982887", "title": "Anthem executive becomes next president, CEO of Blue Cross North Carolina", "authors": [], "date": "2020-03-30", "keywords": ["sotunde", "leadership", "anthem", "carolina", "cross", "states", "north", "ceo", "president", "executive", "trustee", "university", "blue", "shield"], "summary": "Blue Cross and Blue Shield of North Carolina is hiring an executive from a major Blue Cross insurer in multiple states as its next president and CEO, the company announced on Monday.Tunde Sotunde will begin on June 1 after the Blue Cross NC trustee board picked him for the new jobs, according to a news release.\nBlue Cross and Blue Shield of North Carolina is hiring an executive from a major Blue Cross insurer in multiple states as its next president and CEO, the company announced on Monday.\nTunde Sotunde will begin on June 1 after the Blue Cross NC trustee board picked him for the new jobs, according to a news release.\nSotunde has a remarkable record of leadership and accomplishment as a physician, an educator, and a business leader,” said Frank Holding Jr., chairman of the trustee board for Blue Cross and Blue Shield of North Carolina, the state’s dominant insurer.\nHe graduated from medical school in Nigeria and completed other training at Howard University and the University of Memphis."}, {"url": "https://www.wxii12.com/article/triad-restaurants-bars-get-creative-during-coronavirus-shut-down/31718720", "title": "Triad restaurants, bars get creative during coronavirus shut down", "authors": ["Briana Conner", "Https", "Www.Facebook.Com Brianaconnerwxii", "Anchor Reporter"], "date": "2020-03-18", "keywords": ["restaurants", "going", "triad", "effect", "getting", "creative", "shut", "bars", "community", "coronavirus", "briana", "lot", "food", "customers"], "summary": "Triad restaurants, bars get creative during coronavirus shut down Taprooms are bare, food trucks have no lines, and restaurants are almost empty.\nTHE GOVERNOR’S ORDER CLOSING SIT DOWN SERVICE AT BARS AND RESTAURANTS STATEWIDE IS IN EFFECT.\nBRIANA CONNER SPENT THE DAY SPEAKING WITH PEOPLE IN THE PIEDMONT TRIAD.\nAIXA: THEY HAVE -- BRIANA: THEY HAVE SERVED COMMUNITY FOR 40 YEARS AND THEY SAY THE CORONAVIRUS WILL NOT CHANGE THAT.\n>> OUR BUSINESS MODEL DEPENDS ON PEOPLE GATHERING TOGETHER AND THIS CORONAVIRUS HAS JUST HAD A DEVASTATING EFFECT ON THAT."}, {"url": "https://www.wxii12.com/article/guilford-county-deputies-find-toilet-paper-stolen-tractor-trailer-truck/31787833", "title": "Guilford County deputies find 18K pounds of stolen toilet paper", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-03-19", "keywords": ["county", "deputies", "nearly", "investigation", "guilford", "traffic", "paper", "pounds", "18k", "vehicle", "interstate", "stolen", "toilet"], "summary": "Deputies with the Guilford County Sheriff's Office discovered 18,000 pounds of toilet paper in stolen tractor-trailer truck during a traffic stop Wednesday.Sheriff Danny Rogers said deputies initiated a traffic investigation involving the 18-wheeler along Interstate 40 in Whitsett after a motor vehicle law violation.\nDeputies determined the 53-foot Hyundai dry-van trailer was reported stolen locally and was being utilized to transport nearly 18,000 pounds of commercial bathroom paper products.\nGeorgia Pacific, the maker of Angel Soft and Quilted Northern toilet paper, said that last week, some orders from retailers nearly doubled.\nDeputies with the Guilford County Sheriff's Office discovered 18,000 pounds of toilet paper in stolen tractor-trailer truck during a traffic stop Wednesday.\nGeorgia Pacific, the maker of Angel Soft and Quilted Northern toilet paper, said that last week, some orders from retailers nearly doubled."}, {"url": "https://www.wxii12.com/article/some-grocery-stores-to-create-elderly-hours-for-geriatrics-to-get-supplies-early-before-crowds/31703015", "title": "Some stores creating 'elderly hours' for seniors to get groceries, supplies before crowds", "authors": ["Https", "Www.Facebook.Com", "National Desk Staff"], "date": "2020-03-19", "keywords": ["stores", "supplies", "shelves", "crowds", "elderly", "creating", "hours", "store", "shoppers", "paper", "restock", "hour", "toilet", "groceries", "customers", "seniors"], "summary": "Inside the store, shoppers could be seen lining up at the registers as workers directed traffic and helped hand out some of the most popular items.\nNotably missing, however, was toilet paper, which has mostly been wiped out at stores all across the country.\nNo toilet paper whatsoever in any stores.\nThis stop and shop in Smithtown had plenty of food but no toilet paper.\nAdvertisement Some stores creating 'elderly hours' for seniors to get groceries, supplies before crowds Share Shares Copy Link CopyThis article will be updated as stores announce these policies."}, {"url": "https://www.wfmynews2.com/article/news/local/good-morning-show/carolina-music-ways-live-our-musical-history-free-public-concert-wfmy/83-effdc7f5-2f0b-4fe3-bb14-a540eacc84ee", "title": "Listen to the sweets sounds of North Carolina Music", "authors": ["Author", "Ziris Savage", "Published", "Am Est March", "Updated"], "date": "2020-03-01", "keywords": ["listen", "available", "concert", "tickets", "carolina", "sweets", "cmw", "north", "music", "winstonsalem", "musical", "sounds", "include"], "summary": "WINSTON-SALEM, N.C. — Carolina Music Ways (CMW) will present Carolina Live!—Our Musical History on Friday, March 6th at 7:00 PM at the Southeastern Center for Contemporary Art (SECCA), located at 750 Marguerite Drive in Winston-Salem.\nPerfect for audiences of all ages, CMW brings history to life through North Carolina music, and celebrates North Carolina's multicultural music heritage.\nNorth Carolina Artists in Residence.\nAbout Carolina Music WaysCarolina Music Ways (CMW) is a 501(c)3, tax-exempt, non-profit arts-in-education organization based in Winston-Salem, North Carolina.\nCMW’s mission is to educate children in North Carolina about the state's diverse musical heritage and inspire them to participate in its rich music traditions."}, {"url": "https://www.wxii12.com/article/forsyth-county-election-primary-extends-hours-winston-salem/31215048", "title": "Forsyth County extends voting hours in Winston-Salem", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-03-03", "keywords": ["county", "going", "voting", "carolina", "democratic", "extends", "tonight", "north", "state", "hours", "candidates", "winstonsalem", "ballot", "forsyth", "know"], "summary": "North Carolina Board of Elections extends voting at Forsyth County precinct after problems reported Share Shares Copy Link CopyHide Transcript Show TranscriptBRIANA THANK YOU NOW TO OUR OTHER TOP STORY.\nTHERE ARE ALSO FIVE DEMOCRATIC CANDIDATES ALL IN THE RACE TO TAKE ON WHOEVER ENDS UP WINNING ON THE REPUBLICAN SIDE.\nYEAH, WELL, KENNY ENERGY IS PICKING UP HERE AT THE NORTH CAROLINA DEMOCRATIC PARTY’S WATCH PARTY.\nVIENNA STATE STATUTE THE ITEM WILL SIMPLY READ FORSYTH COUNTY LOCAL SALES AND USE TAX THE FORSYTH COUNTY COMMISSIONERS HAVE UNANIMOUSLY VOTED.\nLATEST POLL SHOWS IN ALL THREE OF THESE CANDIDATES IN NORTH CAROLINA ARE NOW IN A VIRTUAL TIE."}, {"url": "https://www.wxii12.com/article/north-carolina-primary-election-voting-results-2020/30647187", "title": "Full list: North Carolina primary results", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-03-04", "keywords": ["district", "going", "reporter", "carolina", "primary", "tonight", "north", "kenny", "win", "list", "results", "briana", "sure", "race", "republican"], "summary": "Full list: North Carolina primary results Share Shares Copy Link CopyHide Transcript Show TranscriptANNOUNCER: FROM WXII 12 NEWS, THIS IS BREAKING NEWS.\nBRIANA: -- KENNY: TEAM COVERAGE ALL THE WAY TO THE TRIANGLE.\nNO MATTER HOW MANY DELEGATES WE WIN TONIGHT, WE HAVE DONE SOMETHING NO ONE ELSE THOUGHT WAS POSSIBLE.\nHE SAYS WHILE THIS IS AN EXCITING RACE, THIS RACE IS GOING TO HAVE THE INTENTION OF THE ENTIRE COUNTRY.\nCUNNINGHAM EASILY TOOK THE WIN TONIGHT AGAINST DEMOCRATIC RIVALS."}, {"url": "https://myfox8.com/news/house-fire-in-winston-salem-displaces-4/", "title": "House fire in Winston-Salem displaces 4", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-03-10", "keywords": ["displaces", "house", "reported", "videowinstonsalem", "tonight", "watch", "red", "winstonsalem", "winstonsalemthe", "northeastfirefighters", "street", "stay", "reportedthe"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Four people will not be able to stay in their home tonight after a fire in Winston-Salem.\nThe fire was reported at 8:40 p.m. in the 2100 block of 23rd Street Northeast.\nFirefighters had the fire under control by 9:11 p.m. No injuries were reported.\nThe Red Cross is helping the four people who were displaced."}, {"url": "https://myfox8.com/news/winston-salem-declares-state-of-emergency-in-response-to-coronavirus-outbreak/", "title": "Winston-Salem declares State of Emergency in response to coronavirus outbreak", "authors": ["Digital Desk", "Cnn Wire"], "date": "2020-03-13", "keywords": ["testing", "response", "families", "symptoms", "state", "watch", "winstonsalem", "declares", "trump", "coronavirus", "outbreak", "declared", "emergency"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- The city of Winston-Salem declared a State of Emergency Friday in response to the coronavirus.\nGreensboro Mayor Nancy Vaughan, in conjunction with Guilford County, has declared a State of Emergency in response to the coronavirus as well.\nPelosi held a news conference Friday to outline the Families First Coronavirus Response Act in the wake of the coronavirus pandemic.\n\"The three most important parts of this bill are testing, testing, testing,\" said Pelosi.\n\"This legislation facilitates free coronavirus testing for everyone who needs a test, including the uninsured."}, {"url": "https://www.wfmynews2.com/article/news/local/dixie-classic-fair-guide-winston-salem-nc/83-8d937959-4c64-4f8d-92a5-91f431181396", "title": "Everything You Need To Know About The Dixie Classic Fair!", "authors": ["Author", "Wfmy News Digital", "Published", "Pm Edt September", "Updated", "Am Edt October"], "date": "2019-09-24", "keywords": ["jazz", "fair", "music", "city", "dixie", "winstonsalem", "classic", "band", "free", "730", "need", "know"], "summary": "Dixie Classic Fair Clock TowerThe Thomas W. Fredericks Chevy Clock Tower stage will feature daily entertainment during the Dixie Classic Fair from Friday, October 4 through Sunday, October 13.\nOTHER DIXIE CLASSIC FAIR STORIESRELATED: Back To The Drawing Board: Winston-Salem Committee Votes To Change 'Dixie Classic Fair' By 2020, But Still Deciding On New NameRELATED: Dixie Classic Fair New Name, Winston-Salem Submits Its RecommendationRELATED: Dixie Classic Fair Name is Changing: Here's the ProcessRELATED: Winston-Salem City Leaders Approve Dixie Classic Fair Name ChangeRELATED: No More Dixie | Fair Committee Asks City to Hire Consultant to Research New Name OptionsRELATED: Dixie Classic Fair Fun is Almost Here!\nRELATED: Fair Planning Committee Asks City Council for More Time to Consider 'Dixie Classic' Name Change OptionsRELATED: More Than 8,000 Names Submitted For Dixie Classic Fair Name Change As City Leaders Discuss Its FutureRELATED: How Did The Word 'Dixie' Become Associated With The South?\nRELATED: Is The Dixie Classic Fair Changing Its Name Or Not?\nWinston-Salem Starts Process to Change Name of the City's Annual Fair, Second Largest in NCRELATED: 'Take Dixie Out Of The ‘Dixie Classic Fair.’ Group Urges Winston-Salem City Leaders To Change Fair's NameRELATED: A MOOooooving Proposal At The Dixie Classic Fair"}, {"url": "https://www.wfmynews2.com/article/news/crime/winston-salem-shooting-pittsburgh/83-2b21ec99-3cc8-46a5-a3d6-23528d668b19", "title": "17-Year-Old Charged With Murder Of Winston-Salem Teen Found Shot To Death In Vehicle: Police", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated"], "date": "2019-10-29", "keywords": ["jayden", "occurred", "jamison", "teen", "law", "shot", "17yearold", "vehicle", "incident", "winstonsalem", "shooting", "death", "murder", "williams", "charged"], "summary": "WINSTON-SALEM, N.C. — Winston-Salem Police have arrested and charged 17-year-old Zacchaeus Williams with Murder in relation to the shooting death of Jayden Jamison, 16.\nWilliams is also being charged with Robbery with a Dangerous Weapon in an unrelated incident that occurred on October 14, 2019, at 2825 University Parkway.\n16-year-old Jayden Jamison was found shot inside a vehicle on Pittsburgh Avenue Tuesday afternoon.\nInvestigators said they identified evidence to indicate that Jamison was not in the vehicle alone when the shooting occurred.\nAccording to Winston-Salem Forsyth County Schools, Jamison went to Winston-Salem Prep AcademyPolice are asking that anyone with information regarding this investigation contact the Winston-Salem Police Department at (336) 773-7700 or CrimeStoppers at (336) 727-2800."}, {"url": "https://www.wfmynews2.com/article/news/crime/winston-salem-20-shootings-2019-argonne-boulevard/83-3e4dd59d-1f45-417a-b4e4-ff9b7dd709dd", "title": "Four Arrested in Glenn High Student's Murder: Winston-Salem Police", "authors": ["Author", "Tosha Brown", "Wfmy", "Carrie Hodgin", "Wfmy News Digital", "Published", "Am Edt October", "Updated", "Pm Edt October"], "date": "2019-10-18", "keywords": ["glenn", "romanmarin", "arrested", "high", "winstonsalem", "broad", "toledo", "say", "students", "shooting", "street", "17", "murder", "charged"], "summary": "WINSTON-SALEM, N.C. — Winston-Salem Police have made more arrests in the shooting death of 17-year-old, Jumil Dewann Robertson.\nAs part of the investigation, he was already jailed for possession of stolen property and discharging a firearm into a house on South Broad Street.\nKelly Roman-MarinWinston-Salem PolicePolice also arrested Francisco Javier Dominguez-Bautista, 18, and charged him with murder and shooting into a home.\nOn Wednesday night, police arrested Jose Noyola Toledo, 17, and Manuel Mejia Jimenez, 17, also both charged in Robertson's murder.\nWinston-Salem Forsyth County Schools say Roman-Marin, Dominguez-Bautista, and Toledo are all former students of Glenn High School."}, {"url": "https://myfox8.com/news/17-year-old-charged-in-shooting-death-of-16-year-old-in-winston-salem/", "title": "17-year-old charged in shooting death of 16-year-old in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-30", "keywords": ["jamison", "student", "scene", "16yearold", "17yearold", "vehicle", "officers", "winstonsalem", "maurice", "say", "shooting", "death", "charged"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- An arrest has been made in the shooting death of a 16-year-old in Winston-Salem, according to a news release from Winston-Salem police.\nAround 12:07 p.m. Tuesday, officers were dispatched to the 2200 block of Pittsburg Avenue on a reported shooting.\nOfficers say they found a vehicle stationary near the intersection of Pittsburgh Avenue and Burton Street when they arrived.\nThe driver, Jayden Maurice Jamison, 16, of Winston-Salem, had been shot and was pronounced dead at the scene by EMS.\n\"Jayden Maurice Jamison was a WS/FCS student and we are saddened to learn of his death."}, {"url": "https://www.wfmynews2.com/article/news/local/fall-festivals-haunted-attractions-pumpkin-patches-farms-hayrides-corn-mazes-nc/83-d8a34dc5-3117-44a1-a470-28778e9e82eb", "title": "It’s Fall Y'all! List of Fall Festivals, Spooky Attractions, Pumpkin Patches, Corn Mazes, Hayrides In North Carolina", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Am Edt September", "Updated", "Pm Edt October"], "date": "2019-09-26", "keywords": ["hayrides", "pumpkin", "spooky", "visit", "yall", "festival", "information", "north", "fun", "farm", "ncmore", "list", "fall", "festivals", "mazes", "patches", "includes"], "summary": "If you want your fall festival, haunted attraction, or farm to be featured send an email to webteam@wfmy.com Add Attn: Fall Event in the subject line.\nCORN MAZES, HAYRIDES, PUMPKIN PATCHESCornfield Maize Adventure (Archdale): 10-acre corn maze at Kersey Valley (1615 Kersey Valley Rd.)\nCheck It Out: Go Apple or Pumpkin Picking In The TriadJ.Razz and Tazz Farm: Includes pumpkin patch, cow train rides, corn maze, haunted forest hayrides, and farm equipment on display.\nFind out more by visiting McKee Cornfield MazeMillstone Creek Orchards (Ramseur): Includes pumpkin patch, pick your own apples, hayrides, cider mill, and more.\nBush-N-Vine Fall Farm (York): Pick your own pumpkin and enjoy Saturday hayrides."}, {"url": "https://myfox8.com/news/person-shot-killed-in-winston-salem/", "title": "Person shot, killed in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-06", "keywords": ["336", "scene", "investigation", "information", "shot", "person", "winstonsalem", "killed", "say", "article", "department"], "summary": "WINSTON-SALEM, N.C. — One person was shot and killed in Winston-Salem Saturday, according to a Winston-Salem Police Department news release.\nOfficers responded to a report of an unconscious person in the 2800 block of Cole Road.\nWhen they arrived, officers say they found a person who had apparently been shot multiple times.\nThe shooting looks like an isolated incident and police say information is very limited at this time.\nAuthorities are asking that anyone with information regarding this investigation contact the Winston-Salem Police Department at (336) 773-7700 or CrimeStoppers at (336) 727-2800."}, {"url": "https://myfox8.com/news/man-killed-in-shooting-on-mulberry-street-in-winston-salem/", "title": "Man suffers life-threatening injuries in shooting on Mulberry Street in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-28", "keywords": ["man", "mulberry", "injuries", "336", "block", "investigation", "shot", "crimestoppers", "person", "winstonsalem", "say", "shooting", "lifethreatening", "suffers", "street", "victim"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A man suffered life-threatening injuries when he was shot in Winston-Salem, according to police.\nPolice initially reported this as a homicide and death investigation but then told FOX8 that the police department's release was incorrect.\nAt about 3:22 a.m. Monday morning, police responded to a report of a person shot on the 600 block of Mulberry Street.\nAnyone with information is asked to contact the Winston-Salem Police Department at (336) 773-7700 or CrimeStoppers at (336) 727-2800; En Español (336) 728-3904.\nThis scene is separate from another nearby investigation where a person was killed minutes earlier on the 1000 block of West Academy Street Southwest."}, {"url": "https://www.wfmynews2.com/article/news/local/halloween-events-piedmont-triad-greensboro-winston-salem-high-point-burlington-lexington/83-d2627ca4-0546-49c0-b7ad-1986d65ba43d", "title": "Spooky Fun! Where To Trick-or-Treat And Other Halloween Haunted Happenings In The Triad", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Edt October", "Updated"], "date": "2019-10-04", "keywords": ["spooky", "triad", "books", "29", "fun", "library", "haunted", "rhymes", "storytime", "happenings", "short", "costume", "trickortreat", "halloween"], "summary": "Halloween Costume Shop at Central Library: October 19, 10 am to 12 noonHalloween is less than two weeks away!\nHalloween Fun Storytime at Hemphill Library: October 31, 10-11 amJoin us for a toddler and preschool storytime with books, rhymes, and a fun art activity.\nWhen: Tuesday, October 8 at 6:00 p.m.Find out more: Spooky Cruise’NBURLINGTONDark in the ParkWhat: Dive into Halloween fun at Dark in the Park in Burlington!\nThe event includes amusement rides, Halloween costume contests, carnival games, and a lot more spooky fun!\nWhen: Saturday, October 26 from 5:00 p.m. – 9:00 p.m.Find out more: Dark in the ParkDowntown SpooktacularWhat: Includes trick-or-treating fun plus a Halloween costume parade!"}, {"url": "https://www.fox61.com/article/news/local/outreach/awareness-months/3-women-accused-of-encouraging-filming-fights-at-north-carolina-assisted-living-facility/520-ee68c94e-55bc-439b-94e0-f55620d33acc", "title": "3 women accused of encouraging, filming fights at North Carolina assisted living facility", "authors": [], "date": "2019-10-12", "keywords": ["accused", "fights", "women", "house", "carolina", "assisted", "north", "workers", "winstonsalem", "encouraging", "woman", "say", "filming", "living", "facility", "residents", "jordan", "fight"], "summary": "On June 21, police received a report of elder abuse at the Danby House assisted living facility in Winston-Salem, North Carolina, after workers allegedly let two residents fight each other.\nThe police department’s Criminal Investigations Division began investigating with the North Carolina Department of Health and Human Services.\nInvestigators learned that certain Danby House employees were encouraging residents to fight each other and an employee physically assaulted a resident by shoving them.\nDuring a separate incident, court documents say that the 73-year old woman began to fight with a 70-year-old woman.\nAll three women are accused of watching the fight, filming it and even encouraging it."}, {"url": "https://myfox8.com/news/fire-crews-respond-as-flames-engulf-outbuilding-in-winston-salem/", "title": "Fire crews respond as flames engulf outbuilding in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-21", "keywords": ["unclear", "heat", "wsfire", "respond", "videowinstonsalem", "watch", "damage", "winstonsalem", "crews", "say", "outbuilding", "engulf", "minimal", "flames"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A fire in Winston-Salem drew out emergency crews early Monday morning, according to the Winston-Salem Fire Department.\nAt about 5:31 a.m., firefighters responded to an outbuilding that was engulfed in flame on the 5200 block of Cox Boulevard.\nPolice and fire officials say the fire was out within minutes and caused minimal heat damage to the home beside the outbuilding.\nThe occupied residence next to the outbuilding received minimal heat damage.\n#wsfire .80 — Winston-Salem FD (@cityofwsfire) October 21, 201936.162966 -80.231579"}, {"url": "https://myfox8.com/news/police-looking-for-leads-after-man-shot-in-winston-salem/", "title": "Police looking for leads after man shot in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-28", "keywords": ["survive", "man", "treatmenta", "taken", "shot", "speas", "leads", "winstonsalem", "wound", "suspect", "suffering", "streetat", "unable", "looking"], "summary": "WINSTON-SALEM, N.C. — A man is expected to survive after he was shot in Winston-Salem overnight, according to Winston-Salem police.\nAt about 12:35 a.m. Monday, officers responded to a report of shots fired on the 900 block of East 17th Street.\nAt the scene, police found 24-year-old Anthony Denard Speas Jr. suffering from a non-life-threatening gunshot wound to the lower part of his body.\nSpeas was taken to a hospital for treatment.\nPolice say they canvassed the neighborhood but were unable to gather any more suspect information."}, {"url": "https://myfox8.com/news/man-injured-in-shooting-in-winston-salem-3/", "title": "Man injured in shooting in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-26", "keywords": ["man", "taken", "victimpolice", "woundthe", "winstonsalem", "shooting", "suspect", "injured", "type", "victim", "altercation"], "summary": "WINSTON-SALEM, N.C. — A man was injured in a shooting in Winston-Salem on Friday afternoon, according to a news release from Winston-Salem police.\nThe shooting was reported at 321 Gregory St. at 4:33 p.m.\nWhen officers arrived, they found a 34-year-old man suffering from a gunshot wound.\nAfter the altercation ended and the two had separated, the suspect returned to the area and shot the victim.\nAnyone with information on this shooting is asked to call CrimeStoppers at (336) 727-2800."}, {"url": "https://www.atthehive.com/2019/7/15/20695043/charlotte-hornets-news-will-play-a-preseason-game-in-winston-salem-philadelphia-76ers", "title": "The Hornets will play a preseason game in Winston-Salem", "authors": ["Jonathan Delong", "Jul"], "date": "2019-07-15", "keywords": ["play", "yearsthis", "confirmed", "games", "game", "announced", "winstonsalem", "womens", "preseason", "played", "hornets"], "summary": "The Charlotte Hornets announced today that they’ll play one of their preseason exhibition games in Winston-Salem, North Carolina.\nThe game will be played in Lawrence Joel Veterans Memorial Coliseum, which is where the Wake Forest men’s and women’s teams play.\nThey’ve also played games in Greensboro and Asheville, NC as well as Greenville, SC in recent years.\nThis is the second Hornets preseason game confirmed thus far.\nThe first is against the Miami Heat, who announced their full slate of preseason games back in June."}, {"url": "https://myfox8.com/news/person-killed-in-winston-salem-crash-involving-tractor-trailer/", "title": "Man killed in Winston-Salem when truck runs off bridge and overturns", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-20", "keywords": ["crash", "man", "truck", "runs", "overturns", "winstonsalem", "watch", "troopers", "killed", "nc", "javascript", "panera", "happened", "fox8", "bridge"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. --Police and the N.C. State Highway Patrol are investigating a fatal crash that happened early Sunday morning in Winston-Salem, according to a news release from the Winston-Salem Police Department.\nThe crash happened at about 3:30 a.m. and originated on Interstate 40 West, resulting in a truck going off a bridge to the right, overturning and coming to rest in the 900 block of East Clemmonsville Road.\nThe 65-year-old man was driving a Panera bread truck and troopers tell FOX8 he had just left the Greensboro headquarters when he crashed.\nPanera released the following statement to FOX8 Sunday afternoon:“We are shocked and saddened by the passing of a wonderful member of the Panera family.\nPlease enable Javascript to watch this video36.09986 -80.244216"}, {"url": "https://myfox8.com/news/3-women-arrested-after-police-bust-fighting-ring-at-danby-house-assisted-living-facility-in-winston-salem/", "title": "3 women arrested after police bust fighting ring at Danby House assisted living facility in Winston-Salem", "authors": ["Digital Desk", "Daniel Pierce", "Cnn Wire"], "date": "2019-10-11", "keywords": ["women", "house", "fighting", "assisted", "bust", "workers", "winstonsalem", "woman", "old", "danby", "employees", "living", "facility", "department", "ring", "jordan", "fight"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Three workers at the Danby House were arrested after police say they uncovered the workers abused two elderly women in the assisted living facility.\nOn June 21, police received a report of elder abuse at the Danby House assisted living facility.\nInvestigators learned that certain Danby House employees were encouraging residents to fight each other and an employee physically assault a resident by shoving them.\nDuring a separate incident, court documents show that the 73-year old woman began to fight with a 70-year old woman.\nAdditional staff training and a more rigorous vetting process for all new and existing employees at Danby House has been implemented."}, {"url": "https://www.wfmynews2.com/article/entertainment/events/5-things-to-do-weekend/83-a9423403-fe9f-4c8c-8d2c-e0629a7d2cb3", "title": "5 Things To Do In The Triad This Weekend: Oct. 12-13", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Edt October", "Updated", "Am Edt October"], "date": "2019-10-10", "keywords": ["weekend", "site", "triad", "things", "university", "cookies", "parking", "refer", "forest", "1213", "coliseum", "greensboro", "oct", "wake"], "summary": "The Greensboro Invitational, the 25 th stop on the premier PBR Unleash The Beast, will buck into the Greensboro Coliseum for two days of edge-of-your-seat action on October 12-13.\nWhat: FairWhen: Oct. 4-13Where: Winston-Salem FairgroundsTime: Refer to websiteGeneral Info Parking is available at the LJVM Coliseum lot and BB&T Field parking lots owned and operated by Wake Forest University.\nWhat: Jazz MusicWhen: Oct. 12Where: O.Henry HotelTime: 7 p.m.Happenings at O.Henry Hotel in Greensboro, NC Sign Up Awards Logos This site uses cookies.\nBy continuing to browse the site, you are agreeing to our use of cookies.\nFollow WFMY News 2 on Facebook and Twitter► Make it easy to keep up to date with more stories like this."}, {"url": "https://myfox8.com/news/firefighters-on-scene-of-transformer-fire-at-forsyth-medical-center-in-winston-salem-evacuation-underway/", "title": "Transformer fire reported at Forsyth Medical Center in Winston-Salem; fire now under control, no injuries", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-20", "keywords": ["injuries", "small", "scene", "wsfire", "center", "hospital", "smoke", "winstonsalem", "medical", "returned", "limited", "reported", "control", "transformer", "forsyth"], "summary": "There were no injuries and all evacuated have been returned to the hospital.\nSmoke was limited to a small area.\nWINSTON-SALEM, N.C. -- Firefighters are on scene of a transformer fire at Forsyth Medical Center, according to the Winston-Salem Fire Department.\nSmoke was limited to small area of the structure.\n140 — Winston-Salem FD (@cityofwsfire) October 20, 2019Fire units are on scene of a transformer fire at Forsyth Hospital."}, {"url": "https://catamountsports.com/news/2019/10/24/211814919.aspx", "title": "Women's Tennis Competes in ITA Carolina Regional", "authors": [], "date": "2019-10-24", "keywords": ["compete", "carolina", "tennis", "catamounts", "king", "womens", "regional", "draw", "dayday", "nc", "winstonsalem", "singles", "tournament", "competes", "ita"], "summary": "CULLOWHEE, N.C. – Four members of Western Carolina women's tennis will compete in the ITA Carolina Regionals Oct. 24-28 on the Wake Forest campus in Winston-Salem, N.C.\nThe tournament features the best collegiate players from North and South Carolina.\nSenior Jordan Strickland will compete in the main draw while sophomore Jacy Smith opens the tournament in the qualifying draw.\nSmith gets things started for the Catamounts playing in the qualifying singles draw facing Furman's Maryann Rompf at 9:30 a.m.\nThe Catamounts will compete in its first ITA Carolina Regional since 2012 when former Catamounts Karen Jimenez Sarmiento and Stacia Kissell competed in the event."}, {"url": "https://myfox8.com/news/man-killed-when-panera-truck-ran-off-bridge-in-winston-salem-has-been-indentified/", "title": "Man killed when Panera truck ran off bridge in Winston-Salem has been identified", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-21", "keywords": ["crash", "man", "ran", "truck", "west", "watch", "winstonsalem", "troopers", "killed", "say", "javascript", "panera", "weather", "identified", "enable", "bridge"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — The man killed in a fatal crash early Sunday morning in Winston-Salem has been identifed, according to a news release from the Winston-Salem Police Department.\nThe crash happened at about 3:30 a.m. and originated on Interstate 40 West, resulting in a truck going off a bridge to the right, overturning and coming to rest in the 900 block of East Clemmonsville Road.\nPolice say 65-year-old Leon Lavonne Baker, of Sophia, was driving a Panera bread truck and troopers tell FOX8 he had just left the Greensboro headquarters when he crashed.\nTroopers say the weather did not contribute to the crash, the driver was not speeding and there were no signs of drugs or alcohol use.\nPlease enable Javascript to watch this video36.09986 -80.244216"}, {"url": "https://myfox8.com/news/winston-salem-man-among-4-swimmers-who-died-on-the-north-carolina-coast-this-week/", "title": "Winston-Salem man among 4 swimmers who died on the North Carolina coast this week", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-04", "keywords": ["man", "national", "swimmers", "carolina", "water", "victim", "north", "died", "winstonsalem", "week", "coast", "beach", "kure", "waters", "town", "unresponsive", "near"], "summary": "KURE BEACH, N.C. — A Winston-Salem man drowned at Kure Beach on Wednesday, one of four deaths reported on the North Carolina coast since Monday, according to Kure Beach police.\nAt about 10:15 a.m., police found a man unresponsive near the G Avenue beach accessPolice identified the victim as 37-year-old Devin Adair Harding, of Winston-Salem.\nHours after Harding was pulled from the water, at about 7 p.m., another man was found unresponsive near the J Avenue beach access at Kure Beach.\nAt about 3 p.m. Thursday, a 51-year-old man from Davidson, Maryland, died in the ocean waters off of Nags Head.\nHe was found floating face down in the water near the 8300 block of South Old Oregon Inlet Road, according to the Town of Nags Head."}, {"url": "https://www.wxii12.com/article/vehicle-crash-and-fire-closes-part-of-us-52-ncdot-says/29601885", "title": "All US 52 lanes reopened after vehicle crash and fire", "authors": ["Taylor Lang", "Https", "Www.Facebook.Com"], "date": "2019-10-27", "keywords": ["crash", "near", "akron", "vehicle", "road", "closed", "exit", "lanes", "according", "reopened", "52"], "summary": "The road was closed near Exit 112 near Akron Drive.\nAll US 52 lanes reopened after vehicle crash and fireAll lanes of U.S. Highway 52 are back open after a vehicle crash and fire, according to the Winston-Salem Fire Department.The road was closed near Exit 112 near Akron Drive, according to the North Carolina Department of Transportation website.\nAll lanes of U.S. Highway 52 are back open after a vehicle crash and fire, according to the Winston-Salem Fire Department.\nThe road was closed near Exit 112 near Akron Drive, according to the North Carolina Department of Transportation website.\nAdvertisement"}, {"url": "https://spectrumlocalnews.com/nc/charlotte/news/2019/10/16/fire-breaks-out-at-hanes-mall", "title": "Fire Breaks Out at Hanes Mall", "authors": ["Published Am Et Oct."], "date": "2019-10-16", "keywords": ["tgi", "injuries", "system", "breaks", "mall", "winstonsalem", "fridays", "hanes", "firefighters", "broke", "flames"], "summary": "WINSTON-SALEM, N.C. – Fire officials are investigating an overnight fire at Hanes Mall.\nFire broke out at the TGI Friday's in Hanes Mall around 1:30 Wednesday morning.\nAccording to authorities, the fire broke out around 1:30 Wednesday morning in the duct system over TGI Friday's.\nLuckily, the flames did not extend to any other part of the mall and no injuries were reported.\n#wsfire.140 #fastestwater pic.twitter.com/wUARaH2DVg — Winston-Salem FD (@cityofwsfire) October 16, 2019TGI Friday's will be closed indefinitely, but the rest of the mall will function normally today."}, {"url": "https://myfox8.com/news/17-year-old-shot-killed-overnight-in-winston-salem/", "title": "17-year-old shot, killed overnight in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-18", "keywords": ["county", "336", "shot", "17yearold", "watch", "overnight", "winstonsalem", "javascript", "killed", "woundfire", "winston", "enable", "forsyth", "crimestoppers"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A teenager is dead after shooting in Winston-Salem overnight, police report.\nFire officials and Forsyth County EMS tried to save the teenager's life, but he died at the scene.\nAnyone with information is asked to contact the Winston-Salem Police Department at (336) 773-7700 or CrimeStoppers at (336) 727-2800; En Español (336) 728-3904.\nCrimeStoppers may also be contacted via “Crime Stoppers of Winston Salem Forsyth County” on Facebook.\nPlease enable Javascript to watch this video36.072442 -80.211706"}, {"url": "https://pulitzercenter.org/blog/tour-nikole-hannah-jones-chicago-and-north-carolina", "title": "On Tour With Nikole Hannah-Jones, in Chicago and North Carolina", "authors": [], "date": "2019-10-14", "keywords": ["history", "system", "tour", "carolina", "center", "north", "chicago", "1619", "project", "pulitzer", "thanks", "nikole", "saic", "sawyer", "work", "hannahjones"], "summary": "Pulitzer Center staff ventured to high schools and colleges in Illinois and North Carolina last week to participate in panel discussions and education events surrounding the historic 1619 Project.\nThe Pulitzer Center is a proud education partner for this special issue of The New York Times Magazine that explores the bonds between modern American life and the brutal legacy of slavery.\nAlong with creating and circulating original education curricula centered around the project, the Pulitzer Center has distributed bulk copies of the magazine to over 500 schools across the country—including every high school in Chicago, Buffalo, NY, Washington, DC, and Winston-Salem.\nThe Center has also helped organize engagements with its network of schools and university partners for Nikole Hannah-Jones, lead writer on the 1619 Project.\nWe’re so honored that justice reform advocates Deb LaBelle, Eric Alexander, and Norris Henderson have been with us this week, sharing their urgently important work with our school and university partners here in Chicago.\""}, {"url": "https://myfox8.com/news/metallica-to-headline-5-festivals-in-2020-including-1-in-nc-with-a-promise-to-perform-10-unique-sets/", "title": "Metallica to headline 5 festivals in 2020 – including 1 in NC – with a promise to perform 10 unique sets", "authors": ["Cnn Wire", "Digital Desk"], "date": "2019-10-10", "keywords": ["weekend", "springfall", "rock", "2020", "sets", "metallica", "headline", "including", "unique", "presents", "ticket", "nc", "band", "festivals", "wimmer", "promise", "danny", "perform"], "summary": "Metallica has announced that it will headline all five of Danny Wimmer Presents’ Spring/Fall U.S. rock festivals in 2020.\nMetallica fans better start stretching their neck muscles because the band has some headbang-worthy news coming straight for you.\nMetallica has announced that it will headline all five of Danny Wimmer Presents’ Spring/Fall U.S. rock festivals in 2020.\nFor a double dose of the rock legends, Metallica will be giving closing performances on both Friday and Sunday night of the festivals, performing unique sets each time.\nThe winner will receive an all-expenses-paid trip to their choice of one of the festivals, including accommodation, exclusive festival access, meet-and-greet passes, and band swag."}, {"url": "https://wschronicle.com/2019/11/student-with-winston-salem-roots-crowned-miss-unc-2019/", "title": "Student with Winston-Salem roots crowned Miss UNC 2019", "authors": [], "date": "2019-11-06", "keywords": ["member", "mcneill", "miss", "student", "roll", "reginald", "winstonsalem", "roots", "unc", "2019", "honor", "university", "crowned", "mckinley", "graduate"], "summary": "Congratulations to McKinley Alexis McNeill, a 2016 graduate from Parkland High School, who was crowned Miss UNC 2019 at The University of North Carolina at Chapel Hill on Oct. 26.\nAs Miss UNC, McKinley will launch her #Feed50 Food Insecurity project to raise awareness and funds to help Table Inc. in Carrboro feed 50 children for one month.\nShe has earned several scholastic and athletic awards and is known for her community service.\nMcNeill is the daughter of Reginald and Deborah McNeill.\nShe has one brother, Reginald Jr, who attends James Madison University and is on the football team."}, {"url": "https://triad-city-beat.com/tattoo-history-convention-winston-salem/", "title": "World’s first tattoo history convention gathers in Winston-Salem", "authors": [], "date": "2019-10-17", "keywords": ["history", "worlds", "tattoos", "eldridge", "tattoo", "tattooing", "gibbons", "winstonsalem", "art", "flash", "artist", "gathers", "convention", "rojas"], "summary": "Eldridge has been in the business of collecting and preserving tattoo history for years.\n“I started looking for his stuff in the ’80s,” says Rojas, who owns Electra Art Tattoo in Corpus Christi.\n“The illustrations are some of the best I’ve ever seen.”Tattoo artist and enthusiast Leif Hansen paid thousands of dollars for this tattoo flash by an unknown tattoo artist.\n“They wouldn’t be getting the tattoo here without the guys that came before.”Paul “Rambo” Ramsbottom understands the need to preserve tattoo history.\nIt’s important for tattoo history to stay true, simple and honest.”"}, {"url": "https://myfox8.com/news/winston-salem-forsyth-county-schools-recalls-chromebooks-after-one-began-smoking/", "title": "Winston-Salem/Forsyth County Schools recalls Chromebooks after one began smoking", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-10-09", "keywords": ["county", "steen", "smoking", "yearabout", "chromebook", "classroom", "winstonsalemforsyth", "began", "olivia", "article", "chromebooks", "school", "recalls", "schools", "osteennews"], "summary": "Please enable Javascript to watch this videoLEWISVILLE, N.C. — All Chromebooks are being taken out of Winston-Salem/Forsyth County Schools, according to the school system.\nConcern sparked when a Chromebook began smoking at about 9:30 a.m. in a 3rd-grade classroom at Lewisville Elementary School.\npic.twitter.com/bYVumberBp — Olivia Steen (@OSteenNews) October 9, 2019The school was evacuated, and the smoldering device was put out.\nAbout 8,000 new Chromebooks will be put into schools this month.\n— Olivia Steen (@OSteenNews) October 9, 201936.097082 -80.419222"}, {"url": "https://www.wxii12.com/article/north-carolina-traffic-stop-piedmont-triad-race-disparities/31082726", "title": "North Carolina traffic stops show racial disparities, data says", "authors": ["Davonté Mckenith", "Https", "Www.Facebook.Com Davontemckenith", "Anchor Reporter"], "date": "2020-02-25", "keywords": ["county", "searched", "sheriffs", "drivers", "carolina", "traffic", "racial", "north", "data", "white", "disparities", "search", "stopped", "stops"], "summary": "It breaks down the numbers data you're about to see covers the traffic stops and searches.\nMore diversity and patrol and policy making procedures, he says that will help stop unjust traffic stops.\nOf course, not the only department with disparities are analysis of nearly 11 million traffic stops by the state Highway Patrol shows.\nBaumgartner said there are real and dramatic racial disparities when it comes to traffic stops.\nWe recognize it exists in this country.”The Forsyth County Sheriff’s Office, of course, is not the only department with disparities."}, {"url": "https://www.nj.com/atlantic/2019/11/man-accused-of-dognapping-at-nj-rescue-farm-now-facing-murder-charge-in-nc.html", "title": "Man accused of dognapping at N.J. rescue farm now facing murder charge in N.C.", "authors": ["Rebecca", "Everett", "Reverett Njadvancemedia.Com", "Rebecca Everett", "For Nj.Com", "Both Men Are Being Held In The Forsyth County Detention Center With No Bond", "Are Scheduled To Appear In Court Nov.", "Police Said."], "date": "2019-11-05", "keywords": ["dognapping", "accused", "man", "dog", "rescue", "nj", "caesar", "post", "roommate", "north", "nc", "smith", "facing", "charge", "farm", "oct", "bussey", "murder"], "summary": "The man accused last month of stealing his dog back from a New Jersey animal rescue farm has been charged with stabbing a man to death in North Carolina, authorities said.\nWhile police did not disclose whether they recovered the dog from the crime scene, Funny Farm Rescue announced Tuesday morning that Caesar, the dog that Bussey had allegedly surrendered and then absconded with, had been returned to the Mays Landing rescue.\nIn the original Facebook post describing the alleged theft of the dog, Funny Farm Rescue described Bussey as a runaway from Missouri who ended up in a youth homeless shelter in Atlantic City.\nThe rescue never said when this happened, but it posted the story — along with a photo of Bussey and Caesar — in early October.\nTucker is... Posted by Funny Farm Rescue on Tuesday, November 5, 2019Rebecca Everett may be reached at reverett@njadvancemedia.com."}, {"url": "https://www.wxii12.com/article/they-lost-their-jobs-because-of-the-coronavirus-outbreak-now-theyre-full-time-video-game-coaches/32169763", "title": "They lost their jobs because of the coronavirus outbreak. Now they're full-time video game coaches", "authors": ["Shannon Liao"], "date": "2020-04-16", "keywords": ["theyre", "lost", "coaches", "reporter", "youre", "jobs", "coaching", "game", "fulltime", "video", "online", "gaming", "coronavirus", "outbreak", "kings", "customers"], "summary": ">> THE INTERESTING CROSS OVER WITH TRADITIONAL SPORTS IS TRADITIONAL ATHELETES AND FANS AROUND THE WORLD ALL LOVE GAME REPORTER: CHRIS PARK MANAGES TEAMS AROUND THE WORLD.\nREPORTER: KINGS GUARD GAMING FRESH OFF THEIR COAST-TO-COAST CUP WIN, GEARING UP NOW TO PLAY IN A SPECIAL TOURNAMENT THIS WEEKEND WITH FANS.\nNow they're full-time video game coaches Share Shares Copy Link CopyTrevor Andrews is a concert violist and music teacher who found his symphony performances canceled in late March as COVID-19 decimated the U.S. economy.\n\"Tech-savvy game enthusiasts are becoming full-time video game coaches as the ongoing pandemic has eradicated millions of jobs.\n\"Unfortunately, things are totally up in the air,\" he said.A video game coach for two years, Spersch decided to turn his side gig into a full-time one in March."}, {"url": "https://theundefeated.com/features/samuel-puryear-howards-new-golf-coach-knows-how-to-win/", "title": "Samuel Puryear, Howard’s new golf coach, knows how to win", "authors": ["Nathaniel Easington"], "date": "2020-04-15", "keywords": ["youre", "things", "university", "knows", "hbcu", "think", "samuel", "howards", "win", "puryear", "coach", "golf", "lot", "howard", "thats", "looking"], "summary": "Samuel Puryear Jr., Howard University’s new men’s and women’s golf coach, is returning to his HBCU roots.\nSo, you’re looking at a lot of video, which you do anyway, but now that’s your only way to do it.\nSo now you’re looking at a golf resume.\nYou’re looking at junior tournaments and you’re looking at golf video.\nI think you’re looking at students from coast to coast, honestly."}, {"url": "https://www.wbtv.com/2020/03/17/latest-north-carolina-news-sports-business-entertainment-am-edt/", "title": "Latest North Carolina news, sports, business and entertainment at 9:20 p.m. EDT", "authors": ["Published Am At Am", "Published April", "At Am"], "date": "2020-03-17", "keywords": ["business", "running", "didnt", "carolina", "cooper", "state", "gov", "north", "latest", "entertainment", "920", "roy", "restrictions", "coopers", "edt", "restriction", "forest"], "summary": "Roy Cooper's power to demand a dine-in prohibition at North Carolina’s restaurants and bars is being challenged by Republican Lt. Gov.\nForest says the governor didn't get the consent of a majority of the Council of State needed to issue the new customer restrictions on Tuesday.\nBut Cooper's office says he didn't need that backing and cite several other laws to back his decision.\nForest is running against Cooper in November.\nForest says the mandate will “devastate our economy.” Cooper says the restriction is a painful but necessary action to blunt the intensity of the new coronavirus."}, {"url": "https://wschronicle.com/2020/04/wake-experiences-most-successful-stretch-ever-under-clawson/", "title": "Wake experiences most successful stretch ever under Clawson", "authors": [], "date": "2020-04-09", "keywords": ["set", "experiences", "stretch", "successful", "bowl", "record", "coach", "season", "forest", "team", "deacons", "clawson", "wake"], "summary": "Since head coach Dave Clawson arrived in Winston-Salem, the Wake Forest football team has experienced the most successful stretch in program history while also rewriting the record book.\nSince the start of the 2017 season, Wake Forest is tied for the second-most wins in the Atlantic Coast Conference.\nIn his 20 years as a head coach, Coach Clawson has had a history of turning programs into winners.\nWake Forest set major records for points scored in a season, obliterating the record by 97.\nOn December 10, 2013, Clawson became the 32nd head football coach in Wake Forest University history."}, {"url": "https://thegrio.com/2020/03/17/north-carolina-woman-recants-story-black-teens-jail/", "title": "North Carolina woman recants story that put 4 Black teens in jail for years", "authors": [], "date": "2020-03-17", "keywords": ["sorry", "jail", "wrongful", "man", "recants", "local", "carolina", "black", "teens", "north", "men", "woman", "commission", "jones", "murder"], "summary": "A North Carolina woman has recanted her original testimony that implicated five Black teens in the 2002 murder of local man Nathaniel Jones.\nAccording to the Winston-Salem Journal, last week, Jessicah Black, 33, wept on the stand as she was questioned by the state’s Innocence Inquiry Commission.\nBlack was visibly distraught throughout her hearing with the commission in the state capital of Raleigh and expressed remorse for her part in getting the teens thrown behind bars.\nBlack claims she was coerced by detectives to implicate the teens in Jones’ murder and only complied after they convinced her that she might be charged if she didn’t say exactly what they wanted.\nAnd a fifth man, Dorrell Brayboy was released but tragically stabbed to death outside a local grocery store in 2019."}, {"url": "https://myfox8.com/news/family-escapes-burning-home-in-winston-salem-neighborhood/", "title": "Family escapes burning home in Winston-Salem neighborhood", "authors": ["Tess Bargebuhr", "Cnn Wire", "Digital Desk"], "date": "2019-11-15", "keywords": ["neighborhood", "family", "burning", "escapes", "rivera", "enable", "watch", "winstonsalem", "crews", "javascript", "god", "thank", "cruz"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Smoke detectors potentially saved five people's lives when a fire broke out at a Winston-Salem home.\nYaquelin Cruz Rivera, the homeowners' daughter, showed the extensive damage to the kitchen and back of the home.\n“For us to see it the way it is is so hard because it’s all our memories and our childhood,” Cruz Rivera said.\n\"When they tried to go back, the cops...didn’t let them go back because it was just so much fire,” Cruz Rivera said.\n\"We thank God."}, {"url": "https://www.orlandomagazine.com/win-a-trip-for-2-to-north-carolina/", "title": "Win A Trip For 2 To North Carolina!", "authors": [], "date": "2019-11-11", "keywords": ["holidays", "salem", "triad", "house", "carolina", "trip", "special", "museum", "north", "winstonsalem", "win", "old", "reynolda", "spirit"], "summary": "Get into the Spirit with Winston-Salem’s Historic HolidaysThis season, we’re giving one special winner a chance to get into the Spirit of the holidays in Winston-Salem, North Carolina.\nWith daily direct flights from Orlando to the Piedmont Triad International Airport, guests can experience more than 250 years of history when visiting Winston-Salem this season.\nHistoric holidays in Winston-Salem are filled with the Spirit of nostalgia.\nTour historic homes, featuring 18th and 19th century seasonal decorations throughout Old Salem, Graylyn Estate and Reynolda House Museum of American Art.\nExplore traditions dating back to the earliest settlers, including a delicious stop or two along the famed Moravian Culinary Trail."}, {"url": "https://myfox8.com/news/police-respond-to-reported-shooting-at-bojangles-in-winston-salem/", "title": "Police respond to reported shooting at Bojangles in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-21", "keywords": ["bojangles", "scene", "respond", "videowinstonsalem", "walkertown", "vehicle", "watch", "office", "winstonsalem", "vehiclethe", "shooting", "deputy", "sheriffs", "reported", "winstonsalemofficers"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Police are on scene after a shooting at a Bojangles on New Walkertown Road in Winston-Salem.\nAccording to the sheriff's office, a Forsyth County deputy was in the area when the shots were fired and radioed it in.\nThe deputy said they saw a group running away from the scene, as well as a vehicle.\nThe sheriff's office and police set up a perimeter.\nThe vehicle was found unoccupied on the 500 block of Martin Luther King Jr. Drive."}, {"url": "https://triad-city-beat.com/the-triad-100-the-100-people-places-and-things-that-shaped-the-triad-in-2019/", "title": "The Triad 100: The 100 people, places and things that shaped the Triad in 2019", "authors": [], "date": "2019-12-26", "keywords": ["county", "things", "triad", "black", "shaped", "north", "high", "places", "winstonsalem", "2019", "city", "members", "greensboro", "school", "100"], "summary": "Triad City Beat delved into the case in 2019, although Fairbanks was arrested in early 2018.\nTriad City Beat broke the story, and it commanded the largest audience of any in 2019.\nAll four visited different locations in Greensboro from Bennett College and NC A&T University to Smith High School and Natty Greene’s.\nTriad City Beat wins awardsThe TCB team took home two national Altweekly Awards, awarded at the annual convention in July, both for political writing.\nBlack Panther PartyThe Winston-Salem Black Panther Party’s 50th year celebration in October was a bittersweet affair."}, {"url": "https://myfox8.com/news/man-dead-after-shooting-sends-3-to-hospital-in-winston-salem/", "title": "Man dead after shooting sends 3 to hospital in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-20", "keywords": ["man", "weapon", "dead", "harris", "hospital", "men", "sends", "officers", "winstonsalem", "gunshot", "shooting", "jones", "brown", "stopped", "victim"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — A man is dead, two others were injured and a woman is in custody after a shooting in Winston-Salem, according to Winston-Salem police.\nArriving officers found a car on the side of the road and two men — 22-year-old Ajian Lynell Jones, of Winston-Salem, and Andres Harris, 19 — suffering from gunshot wounds in the car.\nInvestigators learned a third gunshot victim, Charvez Brown, 25, of Winston-Salem, arrived at a hospital with non-life-threatening injuries.\nWhen a passerby stopped to help, they saw the gunshot victim and called 911.\nAnyone with information is asked to contact the Winston-Salem Police Department at (336) 773-7700 or CrimeStoppers at (336) 727-2800."}, {"url": "https://www.wfmynews2.com/article/news/local/veterans-day-2019-events-in-the-triad/83-d8b27b8c-c3e7-40bf-86bf-cfeda3542cce", "title": "LIST | Veterans Day 2019 Parades, Ceremonies in the Triad", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Est November", "Updated"], "date": "2019-11-07", "keywords": ["triad", "pmwhere", "war", "veterans", "day", "parade", "starting", "ceremonies", "parades", "list", "2019", "series", "honor", "street", "left"], "summary": "Info: The parade will honor veterans as well as active-duty personnel and Gold Star families of Guilford County.\nWinston-Salem Veterans Day ParadeWhen: Saturday, November 9 starting at 9 a.m.Where: Starting near Broad and Fourth streets.\nHigh Point Veterans Day ParadeWhen: Sunday, November 10- Starting at 3:00 p.m.Where: The parade will start along Main Street in downtown high Point.\nVeterans Day Service at Carolina Field of HonorWhen: Monday, November 11 starting at 11 a.m.Where: Carolina Field of Honor in KernersvilleInfo: The service will honor veterans past and present.\nAlamance County Veterans Day Parade and FestivalWhen: Saturday, November 9 from 9 a.m. to 5 p.m.Where: Downtown GrahamInfo: The event is sponsored by Alamance County Veterans group."}, {"url": "https://www.wfmynews2.com/article/entertainment/christmas-events-list-parades-ice-skating-tree-lightings-holidays-greensboro-winston-salem-nc/83-2f706732-287a-4c15-b3f1-f4cea9adbaec", "title": "CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, and More!", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated", "Am Est December"], "date": "2019-11-19", "keywords": ["lights", "pmwhere", "events", "holiday", "parade", "jamestown", "2019", "parades", "nc", "greensboro", "santa", "christmas", "details"], "summary": "CHRISTMAS PARADESJamestown Christmas ParadeWhat: It’s all about a holiday good time at the Jamestown Christmas Parade!\nWhen: December 1 at 3:00 p.m.Where: Main StreetMore Details: Jamestown Christmas ParadeSights and sounds of the 2019 Jamestown Parade:PHOTOS | Jamestown Christmas ParadePHOTOS | Check Out the 2019 Jamestown Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas ParadeLexington Christmas ParadeWhat: Christmas is Uptown Lexington!\nWhen: Saturday, December 7 at noon(rain or shine)Where: Starts on North Greene Street in GreensboroMore Details: Holiday Parade Route MapWinston-Salem Jaycees Holiday ParadeWhat: Come to downtown Winston-Salem for the 29th Annual Winston-Salem Jaycees Holiday Parade.\nMore Details: Winston-Salem Jaycees Holiday ParadeHigh Point Holiday Festival ParadeWhat: Get into the Holiday spirit with the High Point Holiday Festival Parade!\nMore Details: High Point ParadeBurlington Christmas ParadeWhat: Oh, what fun it is to be at the Burlington Christmas Parade!"}, {"url": "https://spectrumlocalnews.com/nc/triangle-sandhills/things-to-do/2019/11/18/celebrating-a-north-carolina-christmas-with-our-state-magazine", "title": "Celebrating A North Carolina Christmas With Our State Magazine", "authors": ["Published Am Et Nov."], "date": "2019-11-18", "keywords": ["writer", "magazine", "yearspectrum", "carolina", "state", "north", "celebrating", "holiday", "2019", "nc", "issue", "christmas"], "summary": "Raleigh, N.C.— Just in time for the 2019 holiday season, Our State is launching a brand new 200 page keepsake issue.\nA North Carolina Christmas is filled with many of the publication’s favorite holiday traditions, recipes and experiences.\nThe first of it’s kind Christmas anthology as they’re calling it, highlights classic stories from the archives, tasty treats to eat, and places that celebrate all that North Carolina has to offer the end of each year!\nSpectrum News anchor Caroline Blair sat down with Our State writer and digital manager, Jeremy Markovich, for a glimpse inside the new issue, and details on the 2019 Made in N.C.\nA North Carolina Christmas by Our State is on newsstands right now."}, {"url": "https://myfox8.com/news/2-taken-to-hospital-after-shooting-in-winston-salem-1-victim-has-life-threatening-injuries/", "title": "2 taken to hospital after shooting in Winston-Salem; 1 victim has life-threatening injuries", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-20", "keywords": ["victims", "injuries", "hospital", "taken", "officers", "winstonsalem", "shots", "mall", "hanes", "shooting", "lifethreatening", "victim", "peachtree"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Two people were taken to the hospital Tuesday night after a shooting in Winston-Salem, according to Winston-Salem police.\nShortly after arriving, officers were called to the Interstate 40 Hanes Mall Boulevard exit ramp.\nArriving officers found a car on the side of the road with two male victims inside suffering from gunshot wounds.\nBoth victims were taken to the hospital and one victim has life-threatening injuries.\nIt is unclear if the shots fired call on Peachtree Street is related to the victims found on the Hanes Mall Boulevard exit ramp."}, {"url": "https://news.wfu.edu/2019/11/15/turkeypalooza-2019-to-feed-about-350/", "title": "Turkeypalooza 2019 to feed about 350", "authors": [], "date": "2019-11-15", "keywords": ["sweet", "meals", "used", "raise", "nov", "veterans", "feed", "2019", "community", "campus", "potatoes", "turkeypalooza", "wake", "350"], "summary": "Beginning Nov. 17, Wake Forest volunteers will prepare about 350 traditional Thanksgiving meals in Campus Kitchen and deliver them to food-insecure Winston-Salem residents during Turkeypalooza.\nDinners of turkey, green beans, vegetable stuffing, mashed sweet potatoes, homemade cranberry sauce and pumpkin cookies will be delivered Nov. 19-25.\nThe bulk of the green beans and sweet potatoes being used are from the Wake Forest Campus Garden.\nTurkeypalooza is an annual event sponsored by Campus Kitchen that began in 2006.\n“Because we’re preparing scratch-made meals and not relying on donated goods, we fundraise from the campus community to be able to purchase the food,” said Brad Shugoll, associate director of service and leadership for the Office of Civic and Community Engagement."}, {"url": "https://www.thetimesnews.com/news/20200317/jailed-north-carolina-teacher-charged-with-more-student-sex-abuse-counts", "title": "Jailed North Carolina teacher charged with more student sex abuse counts", "authors": [], "date": "2020-03-17", "keywords": ["sex", "county", "sheriffs", "student", "carolina", "north", "walkertown", "counts", "male", "teacher", "jailed", "abuse", "school", "taking", "charged"], "summary": "WALKERTOWN, N.C. — A former North Carolina middle school teacher previously charged with sexually abusing a male student was charged Monday with additional sex crime counts involving other male students, authorities said.\nCarly Erin Kaczmarek, 32, was charged with one count of statutory rape, two counts of sexual activity with a student and two counts of taking indecent liberties with a student in connection with an off-campus encounter in November 2019, according to warrants obtained by the Winston-Salem Journal.\nWinston-Salem/Forsyth County School officials told news outlets the district was recently notified of the criminal investigation, but Kaczmarek had already been suspended pending a separate, unrelated investigation.\nKaczmarek was being held in Forsyth County jail Monday on a $50,000 bond.\nIt's unclear whether she has an attorney who can comment on her behalf."}, {"url": "https://myfox8.com/news/man-shot-killed-in-winston-salem-after-fight-with-weapons-police-say/", "title": "Man shot, killed in Winston-Salem after fight with weapons, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-03", "keywords": ["man", "parking", "suspects", "shot", "victim", "release", "winstonsalem", "say", "weapons", "killed", "male", "lot", "department", "fight"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- A man was shot and killed in Winston-Salem Sunday after a fight that involved weapons, according to a Winston-Salem Police Department news release.\nPolice got a call around 2:16 a.m. reporting a fight in progress with weapons at 910 N. Cleveland Ave.Officers responded and found a dead male victim, lying on the ground in the parking lot of an apartment complex, the release says.\nEMS arrived and pronounced the male victim deceased.\nGunfire was heard in the parking lot after an argument and all four suspects fled the scene in a white four-door vehicle, the release says.\nAuthorities are asking that anyone with information regarding this investigation contact the Winston-Salem Police Department at (336) 773-7700."}, {"url": "https://www.robesonian.com/opinion/letters/133531/vital-everyone-fills-out-census-form", "title": "Vital everyone fills out Census form", "authors": [], "date": "2020-04-08", "keywords": ["county", "form", "roughly", "federal", "state", "means", "person", "fills", "complete", "responded", "robeson", "vital", "census"], "summary": "To the editorWhile we attempt to flatten the curve through social distancing, one thing we can all do is complete the 2020 Census.\nAs of April 5 everyone with a home mailing address should have received an invitation to complete the 2020 Census.\nIf you have misplaced it or put it off, you can complete the form online at the Census.gov.\nDespite the obvious importance, Robeson County has only a 33% self-response rate as of April 5.\nIf you have not yet responded to the Census, take five minutes to help yourself and your community in this time of uncertainty."}, {"url": "https://www.ncaa.com/news/fieldhockey/article/2019-11-22/2019-di-field-hockey-championship-north-carolina-tops-princeton", "title": "2019 DI field hockey championship: North Carolina tops Princeton in final with dominant second half", "authors": [], "date": "2019-11-22", "keywords": ["goal", "second", "matson", "carolina", "game", "shot", "north", "hockey", "dominant", "tops", "final", "di", "tar", "princeton", "heels", "field", "scored", "half"], "summary": "The North Carolina Tar Heels are your 2019 Division I field hockey champions.\nFINAL NORTH CAROLINA VS. PRINCETON BOX SCORENorth Carolina 6, Princeton 1 | END OF GAMENorth Carolina 5, Princeton 1 | Mid 4QNorth Carolina is inching towards the national championship with an absolutely dominant second half performance.\nNorth Carolina 4, Princeton 1 | End of 3QNorth Carolina can play this conservatively now.\nThe North Carolina defense has really tightened up after allowing an early Princeton goal and is outshooting the Tigers 6-4.\n1 North Carolina defeats in-state rival Duke 1-0Division I field hockey: History, champions"}, {"url": "https://www.wxii12.com/article/former-guilford-county-sheriff-bj-barnes-easily-defeats-danny-nelson-in-mayoral-race/29705352", "title": "Election 2019 results are in; several changes in town, city political landscapes", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2019-11-06", "keywords": ["changes", "county", "landscapes", "incumbent", "local", "guilford", "york", "sheriff", "mayor", "city", "political", "election", "2019", "results", "town", "race"], "summary": "Election 2019 results are in; several changes in town, city political landscapesSummerfield is getting a new mayor and it's a familiar face in local politics.\nHe will take Ward's seat.Check out your local election results here.\nBarnes, the longest-serving sheriff in Guilford County history, cruised to victory in Summerfield's mayoral race, earning more than sixty percent of the vote.\nAdvertisementBarnes served Guilford County for 24 years before losing his re-election bid to current Sheriff Danny Rogers last November.\nIn Thomasville, the race between incumbent Mayor Raleigh York and challenger Lisa Shell was about as close at it gets."}, {"url": "https://www.wfmynews2.com/article/news/crime/shooting-investigation-winston-salem-west-academy-mulberry-street/83-f1dac8b5-cfb2-4221-9d42-f15435a84deb", "title": "Apartment Murder and Nearby Shooting Not Connected, Winston-Salem Police Say", "authors": ["Author", "Megan Allman", "Wfmy News Digital", "Published", "Am Edt October", "Updated", "Pm Edt October"], "date": "2019-10-28", "keywords": ["thornton", "shot", "died", "coble", "winstonsalem", "connected", "apartment", "say", "came", "shooting", "nearby", "stabbed", "street", "identified", "murder"], "summary": "WINSTON-SALEM, N.C. — Winston-Salem Police are investigating two deaths and one assault with a deadly weapon case.\nPolice arrived to find Eric Coble shot on the side of the roadway.\nPolice say Coble was shot outside of a home and the suspect ran away from the area.\nPolice say an adult male, identified as Jamey Alfredo Thornton, was found dead in the roadway next to his bicycle.\nInvestigators say Thornton was sideswiped by a dump truck."}, {"url": "https://myfox8.com/news/winston-salem-officials-to-address-teen-violence-in-city-after-murder-of-2-teens/", "title": "Winston-Salem officials to address teen violence in city after murder of 2 teens", "authors": ["Tess Bargebuhr", "Cnn Wire", "Digital Desk"], "date": "2019-11-06", "keywords": ["things", "teen", "officials", "ford", "realize", "teens", "violence", "winstonsalem", "city", "address", "members", "help", "community", "residents", "upcoming", "murder"], "summary": "Assistant City Manager Tasha Logan Ford said Tuesday that gun violence will be discussed in the committee’s upcoming November meeting.\n“I think it’s important for the community to realize that we are concerned about this just as the residents are,” Ford said.\nShe explained that the committee would review statistics, look for possible trends and review programs that could help curb violence.\n“It’s always an ongoing conversation in our community in terms of how do we make sure we have a safe environment for all of our residents,\" Ford said.\nWe spend a lot of time working to build relationships with the community members with neighborhoods,” Ford said."}, {"url": "https://www.wfmynews2.com/article/news/local/fall-festivals-haunted-attractions-pumpkin-patches-farms-hayrides-corn-mazes-nc/83-d8a34dc5-3117-44a1-a470-28778e9e82eb", "title": "It’s Fall Y'all! List of Fall Festivals, Spooky Attractions, Pumpkin Patches, Corn Mazes, Hayrides In North Carolina", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Am Edt September", "Updated", "Pm Edt October"], "date": "2019-09-26", "keywords": ["hayrides", "pumpkin", "spooky", "visit", "yall", "festival", "information", "north", "fun", "farm", "ncmore", "list", "fall", "festivals", "mazes", "patches", "includes"], "summary": "If you want your fall festival, haunted attraction, or farm to be featured send an email to webteam@wfmy.com Add Attn: Fall Event in the subject line.\nCORN MAZES, HAYRIDES, PUMPKIN PATCHESCornfield Maize Adventure (Archdale): 10-acre corn maze at Kersey Valley (1615 Kersey Valley Rd.)\nCheck It Out: Go Apple or Pumpkin Picking In The TriadJ.Razz and Tazz Farm: Includes pumpkin patch, cow train rides, corn maze, haunted forest hayrides, and farm equipment on display.\nFind out more by visiting McKee Cornfield MazeMillstone Creek Orchards (Ramseur): Includes pumpkin patch, pick your own apples, hayrides, cider mill, and more.\nBush-N-Vine Fall Farm (York): Pick your own pumpkin and enjoy Saturday hayrides."}, {"url": "https://triad-city-beat.com/fact-check-winston-salem-mayoral-race/", "title": "The sunny incumbent and gloomy challenger: A fact-check on the Winston-Salem mayoral race", "authors": ["Jordan Green Is The Senior Editor At Triad City Beat."], "date": "2020-02-12", "keywords": ["allen", "mayoral", "incumbent", "poverty", "sunny", "gloomy", "growth", "jobs", "north", "winstonsalem", "joines", "city", "housing", "race", "msa", "factcheck", "challenger"], "summary": "It’s hard to reconcile the data cited by incumbent Allen Joines and challenger JoAnne Allen on employment, housing and a host of other metrics on Winston-Salem’s well-being.\nAllen Joines and JoAnne Allen, the two candidates in Winston-Salem’s Democratic mayoral primary, often seem to describe two different cities.\nAllen Joines cited the partnership as a source in a follow-up conversation with TCB.\nIndeed, Winston-Salem’s annual jobs growth compared favorably to other MSAs in the Southeast, including Charlotte (2.4 percent), Raleigh (1.8 percent), Greensboro-High Point (0.3 percent) and Greenville, SC (1.8 percent).\n“You may have seen that I was able to raise pilot funds to pay for a free college program,” Allen Joines said."}, {"url": "https://www.hcpress.com/obituaries/watauga-avery-obituaries-november-5-2019.html", "title": "Watauga, Avery Obituaries – November 5, 2019", "authors": [], "date": "2019-11-05", "keywords": ["family", "avery", "boone", "watauga", "gragg", "friends", "funeral", "2019", "wife", "nc", "obituaries", "husband"], "summary": "Bertha Faye Moody1928 – 2019Ms. Bertha Faye Moody, age 91, of Vilas, passed away Tuesday, October 29, 2019 at Watauga Medical Center.\nAndrew Vila, Jr.December 19, 1947 – October 29, 2019Andrew Vila, Jr., age 71, of Boone passed away Tuesday, October 29, 2019 at Watauga Medical Center.\nJr., will be conducted Friday afternoon, November 1, 2019, at 1:00 o’clock, at the Watauga Medical Center Chapel.\nMiriam “Micki” SteinNovember 29, 1925 – October 31, 2019Miriam, “Micki”, K. Stein long-time resident of Boone, NC.\nIn lieu of flowers, memorial donations may be made to: Medi-Home Hospice, 400 Shadowline Dr. Suite 102 Boone, NC 28607."}, {"url": "https://www.wxii12.com/article/mobile-home-fully-engulfed-in-flames-in-winston-salem/29675732", "title": "Mobile home catches fire in Winston-Salem", "authors": ["Steve King", "Https", "Www.Facebook.Com Stevedking.Info"], "date": "2019-11-03", "keywords": ["county", "dispatchers", "mobile", "line", "fully", "engulfed", "winstonsalem", "say", "davidson", "catches", "flames"], "summary": "Davidson County dispatchers say a mobile home was fully engulfed in flames in Winston-Salem across the Davidson County line at around 9:30 p.m. on Saturday.\n(Video: A look at other evening headlines from November 2, 2019)Davidson County dispatchers say a mobile home was fully engulfed in flames in Winston-Salem across the Davidson County line at around on Saturday night.Investigators say no one was hurt in the fire.\nEmergency crews responded to the fire at 8:53 p.m.Dispatchers told WXII 12 News that the mobile home fire is located at 158 Rachael Drive.\n(Video: A look at other evening headlines from November 2, 2019)Davidson County dispatchers say a mobile home was fully engulfed in flames in Winston-Salem across the Davidson County line at around on Saturday night.\nEmergency crews responded to the fire at 8:53 p.m.Dispatchers told WXII 12 News that the mobile home fire is located at 158 Rachael Drive."}, {"url": "https://www.atlantamagazine.com/travel/holiday-nostalgia-blossoms-in-winston-salem/", "title": "Holiday Nostalgia Blossoms in Winston-Salem", "authors": [], "date": "2019-11-20", "keywords": ["christmas", "nostalgia", "local", "fair", "moravian", "holiday", "winstonsalem", "old", "shopping", "art", "winstonsalems", "blossoms"], "summary": "Experience more than 260 years of historic holiday traditions filled with the spirit of nostalgia, the twilight of candlelight tours, and excitement of holiday celebrations for the entire family.\nEven local brewery, Foothills Brewing, taps into Winston-Salem’s Moravian heritage with their holiday release of People’s Moravian Porter.\nA Holiday Shopping Trip Like No OtherA Winston-Salem holiday getaway wouldn’t be complete without selecting one-of-a-kind gifts for everyone on your shopping list.\nKickstart your holiday shopping by experiencing a festive Winston-Salem tradition—the 56th Annual Piedmont Craftsmen’s Fair, November 23–24.\nLocal Winston-Salem makers have mastered the art of handmade holiday gift giving and now you can too with workshops that guide you from start to finish on the perfect holiday gift."}, {"url": "https://www.wspa.com/sports/clemson-usc-top-ten-moments/10-usc-1969-acc-championship/", "title": "#10 USC: 1969 ACC Championship", "authors": ["Dan Vasko"], "date": "2020-04-15", "keywords": ["carolina", "championship", "conference", "tech", "bowl", "season", "south", "acc", "gamecocks", "1969", "usc"], "summary": "#10: 1969 ACC Football ChampionshipOverviewWhen it comes to Gamecocks football few accomplishments compete with the ACC champs.\nThe 1969 ACC Champion South Carolina Gamecocks(Photo Courtesy: South Carolina Athletics)SeasonIt was a pivotal season for fourth-year head coach Paul Dietzel and the South Carolina Gamecocks.\nThat loss was followed by three-straight victories, building momentum in their chase for the ACC Championship.\nSuggs threw three touchdown passes as South Carolina routed the Demon Deacons, 24-6, clinching the ACC Conference Championship.\nKornblut maintains, however, that the 1969 ACC Championship can be looked at with both pride and frustration."}, {"url": "https://wschronicle.com/2019/11/student-with-winston-salem-roots-crowned-miss-unc-2019/", "title": "Student with Winston-Salem roots crowned Miss UNC 2019", "authors": [], "date": "2019-11-06", "keywords": ["member", "mcneill", "miss", "student", "roll", "reginald", "winstonsalem", "roots", "unc", "2019", "honor", "university", "crowned", "mckinley", "graduate"], "summary": "Congratulations to McKinley Alexis McNeill, a 2016 graduate from Parkland High School, who was crowned Miss UNC 2019 at The University of North Carolina at Chapel Hill on Oct. 26.\nAs Miss UNC, McKinley will launch her #Feed50 Food Insecurity project to raise awareness and funds to help Table Inc. in Carrboro feed 50 children for one month.\nShe has earned several scholastic and athletic awards and is known for her community service.\nMcNeill is the daughter of Reginald and Deborah McNeill.\nShe has one brother, Reginald Jr, who attends James Madison University and is on the football team."}, {"url": "https://myfox8.com/news/detailed-look-into-winston-salem-police-departments-need-for-gunfire-detection-system/", "title": "Detailed look into Winston-Salem Police Department’s need for gunfire detection system", "authors": ["Michael Hennessey", "Cnn Wire", "Digital Desk"], "date": "2019-11-13", "keywords": ["departments", "school", "system", "gunfire", "leone", "officers", "winstonsalem", "look", "say", "firearmrelated", "responded", "detection", "department", "detailed", "need"], "summary": "As of Nov. 5, Winston-Salem officers responded to 542 firearm-related assaults in 2019.\nOfficers say they’ve responded to 158 firearm-related robberies during that span, with 53 of them being cleared.\nIn October, the department announced it’d been awarded a $699,608 grant through a U.S. Department of Justice grant for a gunfire detection system.\n\"That will help them alert to whether they're dealing with automatic gunfire, semi-automatic gunfire or just a single shot,” Leone said.\nThe Winston-Salem Police Department says it’s still in the bidding process for gunfire detection system providers."}, {"url": "https://myfox8.com/news/tractor-trailer-crashes-into-winston-salem-funeral-home/", "title": "Tractor-trailer crashes into Winston-Salem funeral home", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-20", "keywords": ["crashes", "suffered", "main", "scene", "videowinstonsalem", "watch", "winstonsalem", "funeral", "tractortrailer", "word", "crashed"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- A tractor-trailer crashed into a Winston-Salem funeral home on Tuesday night.\nVideo from the Winston-Salem Fire Department shows the tractor-trailer crashed into Salem Funeral & Cremations on South Main Street.\nTwo people in the tractor-trailer suffered minor injuries.\nA hazmat crew was called in because of a diesel fuel spill.\nSouth Main Street will be closed at the scene of the crash until the scene is cleared."}, {"url": "https://myfox8.com/news/firefighter-injured-while-battling-fire-at-winston-salem-hotel/", "title": "Firefighter injured while battling fire at Winston-Salem hotel", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-11-13", "keywords": ["hotel", "taken", "videowinstonsalem", "watch", "sustained", "winstonsalem", "battling", "firefighter", "crews", "word", "injured", "battled"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- A firefighter was injured as crews battled a fire at a Winston-Salem hotel on Tuesday night, according to Batallion Chief Joe Ramsey.\nThe fire was reported at 7:42 p.m. at the Quality Inn, located at 531 Akron Drive.\nTwenty-three people were evacuated from the hotel as crews battled the fire.\nOne firefighter was taken to the hospital with a minor injury.\nNo one staying at the hotel was injured."}, {"url": "https://www.globenewswire.com/news-release/2019/10/10/1927892/0/en/Inmar-Named-Best-Tech-Company-to-Work-For-Finalist-for-2019-NC-Tech-Association-Awards.html", "title": "Inmar Named “Best Tech Company to Work For” Finalist for 2019 NC Tech Association Awards", "authors": ["Inmar"], "date": "2019-10-10", "keywords": ["sector", "finalist", "companies", "carolina", "technology", "media", "north", "awards", "nc", "inmar", "named", "company", "association", "best", "tech", "work"], "summary": "Winston-Salem, NC, Oct. 10, 2019 (GLOBE NEWSWIRE) -- Inmar, a data-driven technology-enabled services company, today announced that it is a finalist in the “Best Company to Work For” category for the 2019 NC Tech Awards.\nThe awards are presented by NC Tech (North Carolina Technology Association) and the winner will be announced in November.\n“North Carolina has a history of innovation and a demonstrated ability to lead over centuries as the world economy evolves.\nPress Inquiries:Holly PavlikaSVP, Corporate Marketing, 336-770-3596holly.pavlika@inmar.comAbout NC TECHThe North Carolina Technology Association (NC TECH) is a not-for-profit, membership-driven trade association and the primary voice of the tech industry in North Carolina.\nNC TECH Media Contact:Rachel Kennedy, NC TECH Communicationsrachel@nctech.org919.856.0393Holly Pavlika Inmar, Inc. 336-770-3596 holly.pavlika@inmar.com"}, {"url": "https://www.wfmynews2.com/article/news/local/winston-salem-leaf-collection-begins-november-leaf-pickup/83-f6b92ca2-ecef-4252-a115-aec278728126", "title": "Loose Leaf Collection Dates For Triad Cities", "authors": ["Author", "Courtney Kiley", "Wfmy", "Published", "Am Est November", "Updated"], "date": "2019-11-04", "keywords": ["collection", "triad", "leaves", "loose", "dates", "day", "city", "leaf", "week", "picked", "begins", "different", "pickup", "cities"], "summary": "WINSTON-SALEM, N.C. — Loose leaf collection is beginning in many Triad cities.\nGREENSBOROLoose leaf collection begins November 12 and ends December 23.\nCheck the interactive map to find out when your neighborhood is on the leaf collection schedule.\nHIGH POINTLoose leaf collection begins November 11.\nYour neighborhood's leaf pickup day depends on your solid waste collection day."}, {"url": "https://catamountsports.com/news/2019/10/24/211814919.aspx", "title": "Women's Tennis Competes in ITA Carolina Regional", "authors": [], "date": "2019-10-24", "keywords": ["compete", "carolina", "tennis", "catamounts", "king", "womens", "regional", "draw", "dayday", "nc", "winstonsalem", "singles", "tournament", "competes", "ita"], "summary": "CULLOWHEE, N.C. – Four members of Western Carolina women's tennis will compete in the ITA Carolina Regionals Oct. 24-28 on the Wake Forest campus in Winston-Salem, N.C.\nThe tournament features the best collegiate players from North and South Carolina.\nSenior Jordan Strickland will compete in the main draw while sophomore Jacy Smith opens the tournament in the qualifying draw.\nSmith gets things started for the Catamounts playing in the qualifying singles draw facing Furman's Maryann Rompf at 9:30 a.m.\nThe Catamounts will compete in its first ITA Carolina Regional since 2012 when former Catamounts Karen Jimenez Sarmiento and Stacia Kissell competed in the event."}, {"url": "https://www.citizen-times.com/story/money/business/2020/01/26/nc-ends-2019-where-began-3-7-jobless-rate/4568474002/", "title": "NC ends 2019 where it began with 3.7% jobless rate", "authors": ["Richard Craver", "Winston-Salem Journal", "Published P.M. Et Jan."], "date": "2020-01-26", "keywords": ["labor", "37", "jobs", "growth", "state", "ends", "force", "began", "job", "nc", "2019", "rate", "net", "jobless", "services"], "summary": "(Photo: Angeli Wright/awright@citizen-times.com)The state’s jobless rate ended 2019 at the same 3.7% level where it began, the N.C. Commerce Department reported Jan. 24.\nMeanwhile, Wells Fargo senior economist Mark Vitner said that although job growth outpaced labor force growth during 2019, \"both have risen by roughly the same magnitude\" to explain why the jobless rate finished 2019 at 3.7%.\nLabor force typically is defined by economists as counting those employed plus those looking for employment.\nThose who drop out of the labor force play a role in lowering the jobless rate.\nSince December 2018, the labor force has increased by 142,604, reflecting 137,509 gaining employment over the year and 5,095 considered as unemployed."}, {"url": "https://www.ptcommunity.com/wire/novant-health-contributes-additional-10-million-covid-19-disaster-relief-fund", "title": "Novant Health contributes additional $10 million to COVID-19 disaster relief fund", "authors": [], "date": "2020-04-15", "keywords": ["novant", "support", "care", "fund", "health", "disaster", "contributes", "additional", "members", "community", "million", "team", "relief", "covid19"], "summary": "WINSTON-SALEM, N.C., April 15, 2020 /PRNewswire/ -- Novant Health has contributed an additional $10 million to the Novant Health Disaster Relief Fund, which was created by the Novant Health Foundation to provide financial assistance to team members who need it most during the COVID-19 pandemic.\nPrior to this contribution, the fund had already raised more than $1 million from team members, the Novant Health executive team, community leaders and businesses.\n\"At Novant Health, our business is the care of all people and that starts with our team members,\" said Carl S. Armato, president and chief executive officer of Novant Health.\nFor more information on the Novant Health Disaster Relief Fund, please visit NovantHealth.org/giving.\nIn 2020, Novant Health was the only healthcare system in North Carolina to be included on Forbes' Best Employers for Diversity list."}, {"url": "https://www.bizjournals.com/charlotte/news/2020/03/20/decade-of-growth-what-happened-to-change-the.html", "title": "", "authors": [], "date": "2020-03-20", "keywords": [], "summary": ""}, {"url": "https://wschronicle.com/2020/04/wake-experiences-most-successful-stretch-ever-under-clawson/", "title": "Wake experiences most successful stretch ever under Clawson", "authors": [], "date": "2020-04-09", "keywords": ["set", "experiences", "stretch", "successful", "bowl", "record", "coach", "season", "forest", "team", "deacons", "clawson", "wake"], "summary": "Since head coach Dave Clawson arrived in Winston-Salem, the Wake Forest football team has experienced the most successful stretch in program history while also rewriting the record book.\nSince the start of the 2017 season, Wake Forest is tied for the second-most wins in the Atlantic Coast Conference.\nIn his 20 years as a head coach, Coach Clawson has had a history of turning programs into winners.\nWake Forest set major records for points scored in a season, obliterating the record by 97.\nOn December 10, 2013, Clawson became the 32nd head football coach in Wake Forest University history."}, {"url": "https://myfox8.com/news/police-on-scene-at-winston-salem-sanitation-department/", "title": "2 people dead, 2 others injured including police sergeant in shooting at Winston-Salem Sanitation Department", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-20", "keywords": ["sergeant", "dead", "worker", "way", "including", "shot", "watch", "winstonsalem", "department", "javascript", "shooting", "injured", "sanitation", "employees", "enable", "gunshots"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — Two people were shot and killed and a police sergeant and one other person was shot and injured at the Winston-Salem Sanitation Department early Friday morning.\nThe shooting happened at the Joycelyn V. Johnson Municipal building at 2000 Lowery St., according to Winston-Salem police.\nA source close to FOX8 said Winston-Salem Police Sergeant Stewart Sloan was shot.\n⁦@myfox8⁩ pic.twitter.com/L94QPyMBZ4 — Daniel Pierce (@DanielDPierce) December 20, 2019Herbert Martinez, a sanitation worker, said he heard gunshots before 7 a.m. while he was in his car as people were arriving to work.\nWe remain dedicated to continuing to ensure that all city employees have a safe and secure work place.”Please enable Javascript to watch this videoPlease enable Javascript to watch this video36.092754 -80.21424"}, {"url": "https://www.wfmynews2.com/article/entertainment/christmas-events-list-parades-ice-skating-tree-lightings-holidays-greensboro-winston-salem-nc/83-2f706732-287a-4c15-b3f1-f4cea9adbaec", "title": "CHRISTMAS 2019 | Parades, Holiday Lights, Santa, Events, and More!", "authors": ["Author", "Carrie Hodgin", "Wfmy News Digital", "Published", "Pm Est November", "Updated", "Am Est December"], "date": "2019-11-19", "keywords": ["lights", "pmwhere", "events", "holiday", "parade", "jamestown", "2019", "parades", "nc", "greensboro", "santa", "christmas", "details"], "summary": "CHRISTMAS PARADESJamestown Christmas ParadeWhat: It’s all about a holiday good time at the Jamestown Christmas Parade!\nWhen: December 1 at 3:00 p.m.Where: Main StreetMore Details: Jamestown Christmas ParadeSights and sounds of the 2019 Jamestown Parade:PHOTOS | Jamestown Christmas ParadePHOTOS | Check Out the 2019 Jamestown Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas Parade Sunday, December 1 | Jamestown, NC 2019 Christmas ParadeLexington Christmas ParadeWhat: Christmas is Uptown Lexington!\nWhen: Saturday, December 7 at noon(rain or shine)Where: Starts on North Greene Street in GreensboroMore Details: Holiday Parade Route MapWinston-Salem Jaycees Holiday ParadeWhat: Come to downtown Winston-Salem for the 29th Annual Winston-Salem Jaycees Holiday Parade.\nMore Details: Winston-Salem Jaycees Holiday ParadeHigh Point Holiday Festival ParadeWhat: Get into the Holiday spirit with the High Point Holiday Festival Parade!\nMore Details: High Point ParadeBurlington Christmas ParadeWhat: Oh, what fun it is to be at the Burlington Christmas Parade!"}, {"url": "https://myfox8.com/news/17-year-old-killed-in-shooting-in-winston-salem/", "title": "15-year-old killed in shooting in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-17", "keywords": ["word", "woundems", "teen", "wright", "videowinstonsalem", "15yearold", "watch", "winstonsalem", "killed", "shooting", "arrived", "suspect3609986"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- A teen has died after a shooting in Winston-Salem on Monday night and police are investigating it as a homicide, according to Lt. Greg Dorn.\nOfficers were called to the area of South Main and Wright streets around 7:40 p.m.\nWhen officers arrived they found a 15-year-old with a gunshot wound.\nEMS arrived and pronounced the teen dead at the scene.\nThere is no word on what led up to the shooting or information on a suspect."}, {"url": "https://www.wxii12.com/article/winston-salem-grocery-store-robbed-at-gunpoint-on-christmas-eve-police-search-for-suspects/30327295", "title": "Winston-Salem grocery store robbed at gunpoint on Christmas Eve, police search for suspects", "authors": ["Brandon Bates", "Https", "Www.Facebook.Com", "Anchor Reporter"], "date": "2019-12-25", "keywords": ["christmas", "eve", "point", "gunpoint", "suspects", "person", "store", "high", "winstonsalem", "right", "say", "working", "shooting", "night", "robbed", "search", "grocery"], "summary": "Winston-Salem grocery store robbed at gunpoint on Christmas Eve, police search for suspects Neighborhood Grocery in Winston-Salem robbed at gunpoint Share Shares Copy Link CopyHide Transcript Show TranscriptCHRISTMAS EVE.\nTHE INCIDENT HAPPENED AROUND 4:30 THIS AFTERNOON ON AN ALREADY BUSY DAY HERE FOR THE HIGH POINT POLICE DEPARTMENT HOMICIDE INVESTIGATORS.\nALSO HOURS LATER ON CHRISTMAS EVE MORNING IN A SEPARATE SHOOTING, AN 18-YEAR-OLD WAS SHOT AND KILLED.\nAS POLICE CONTINUE TO INVESTIGATE, THEY SHARE THEIR REACTION TO THIS DEADLY CHRISTMAS EVE SHOOTING WITH US.\nVERY NICE ON THIS CHRISTMAS EVE, NO WHITE CHRISTMAS HERE UNLESS YOU ARE LOOKING UP AT THE WHITE SKY, BUT PRETTY PERFECT IF YOU LIKE DECENT TEMPERATURES."}, {"url": "https://myfox8.com/news/2-adults-juvenile-bound-and-beaten-during-home-invasion-in-winston-salem/", "title": "2 adults, juvenile bound and beaten during home invasion in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-17", "keywords": ["man", "injuries", "residence", "26yearold", "door", "suspects", "adults", "winstonsalem", "woman", "juvenile", "beaten", "invasion", "bound"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Three people, including a juvenile, were injured during a home invasion in Winston-Salem on Monday evening, according to a news release from Winston-Salem police.\nThe people in the residence -- the 26-year-old man who opened the door, a 25-year-old woman and a 15-year-old juvenile -- were all tied up and assaulted.\nWinston-Salem police said a firearm, some type of blunt instrument, knives and a Taser were used in the assaults.\nThe 26-year-old man and 25-year-old woman had severe injuries.\nAll three victims are expected to eventually recover from their injuries, Winston-Salem police said."}, {"url": "https://www.wfmynews2.com/article/weather/remembering-greensboro-snow-2018-piedmont-triad/83-c0014153-1a99-4b45-ac8a-4375c7a3e4b0", "title": "It was a big snowstorm! Remembering the 2018 snowstorm", "authors": ["Author", "Christian Morgan", "Wfmy", "Published", "Pm Est December", "Updated"], "date": "2019-12-10", "keywords": ["snowstorm", "triad", "remembering", "snow", "2018", "snowiest", "storm", "day", "record", "weather", "greensboro", "number", "big"], "summary": "The storm closed schools for a week and caused more than 200,000 power outages across the state of North Carolina.\nIt was a big storm!\nThe number one snowiest day on record for Greensboro was in March 1927 with 20\", and number two was in December 1930 with a little over 14\".\nSince that big snow, we haven't had any accumulating snow in the Triad.\nRELATED: RECORD SNOW | Third Snowiest 'One Day' In Greensboro HistoryWFMYVERIFY: Can The Triad Get A Lot of Snow In March, April?"}, {"url": "https://myfox8.com/community-foundation/mixxer-in-winston-salem-gives-creative-minds-the-tools-they-need-to-create/", "title": "Mixxer in Winston-Salem gives creative minds the tools they need to create", "authors": ["Digital Desk", "Katie Nordeen"], "date": "2019-12-04", "keywords": ["minds", "tells", "totally", "set", "creative", "videowinstonsalem", "watch", "winstonsalem", "thing", "tools", "gives", "resources", "create", "mixxer", "idea", "need"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — It's one thing to have an idea.\nIt's something totally different to see that idea come to reality.\nThat's really challenging if you don't have the tools or resources to get the job done.\nAs FOX8's Katie Nordeen tells us Mixxer in downtown Winston-Salem set out to change that, and, with the help of the Winston-Salem Foundation, it is!\n36.09986 -80.244216"}, {"url": "https://myfox8.com/news/man-shot-in-winston-salem-has-life-threatening-injuries/", "title": "Man shot in Winston-Salem, has ‘life-threatening’ injuries", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-07", "keywords": ["man", "injuries", "upper", "crime", "shot", "stoppers", "winstonsalem", "happened", "view", "shooting", "lifethreatening", "wound", "department"], "summary": "WINSTON-SALEM, N.C. — Winston-Salem Police are investigating a shooting that happened in the 1000 block of East 17th Street early Saturday morning.\nUpon arrival, officers located an unidentified man suffering from a gunshot wound to his upper torso.\nForsyth County EMS transported the man to a local hospital where he is currently receiving medical treatment for life-threatening injuries.\nThe Winston-Salem Police Department request that anyone with information regarding this incident contact the Winston-Salem Police Department at (336)773-7700 or Crime Stoppers at (336)727-2800.\nYou can also view Crime Stoppers of Winston-Salem on Facebook."}, {"url": "https://triad-city-beat.com/the-triad-100-the-100-people-places-and-things-that-shaped-the-triad-in-2019/", "title": "The Triad 100: The 100 people, places and things that shaped the Triad in 2019", "authors": [], "date": "2019-12-26", "keywords": ["county", "things", "triad", "black", "shaped", "north", "high", "places", "winstonsalem", "2019", "city", "members", "greensboro", "school", "100"], "summary": "Triad City Beat delved into the case in 2019, although Fairbanks was arrested in early 2018.\nTriad City Beat broke the story, and it commanded the largest audience of any in 2019.\nAll four visited different locations in Greensboro from Bennett College and NC A&T University to Smith High School and Natty Greene’s.\nTriad City Beat wins awardsThe TCB team took home two national Altweekly Awards, awarded at the annual convention in July, both for political writing.\nBlack Panther PartyThe Winston-Salem Black Panther Party’s 50th year celebration in October was a bittersweet affair."}, {"url": "https://www.wxii12.com/article/winston-salem-road-closed-emergency-water-main-repair/30325010", "title": "Winston-Salem road reopened after emergency water main repair", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2019-12-24", "keywords": ["main", "warm", "brea", "repair", "water", "way", "temperatures", "greensboro", "road", "today", "winstonsalem", "mall", "say", "travel", "reopened", "school", "emergency"], "summary": "Winston-Salem road reopened after emergency water main repair Share Shares Copy Link CopyHide Transcript Show TranscriptCARDS ARE THE WAY TO GO.\nPARENTS WON’T BE ABLE TO DROP THEIR TEENS OFF AT HANES MALL TO GET A BREAK OVER THE HOLIDAYS.\nIT IS WEIRDLY WARM TODAY.\nWEIRDLY WARM TODAY.\nGROSE IS CHARGED WITH INDECENT LIBERTIES WITH A MINOR WORK ON A BROKEN WATER MAIN IS CAUSING DELAYS IN WINSTON-SALEM ON JONESTOWN ROAD."}, {"url": "https://www.wxii12.com/article/winston-salem-rollover-crash-i-40-december-4/30121517", "title": "Winston-Salem authorities respond to rollover crash on I-40", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2019-12-04", "keywords": ["authorities", "crash", "unclear", "burke", "respond", "wxii", "winstonsalem", "westbound", "i40", "ebert", "website", "rollover", "near"], "summary": "Winston-Salem authorities responded to a rollover crash Wednesday morning on I-40.\nThe crash happened in the westbound lanes between Burke Mill Road and Ebert Street.\nAccording to the North Carolina Department of Transportation website, the crash has shutdown one lane of traffic near Exit 190, which is near Hanes Mall Boulevard.\nUnits on the scene of a motor vehicle accident with rollover on I-40 west bound between Burke Mill and Ebert.\nExtrication in progress #wsfire .80 pic.twitter.com/C9fIDC5pYK — Winston-Salem FD (@cityofwsfire) December 4, 2019"}, {"url": "https://myfox8.com/news/3-young-people-accused-of-crashing-into-cruiser-with-stolen-pickup-truck-leading-winston-salem-police-on-chase/", "title": "3 young people accused of crashing into cruiser with stolen pickup truck, leading Winston-Salem police on chase", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-16", "keywords": ["accused", "leading", "crashing", "truck", "cruiser", "stolen", "way", "west", "chase", "corporal", "winstonsalem", "say", "young", "pickup"], "summary": "WINSTON-SALEM, N.C. — Three young people were taken into custody after allegedly stealing a pickup truck and leading officers on a chase through Winston-Salem, according to police.\nAt about 6:45 a.m. Monday, police responded to a report of stolen gray Ford F-150 pickup truck near the 1400 block of Donald Street.\nSwayney, who was driving a marked patrol cruiser, spotted the stolen truck heading west on Sprague Street.\nThe corporal saw the truck pull into the driveway at 15 Devonshire Street and tried to conduct a traffic stop.\nAnyone with information is asked to contact the Winston–Salem Police Department at (336)773-7700 or Crime Stoppers at (336)727-2800."}, {"url": "https://myfox8.com/news/at-least-1-person-seriously-injured-after-crash-involving-garbage-truck-in-winston-salem/", "title": "At least 1 person seriously injured after crash involving garbage truck in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-17", "keywords": ["crash", "block", "truck", "hospital", "taken", "seriously", "videowinstonsalem", "person", "involving", "watch", "winstonsalem", "say", "garbage", "4000", "injured", "reidsville", "vehicles"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. — At least one person was taken to the hospital after a crash in Winston-Salem, according to police.\nAt about 6:29 a.m., officers responded to the 4000 block of Reidsville Road.\nPolice say two vehicles were involved, and at least one patient was taken to a hospital with a serious injury.\nIt appears a car ran into the back of a garbage truck.\nThe 4000 block of Reidsville Road was closed but has since reopened."}, {"url": "https://myfox8.com/news/man-thrown-over-handlebars-of-dirt-bike-in-winston-salem-taken-to-hospital-with-serious-injuries-police-say/", "title": "Man thrown over handlebars of dirt bike in Winston-Salem, taken to hospital with serious injuries, police say", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-15", "keywords": ["man", "injuries", "handlebars", "thrown", "taken", "hospital", "north", "serious", "winstonsalem", "say", "dirt", "bike", "intersection"], "summary": "WINSTON-SALEM, N.C. — A man was thrown over the handlebars of a dirt bike in Winston-Salem and taken to the hospital with serious injuries Saturday, according to a Winston-Salem Police Department news release.\nHe was then thrown over the handlebars before the dirt bike fell to the ground, the release says.\nHe was taken to the hospital with serious injuries.\nThe road was closed for about two hours while officials investigated but is now open.\nAnyone with information is asked to contact the Winston-Salem Police Department at (336) 773-7700."}, {"url": "https://myfox8.com/news/couple-without-home-after-firefighters-put-out-house-fire-in-winston-salem/", "title": "Couple without home after firefighters put out house fire in Winston-Salem", "authors": ["Digital Desk", "Michelle Wolf", "Cnn Wire"], "date": "2019-12-01", "keywords": ["house", "block", "shut", "luther", "king", "road", "watch", "winstonsalem", "jr", "couple", "firefighters", "martin"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- A couple is without a home after firefighters put out a house fire in Winston-Salem Saturday.\nFirefighters put out the house fire in the 1800 block of Martin Luther King Jr.\nPlease enable Javascript to watch this videoPolice and firefighters in Winston-Salem shut down Martin Luther King Jr. drive while they worked two separate incidents throughout the day, according to a City of Winston-Salem news release.\nPolice manned down powerlines that cross the road in the 1400 block of Martin Luther King Jr Drive.\nHouse Fire: 1800 Block of South Martin Luther King Jr. Dr. 2 Displacements."}, {"url": "https://www.wxii12.com/article/winston-salem-road-blocked-crash-minor-injuries/30354784", "title": "Winston-Salem road reopened after crash involving minor injuries", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2019-12-29", "keywords": ["crash", "school", "injuries", "scene", "video", "carver", "vehicle", "road", "involving", "winstonsalem", "reopened", "minor", "sayclick"], "summary": "Parts of Carver School Road are reopened after a motor vehicle crash, according to the Winston-Salem Fire Department.The 3300 block of Carver School Road was blocked off because of the crash involving minor injuries at about 1:38 p.m. Sunday, firefighters say.Click the video player above to see the scene of the crashParts of Carver School Road are reopened after a motor vehicle crash, according to the Winston-Salem Fire Department.\nAdvertisementThe 3300 block of Carver School Road was blocked off because of the crash involving minor injuries at about 1:38 p.m. Sunday, firefighters say.\nClick the video player above to see the scene of the crash"}, {"url": "https://www.wxii12.com/article/winston-salem-principal-to-be-honored-in-academic-competition/30384702", "title": "Winston-Salem principal to be honored in academic competition", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2020-01-03", "keywords": ["childers", "atkins", "academic", "scholastic", "principal", "carolina", "competition", "north", "honored", "winstonsalem", "working", "school", "schools"], "summary": "Winston-Salem principal to be honored in academic competitionA North Carolina academic award is being renamed to honor the late principal of Atkins High School.\nChilders started working with Winston-Salem/Forsyth County Schools in 2005 serving as principal of Hanes Middle School.\nHe had more than 40 years’ experience working in North Carolina public schools, the school system said.\nA North Carolina academic award is being renamed to honor the late principal of Atkins High School.\nHe had more than 40 years’ experience working in North Carolina public schools, the school system said."}, {"url": "https://myfox8.com/news/police-investigating-after-2-people-found-dead-in-winston-salem-home/", "title": "Police investigating after 2 people found dead in Winston-Salem home", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-16", "keywords": ["dead", "videowinstonsalem", "welfare", "watch", "officers", "winstonsalem", "nc", "investigating", "released", "street", "mondayofficers"], "summary": "Please enable Javascript to watch this videoWINSTON-SALEM, N.C. -- Winston-Salem police are investigating after two people were found dead in a home on Monday.\nOfficers came to the 3900 block of Ebert Street to do a welfare check after they were contacted by a concerned family member.\nWhen officers got to the home, they found two people dead inside.\nPolice have not released details on how the two people died.\n36.09986 -80.244216"}, {"url": "https://triad-city-beat.com/fact-check-winston-salem-mayoral-race/", "title": "The sunny incumbent and gloomy challenger: A fact-check on the Winston-Salem mayoral race", "authors": ["Jordan Green Is The Senior Editor At Triad City Beat."], "date": "2020-02-12", "keywords": ["allen", "mayoral", "incumbent", "poverty", "sunny", "gloomy", "growth", "jobs", "north", "winstonsalem", "joines", "city", "housing", "race", "msa", "factcheck", "challenger"], "summary": "It’s hard to reconcile the data cited by incumbent Allen Joines and challenger JoAnne Allen on employment, housing and a host of other metrics on Winston-Salem’s well-being.\nAllen Joines and JoAnne Allen, the two candidates in Winston-Salem’s Democratic mayoral primary, often seem to describe two different cities.\nAllen Joines cited the partnership as a source in a follow-up conversation with TCB.\nIndeed, Winston-Salem’s annual jobs growth compared favorably to other MSAs in the Southeast, including Charlotte (2.4 percent), Raleigh (1.8 percent), Greensboro-High Point (0.3 percent) and Greenville, SC (1.8 percent).\n“You may have seen that I was able to raise pilot funds to pay for a free college program,” Allen Joines said."}, {"url": "https://www.wxii12.com/article/old-salem-business-40-construction-tavern/30087521", "title": "Old Salem Tavern closing this month because of Business 40", "authors": ["Kirsten Gutierrez", "Https", "Www.Facebook.Com Wxiikirstengutierrez"], "date": "2019-12-02", "keywords": ["salem", "business", "family", "keiper", "tavern", "wonderful", "month", "old", "rick", "40", "construction", "closing"], "summary": "THE OWNERS SAY THE BUSINESS 40 PROJECT IS PART OF THE PROBLEM.\nKIRSTEN: THAT’S RIGHT, THE BUSINESS 40 PROJECT, ALONG WITH CONSTRUCTION HERE IN OLD SALEM, AND TRYING TO KEEP UP WI EXPENSIVE RENOVATIONS ARE ALL FACTORS IN WHY THE TAVERN IS CLOSING.\nKIRSTEN: THE PRESIDENT AND CEO OF OLD SALEM MUSEUMS AND GARDENS SAYS MOVING FORWARD THEY WILL BE DOING MUCH NEEDED RENOVATIONS TO THE HISTORIC BUILDING.\nA SPOKESMAN SAYS THE DEPARTMENT REACHED OUT TO 500 SMALL BUSINESSES IN DOWNTOWN,Advertisement Old Salem staple to close this month, owners blame Business 40 construction Share Shares Copy Link CopyA staple of Old Salem is closing up shop at the end of the month.\n\"As part of our 'ACTIVATE MAIN STREET” initiative, Old Salem has been expanding its food offerings and adding new public activity to the historic district."}, {"url": "https://www.wfmynews2.com/article/news/local/terry-cobb-jr-funeral-announcement/83-4af23ab1-084d-475c-b2be-8b6df1948b21", "title": "Family of man killed at Winston-Salem sanitation shooting announces funeral", "authors": ["Author", "Wfmy News Digital Team", "Published", "Pm Est December", "Updated"], "date": "2019-12-25", "keywords": ["terry", "man", "family", "jrlatoya", "forte", "winstonsalem", "funeral", "jr", "killed", "shooting", "husband", "announces", "sanitation", "cobb"], "summary": "WINSTON-SALEM, N.C. — Latoya Forte Cobb, the wife of Terry Cobb Jr. said her husband's funeral will take place on Friday, December 27, 2019 at Red Bank Baptist Church.\nCobb has not yet said whether or not the funeral will be public.\nCobb Jr. died last week when the Winston-Salem police said one of his co-workers shot him following a dispute the previous evening.\nOfficials said Steven Haizlip admitted to the shooting before dying from bullet wounds he sustained in a shoot-out with police.\nRELATED: 'Their workplace has changed' | Winston-Salem city employees return to work after shootingLatoya Cobb with husband Terry Cobb Jr.Latoya Forte CobbLatoya Cobb with husband Terry Cobb Jr.Latoya Forte CobbRELATED: 2 dead, police sergeant and city worker wounded in shooting at Winston-Salem sanitation departmentRELATED: What we know about the deadly Winston-Salem sanitation department shooting"}, {"url": "https://myfox8.com/news/driver-taken-to-hospital-after-crashing-car-flipping-several-times-in-winston-salem/", "title": "Driver taken to hospital after crashing car, flipping several times in Winston-Salem", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-11", "keywords": ["crashing", "investigation", "hospital", "taken", "luther", "king", "serious", "winstonsalem", "car", "jr", "flipping", "stable", "times", "martin", "driver", "responders"], "summary": "WINSTON-SALEM, N.C. — A driver was taken to the hospital and is in “serious but stable condition” following a crash in Winston-Salem Tuesday, according to a Winston-Salem Police Department news release.\nWinston-Salem police officers are currently investigating a single-car crash in the 1200 block of South Martin Luther King Jr. Drive.\nPolice and other first responders were sent to the scene around 11:19 p.m.Franklin Dwayne Herring, 39, of Kernersville, was reportedly going north on Martin Luther King Jr. Drive towards Reynolds Park in a 2007 Toyota RAV-4.\nHe was rushed to Wake Forest Baptist Medical Center where police say he is listed in serious but stable condition.\nThe Northbound lanes of Martin Luther King Jr. Drive were temporarily closed so first responders could rescue the driver from the creek area."}, {"url": "https://myfox8.com/news/multiple-people-shot-in-5-points-area-of-high-point/", "title": "6 people shot in 5 Points area of High Point on Christmas Eve", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-24", "keywords": ["victims", "eve", "point", "parking", "taken", "shot", "watch", "high", "javascript", "lot", "shooting", "area", "points", "enable", "christmas", "victim"], "summary": "Please enable Javascript to watch this videoHIGH POINT, N.C. -- High Point police are investigating a shooting involving six victims.\nThe shooting happened around 4:30 p.m. at a parking lot in front of several businesses in the 1200 block of Montlieu Avenue.\nA witness told FOX8 it was a drive-by shooting and 10-15 people were in the parking lot at the time of the shooting.\nHigh Point police said on Tuesday night that all the victims are in stable condition.\nPlease enable Javascript to watch this videoPlease enable Javascript to watch this video35.955692 -80.005318"}, {"url": "https://www.wxii12.com/article/freezing-rain-ice-cold-piedmont-triad-north-carolina/30168218", "title": "Wintry weather timeline: Freezing rain, black ice possible early Friday", "authors": ["Web Staff", "Https", "Www.Facebook.Com"], "date": "2019-12-13", "keywords": ["winter", "triad", "snow", "possible", "timeline", "ice", "early", "black", "wintry", "freezing", "12", "temperatures", "weather", "conditions", "rain", "emergency"], "summary": "WE HAVE FREEZING RAIN CONTINUING AS WELL.\nMIXING FREEZING RAIN AND SNOWFLAKES SOUTH OF HILLSVILLE.\nALSO, WE HAVE THE WINTER WEATHER ADVISORY DOWN TO THE SOUTH TOWARDS THE NORTH THROUGH NOON FOR THE TRIAD AND FOR THE MOUNTAINS AND FOOTHILLS, 3:00 THIS AFTERNOON.\nLUNCHTIME IN THE AFTERNOON, KEEPING THE RAIN CHANCE WITH US, TEMPERATURES IN THE UPPER 30’S TO THE LOW 40’S.\nMotorists should also leave early for their destination and be prepared to use extra caution while driving if there is freezing rain, especially during the predawn hours."}, {"url": "https://myfox8.com/news/24-states-set-to-raise-the-minimum-wage-in-2020/amp/", "title": "24 states plan to raise the minimum wage in 2020. North Carolina isn’t one of them.", "authors": ["Cnn Wire"], "date": "2019-12-30", "keywords": ["set", "2020", "jobs", "carolina", "isnt", "raise", "states", "york", "plan", "north", "wage", "workers", "24", "hour", "minimum", "effective"], "summary": "The minimum wage is set to go up in 72 jurisdictions in 2020.\nPast efforts to raise minimum wageThe minimum wage has been a hotly contested subject.\nEarlier this year, the US House of Representatives passed the Raise the Wage Act, to make a $15 an hour minimum wage a national standard — up from the current $7.25 an hour.\nRaising minimum wage could hurt workers, some argueOpponents of raising the minimum wage say the result could be fewer jobs.\nSome have backed a $12 an hour minimum wage instead to lessen the impact of a higher raise on the job market."}, {"url": "https://myfox8.com/news/3-young-people-arrested-in-winston-salem-after-chase-through-forsyth-county-1-suspect-still-wanted/", "title": "3 young people arrested in Winston-Salem after chase through Forsyth County; 1 suspect still wanted", "authors": ["Digital Desk", "Tess Bargebuhr", "Cnn Wire"], "date": "2019-12-03", "keywords": ["county", "sheriffs", "deputies", "suspects", "vehicle", "chase", "arrested", "office", "winstonsalem", "help", "suspect", "young", "wanted", "forsyth"], "summary": "Please enable Javascript to watch this videoFORSYTH COUNTY, N.C. — A Forsyth County chase ended with three young people arrested in Winston-Salem and one suspect still at-large, according to the sheriff’s office.\nA deputy had been pursuing four suspects possibly connected to a string of Forsyth County break-ins.\nA spokesperson for the sheriff's office said the teenagers arrested are just 13, 14 and 15 years old.\nAnyone who might know the fourth suspect’s identity or location is asked to call the Winston-Salem Police Department at (336) 773-7700 or the Forsyth County Sheriff’s Office at (336) 727-2112.\nAny questions or concerns about the chase or investigation should be directed to the Forsyth County Sheriff’s Office."}, {"url": "https://myfox8.com/news/crash-shuts-down-i-40-business-us-421-north-in-forsyth-county/", "title": "Crash shuts down I-40 Business/US 421 North in Forsyth County", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-19", "keywords": ["county", "crash", "quiet", "kept", "421", "shuts", "prince", "north", "i40", "sneak", "roles", "senior", "residents", "royal", "relocating", "profile", "businessus", "forsyth"], "summary": "Prince Harry and Meghan Markle have kept a low profile since leaving their senior royal roles and relocating to Los Angeles.\nThey've kept so quiet that they managed to sneak out and deliver meals to L.A. residents in need during the COVID-19 pandemic."}, {"url": "https://myfox8.com/news/triad-school-districts-announce-friday-morning-delays-including-guilford-county-schools-and-winston-salem-forsyth-county-schools/", "title": "Triad school districts announce Friday morning delays, including Guilford County Schools and Winston-Salem/Forsyth County Schools", "authors": ["Digital Desk", "Cnn Wire"], "date": "2019-12-13", "keywords": ["county", "delays", "triad", "guilford", "including", "winstonsalemforsyth", "morning", "twohour", "websitewinstonsalemforsyth", "closings", "operate", "school", "delay", "schools", "districts"], "summary": "Please enable Javascript to watch this videoGUILFORD COUNTY, N.C. -- Multiple Piedmont Triad schools will operate on delays Friday after threat of possible ice amid rain and below-freezing temperatures.\nGuilford County Schools will open all schools, including early and middle colleges, on a two-hour delay on Friday.\nFor more information about the inclement weather policy, including the steps GCS takes to determine whether to close or delay school, visit the Guilford County Schools website.\nWinston-Salem/Forsyth County Schools has also announced they will operate on a two-hour delay on Friday.\nFor all local closings and delays, see the FOX8 Closings and Delays list."}]